[
    "```json\n[\n  {\n    \"Q\": \"What is the basis for reservation in the ICAR Agricultural Research Service?\",\n    \"A\": \"Reservations and other concessions are provided for Scheduled Castes, Scheduled Tribes, and other special categories of persons in accordance with the orders issued by the Central Government from time to time.\"\n  },\n  {\n    \"Q\": \"How is the pay of a scientist appointed to any Grade in the Service fixed?\",\n    \"A\": \"The pay of a scientist is fixed in accordance with such orders as may be applicable to Council's employees from time to time.\"\n  },\n  {\n    \"Q\": \"What is the system of merit promotion in the ICAR Agricultural Research Service?\",\n    \"A\": \"There is a system of merit promotion from one grade to the next higher grade and advance increment within the same grade, based on assessment of performance by a procedure prescribed by A.S.R.B.\"\n  },\n  {\n    \"Q\": \"How often is the screening for promotion or advance increment done?\",\n    \"A\": \"The first screening is done within one year of the introduction of Agricultural Research Service, and thereafter, once a year as early as practicable after 1st January.\"\n  },\n  {\n    \"Q\": \"What is the eligibility criterion for screening for promotion or advance increment?\",\n    \"A\": \"A scientist is eligible for screening after the expiry of a period of five years' service in the grade.\"\n  },\n  {\n    \"Q\": \"How is the period of deputation abroad treated for the purpose of assessment?\",\n    \"A\": \"Any period of overstay without the sanction of the Controlling Authority shall not count towards the period of five years' service for the purpose of assessment.\"\n  },\n  {\n    \"Q\": \"When is the promotion or grant of advance increments to successful scientists effective?\",\n    \"A\": \"Promotion or grant of advance increments is effective from the 1st of July of the following year for those who complete five years of service between 1st July and 31st December, and from 1st of January of the following year for those who complete five years of service between 1st January and 30th June.\"\n  },\n  {\n    \"Q\": \"What is the treatment for scientists on notional foreign service who opt for the Council's service?\",\n    \"A\": \"Scientists on notional foreign service who opt for the Council's service and are inducted into A.R.S. after 31-12-1975 but within the limit prescribed by the Council are allowed increments as admissible to the Scientists on notional foreign service inducted into the A.R.S. before 31-12-1975.\"\n  },\n  {\n    \"Q\": \"How is the notional foreign service of scientists reckoned for eligibility for assessment?\",\n    \"A\": \"The notional foreign service in the respective grades in the Council is reckoned towards their eligibility for assessment.\"\n  },\n  {\n    \"Q\": \"What is the effective date for promotion or grant of advance increments for scientists who complete five years of service?\",\n    \"A\": \"The effective date is the 1st of July or 1st of January of the following year, depending on the date of completion of five years of service.\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"What is the condition for a scientist to be liable to transfer?\",\n  \"A1\": \"A scientist shall be liable to transfer to any place in India.\",\n  \n  \"Q2\": \"What is the minimum period of time a scientist may be required to serve in a backward or less developed area?\",\n  \"A2\": \"The minimum period of time is determined and decided by the Controlling Authority.\",\n  \n  \"Q3\": \"What happens to a member of the Service on completion of their tenure appointment?\",\n  \"A3\": \"The member will return to a matching position in research work which may be in any area or any Institute depending on the Council's needs.\",\n  \n  \"Q4\": \"What are the conditions of service for members of the Service for matters not covered in the rules?\",\n  \"A4\": \"The conditions of service shall be the same as are applicable from time to time to the employees of the Council.\",\n  \n  \"Q5\": \"Is there inter-se-seniority among scientists of the Service for the purpose of promotion?\",\n  \"A5\": \"No, there will be no inter-se-seniority among the scientists of the Service for the purpose of promotion.\",\n  \n  \"Q6\": \"How is the period of service counted for the purpose of first screening under Rule 19 (3)?\",\n  \"A6\": \"The entire period of service in the grade, including the service rendered in the pre-revised scale of pay, shall be counted.\",\n  \n  \"Q7\": \"What is the eligibility for a member of the Service to add to their service qualifying for superannuation pension?\",\n  \"A7\": \"A member of the Service appointed to a scientific post under the Council on a regular basis after 31-3-1960 will be eligible to add to their service qualifying for superannuation pension.\",\n  \n  \"Q8\": \"What option is available to a scientist recruited at the age of 35 years or more?\",\n  \"A8\": \"The scientist may elect to forego their right to pension and subscribe to a Contributory Provident Fund within a period of three months from the date of their appointment.\",\n  \n  \"Q9\": \"Who has the authority to relax the provisions of the rules?\",\n  \"A9\": \"The Controlling Authority may relax the provisions of the rules to such an extent as may be necessary to ensure satisfactory working or for removing inequitable results.\",\n  \n  \"Q10\": \"Who decides on questions of interpretation of the rules?\",\n  \"A10\": \"The President of the Council decides on questions of interpretation of the rules.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What is the date of sanction of the Service?\",\n  \"A1\": \"1-10-75\",\n  \"Q2\": \"What are the minimum qualification requirements for induction into the Service?\",\n  \"A2\": \"Master's degree or equivalent in any branch of Agriculture, Animal Sciences, or Bachelor's degree in any branch of Engineering or Technology\",\n  \"Q3\": \"What are the pay scales for scientific or technical posts eligible for induction into the Service?\",\n  \"A3\": \"Rs 425-700, Rs 550-750, Rs 550-900, Rs 650-1200, Rs 700-1300, Rs 1100-1600, Rs 1300-1700, Rs 1500-1800, Rs 1500-2000, Rs 1800-2000, Rs 1800-2250, Rs 2000-2250, Rs 2000-2500\",\n  \"Q4\": \"Can candidates who acquire the minimum qualifications within a period of five years from the date of introduction of the Service be considered for induction?\",\n  \"A4\": \"Yes, candidates who acquire the minimum qualifications within a period of five years from the date of introduction of the Service will also be considered for induction\",\n  \"Q5\": \"What is the method of direct recruitment to S-1 of the Service?\",\n  \"A5\": \"Direct recruitment to S-1 of the Service shall be made through an open competitive examination\",\n  \"Q6\": \"What are the eligibility criteria for direct recruitment to the Service?\",\n  \"A6\": \"Candidate must be a citizen of India or belong to such categories of persons as may from time to time be notified by the Ministry of Home Affairs for employment in public services\",\n  \"Q7\": \"Can a candidate be disqualified from the examination/selection if they attempt to obtain support for their candidature by any means?\",\n  \"A7\": \"Yes, any attempt on the part of a candidate to obtain support for their candidature by any means may be held by the Board to disqualify them for admission to the examination/selection\",\n  \"Q8\": \"What is the requirement for a candidate's health and physical condition for appointment to the Service?\",\n  \"A8\": \"No candidate shall be appointed to the Service who, after such medical examination as the Council may prescribe, is not found to be in good mental or bodily health and free from any mental or physical defect likely to interfere with the discharge of the duties of the Service\",\n  \"Q9\": \"Can a candidate with more than one spouse living be eligible for appointment to the Service?\",\n  \"A9\": \"No, no candidate who has more than one spouse living or who, having a spouse living, marries in any case in which such marriage is void by reasons of its taking place during the lifetime of such spouse, shall be eligible\",\n  \"Q10\": \"What is the authority responsible for conducting the open competitive examination for direct recruitment to S-1 of the Service?\",\n  \"A10\": \"The Agricultural Scientists' Recruitment Board\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What is the age limit for a candidate to appear in the competitive examination for ICAR Agricultural Research Service?\",\n  \"A1\": \"A candidate must have attained the age of 21 years but not have attained the age of 30 years on the 1st day of January or August of the year in which the examination is held.\",\n  \n  \"Q2\": \"Can the upper age limit be relaxed for certain categories of candidates?\",\n  \"A2\": \"Yes, the upper age limit may be relaxed in respect of such categories as may be notified by the Controlling Authority from time to time and to the extent notified in respect of each category.\",\n  \n  \"Q3\": \"What are the educational qualifications required for a candidate to appear in the examination?\",\n  \"A3\": \"A candidate must have obtained a Master's degree or equivalent qualification in any of the subjects specified by the Council, or Bachelor's degree in Technology and Engineering from a recognized University or institution.\",\n  \n  \"Q4\": \"Can a candidate who does not possess the prescribed qualifications be considered educationally eligible?\",\n  \"A4\": \"Yes, in exceptional cases, the Board may treat a candidate who does not possess any of the prescribed qualifications as educationally eligible if he has passed an examination conducted by an institution of equivalent standard.\",\n  \n  \"Q5\": \"How often are the competitive examinations held for ICAR Agricultural Research Service?\",\n  \"A5\": \"The examinations are held at such time and places as may be prescribed in the notice issued by the Board for the purpose.\",\n  \n  \"Q6\": \"Who conducts the examination and interview for appointment to the Service?\",\n  \"A6\": \"The examination and interview are conducted by the Board in such manner as may be notified by the Council from time to time.\",\n  \n  \"Q7\": \"Can in-service employees of ICAR appear in the ARS Examinations?\",\n  \"A7\": \"Yes, in-service employees of ICAR less than 35 years of age are eligible to appear in the ARS Examinations, subject to possession of prescribed qualifications.\",\n  \n  \"Q8\": \"How does a candidate apply for admission to the examination?\",\n  \"A8\": \"A candidate must apply for admission to the examination before such date, in such manner and in such form, as the Board may prescribe.\",\n  \n  \"Q9\": \"Is there any relaxation in age limit for the first two examinations to be held under these rules?\",\n  \"A9\": \"Yes, for the first two examinations to be held under these rules, there will be no age restriction.\",\n  \n  \"Q10\": \"What is the role of the Council in specifying the subjects for the Master's degree or equivalent qualification?\",\n  \"A10\": \"The Council specifies the subjects for the Master's degree or equivalent qualification on the advice of the Board.\"\n}\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```\n[\n  {\n    \"Q\": \"What is the condition for a candidate to apply for admission to the examination if they have not received the result of a qualifying examination?\",\n    \"A\": \"The candidate can apply if they intend to appear at the qualifying examination and it is completed before the commencement of the examination.\"\n  },\n  {\n    \"Q\": \"What is the status of admission for a candidate who has not yet passed the qualifying examination?\",\n    \"A\": \"The admission would be deemed to be provisional and subject to cancellation if the candidate does not produce proof of having passed the examination.\"\n  },\n  {\n    \"Q\": \"What is the time limit for a candidate to produce proof of having passed the qualifying examination?\",\n    \"A\": \"The candidate must produce proof of having passed the examination as soon as possible, and in any case not later than two months after the commencement of the examination.\"\n  },\n  {\n    \"Q\": \"What is the fee requirement for a candidate to appear at the examination?\",\n    \"A\": \"A candidate must pay the fee prescribed by the Council unless exempted therefrom or granted concession thereof in accordance with the exemptions and/or concessions notified from time to time.\"\n  },\n  {\n    \"Q\": \"Who has the final decision on a candidate's eligibility for admission to the examination?\",\n    \"A\": \"The decision of the Board as to the eligibility or otherwise of a candidate for admission to the examination shall be final.\"\n  },\n  {\n    \"Q\": \"What is the penalty for a candidate found guilty of misconduct during the examination?\",\n    \"A\": \"The candidate may be debarred permanently or for a specified period from admission to any examination or appearance at any interview held by the Board, and may also be liable to disciplinary action under the appropriate rules.\"\n  },\n  {\n    \"Q\": \"How are successful candidates selected for appointment after the examination?\",\n    \"A\": \"The successful candidates shall be interviewed by the Board, and a merit list prepared in accordance with the number of unreserved and reserved vacancies decided to be filled on the basis of the results of the examination.\"\n  },\n  {\n    \"Q\": \"What is the provision for candidates belonging to Scheduled Castes and Scheduled Tribes who are not qualified by the standard prescribed by the Board?\",\n    \"A\": \"Such candidates may be recommended for appointment in consonance with the vacancies reserved for the members of the Scheduled Castes and Scheduled Tribes, if they are declared by the Board to be suitable for selection having due regard to the maintenance of efficiency of the research service.\"\n  },\n  {\n    \"Q\": \"Who arranges for the appointment of successful candidates after the examination?\",\n    \"A\": \"The Controlling Authority shall arrange for the appointment of successful candidates after receiving the merit list from the Board.\"\n  },\n  {\n    \"Q\": \"What is the purpose of preparing a merit list of successful candidates after the examination?\",\n    \"A\": \"The merit list is prepared to fill the unreserved and reserved vacancies decided to be filled on the basis of the results of the examination, and to recommend candidates for appointment.\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"What is the process for a candidate to apply for admission through selection to Grade S-2 and S-3 of the Service?\",\n  \"A1\": \"A candidate must apply before the prescribed date, in the prescribed form and manner, as notified by the Board.\",\n  \n  \"Q2\": \"Is a candidate required to pay a fee for applying to Grade S-2 and S-3 of the Service?\",\n  \"A2\": \"Yes, a candidate must pay the fee prescribed by the Board, unless exempted or granted concession.\",\n  \n  \"Q3\": \"What is the scale of pay for a Scientist S-2 in the Service?\",\n  \"A3\": \"The scale of pay for a Scientist S-2 is Rs. 1100-1600.\",\n  \n  \"Q4\": \"What are the essential qualifications for a Scientist S-2 in the Other than Technology and Engineering Group?\",\n  \"A4\": \"The essential qualifications include a Doctorate degree (relaxable to Master's Degree) and at least 5 years' research/teaching experience at least at Bachelor's degree level.\",\n  \n  \"Q5\": \"What is the age limit for a candidate applying to Grade S-2 and S-3 of the Service?\",\n  \"A5\": \"A candidate must not have attained the age of 45 years on the last date for the receipt of applications by the A.S.R.B.\",\n  \n  \"Q6\": \"Are there any desirable qualifications for a Scientist S-2 and S-3 in the Service?\",\n  \"A6\": \"Yes, desirable qualifications are to be prescribed.\",\n  \n  \"Q7\": \"What is the scale of pay for a Scientist S-3 in the Service?\",\n  \"A7\": \"The scale of pay for a Scientist S-3 is Rs. 1500-2000.\",\n  \n  \"Q8\": \"What are the essential qualifications for a Scientist S-3 in the Technology and Engineering Group?\",\n  \"A8\": \"The essential qualifications include a Doctorate in Engineering (relaxable to Master's Degree) and at least 5 years' experience of research/teaching.\",\n  \n  \"Q9\": \"Is there any experience requirement for a Scientist S-3 in the Other than Technology and Engineering Group?\",\n  \"A9\": \"Yes, at least 7 years' research/teaching experience at least at Bachelor's Degree level, with at least 2 years experience at S-2 or equivalent pay level.\",\n  \n  \"Q10\": \"Is there a maximum age limit for serving scientists in I.C.A.R. applying to Grade S-2 and S-3 of the Service?\",\n  \"A10\": \"No, there is no maximum age limit for serving scientists in I.C.A.R.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What is the age limit for candidates applying for the Agricultural Scientists' Recruitment Board (A.S.R.B.)?\",\n  \"A1\": \"The candidate must not have attained the age of 50 years on the last date for the receipt of applications by the A.S.R.B.\",\n  \"Q2\": \"What is the experience requirement for candidates possessing a Doctorate Degree?\",\n  \"A2\": \"3 years of experience is required for candidates possessing a Doctorate Degree.\",\n  \"Q3\": \"What is the experience requirement for candidates having a Master's Degree or an equivalent qualification?\",\n  \"A3\": \"8 years of experience is required for candidates having a Master's Degree or an equivalent qualification.\",\n  \"Q4\": \"Can the qualifications be relaxed for the Engineering and Technology Group in Grades S-2 and S-3?\",\n  \"A4\": \"Yes, the qualifications may be relaxed at the discretion of the A.S.R.B. in exceptional cases.\",\n  \"Q5\": \"What is the minimum qualification required for induction into the Agricultural Scientists' Service?\",\n  \"A5\": \"A Master's Degree or equivalent in any branch of Agriculture, Animal Sciences, Fisheries, Forestry, General Science, Home Science, Social Sciences, Statistics, or Mathematics, or a Bachelor's Degree in any branch of Engineering or Technology.\",\n  \"Q6\": \"Who is eligible for induction into the Agricultural Scientists' Service?\",\n  \"A6\": \"Existing employees of the Council holding Scientific and Technical posts on the date of the constitution of the Service, who satisfy the conditions given, are eligible for induction.\",\n  \"Q7\": \"How are candidates screened for induction into the Agricultural Scientists' Service?\",\n  \"A7\": \"Candidates are screened by the Agricultural Scientists' Recruitment Board on the basis of the information contained in their bio-data forms and other relevant documents.\",\n  \"Q8\": \"Can employees of the I.C.A.R. apply for the Agricultural Scientists' Service without any age limit?\",\n  \"A8\": \"Yes, there is no maximum age limit for the employees of the I.C.A.R.\",\n  \"Q9\": \"What is the pay scale for posts in the Engineering and Technology Group that are filled on a contract basis?\",\n  \"A9\": \"The pay scale for such posts may not be regular, but instead, a specific lump-sum pay may be recommended by the A.S.R.B.\",\n  \"Q10\": \"Can experience acquired by I.C.A.R. employees as B.E./B. Tech. be counted for the purpose of recruitment to higher posts?\",\n  \"A10\": \"Yes, the experience acquired by I.C.A.R. employees as B.E./B. Tech. can be counted for the purpose of recruitment to higher posts if they obtain an M.Sc./M. Tech. Degree.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What is the mode of induction for scientists into the ICAR Agricultural Research Service?\",\n  \"A1\": \"The induction has been done in equivalent grades with effect from 1-10-1975, considering the grade of the post held by the scientist prior to induction.\",\n  \n  \"Q2\": \"What is the exception made for scientists who were holding posts in the pay scales of Rs 425-700 and Rs 650-1200?\",\n  \"A2\": \"The induction has been done in grade S (Rs 550-900) and S-l (Rs 700-1300) respectively for these scientists.\",\n  \n  \"Q3\": \"What is the probation period for persons appointed to the Service?\",\n  \"A3\": \"The probation period is two years, but employees of the Council on induction into the Service will be given credit of their service rendered in the posts corresponding to the grades of their induction.\",\n  \n  \"Q4\": \"How will the future maintenance of the Service be done?\",\n  \"A4\": \"The future maintenance of the Service will be through an all-India Competitive Examination and interview, promotion from grade 'S', and direct recruitment through advertisement to all grades by the Agricultural Scientists' Recruitment Board.\",\n  \n  \"Q5\": \"What is the purpose of grade S (Rs 550-900) in the Service?\",\n  \"A5\": \"This grade is meant to provide initial induction opportunities to qualified employees of the Council in the pay scales of Rs 425-700, Rs 550-750, and Rs 550-900.\",\n  \n  \"Q6\": \"How will vacancies in grade S-l (Rs 700-1300) be filled?\",\n  \"A6\": \"Vacancies in this grade shall be filled by promotion on the basis of assessment of scientists from grade 'S' and appointment of candidates selected on the basis of a competitive examination and interview held by the A.S.R.B.\",\n  \n  \"Q7\": \"What is the period for which a suitable proportion of positions in the grade 'S' of the Service will be kept vacant?\",\n  \"A7\": \"A suitable proportion of positions in the grade 'S' of the Service will be kept vacant for five years.\",\n  \n  \"Q8\": \"Can employees who do not desire to be absorbed in the Service continue to hold their current position?\",\n  \"A8\": \"Yes, employees who do not desire to be absorbed in the Service can continue to hold the position already held by them, provided they inform the Council accordingly within a period of six months from the date of their selection for induction into the Service.\",\n  \n  \"Q9\": \"What is the role of the Agricultural Scientists' Recruitment Board in the recruitment process?\",\n  \"A9\": \"The Agricultural Scientists' Recruitment Board will conduct an all-India Competitive Examination and interview for recruitment to grade S-l and direct recruitment to all grades.\",\n  \n  \"Q10\": \"Can Eminent Indian Scientists be appointed to the Service?\",\n  \"A10\": \"Yes, Eminent Indian Scientists may also be invited for appointment with the approval of the Controlling Authority.\"\n}\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```\n[\n  {\n    \"Q\": \"How often may promotion as a result of assessment be reviewed?\",\n    \"A\": \"Every year\"\n  },\n  {\n    \"Q\": \"What are the pay scales for grades 5-2 and 5-3?\",\n    \"A\": \"Rs 100-50-1600 and Rs 1500-60-1800-100-2000 respectively\"\n  },\n  {\n    \"Q\": \"How are positions in grades 5-2 and 5-3 normally filled?\",\n    \"A\": \"By Scientists promoted on the basis of merit as determined by appropriate assessment\"\n  },\n  {\n    \"Q\": \"Can direct recruitment be made to positions in grades 5-2 and 5-3?\",\n    \"A\": \"No, except to correct certain imbalances\"\n  },\n  {\n    \"Q\": \"How long can a person holding a regular post in another organization remain on deputation before being absorbed into the Service?\",\n    \"A\": \"Not exceeding three years\"\n  },\n  {\n    \"Q\": \"What is the procedure for absorbing Scientists into the Agricultural Research Service?\",\n    \"A\": \"The procedure involves initial appointment on deputation, completion of probation, and then permanent absorption with the consent of the parent department/organization\"\n  },\n  {\n    \"Q\": \"Do Scientists recruited through the Agricultural Scientists' Recruitment Board need to undergo further screening for permanent absorption?\",\n    \"A\": \"No\"\n  },\n  {\n    \"Q\": \"What is the purpose of assessing Scientists in grades S-1 to S-3?\",\n    \"A\": \"For promotion or for advance increments\"\n  },\n  {\n    \"Q\": \"How is the five-year period for assessment computed?\",\n    \"A\": \"The period includes service rendered in scientific and technical posts in the pay scale corresponding to the grade, as well as service rendered in a deputation post in another organization in an equivalent or higher post\"\n  },\n  {\n    \"Q\": \"Who is eligible for assessment for promotion or advance increments?\",\n    \"A\": \"Scientists in grades S-1 to S-3 who have completed five years in their respective grades\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What are the factors considered for equating service in a particular grade?\",\n    \"A\": \"The factors include service rendered before or after deputation, entire service in a particular grade, service in an ad hoc capacity, and service rendered in a lower scale of pay that can be equated with a higher grade.\"\n  },\n  {\n    \"Q\": \"How is the service of technical personnel inducted in grade S-3 equated?\",\n    \"A\": \"The service rendered by technical personnel in the scale of pay of Rs 1300-1700 may be equated with the service in the grade of Rs 1500-2000.\"\n  },\n  {\n    \"Q\": \"What is the periodicity of the five-yearly assessment for scientists?\",\n    \"A\": \"The periodicity of assessment was once a year till 30th June, 1982, and has been changed to twice a year with effect from 1st July, 1982.\"\n  },\n  {\n    \"Q\": \"When does the promotion or advance increments become effective for successful candidates?\",\n    \"A\": \"The promotion or advance increments become effective from 1st of January or 1st of July of the year in which the assessment was due.\"\n  },\n  {\n    \"Q\": \"What is the criteria and method of assessment for scientists in the service?\",\n    \"A\": \"The criteria and method of assessment are based on the Peer Review System, with an Assessment Committee constituted by the ASRB, and the criteria include professional performance, spirit of co-operation, managerial abilities, and personal abilities.\"\n  },\n  {\n    \"Q\": \"What is the composition of the Assessment Committee?\",\n    \"A\": \"The Assessment Committee consists of not more than five scientists, with the Chairman, ASRB, as its Chairman, and external members only, who are eminent scientists belonging to the particular discipline.\"\n  },\n  {\n    \"Q\": \"What factors are taken into consideration during the assessment?\",\n    \"A\": \"The factors taken into consideration include the material furnished in the Five-Yearly Assessment pro forma, Research Project Files, and bio-data and career information.\"\n  },\n  {\n    \"Q\": \"How is the quality of research work considered during the assessment?\",\n    \"A\": \"Emphasis is laid on the quality rather than the quantity of the research work done, especially for scientists in grade S-3 and above.\"\n  },\n  {\n    \"Q\": \"What is the purpose of the five-yearly assessment?\",\n    \"A\": \"The purpose of the five-yearly assessment is to evaluate the contributions and achievements of individual scientists in relation to the requirements of the job and the duties assigned to the post.\"\n  },\n  {\n    \"Q\": \"Who constitutes the Assessment Committee?\",\n    \"A\": \"The Assessment Committee is constituted by the ASRB, with the Chairman, ASRB, as its Chairman, and external members who are eminent scientists belonging to the particular discipline.\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"What are the criteria for selecting scientists for promotion?\",\n  \"A1\": \"The criteria include assessment of research contributions, publications, and other achievements, as well as confidential character rolls and personal discussions.\",\n  \"Q2\": \"How are the posts of Heads of Divisions in the institutes filled?\",\n  \"A2\": \"The posts are filled by rotation from amongst the Professors in the Divisions or other senior scientists in the scale of pay of Rs 1500-2000 or Rs 1800-2000.\",\n  \"Q3\": \"What is the guideline for filling the post of Head of Division if an S-3 Scientist is not available in the Institute?\",\n  \"A3\": \"The post would be filled up by transfer of a suitable scientist from these grades working in other Institutes, or from amongst S-2 scientists working in that Institute if no scientist in the particular discipline is available.\",\n  \"Q4\": \"How long is the tenure of a Head of Division?\",\n  \"A4\": \"The positions of Heads of Divisions will normally be filled in for a period of three years from amongst the eligible scientists.\",\n  \"Q5\": \"What happens if a scientist is transferred from one Institute to another as Head of Division?\",\n  \"A5\": \"His appointment as Head of Division in the new Institute will be treated as a fresh tenure.\",\n  \"Q6\": \"Who is responsible for the work relating to organisation and management of teaching and research work and extension education in their Divisions/Departments?\",\n  \"A6\": \"The Heads of Divisions/Departments are responsible for the work relating to organisation and management of teaching and research work and extension education in their Divisions/Departments.\",\n  \"Q7\": \"What is the procedure for filling a vacant post of Head of Division on a temporary basis?\",\n  \"A7\": \"A proposal for this will be sent to the ICAR by the Director of the concerned Institute, and another suitable scientist will be appointed to act as the Head of the Division/Department as a stop-gap arrangement for a period not exceeding 3 months.\",\n  \"Q8\": \"What is the consideration for filling up a vacancy by transfer?\",\n  \"A8\": \"The filling up of the vacancy by transfer would be made only in public interest and kept to the minimum on consideration of merits alone.\",\n  \"Q9\": \"What is the condition for an S-2 Scientist to be considered for the post of Head of Division if they are on the verge of promotion?\",\n  \"A9\": \"The vacancy would not be filled up from outside the Institute and the concerned scientist would be made the Head of Division, subject to his performance being adjudged as excellent.\",\n  \"Q10\": \"What is the requirement for the appointment of an S-3 Scientist as Head of Division?\",\n  \"A10\": \"The appointment of an S-3 will be subject to his record being found at least very good.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What are the responsibilities of a Head of Division/Department?\",\n  \"A1\": \"A Head of Division/Department is responsible for discharging the functions of the position and performing other duties as assigned by the Director.\",\n  \n  \"Q2\": \"Can a scientist decline the position of Head of Division/Department if offered?\",\n  \"A2\": \"Yes, an eligible scientist may exercise their option not to accept the position of Head of Division/Department if offered to them by the Director.\",\n  \n  \"Q3\": \"What is the tenure period for a Head of Division/Department?\",\n  \"A3\": \"The tenure period for a Head of Division/Department is 3 years.\",\n  \n  \"Q4\": \"Can a Head of Division/Department relinquish their position during their tenure?\",\n  \"A4\": \"Yes, a Head of Division/Department may relinquish their position during their tenure by giving 3 months' notice to the Director of the Institute.\",\n  \n  \"Q5\": \"Who formulates proposals for Headship and sends them to the Council for consideration?\",\n  \"A5\": \"The Directors of the Institute formulate proposals for Headship and send them to the Council for consideration.\",\n  \n  \"Q6\": \"What is the process for selecting a new Head of Division/Department for a second tenure?\",\n  \"A6\": \"The Directors submit their recommendations for the present incumbent and a list of eligible candidates to the Council, which are then examined by the Deputy Director-General and finally decided by the Director-General.\",\n  \n  \"Q7\": \"What happens if no scientist in a Division is considered suitable for appointment as Head of the Division?\",\n  \"A7\": \"In such cases, a scientist from any other Institute may be transferred and posted as Head of the Division by the Council in consultation with the Director concerned.\",\n  \n  \"Q8\": \"Who makes arrangements for the absence of a Director on leave or deputation for a period of more than a month?\",\n  \"A8\": \"The ICAR makes full officiating arrangements for the post or entrusts the current duties to another scientist.\",\n  \n  \"Q9\": \"What are the guidelines for making arrangements for the absence of a Director on leave or deputation for a shorter period?\",\n  \"A9\": \"The Director of the Institute identifies the next two scientists who could be entrusted with the responsibilities, keeping in view the guidelines.\",\n  \n  \"Q10\": \"Who gives approval for the appointment of a candidate as Head of the Division if they are not the senior-most?\",\n  \"A10\": \"The President, ICAR gives approval for the appointment of a candidate as Head of the Division if they are not the senior-most.\"\n}\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```\n[\n  {\n    \"Q\": \"What is the principal criterion for identifying scientists to hold charge of the Institute during the Director's absence?\",\n    \"A\": \"The length of service in the grade next to that of the Director\"\n  },\n  {\n    \"Q\": \"Can Project Coordinators/Project Directors be entrusted with the responsibility to look after the duties of the Director in the latter's absence?\",\n    \"A\": \"No, unless the Chief Scientist is the Head of a Regional Research Centre of the Institute\"\n  },\n  {\n    \"Q\": \"What is the procedure when the absence of the Director on leave/deputation does not exceed one month?\",\n    \"A\": \"One of the senior-most officers of the Institute Headquarters should be entrusted with the current duties of the Director\"\n  },\n  {\n    \"Q\": \"What is the minimum period of time a Scientist is required to serve in a backward or comparatively less developed area of the country?\",\n    \"A\": \"As determined vide ICAR letter No. 8-18/76-Per. IV dt. 10-1-80\"\n  },\n  {\n    \"Q\": \"How are areas classified for the purpose of posting scientists in backward or comparatively less developed areas?\",\n    \"A\": \"Based on population, communication facilities, living conditions, education facilities, medical facilities, and working conditions\"\n  },\n  {\n    \"Q\": \"What is the rate of special allowance granted to scientists posted in category 'C' stations?\",\n    \"A\": \"Rs. 100 per month\"\n  },\n  {\n    \"Q\": \"What types of compensatory benefits are scientists entitled to in addition to special allowance?\",\n    \"A\": \"Lumpsum allowance and other benefits\"\n  },\n  {\n    \"Q\": \"How are scheduled areas classified for the purpose of posting scientists?\",\n    \"A\": \"Based on the extent of availability of normal amenities of life, such as communication facilities, living conditions, education facilities, medical facilities, and working conditions\"\n  },\n  {\n    \"Q\": \"Who is responsible for applying the criteria for classification of scheduled areas and forwarding proposals for approval?\",\n    \"A\": \"The Institutes\"\n  },\n  {\n    \"Q\": \"What is the rate of special allowance granted to scientists posted in category 'D' stations?\",\n    \"A\": \"Rs. 150 per month\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the allowance given to scientists for learning the local dialect?\",\n    \"A\": \"Rs. 200\"\n  },\n  {\n    \"Q\": \"What is the condition for a scientist to receive the local dialect allowance?\",\n    \"A\": \"The scientist must acquire adequate proficiency and pass a written or oral test\"\n  },\n  {\n    \"Q\": \"What type of accommodation will scientists get in areas where Central Government employees get free residential accommodation?\",\n    \"A\": \"Free accommodation\"\n  },\n  {\n    \"Q\": \"How much will scientists have to pay towards rent for hired accommodation?\",\n    \"A\": \"10 per cent of their pay\"\n  },\n  {\n    \"Q\": \"What medical facilities are scientists entitled to?\",\n    \"A\": \"Free medical facilities from the nearest State Government Hospital\"\n  },\n  {\n    \"Q\": \"What education benefits do scientists' children receive?\",\n    \"A\": \"Hostel subsidy and reimbursement of tuition fees\"\n  },\n  {\n    \"Q\": \"What transport/communication facilities may be provided to scientists?\",\n    \"A\": \"Facilities provided to State Government employees, subject to approval from the concerned State Governments\"\n  },\n  {\n    \"Q\": \"What is the maximum duration of posting in a remote area?\",\n    \"A\": \"5 years, which can be covered in not more than 2 separate spells of duty\"\n  },\n  {\n    \"Q\": \"Can scientists be transferred to any place in India?\",\n    \"A\": \"Yes, as a member of the A.R.S., scientists are liable to transfer to any place in India\"\n  },\n  {\n    \"Q\": \"What are the circumstances under which scientists may be transferred?\",\n    \"A\": \"To correct imbalance in cadre strength, fill positions in high-priority projects, utilize experience, post in backward areas, or for administrative reasons\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"What is the normal tenure of posting for scientists in the first group?\",\n  \"A1\": \"The normal tenure of posting for scientists in the first group is 5 years.\",\n  \n  \"Q2\": \"What happens to a scientist after completing their 5-year tenure in the first group?\",\n  \"A2\": \"The scientist is transferred to the third group and after completing 3 years in that group, they are transferred to the second group and then to the first group, and so on.\",\n  \n  \"Q3\": \"Can scientists in the second or third group choose not to be transferred?\",\n  \"A3\": \"Yes, scientists working in the second or third group (category C, D, and E stations) can choose not to be disturbed and continue in those stations.\",\n  \n  \"Q4\": \"What is the minimum time a scientist must spend in group three stations?\",\n  \"A4\": \"A scientist is required to spend at least a minimum of three years in group three stations (category D or E Station) during their entire career.\",\n  \n  \"Q5\": \"Can scientists over 55 years old be transferred without their consent?\",\n  \"A5\": \"No, scientists over 55 years in age may not be disturbed from their existing places of work without their consent, as far as possible.\",\n  \n  \"Q6\": \"When are transfers normally made?\",\n  \"A6\": \"Transfers are normally made by the end of March when the academic session of the schools and colleges comes to a close, to avoid disturbing the education of children.\",\n  \n  \"Q7\": \"What is the basis for determining the order of transfer?\",\n  \"A7\": \"The order of transfer is based on the length of stay at a particular place, with scientists who have served the longest being transferred first.\",\n  \n  \"Q8\": \"Who is consulted before making inter-institutional transfers?\",\n  \"A8\": \"Directors are consulted/informed in advance before making inter-institutional transfers.\",\n  \n  \"Q9\": \"Who has the authority to order non-routine transfers?\",\n  \"A9\": \"Directors in the Centres/stations under them have the authority to order non-routine transfers, but only after getting the prior approval of the D.G., ICAR.\",\n  \n  \"Q10\": \"What is the purpose of the Transfer Committee?\",\n  \"A10\": \"The Transfer Committee is set up to consider the question of transfers according to the specified pattern and make recommendations, on which the orders of transfer are issued.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What is the deadline for the Directors of the Institute to forward the list of scientists eligible for transfer to the Headquarters?\",\n  \"A1\": \"31st March every year\",\n  \"Q2\": \"What is the duration of the intensive course of study and training for candidates selected on the basis of the competitive examination?\",\n  \"A2\": \"One year\",\n  \"Q3\": \"What is the minimum period for which a trainee is required to serve the Council after appointment, including the period of training?\",\n  \"A3\": \"Four years\",\n  \"Q4\": \"What is the amount that a trainee is liable to refund if they fail to serve the Council for the stipulated period?\",\n  \"A4\": \"Rs 12000 together with interest\",\n  \"Q5\": \"What is the purpose of deputing scientists from the Service to work in posts under the Central or State Government, Agricultural University, or elsewhere?\",\n  \"A5\": \"In the interest of agricultural research and education and development work\",\n  \"Q6\": \"What are the grades provided for research management positions, along with their corresponding salary scales?\",\n  \"A6\": \"Scientist-4 (S-4) Rs. 1800-100-2000-125/2-2250, Scientist-5 (S-5) Rs. 2000-125/2-2500, Scientist-6 (S-6) Rs. 2500-125/2-3000, Scientist-7 (S-7) Rs. 3000 (fixed), Scientist-8 (S-8) Rs. 3500 (fixed)\",\n  \"Q7\": \"What is the maximum number of posts that shall be fixed for each grade of research management positions, irrespective of their designations?\",\n  \"A7\": \"The maximum number of posts shall be fixed for each grade\",\n  \"Q8\": \"What is the salary scale for the posts of Deputy Directors-General and the Directors of I.A.R.I., I.V.R.I., N.D.R.I., and C.I.A.E.?\",\n  \"A8\": \"Rs. 2500-3000\",\n  \"Q9\": \"On what basis can a selected candidate be offered a higher salary scale for the post of Director of other Institutes?\",\n  \"A9\": \"On the recommendation of the A.S.R.B.\",\n  \"Q10\": \"What is the consequence for a trainee found guilty of unbecoming conduct during the period of training?\",\n  \"A10\": \"The trainee will be liable to be discharged and refund the full amount of emoluments paid to them during the period of training\"\n}\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the scale of pay for the posts of A.D.G.?\",\n    \"A\": \"The scale of pay for the posts of A.D.G. is Rs. 1800-2250.\"\n  },\n  {\n    \"Q\": \"What is the possibility of granting a higher scale of pay to selected candidates?\",\n    \"A\": \"The possibility of granting the next higher scale of pay, where considered appropriate, will be mentioned in the advertisement for the post.\"\n  },\n  {\n    \"Q\": \"How will the existing Directors of the Institutes be screened for higher scales of pay?\",\n    \"A\": \"The existing Directors of the Institutes will be screened by the Agricultural Scientists' Recruitment Board for the purpose of allowing them the higher scales of pay.\"\n  },\n  {\n    \"Q\": \"What is the tenure for the posts in grades S-4, S-5, and S-6?\",\n    \"A\": \"The posts in grades S-4, S-5, and S-6 shall ordinarily be filled by advertisement and selection, on a tenure of 5 years, subject to renewal by another term not exceeding 5 years.\"\n  },\n  {\n    \"Q\": \"What happens to a Scientist of the Council after the expiry of the tenure?\",\n    \"A\": \"After the expiry of the tenure, the Scientist of the Council will return to a suitable position under the Council, retaining the pay scale as personal to him/her.\"\n  },\n  {\n    \"Q\": \"Can a scientist in the employment of the Council be transferred from one post to another?\",\n    \"A\": \"Yes, any scientist in the employment of the Council in any grade may be transferred from one post to another, in which case he/she will carry his/her own grade irrespective of the grade earlier assigned to the post.\"\n  },\n  {\n    \"Q\": \"What are the essential qualifications for the grade of Scientist S-4?\",\n    \"A\": \"The essential qualifications for the grade of Scientist S-4 include a Doctorate in the area to be specified, at least 10 years' Research/Teaching experience at post-graduate level, and managerial experience of at least 3 years.\"\n  },\n  {\n    \"Q\": \"What is the desirable qualification for the grade of Scientist S-4?\",\n    \"A\": \"The desirable qualification for the grade of Scientist S-4 is an established position of leadership and scientific reputation in the relevant field.\"\n  },\n  {\n    \"Q\": \"What is the age limit for the candidate applying for the grade of Scientist S-4?\",\n    \"A\": \"The candidate must not have attained a certain age, which is not specified in the given text.\"\n  },\n  {\n    \"Q\": \"Who prescribes the qualifications for each grade and can relax them in exceptional cases?\",\n    \"A\": \"The qualifications for each grade may be prescribed by the appointing authority, and can be relaxed in exceptional cases by the appointing authority on the recommendation of the Agricultural Scientists' Recruitment Board.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the age limit for applying to the ASRB?\",\n    \"A\": \"The candidate must not have attained the age of 55 years on the last date for receipt of applications by the ASRB.\"\n  },\n  {\n    \"Q\": \"Is there a maximum age limit for employees of the ICAR?\",\n    \"A\": \"No, there is no maximum age limit for employees of the ICAR.\"\n  },\n  {\n    \"Q\": \"What is the scale of pay for Scientist S-S (Directors)?\",\n    \"A\": \"The scale of pay for Scientist S-S (Directors) is Rs. 2000-2500.\"\n  },\n  {\n    \"Q\": \"What are the essential qualifications for Scientist S-S (Directors)?\",\n    \"A\": \"The essential qualifications include a Doctorate in the area, at least 12 years' Research/Teaching experience, and a record of productive research as evidenced by published work.\"\n  },\n  {\n    \"Q\": \"What is the experience requirement for Scientist S-6 (Directors/Dy. Director-General)?\",\n    \"A\": \"The candidate should have at least 15 years' research/teaching experience at post-graduate level, including 10 years at S-3 level or equivalent pay scale.\"\n  },\n  {\n    \"Q\": \"How is the experience in research/teaching reckoned?\",\n    \"A\": \"The experience in research/teaching is reckoned from the date the candidate has completed their Master's Degree and includes the period, not exceeding 3 years, spent to obtain a Doctorate Degree.\"\n  },\n  {\n    \"Q\": \"What is the desirable qualification for Scientist S-S (Directors) and Scientist S-6 (Directors/Dy. Director-General)?\",\n    \"A\": \"The desirable qualification is an established position of leadership and scientific reputation or a demonstrated capacity in any field of agricultural science.\"\n  },\n  {\n    \"Q\": \"Is there a system of grant of promotion from one grade to the next higher grade?\",\n    \"A\": \"Yes, there is a system of grant of promotion from one grade to the next higher grade on the basis of five-yearly assessment of performance.\"\n  },\n  {\n    \"Q\": \"Who is eligible for the five-yearly assessment of performance?\",\n    \"A\": \"Scientists in any of the grades who are not members of the Agricultural Research Service but who were in regular service of the Indian Council of Agricultural Research on or before 1.10.1975 are eligible.\"\n  },\n  {\n    \"Q\": \"What is the basis of the five-yearly assessment of performance?\",\n    \"A\": \"The five-yearly assessment of performance is based on the Peer Review System.\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"What is the condition for a scientist to be eligible to add to his service qualifying for superannuation pension?\",\n  \"A1\": \"A scientist appointed to any scientific post under the Council after 31st March, 1960 on a regular basis and holding a post in any of the grades covered under these rules, will be eligible to add to his service qualifying for superannuation pension.\",\n  \n  \"Q2\": \"What is the maximum period that can be added to a scientist's service for superannuation pension?\",\n  \"A2\": \"The actual period not exceeding one-fourth of the length of his service or the actual period by which his age at the time of recruitment exceeded 25 years or a period of 5 years, whichever is less.\",\n  \n  \"Q3\": \"What option is available to a scientist who is recruited at the age of 35 years or more?\",\n  \"A3\": \"A scientist who is recruited at the age of 35 years or more may, within a period of three months from the date of appointment, elect to forego his right to pension whereupon he will be eligible to subscribe to a contributory Provident Fund.\",\n  \n  \"Q4\": \"What are the approved disciplines for purposes of recruitment to the Agricultural Research Service?\",\n  \"A4\": \"The approved disciplines include Plant Sciences, Animal Sciences, Physical Sciences, Economics, Statistics and Extension, and Technology and Engineering.\",\n  \n  \"Q5\": \"What are some examples of disciplines under Plant Sciences?\",\n  \"A5\": \"Some examples of disciplines under Plant Sciences include Agronomy, Plant Breeding, Genetics and Cytogenetics, Agricultural Entomology, and Plant Pathology.\",\n  \n  \"Q6\": \"What are some examples of disciplines under Animal Sciences?\",\n  \"A6\": \"Some examples of disciplines under Animal Sciences include Veterinary Bacteriology and Virology, Animal Reproduction, Veterinary Pathology, and Animal Genetics and Breeding.\",\n  \n  \"Q7\": \"What are some examples of disciplines under Physical Sciences?\",\n  \"A7\": \"Some examples of disciplines under Physical Sciences include Physics, Organic Chemistry, Bio-physics, and Physical Chemistry.\",\n  \n  \"Q8\": \"What are some examples of disciplines under Technology and Engineering?\",\n  \"A8\": \"Some examples of disciplines under Technology and Engineering include Textile Manufacture, Electronics and Instrumentation, Electrical Engineering, and Chemical Engineering.\",\n  \n  \"Q9\": \"What is the purpose of Appendix I in the text?\",\n  \"A9\": \"Appendix I lists the approved disciplines for purposes of recruitment to the Agricultural Research Service.\",\n  \n  \"Q10\": \"What is the purpose of Appendix II in the text?\",\n  \"A10\": \"Appendix II outlines the terms and conditions of appointment to grades S-2 and S-3 of the Agricultural Research Service by open advertisement.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What is the probation period for the appointed candidate?\",\n  \"A1\": \"The probation period is 2 years from the date of appointment, which may be extended or curtailed at the discretion of the competent authority.\",\n  \n  \"Q2\": \"What happens if the candidate fails to complete the probation period satisfactorily?\",\n  \"A2\": \"The candidate will be liable to be discharged from service or reverted to their substantive post.\",\n  \n  \"Q3\": \"How is the initial pay of the candidate fixed?\",\n  \"A3\": \"The initial pay is fixed in accordance with the rules applicable to the Indian Council of Agricultural Research scientists.\",\n  \n  \"Q4\": \"Can the candidate be posted to any location in India?\",\n  \"A4\": \"Yes, as a member of the service, the candidate will be liable to be posted to any grade or assignment anywhere in India.\",\n  \n  \"Q5\": \"Is the candidate required to serve in a backward or less developed area?\",\n  \"A5\": \"Yes, the candidate may be required to serve in a backward or less developed area of the country for a period decided by the Controlling Authority.\",\n  \n  \"Q6\": \"Can the Indian Council of Agricultural Research depute the candidate to work outside the organization?\",\n  \"A6\": \"Yes, the Indian Council of Agricultural Research can depute the candidate to work in a post under the Central or a State Government, Agricultural University, or elsewhere, including assignment abroad, for specific periods.\",\n  \n  \"Q7\": \"What medical requirement must the candidate fulfill?\",\n  \"A7\": \"The candidate must produce a medical certificate of fitness from the Medical Board if they have not been already examined by such a Board.\",\n  \n  \"Q8\": \"What declaration must the candidate submit regarding their marital status?\",\n  \"A8\": \"The candidate must submit a declaration regarding their marital status in the prescribed form, if not already done.\",\n  \n  \"Q9\": \"What oath or affirmation must the candidate take?\",\n  \"A9\": \"The candidate must take an oath of allegiance/faithfulness to the Constitution of India or make a solemn affirmation to this effect in the prescribed form, if not already done.\",\n  \n  \"Q10\": \"What rules govern the other conditions of service?\",\n  \"A10\": \"The other conditions of service will be governed by the relevant rules, orders, and staff regulations issued by the Indian Council of Agricultural Research from time to time.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What will happen if an employee of the Indian Council of Agricultural Research (ICAR) is found to have provided false information or wilfully suppressed material information?\",\n  \"A1\": \"The employee will be liable to removal from service and such other action as may be deemed necessary.\",\n  \"Q2\": \"What undertaking is required from employees of the ICAR engaged in research?\",\n  \"A2\": \"Employees are required to give an undertaking that patent rights in respect of discoveries and inventions made during their service with the ICAR shall vest in the ICAR.\",\n  \"Q3\": \"What is the purpose of the undertaking by employees of the ICAR?\",\n  \"A3\": \"The purpose of the undertaking is to ensure that the ICAR has sole rights to the inventions and discoveries made by its employees during their service.\",\n  \"Q4\": \"Can employees of the ICAR publish the results of their investigations without prior approval?\",\n  \"A4\": \"No, employees are not allowed to publish the results of their investigations without the prior approval of the ICAR.\",\n  \"Q5\": \"Who has the sole right to publish the results of investigations in its own journals?\",\n  \"A5\": \"The ICAR has the sole right to publish the results of investigations in its own journals before they are published elsewhere.\",\n  \"Q6\": \"What happens to inventions and improvements made by employees during their service with the ICAR?\",\n  \"A6\": \"The inventions and improvements made by employees during their service with the ICAR shall be the sole and absolute property of the ICAR.\",\n  \"Q7\": \"Are employees required to disclose their inventions and improvements to the ICAR?\",\n  \"A7\": \"Yes, employees are required to disclose their inventions and improvements to the ICAR and hold them in trust on behalf of the ICAR.\",\n  \"Q8\": \"Can employees retain any rights to their inventions and improvements?\",\n  \"A8\": \"The ICAR may permit employees to retain some rights to their inventions and improvements, but this is subject to the ICAR's discretion.\",\n  \"Q9\": \"What is required of employees when applying for Letters Patent in respect of their inventions?\",\n  \"A9\": \"Employees are required to join the ICAR in applying for Letters Patent in India and other countries, and to execute any necessary instruments to vest the inventions in the ICAR.\",\n  \"Q10\": \"Who bears the expense of applying for Letters Patent and executing necessary instruments?\",\n  \"A10\": \"The ICAR bears the expense of applying for Letters Patent and executing necessary instruments.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What is the Indian Council of Agricultural Research (ICAR) registered as?\",\n  \"A1\": \"ICAR is registered as a Society under the Societies Registration Act, 1860.\",\n  \n  \"Q2\": \"Which rules are followed by ICAR for its employees?\",\n  \"A2\": \"ICAR follows the Central Civil Services (Classification, Control and Appeal) Rules, 1965, with modifications.\",\n  \n  \"Q3\": \"What is the role of the Disciplinary Authority in ICAR?\",\n  \"A3\": \"The Disciplinary Authority is competent to impose penalties on ICAR employees, as per the CCS (CCA) Rules.\",\n  \n  \"Q4\": \"What are the penalties that can be imposed on ICAR employees?\",\n  \"A4\": \"The penalties are mentioned in Rule 11 of the CCS (CCA) Rules, 1965.\",\n  \n  \"Q5\": \"Who has the authority to impose penalties on ICAR employees?\",\n  \"A5\": \"Only authorized officers, technically termed as the Disciplinary Authority, can impose penalties on ICAR employees.\",\n  \n  \"Q6\": \"What is the provision for review of orders passed under the CCS (CCA) Rules?\",\n  \"A6\": \"The President, ICAR, may review any order passed under these Rules, as per provision of Rule 29A of CCS (CCA) Rules, 1965.\",\n  \n  \"Q7\": \"Who is the Appointing Authority for Scientist-8 (S-8) grade in ICAR?\",\n  \"A7\": \"The President, ICAR, is the Appointing Authority for Scientist-8 (S-8) grade.\",\n  \n  \"Q8\": \"What is the schedule for Disciplinary and Appellate Authorities in ICAR?\",\n  \"A8\": \"The schedule is drawn up with the approval of the President, ICAR, as per provision of Rule 12 of CCS (CCA) Rules, 1965.\",\n  \n  \"Q9\": \"Who has the authority to impose penalties on Scientist-1 (S-1) grade employees in ICAR?\",\n  \"A9\": \"The Director General, ICAR, has the authority to impose penalties on Scientist-1 (S-1) grade employees.\",\n  \n  \"Q10\": \"What is the purpose of the Disciplinary/Appellate Authorities in ICAR?\",\n  \"A10\": \"The purpose is to ensure that penalties are imposed on ICAR employees in a fair and transparent manner, as per the CCS (CCA) Rules.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What are the criteria for five-yearly assessment of scientists in the Agricultural Research Service?\",\n  \"A1\": \"The criteria include professional performance, spirit of co-operation and team work, managerial/organisational abilities/attributes, and personal/behavioural abilities/attributes.\",\n  \n  \"Q2\": \"What is the purpose of the assessment system in the Agricultural Research Service?\",\n  \"A2\": \"The assessment system serves to reward scientists by promotion or advance increments, and helps individuals identify and develop aspects of their personality and performance that the organisation emphasizes.\",\n  \n  \"Q3\": \"What materials are considered during the five-yearly assessment of scientists?\",\n  \"A3\": \"The materials considered include the Five-Yearly Assessment proforma, research project files, bio-data and career information, CCRs for the past 5 years, and personal discussion if desired.\",\n  \n  \"Q4\": \"Who is the reviewer for scientists in Grades S, S-1, and S-2?\",\n  \"A4\": \"The reviewer is the Head of the Division/Head of the Research Station/Project Co-ordinator, or as specified by the Directors of the Institutes.\",\n  \n  \"Q5\": \"What should the scientist being assessed do with the Five-Yearly Assessment proforma?\",\n  \"A5\": \"The scientist should carefully fill in parts II and III of the proforma, keeping in mind their activities in the past five years, and then pass it on to the reviewer.\",\n  \n  \"Q6\": \"What should the reviewer do after receiving the filled proforma from the scientist?\",\n  \"A6\": \"The reviewer should carefully go through the information provided by the scientist and record their critical evaluation in part IV of the proforma.\",\n  \n  \"Q7\": \"Why is it important for the reviewer to have supervised the work of the reviewee for a significant period of time?\",\n  \"A7\": \"It is important so that the reviewer can provide a fair and accurate evaluation of the scientist's performance.\",\n  \n  \"Q8\": \"What should the reviewer do if they have supervised the work of the reviewee for less than six months?\",\n  \"A8\": \"The reviewer should consult other scientists of corresponding status who may have also supervised or worked with the reviewee for a longer period.\",\n  \n  \"Q9\": \"Who is responsible for issuing orders indicating the reviewer for each post?\",\n  \"A9\": \"The Directors of the Institutes are responsible for issuing separate orders indicating the reviewer for each post.\",\n  \n  \"Q10\": \"What is the overall goal of the five-yearly assessment system in the Agricultural Research Service?\",\n  \"A10\": \"The overall goal is to evaluate the performance of scientists and help the organisation evolve a working culture that meets its mandate and goals.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What happens to the completed proforma after it is filled?\",\n  \"A1\": \"The completed proforma is sent to the Director/DDG, ICAR where Part V of the proforma is filled in by the concerned authorities.\",\n  \n  \"Q2\": \"Who fills in Part V of the proforma if the Director has left the ICAR system?\",\n  \"A2\": \"The concerned DDG at the ICAR Headquarters fills in Part V of the proforma if the Director has left the ICAR system.\",\n  \n  \"Q3\": \"What does the Director/DDG/Director-General do after reviewing the proforma?\",\n  \"A3\": \"The Director/DDG/Director-General carefully goes through the proforma, comments on discrepancies, and countersigns the proforma with specific recommendations and proper justification.\",\n  \n  \"Q4\": \"What happens if a scientist has worked at more than one Institute/Organisation during the past five years?\",\n  \"A4\": \"The scientist completes the requisite number of copies of assessment proformae for each Institute/Organisation where they have worked for one year or more.\",\n  \n  \"Q5\": \"Who coordinates the proformae for a scientist who has worked at multiple Institutes/Organisations?\",\n  \"A5\": \"The Institute where the scientist is currently posted coordinates all the proformae duly completed by the concerned authorities of the previous Institute/Organisation.\",\n  \n  \"Q6\": \"Who gives an overall assessment of a scientist who has worked at multiple Institutes/Organisations?\",\n  \"A6\": \"The concerned DDG/Director General gives an overall assessment based on the information available in the proformae for the entire period of five years.\",\n  \n  \"Q7\": \"What happens to the proformae after they are completed and reviewed?\",\n  \"A7\": \"The Directors forward the proformae directly to ASRB, except for those that need to be examined by the concerned DDG/Director-General.\",\n  \n  \"Q8\": \"What is the composition of the Assessment Committee?\",\n  \"A8\": \"The Assessment Committee has not more than five members, excluding the Chairman ASRB or his nominee, and consists of eminent scientists belonging to the particular discipline.\",\n  \n  \"Q9\": \"How are scientists selected for assessment by the Assessment Committee?\",\n  \"A9\": \"The scientists of one grade belonging to a particular discipline are taken up for assessment as far as possible in one lot instead of inter-mix.\",\n  \n  \"Q10\": \"What happens to scientists who are called for personal discussion by the ASRB?\",\n  \"A10\": \"The ASRB calls the scientists to appear before the Assessment Committee, except in cases where it is not possible to do so, such as scientists on foreign deputation or on long study leave.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What is the composition of the Assessment Committee?\",\n  \"A1\": \"The Assessment Committee consists of external members, including retired ICAR scientists, with the Chairman, ASRB or his nominee as its Chairman.\",\n  \n  \"Q2\": \"What is the purpose of the meeting between the Chairman, ASRB and the Assessment Committee members?\",\n  \"A2\": \"The purpose is for briefing and giving guidelines to the members for judging the achievements of an individual scientist in their respective discipline.\",\n  \n  \"Q3\": \"What type of discussion will the Assessment Committee have with the scientist?\",\n  \"A3\": \"The discussion will not be a routine or formal type of interview, but rather an opportunity for the scientist to project their work and achievements, and to clarify any specific aspects of their work.\",\n  \n  \"Q4\": \"What are the possible recommendations of the Assessment Committee?\",\n  \"A4\": \"The Committee may recommend merit promotion, advance increment(s), or nothing, with a maximum of three advance increments.\",\n  \n  \"Q5\": \"What is the significance of advance increments?\",\n  \"A5\": \"An advance increment means one increment over and above the normal annual increment.\",\n  \n  \"Q6\": \"Who finalizes the recommendations of the Assessment Committee?\",\n  \"A6\": \"The recommendations are finalized under the guidance of the Chairman, ASRB.\",\n  \n  \"Q7\": \"What is the procedure for assessing scientists in Grade S-3?\",\n  \"A7\": \"The procedure involves a five-yearly assessment for grant of advance increments or for grant of S-4 scale of pay as personal to them.\",\n  \n  \"Q8\": \"What is the criteria for the five-yearly assessment of scientists in Grade S-3?\",\n  \"A8\": \"The criteria are laid down by the Controlling Authority in consultation with the Agricultural Scientists' Recruitment Board.\",\n  \n  \"Q9\": \"Can scientists in Grade S-3 be granted a personal scale of pay higher than that of Grade S-3?\",\n  \"A9\": \"Yes, in recognition of outstanding performance in research, as per Rule 12 of the Agricultural Research Service Rules.\",\n  \n  \"Q10\": \"What is the purpose of Rule 19 of the Agricultural Research Service Rules?\",\n  \"A10\": \"Rule 19 provides for merit promotion and advance increments for scientists in Grades S, S-1, and S-2, and also applies to scientists in Grade S-3.\"\n}\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```\n[\n  {\n    \"Q\": \"What are the key factors considered in the assessment of a scientist's performance?\",\n    \"A\": \"Professional performance, spirit of co-operation and team work, managerial/organisational abilities, and personal/behavioural abilities\"\n  },\n  {\n    \"Q\": \"What is the emphasis of the assessment?\",\n    \"A\": \"Emphasis is on the quality rather than the quantity of the research work done\"\n  },\n  {\n    \"Q\": \"What materials are considered in the assessment of a scientist?\",\n    \"A\": \"Five-yearly assessment pro-forma, research project files, bio-data, and career information, CCRs for the past five years\"\n  },\n  {\n    \"Q\": \"Who fills in Part IV of the proforma?\",\n    \"A\": \"The reviewer, who is a scientist not below the rank of a grade S-4 scientist supervising the work of the reviewee\"\n  },\n  {\n    \"Q\": \"What happens if the reviewer has supervised the work of the reviewee for a short period?\",\n    \"A\": \"The reviewer shall consult other officers of the corresponding level who may have also supervised the work of the reviewee for a longer period\"\n  },\n  {\n    \"Q\": \"Who issues separate orders indicating the reviewer for each post?\",\n    \"A\": \"The competent authority\"\n  },\n  {\n    \"Q\": \"What happens after the proforma has been completed by the scientist being assessed?\",\n    \"A\": \"The proforma is passed on to the reviewer, who then fills in Part IV and sends it to the Director/DDG/Director-General, ICAR\"\n  },\n  {\n    \"Q\": \"Who fills in Part V of the proforma?\",\n    \"A\": \"The concerned authorities at the ICAR Headquarters\"\n  },\n  {\n    \"Q\": \"What happens in cases where a Director has left the ICAR system?\",\n    \"A\": \"Part V or Part IV of the proforma is filled in by the concerned DDG at the ICAR Headquarters\"\n  },\n  {\n    \"Q\": \"What is the final step in the assessment process?\",\n    \"A\": \"The Director/DDG/DG, ICAR carefully goes through the proforma and takes necessary actions\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"What happens if the Director/DDG/DG, ICAR disagrees with the assessment of both the reviewer and the reviewee?\",\n  \"A1\": \"He may give his reasons for disagreement and countersign the proforma with his specific recommendations giving proper justification.\",\n  \n  \"Q2\": \"What is the role of the Directors in the assessment process?\",\n  \"A2\": \"The Directors will forward directly to ASRB the proformae relating to all scientists excepting those which have to be examined by the concerned DDG/DG.\",\n  \n  \"Q3\": \"What happens to a scientist who has worked at more than one Institute/Organisation during the past five years?\",\n  \"A3\": \"He may complete requisite number of copies of assessment proformae in respect of each such Institute/Organisation where he has worked for one year or more.\",\n  \n  \"Q4\": \"Who coordinates the assessment proformae for a scientist who has worked at multiple Institutes/Organisations?\",\n  \"A4\": \"The Institute where the scientist is posted currently will co-ordinate all such proformae duly completed by the concerned authorities of the previous Institute/Organisation.\",\n  \n  \"Q5\": \"What is the role of the ASRB in the assessment process?\",\n  \"A5\": \"The ASRB shall call through the concerned Institute/ICAR Headquarters all the scientists, who indicate their desire for personal discussion, to appear before the Assessment Committee.\",\n  \n  \"Q6\": \"How is the Assessment Committee constituted?\",\n  \"A6\": \"The ASRB shall constitute an Assessment Committee consisting of not more than five members excluding the Chairman, ASRB or his nominee, with eminent scientists belonging to the particular discipline as its members.\",\n  \n  \"Q7\": \"What is the purpose of the Assessment Committee?\",\n  \"A7\": \"The Committee will deal with all scientists/assessees belonging to a particular discipline through working in different research Institutes.\",\n  \n  \"Q8\": \"Can scientists of different grades be assessed together?\",\n  \"A8\": \"All the scientists of one grade belonging to a particular discipline will be taken up for assessment as far as possible in one lot instead of intermixing scientists of different grades.\",\n  \n  \"Q9\": \"Who are the members of the Assessment Committee?\",\n  \"A9\": \"The Assessment Committee would consist of external members (including retired ICAR scientists) only, with Chairman, ASRB or his nominee as its Chairman.\",\n  \n  \"Q10\": \"What happens before the meeting of the Assessment Committee?\",\n  \"A10\": \"The Chairman, ASRB may, as far as possible, have a meeting with the Members of each Assessment Committee(s) for briefing and giving guidelines to them for judging the achievements of an individual scientist in his/her respective discipline.\"\n}\n```",
    "```json\n[\n  {\n    \"Q\": \"What are the two types of promotion mentioned in the text?\",\n    \"A\": \"Merit promotion upto S-3 and promotion based on outstanding performance under Rule 12 of the Rules of the ARS\"\n  },\n  {\n    \"Q\": \"What is the purpose of the personal discussion with the scientist during the assessment process?\",\n    \"A\": \"To provide an opportunity for the scientist to project their work and achievements, and to clarify any specific aspects of their work\"\n  },\n  {\n    \"Q\": \"What are the possible recommendations for scientists based on their assessment?\",\n    \"A\": \"Advance increment(s), the Grade S-4 scale of pay, or nothing\"\n  },\n  {\n    \"Q\": \"What is the maximum number of advance increments that can be given to a scientist?\",\n    \"A\": \"Three\"\n  },\n  {\n    \"Q\": \"What is the basis for assessing the suitability of scientists for the next higher pay-scale?\",\n    \"A\": \"Whether their performance has been outstanding or not, rather than on the basis of long and meritorious service\"\n  },\n  {\n    \"Q\": \"Who guides the finalization of the Assessment Committee's recommendations?\",\n    \"A\": \"The Chairman, ASRB\"\n  },\n  {\n    \"Q\": \"What are the criteria for the five-yearly assessment of S-3 Scientists of ARS holding higher pay scale or research management position in Grade S-4 and above?\",\n    \"A\": \"Professional performance, spirit of co-operation and team work, managerial/organization abilities, and personal/behavioural abilities\"\n  },\n  {\n    \"Q\": \"What is the emphasis in the assessment of scientists?\",\n    \"A\": \"On the contributions and achievements of the individual in relation to the requirements of the job and duties assigned\"\n  },\n  {\n    \"Q\": \"What is given more consideration in the assessment of scientists' achievements?\",\n    \"A\": \"Qualitative achievements rather than quantitative achievements\"\n  },\n  {\n    \"Q\": \"What is the broader function of the assessment system beyond rewarding scientists?\",\n    \"A\": \"To help individuals identify and develop aspects of their personality and performance, and to evolve a working culture appropriate to the organization\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"What is the purpose of the five-yearly assessment in the ICAR?\",\n  \"A1\": \"The purpose of the five-yearly assessment is to evaluate the performance of scientists and help them acquire expertise to meet the organization's goals.\",\n  \n  \"Q2\": \"What factors are considered during the assessment of scientists?\",\n  \"A2\": \"The assessment considers the material and achievements furnished in the Five-Yearly Assessment proforma, bio-data, career information, yearly record of work done, and CCR for the past 5 years.\",\n  \n  \"Q3\": \"Who fills in Parts II and III of the assessment proforma?\",\n  \"A3\": \"The scientist being assessed fills in Parts II and III of the proforma, keeping in mind their performance in the past five years.\",\n  \n  \"Q4\": \"Who is the reviewer in the assessment process?\",\n  \"A4\": \"The reviewer is the DG/DDG/Director of the Institute, who may consult other scientists if they have supervised the work of the reviewee for a short period.\",\n  \n  \"Q5\": \"What happens after the proforma is completed by the scientist and the reviewer?\",\n  \"A5\": \"The completed proforma is sent to the Director/DDG/DG, ICAR, where Part V of the proforma is filled in by the concerned authorities.\",\n  \n  \"Q6\": \"What is the role of the Director of the Institute in the assessment process?\",\n  \"A6\": \"The Director of the Institute encloses their comments in a separate sheet for critical evaluation of the performance of the reviewee by the concerned authorities at the ICAR Headquarters.\",\n  \n  \"Q7\": \"Who completes Part IV and V of the proforma for Project Co-ordinators located at Agricultural Universities?\",\n  \"A7\": \"The DDG and DG respectively complete Part IV and V of the proforma for Project Co-ordinators located at Agricultural Universities.\",\n  \n  \"Q8\": \"What happens if the Director/DDG/DG, ICAR notices discrepancies between the reviewer's and reviewee's evaluation?\",\n  \"A8\": \"The Director/DDG/DG, ICAR may give their comments on the discrepancies and may disagree with the assessment of both the reviewer and the reviewee if necessary.\",\n  \n  \"Q9\": \"What is the final step in the assessment process?\",\n  \"A9\": \"The completed proforma is sent to the ASRB after all parts have been filled in and comments have been added by the concerned authorities.\",\n  \n  \"Q10\": \"Why is the five-yearly assessment important for the organization?\",\n  \"A10\": \"The five-yearly assessment is important because it helps the organization achieve its goals by evaluating the performance of scientists and providing feedback for career advancement.\"\n}\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```\n[\n  {\n    \"Q\": \"What is the process for a scientist to provide reasons for disagreement with their assessment?\",\n    \"A\": \"The scientist shall counter-sign the proforma with their specific recommendations and give full justification.\"\n  },\n  {\n    \"Q\": \"Who forwards the proformae to the Agricultural Scientists' Recruitment Board (ASRB)?\",\n    \"A\": \"The Director will forward directly to ASRB the proformae relating to all scientists excepting those which have to be examined by the DDG concerned or by the Director-General.\"\n  },\n  {\n    \"Q\": \"What happens to the proforma received at the ICAR Headquarters?\",\n    \"A\": \"The proforma will be forwarded to the ASRB after getting the needful done, through the concerned administrative Section at the ICAR Headquarters.\"\n  },\n  {\n    \"Q\": \"What is the process for a scientist who has worked at multiple institutes during the past five years?\",\n    \"A\": \"The scientist may complete requisite number of copies of assessment proformae in respect of each such Institute/Organisation where he has worked for one year or more.\"\n  },\n  {\n    \"Q\": \"Who gives an overall assessment for a scientist who has worked at multiple institutes?\",\n    \"A\": \"The concerned DDG/DG will give an overall assessment based on the information available in the proformae for the entire period of five years.\"\n  },\n  {\n    \"Q\": \"What is the composition of the Assessment Committee?\",\n    \"A\": \"The Assessment Committee consists of five members, with two nominated by the Chairman ASRB and two by the President ICAR, and one chairman.\"\n  },\n  {\n    \"Q\": \"What is the quorum required for the Assessment Committee to function?\",\n    \"A\": \"The quorum required for the Assessment Committee to function is three members.\"\n  },\n  {\n    \"Q\": \"Who are the members of the Assessment Committee?\",\n    \"A\": \"The members of the Assessment Committee are external members, including retired ICAR scientists, and the Chairman ASRB or his nominee as the chairman.\"\n  },\n  {\n    \"Q\": \"What is the purpose of the meeting between the Chairman ASRB and the members of the Assessment Committee?\",\n    \"A\": \"The purpose of the meeting is for briefing and giving guidelines to the members for judging the achievements of an individual scientist in their respective discipline.\"\n  },\n  {\n    \"Q\": \"What documents does the Assessment Committee consider when deciding on the performance of scientists?\",\n    \"A\": \"The Assessment Committee considers the documents mentioned in para 3, which includes the assessment proformae and other relevant documents.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the purpose of the personal discussion with the scientist during the assessment process?\",\n    \"A\": \"The personal discussion provides an opportunity for the scientist to project their work and achievements, clarify any specific aspects of their work, and discuss any bottlenecks that constrained their research output.\"\n  },\n  {\n    \"Q\": \"What is the basis for assessing a scientist's suitability for a higher pay-scale?\",\n    \"A\": \"The assessment is based on whether the scientist's performance has been outstanding, rather than solely on long and meritorious service.\"\n  },\n  {\n    \"Q\": \"What is the highest pay-scale that a scientist can achieve through this assessment process?\",\n    \"A\": \"A scientist can rise up to Grade S-8 (Rs. 3500/- fixed) through this assessment process.\"\n  },\n  {\n    \"Q\": \"What information is required to be filled in Part-I of the Five-Yearly Assessment Proforma?\",\n    \"A\": \"Part-I requires information such as the reported period, name, father's name, date of birth, field of specialization, date of induction into A.R.S., and present position and scale of pay.\"\n  },\n  {\n    \"Q\": \"Who is responsible for filling in Part-II of the Five-Yearly Assessment Proforma?\",\n    \"A\": \"Part-II is to be filled in by the reviewee (the scientist being assessed).\"\n  },\n  {\n    \"Q\": \"What information is required in Part-II of the Five-Yearly Assessment Proforma?\",\n    \"A\": \"Part-II requires information such as the scientist's educational career, major field of study, additional qualifications, and employment record for the last five years.\"\n  },\n  {\n    \"Q\": \"What is the purpose of the Five-Yearly Assessment Proforma?\",\n    \"A\": \"The proforma is used to assess the performance of scientists and determine their suitability for a higher pay-scale.\"\n  },\n  {\n    \"Q\": \"How often is the assessment process conducted?\",\n    \"A\": \"The assessment process is conducted every five years.\"\n  },\n  {\n    \"Q\": \"What is the role of the Assessment Committee in the evaluation process?\",\n    \"A\": \"The Assessment Committee is responsible for evaluating the scientist's performance and recommending them for a higher pay-scale if their performance is deemed outstanding.\"\n  },\n  {\n    \"Q\": \"Can a scientist add or augment their record of work during the assessment process?\",\n    \"A\": \"Yes, the scientist is free to add or augment their record of work and may also bring to the notice of the Committee any bottlenecks that proved a constraint in their research output and functioning.\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"What is the purpose of the ICAR Agricultural Research Service form?\",\n  \"A1\": \"The purpose of the form is to assess the research, teaching, training, extension, and production activities of scientists in the ICAR Agricultural Research Service.\",\n  \n  \"Q2\": \"What are the different categories of activities that scientists are expected to report on?\",\n  \"A2\": \"The categories include research, teaching, training, extension activities, production activities, administration, research management and co-ordination, and others.\",\n  \n  \"Q3\": \"What information is required for each research project?\",\n  \"A3\": \"The information required includes the title of the project, research objectives, relevance and practical utility of the project, results and conclusions, scientist's own contribution, and time taken to complete the project.\",\n  \n  \"Q4\": \"What are the teaching responsibilities that scientists are expected to report on?\",\n  \"A4\": \"The teaching responsibilities include courses taught, guidance provided to students, new courses developed and taught, teaching innovations devised and adopted, and teaching materials prepared and used.\",\n  \n  \"Q5\": \"What information is required for training programs?\",\n  \"A5\": \"The information required includes the objectives of the training program, subject-wise details, target group, duration, and training materials prepared and used.\",\n  \n  \"Q6\": \"What are the extension activities that scientists are expected to report on?\",\n  \"A6\": \"The extension activities include details of extension and development activities carried out, research findings taken up for transfer, results of surveys conducted, and extent to which new methods are adopted.\",\n  \n  \"Q7\": \"What information is required for production activities?\",\n  \"A7\": \"The information required includes details of production of biological products, seed production, management responsibilities, targets set, and achievements in quantitative terms.\",\n  \n  \"Q8\": \"What are the responsibilities of scientists engaged in research co-ordination and management?\",\n  \"A8\": \"The responsibilities include planning new research programs, supervising the implementation of research projects, monitoring and evaluating progress, and compiling and documenting research results.\",\n  \n  \"Q9\": \"What is the purpose of the assessment by the ASRB?\",\n  \"A9\": \"The purpose of the assessment is to evaluate the performance of scientists in the ICAR Agricultural Research Service and to provide feedback for improvement.\",\n  \n  \"Q10\": \"How can scientists indicate their preference for assessment by the ASRB?\",\n  \"A10\": \"Scientists can indicate their preference for assessment by the ASRB through a personal discussion with the Assessment Committee or consideration in absentia.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What is the purpose of the proforma for supplementary information?\",\n  \"A1\": \"The purpose of the proforma is for scientists to furnish supplementary information for their subsequent assessment for grant of merit promotion.\",\n  \n  \"Q2\": \"Who fills out Part I of the proforma?\",\n  \"A2\": \"Part I is filled out initially in the Director's Headquarters Office.\",\n  \n  \"Q3\": \"What information is required in Part II of the proforma?\",\n  \"A3\": \"Part II requires information on post held, nature of duties, recommendations, awards, publications, and papers presented in conferences/symposia.\",\n  \n  \"Q4\": \"Who fills out Part III of the proforma?\",\n  \"A4\": \"Part III is filled out by the Reviewee, providing additional information on research work, guidance of student research, post-graduate teaching, training, extension, production activities, and research co-ordination and management.\",\n  \n  \"Q5\": \"Can the Reviewee request a personal discussion with the Assessment Committee?\",\n  \"A5\": \"Yes, the Reviewee can indicate 'Yes' or 'No' in Part III of the proforma if they wish to have a personal discussion with the Assessment Committee.\",\n  \n  \"Q6\": \"Who fills out Part IV of the proforma?\",\n  \"A6\": \"Part IV is filled out by the Reviewer, who is the Head of the Division or other Officer concerned, to verify the correctness of the supplementary material and provide a critical appraisal.\",\n  \n  \"Q7\": \"What is the role of the Director/D.G./D.G. in the assessment process?\",\n  \"A7\": \"The Director/D.G./D.G. provides an overall assessment of the scientist, taking into account the self-assessment and analysis of achievements by the Head of the Division.\",\n  \n  \"Q8\": \"What is the significance of the signature of the Reviewee and Reviewer in the proforma?\",\n  \"A8\": \"The signatures of the Reviewee and Reviewer confirm the accuracy and authenticity of the information provided in the proforma.\",\n  \n  \"Q9\": \"How often is the supplementary information required to be furnished by scientists?\",\n  \"A9\": \"The supplementary information is required to be furnished by scientists for their subsequent assessment for grant of merit promotion, but the frequency is not specified in the text.\",\n  \n  \"Q10\": \"What is the purpose of the ICAR Agricultural Research Service proforma?\",\n  \"A10\": \"The purpose of the ICAR Agricultural Research Service proforma is to assess the performance and contributions of scientists for merit promotion.\"\n}\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the purpose of maintaining a personal file by scientists in the Agricultural Research Service?\",\n    \"A\": \"The personal file is used to record details of scientific work assigned, targets set, and responsibilities of the scientist, as well as their performance evaluation.\"\n  },\n  {\n    \"Q\": \"What are the different parts of the personal file that a scientist is required to maintain?\",\n    \"A\": \"The personal file consists of three parts: Part I (details of scientific work and targets), Part II (scientific responsibilities), and Part III (not specified in the text).\"\n  },\n  {\n    \"Q\": \"What information should be included in Part II of the personal file regarding research work?\",\n    \"A\": \"Part II should include the name of the projects, the scientist's specific contribution to each project, percentage of time devoted to each project, and details of research work assigned to the scientist.\"\n  },\n  {\n    \"Q\": \"Are projects assigned to students included in the personal file?\",\n    \"A\": \"No, only projects where a scientist is doing research themselves, assisted by technical staff only, and not by other scientists or students, are included in the personal file.\"\n  },\n  {\n    \"Q\": \"What teaching functions should be reflected in the personal file?\",\n    \"A\": \"The personal file should include details of courses taught, number of students in each course, number of PG students guided/taught, innovations made in teaching methods, time spent on teaching, and its percentage of the total time of the scientist.\"\n  },\n  {\n    \"Q\": \"How is the performance of a scientist evaluated at the end of the year?\",\n    \"A\": \"The performance of a scientist is evaluated by the Head of Division and Director, or any other scientist designated by them, with reference to the set targets, and their comments are recorded in the personal file.\"\n  },\n  {\n    \"Q\": \"What is the purpose of maintaining a Research Project File by scientists?\",\n    \"A\": \"The Research Project File is used to record details of the project, including the name of the Principal Investigator and Associate, tasks and responsibilities assigned to each scientist, and percentage of time devoted to the project.\"\n  },\n  {\n    \"Q\": \"Who is responsible for evaluating the performance of scientists at the ICAR headquarters?\",\n    \"A\": \"The performance of scientists at the ICAR headquarters is evaluated by the concerned ADG/DDG or any other scientist nominated by the DDG.\"\n  },\n  {\n    \"Q\": \"What is the role of the Head of Division and Director in the evaluation of a scientist's performance?\",\n    \"A\": \"The Head of Division and Director evaluate the performance of a scientist with reference to the set targets and provide their comments, which are recorded in the personal file.\"\n  },\n  {\n    \"Q\": \"What is the significance of including a copy of the personal file with the Annual Assessment Report?\",\n    \"A\": \"The copy of the personal file is included with the Annual Assessment Report to provide a comprehensive evaluation of the scientist's performance and to facilitate the assessment process.\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"What information should be included in the project proforma at the beginning of the year?\",\n  \"A1\": \"The project proforma should include the time devoted, targets, and remarks of the Project Leader, Head of Division, and Director.\",\n  \n  \"Q2\": \"How many projects can a scientist have as Project Leader or Associate?\",\n  \"A2\": \"A scientist should not have more than three projects as Project Leader or Associate.\",\n  \n  \"Q3\": \"What should be clearly indicated in the five-yearly assessment proforma and research project files?\",\n  \"A3\": \"The actual place of work and various difficulties/bottlenecks faced by the scientist should be clearly indicated.\",\n  \n  \"Q4\": \"What is the purpose of the evaluation by the Head of Division and Director in the Annual Assessment Report?\",\n  \"A4\": \"The evaluation should clearly bring out the research projects and other work assigned to the scientist and their quality performance in regard to the achievement of set targets.\",\n  \n  \"Q5\": \"What is the Peer Review System for assessment of ARS scientists?\",\n  \"A5\": \"The Peer Review System provides for the constitution of an Assessment Committee for each professional subject/discipline, consisting of eminent scientists belonging to that particular discipline.\",\n  \n  \"Q6\": \"Can exceptions be made in the constitution of the Assessment Committee for scientists at NAARM, Hyderabad and ICAR Hqs?\",\n  \"A6\": \"Yes, exceptions can be made by associating scientists connected with behavioral scientists, research coordination/monitoring, training programs, etc. rather than specialists belonging to the disciplines of ARS.\",\n  \n  \"Q7\": \"What is the importance of maintaining Research Project Files by scientists?\",\n  \"A7\": \"The Research Project Files are an integral part of the scientist's output for the purpose of their five-yearly assessment.\",\n  \n  \"Q8\": \"How should scientists at ICAR Hqs and NAARM Hyderabad keep records of their work?\",\n  \"A8\": \"They should keep proper records of the work/project work done by them for presentation before the Assessment Committee.\",\n  \n  \"Q9\": \"What is the purpose of the five-yearly assessment proforma?\",\n  \"A9\": \"The purpose is to evaluate the scientist's performance and provide recommendations for assessment benefits.\",\n  \n  \"Q10\": \"What should the recommendations in the five-yearly assessment proforma include?\",\n  \"A10\": \"The recommendations should be specific with adequate justifications for the grant of assessment benefits.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What is the purpose of maintaining a record of work done by scientists at the Headquarters?\",\n  \"A1\": \"The record of work done by scientists is to be put up before the Assessment Committee at the time of assessment/re-assessment.\",\n  \n  \"Q2\": \"Who is responsible for designing a suitable proforma for recording work done by scientists?\",\n  \"A2\": \"The NAARM is responsible for designing a suitable proforma for recording work done by scientists.\",\n  \n  \"Q3\": \"What is the significance of assigning weightage to major items being considered for assessment?\",\n  \"A3\": \"Proper weightage is assigned to each major item to ensure a fair assessment, with details provided in Annexure III.\",\n  \n  \"Q4\": \"What information is required to be filled in Part I of the Five-Yearly Assessment Form?\",\n  \"A4\": \"Part I requires information such as reported period, name, father's name, date of birth, field of specialization, and date of induction into ARS and grade.\",\n  \n  \"Q5\": \"What is the purpose of Part II of the Five-Yearly Assessment Form?\",\n  \"A5\": \"Part II is to be filled in by the reviewee and requires information about their educational career, additional qualifications, career information, and membership of societies.\",\n  \n  \"Q6\": \"What type of information is required under the 'Career Information' section of the assessment form?\",\n  \"A6\": \"The 'Career Information' section requires a list of all posts held by the scientist, in reverse order, including designation, basic pay, date of joining, and nature of duties performed.\",\n  \n  \"Q7\": \"What is the significance of mentioning 'Duration of service in difficult areas' in the assessment form?\",\n  \"A7\": \"Mentioning 'Duration of service in difficult areas' is required to indicate any period of service in neglected, backward, or difficult areas.\",\n  \n  \"Q8\": \"What type of publications are required to be listed in the assessment form?\",\n  \"A8\": \"The assessment form requires a list of publications, including research journals, technical journals, popular articles, reports, and reviews.\",\n  \n  \"Q9\": \"What is the purpose of the 'Awards/Recognition received' section in the assessment form?\",\n  \"A9\": \"The 'Awards/Recognition received' section is to recognize any awards or recognition received by the scientist.\",\n  \n  \"Q10\": \"Who is responsible for filling in the initial information in the Five-Yearly Assessment Form?\",\n  \"A10\": \"The Director IDG's Office is responsible for filling in the initial information in the Five-Yearly Assessment Form.\"\n}\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the purpose of the ICAR Agricultural Research Service form?\",\n    \"A\": \"The purpose of the form is to assess the performance of scientists and researchers in various activities such as research, teaching, training, extension, and production.\"\n  },\n  {\n    \"Q\": \"What are the different activities that scientists are expected to allocate their time to?\",\n    \"A\": \"The activities include research, teaching, training, extension activities, production activities, administration, research management and coordination, and others.\"\n  },\n  {\n    \"Q\": \"What information is required for the projects undertaken during the period of review?\",\n    \"A\": \"The information required includes the title of the project, research objectives, relevance and practical utility of the project, results and conclusions, and the scientist's own contribution to the research project.\"\n  },\n  {\n    \"Q\": \"What are the different types of publications that scientists are expected to list?\",\n    \"A\": \"The publications include reports and papers made based on research projects, publications involving research/review, conceptual papers, and manuscripts related to project files.\"\n  },\n  {\n    \"Q\": \"What information is required for teaching activities?\",\n    \"A\": \"The information required includes the courses taught, guidance provided to students, new courses developed and taught, teaching innovations devised and adopted, and teaching materials prepared and used.\"\n  },\n  {\n    \"Q\": \"What are the details required for training programs?\",\n    \"A\": \"The details required include the objectives of the training program, target group, duration, and training material prepared and used.\"\n  },\n  {\n    \"Q\": \"What information is required for extension activities?\",\n    \"A\": \"The information required includes the details of extension and development activities carried out, research findings taken up for transfer, and results of surveys conducted with regard to problems in respect of transfer of technology.\"\n  },\n  {\n    \"Q\": \"What are the details required for production activities?\",\n    \"A\": \"The details required include the production of biological products, seed production, management responsibilities shouldered, targets set, and achievements in quantitative terms.\"\n  },\n  {\n    \"Q\": \"What is the purpose of the research coordination and management section?\",\n    \"A\": \"The purpose of this section is to assess the contribution made by scientists in planning new research programs, modifying/improving ongoing programs, supervising the implementation of research projects, and monitoring and evaluating the progress of projects.\"\n  },\n  {\n    \"Q\": \"Who is required to fill out the research coordination and management section?\",\n    \"A\": \"Only scientists engaged wholly on research coordination and management work are required to fill out this section.\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"What is the purpose of the proforma for supplementary information?\",\n  \"A1\": \"The proforma is used for the subsequent assessment of scientists for grant of merit promotion.\",\n  \n  \"Q2\": \"What information is required in Part I of the proforma?\",\n  \"A2\": \"Part I requires information such as the period for which supplementary information is given, name, field of specialisation, date of induction into ARS, present pay, and duties assigned.\",\n  \n  \"Q3\": \"What type of information is required in Part II of the proforma?\",\n  \"A3\": \"Part II requires information about the post held, nature of duties, recommendations, awards, publications, and details regarding projects and publications.\",\n  \n  \"Q4\": \"What are the different types of publications that need to be listed in Part II?\",\n  \"A4\": \"The different types of publications that need to be listed include research journals, technical journals, popular articles, reports, reviews, technical bulletins, and books.\",\n  \n  \"Q5\": \"What information is required in Part III of the proforma?\",\n  \"A5\": \"Part III requires information about research work, guidance of student research, post-graduate teaching, training, extension, production activities, and research co-ordination and management.\",\n  \n  \"Q6\": \"Who is responsible for filling in Part IV of the proforma?\",\n  \"A6\": \"Part IV is to be filled in by the Head of the Division or other officer concerned, in consultation with the Project Leader.\",\n  \n  \"Q7\": \"What is the purpose of Part IV of the proforma?\",\n  \"A7\": \"Part IV is for the critical evaluation by the Head of the Division/A.D.G. with reference to the candidate's contribution in the field of research, teaching, training, extension, etc.\",\n  \n  \"Q8\": \"Who is responsible for filling in Part V of the proforma?\",\n  \"A8\": \"Part V is to be filled in by the Director/D.D.G./D.G.\",\n  \n  \"Q9\": \"What is the purpose of Part V of the proforma?\",\n  \"A9\": \"Part V is for the overall assessment of the scientist by the Director/D.D.G./D.G., taking into account the self-assessment by the candidate and the analysis of their achievements by the Head of the Division.\",\n  \n  \"Q10\": \"What is the significance of the signature and date in the proforma?\",\n  \"A10\": \"The signature and date are required to authenticate the information provided in the proforma and to confirm that the information is accurate and up-to-date.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What is the purpose of the supplementary material furnished by the reviewee?\",\n  \"A1\": \"The purpose of the supplementary material is for the reviewee to provide additional information to support their self-assessment.\",\n  \n  \"Q2\": \"Who is responsible for critically appraising the assessment and projections made by the reviewee?\",\n  \"A2\": \"The Reviewer, in consultation with the Project Leader, is responsible for critically appraising the assessment and projections made by the reviewee.\",\n  \n  \"Q3\": \"What is the weightage assigned to annual assessment reports in the assessment process?\",\n  \"A3\": \"20 per cent marks are assigned to annual assessment reports.\",\n  \n  \"Q4\": \"What factors are considered when evaluating and awarding marks to scientists?\",\n  \"A4\": \"Factors such as constraints faced by scientists, including remote postings, meagre facilities, and frequent transfers, are considered when evaluating and awarding marks.\",\n  \n  \"Q5\": \"How are publications considered in the assessment process?\",\n  \"A5\": \"Due weightage is given to publications that relate to the period of assessment or re-assessment, and only those that are relevant to the scientist's job requirement are considered.\",\n  \n  \"Q6\": \"What is the purpose of the Director's recommendations in the assessment process?\",\n  \"A6\": \"The Director's recommendations provide an evaluation of the scientist's performance and are considered in the assessment process.\",\n  \n  \"Q7\": \"How are scientists who are directly recruited to grade S-1 of ARS evaluated?\",\n  \"A7\": \"Scientists who are directly recruited to grade S-1 of ARS are evaluated based on their research output, taking into account the time they need for training and adaptation to the system.\",\n  \n  \"Q8\": \"What is the weightage assigned to job accomplishment in the assessment process?\",\n  \"A8\": \"65 per cent marks are assigned to job accomplishment, including research papers, reports, and brochures issued during the period of assessment.\",\n  \n  \"Q9\": \"How are scientists who are posted in remote or difficult areas evaluated?\",\n  \"A9\": \"Scientists who are posted in remote or difficult areas are given due consideration for the constraints they face, and relatively more credit is given for their achievements.\",\n  \n  \"Q10\": \"What is the purpose of the assessment benefit regulation?\",\n  \"A10\": \"The purpose of the assessment benefit regulation is to provide a fair and transparent evaluation of scientists' performance, taking into account various factors and constraints.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"How are scientists appointed in the ICAR Agricultural Research Service?\",\n  \"A1\": \"Scientists are appointed by induction/promotion, with suitable credit given to direct recruits based on evaluation of their work.\",\n  \n  \"Q2\": \"Who evaluates the performance of scientists in the ICAR Agricultural Research Service?\",\n  \"A2\": \"The performance of scientists is evaluated by the Members of the Assessment Committee.\",\n  \n  \"Q3\": \"What is the basis for granting assessment benefits to scientists?\",\n  \"A3\": \"The grant of assessment benefit to scientists is regulated based on their score, which is the average of marks awarded by all Members of the Assessment Committee.\",\n  \n  \"Q4\": \"What are the different scientist grades and their corresponding pay scales?\",\n  \"A4\": \"The scientist grades and pay scales are: Scientist grade 'S' (Rs.550-900), Scientist grade S-J (Rs. 700-1300), Scientist grade S-2 (Rs. 1100-1600), and Scientist S-3 (Rs. 1500-2000).\",\n  \n  \"Q5\": \"What are the criteria for promotion and advance increments for scientists?\",\n  \"A5\": \"The criteria for promotion and advance increments vary by scientist grade and are based on the score, with specific marks required for promotion, three advance increments, two advance increments, one advance increment, or neither promotion nor advance increments.\",\n  \n  \"Q6\": \"How can a scientist review and appeal their assessment result?\",\n  \"A6\": \"A scientist who is not satisfied with their assessment result can submit a note of not more than 500 words in support of their claim for promotion retrospectively from the due date, along with recommendations from the Director, DDG/DG, ICAR.\",\n  \n  \"Q7\": \"What is the role of the Agricultural Scientists' Recruitment Board in reviewing assessment results?\",\n  \"A7\": \"The Agricultural Scientists' Recruitment Board considers whether there is any strength in the representation to justify grant of promotion retrospectively from the due date.\",\n  \n  \"Q8\": \"What is the maximum number of words allowed for a scientist's note in support of their claim for promotion?\",\n  \"A8\": \"The note should not exceed 500 words.\",\n  \n  \"Q9\": \"How many copies of the note and recommendations should be submitted to the Agricultural Scientists' Recruitment Board?\",\n  \"A9\": \"Six copies of the note along with the recommendations of the Director, DDG/DG, ICAR, should be submitted to the Agricultural Scientists' Recruitment Board.\",\n  \n  \"Q10\": \"What is the minimum score required for promotion for scientists holding a pay scale of Rs. 1800-2500 and above?\",\n  \"A10\": \"Scientists holding a pay scale of Rs. 1800-2500 and above require a minimum score of 81 marks out of 100 for promotion.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What is the position of India in global fish production?\",\n  \"A1\": \"India has achieved the second highest position in global fish production.\",\n  \n  \"Q2\": \"What is the percentage of fish food basket shared by India?\",\n  \"A2\": \"India shares over 6% of the total fish food basket.\",\n  \n  \"Q3\": \"What was the total fish production in India during 2016-17?\",\n  \"A3\": \"The total fish production in India during 2016-17 was 11.41 million tonnes.\",\n  \n  \"Q4\": \"How has the fish production in India increased since independence?\",\n  \"A4\": \"The fish production in India has increased 15-folds since independence.\",\n  \n  \"Q5\": \"What is the current share of aquaculture production in total fish produce?\",\n  \"A5\": \"Aquaculture production currently shares about 60% of the total fish produce.\",\n  \n  \"Q6\": \"What are the main species of fish farmed in India?\",\n  \"A6\": \"The main species of fish farmed in India are three Indian major carps, followed by three exotic carp species and pangasan exotic large catfish in freshwater and shrimps in brackishwater.\",\n  \n  \"Q7\": \"What percentage of aquaculture share is contributed by the main species of fish farmed in India?\",\n  \"A7\": \"The main species of fish farmed in India contribute over 95% of aquaculture share.\",\n  \n  \"Q8\": \"Why is there a need to diversify fish species in aquaculture?\",\n  \"A8\": \"There is a need to diversify fish species in aquaculture to make the farming practice more remunerative and to meet the increasing demand for alternative species.\",\n  \n  \"Q9\": \"What is the expected growth of aquaculture production in India in coming years?\",\n  \"A9\": \"The aquaculture production in India is expected to grow at a similar pace in coming years with large-scale utilization of coastal waters for mariculture and inland saline areas for brackishwater shrimp farming.\",\n  \n  \"Q10\": \"Who is the publisher of the ICAR Technologies: Breeding and Seed Production of Finfishes and Shellfishes?\",\n  \"A10\": \"The publisher of the ICAR Technologies: Breeding and Seed Production of Finfishes and Shellfishes is Dr S.K. Singh, Project Director (DKMA), on behalf of Indian Council of Agricultural Research.\"\n}\n```",
    "```json\n[\n  {\n    \"Q\": \"What is happening to the population of high-valued food fishes from open waters?\",\n    \"A\": \"The population of high-valued food fishes from open waters has been declining severely.\"\n  },\n  {\n    \"Q\": \"Why is the price of carps relatively constant?\",\n    \"A\": \"The price of carps is relatively constant due to their greater availability.\"\n  },\n  {\n    \"Q\": \"What is the current state of carp and pangus farming?\",\n    \"A\": \"Carp and pangus farming have become non-attractive for many farmers due to increasing production costs.\"\n  },\n  {\n    \"Q\": \"What is the proposed solution to the current state of aquaculture?\",\n    \"A\": \"The proposed solution is to focus on new fish and shellfish species that can provide higher income to farmers and greater choice for consumers.\"\n  },\n  {\n    \"Q\": \"What is the significance of the book 'ICAR Technologies for Breeding and Seed Production of Finfishes and Shellfishes'?\",\n    \"A\": \"The book provides technology resumes of over 60 finfish and shellfish species to help farmers and entrepreneurs identify and adopt new species for aquaculture practices.\"\n  },\n  {\n    \"Q\": \"What is the 'Blue Revolution' in India?\",\n    \"A\": \"The 'Blue Revolution' is a call by the Hon'ble Prime Minister of India to boost the aquaculture sector in the country.\"\n  },\n  {\n    \"Q\": \"What is the significance of the development of induced breeding of Indian major carps in 1957?\",\n    \"A\": \"The development of induced breeding of Indian major carps in 1957 led to a complete shift from riverine seed collection and steered the commercial carp polyculture of India, contributing to the 'Blue Revolution'.\"\n  },\n  {\n    \"Q\": \"What is the current state of brackishwater aquaculture in India?\",\n    \"A\": \"Brackishwater aquaculture in India has taken a leap with shrimp as the primary commodity, with mass production of tiger shrimp seed in hatcheries enabling industrial-scale shrimp farming in coastal states.\"\n  },\n  {\n    \"Q\": \"What is the role of eco-hatcheries in aquaculture?\",\n    \"A\": \"Eco-hatcheries have enabled mass-scale seed production, allowing the country to meet almost 100% of the demand for carp seed and producing excess seed in several states.\"\n  },\n  {\n    \"Q\": \"What is the goal of the government's initiatives in aquaculture?\",\n    \"A\": \"The goal is to double farmers' income by 2022, as part of the 'Blue Revolution' and other initiatives to boost the aquaculture sector in India.\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"What has been the annual growth rate of aquaculture in India over the last three decades?\",\n  \"A1\": \"Over 6% annual growth rate\",\n  \"Q2\": \"What percentage of fish production in India is contributed by carp?\",\n  \"A2\": \"Over 80%\",\n  \"Q3\": \"How many fish species are involved in commercial aqua-farming in top producing countries?\",\n  \"A3\": \"More than 60 fish species\",\n  \"Q4\": \"Why is species diversification necessary in aquaculture?\",\n  \"A4\": \"To meet regional preference, increase profitability, tackle disease threats, facilitate conservation, and meet emerging demand\",\n  \"Q5\": \"How many species of freshwater, brackishwater, and marine ecosystems have been developed by ICAR research institutes?\",\n  \"A5\": \"More than 60 species\",\n  \"Q6\": \"What is the purpose of the book 'ICAR Technologies for Breeding and Seed Production of Finfishes and Shellfishes'?\",\n  \"A6\": \"To popularize species diversification in fish farming and increase income of fish farmers\",\n  \"Q7\": \"What is the goal mentioned by the Hon'ble Prime Minister that the book aims to support?\",\n  \"A7\": \"Doubling Farmers' Income by 2022\",\n  \"Q8\": \"What is the source of the technology briefs compiled in the book?\",\n  \"A8\": \"Research papers and scientific reports published in ICAR Fisheries Research Institutes\",\n  \"Q9\": \"What is the role of the contributors mentioned in the book?\",\n  \"A9\": \"They have been involved in demonstrating the technology, not necessarily inventing it\",\n  \"Q10\": \"Who suggested the compilation of the technology briefs in the book?\",\n  \"A10\": \"Dr. Trilochan Mohapatra, Secretary, DARE and Director General, ICAR\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What is the scientific name of Catla?\",\n  \"A1\": \"Catla catla\",\n  \"Q2\": \"What is the common name of Labeo rohita?\",\n  \"A2\": \"Rohu\",\n  \"Q3\": \"How many species of freshwater finfishes are listed?\",\n  \"A3\": \"35\",\n  \"Q4\": \"What is the scientific name of the Indian Snow Trout?\",\n  \"A4\": \"Schizothorax richardsonii\",\n  \"Q5\": \"What is the common name of Clarias dussumeiri?\",\n  \"A5\": \"Valencienees Clariid\",\n  \"Q6\": \"What is the scientific name of the Giant Murrel?\",\n  \"A6\": \"Channa marulius\",\n  \"Q7\": \"How many species of brackishwater finfishes are listed?\",\n  \"A7\": \"5\",\n  \"Q8\": \"What is the common name of Lates calcarifer?\",\n  \"A8\": \"Asian Seabass\",\n  \"Q9\": \"What is the scientific name of the Rainbow Trout?\",\n  \"A9\": \"Oncorhynchus mykiss\",\n  \"Q10\": \"What is the common name of Macrobrachium rosenbergii?\",\n  \"A10\": \"Giant Freshwater Prawn\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What is the growth rate of Catla fish?\",\n  \"A1\": \"Catla grows to 1.0-1.5 kg/yr, making it the fastest growing Indian major carp.\",\n  \n  \"Q2\": \"Where does Catla breeding occur?\",\n  \"A2\": \"Catla breeds only in flowing rivers and streams during monsoon (May to September).\",\n  \n  \"Q3\": \"How are Catla brooders induced for breeding?\",\n  \"A3\": \"Brooders are induced by injecting either pituitary extract or commercial hormones, such as Ovaprim, Ovatide, or Gonopro FH.\",\n  \n  \"Q4\": \"What is the ratio of female to male in induced breeding of Catla?\",\n  \"A4\": \"The ratio of female to male is maintained at 1:1 in circular echo-hatchery.\",\n  \n  \"Q5\": \"How many eggs are obtained per kilogram of female Catla?\",\n  \"A5\": \"1.0-1.5 lakh eggs/kg female are obtained, with fertilization levels remaining over 90%.\",\n  \n  \"Q6\": \"What is the water temperature required for hatching of Catla eggs?\",\n  \"A6\": \"Hatching occurs within 18-22 h at 27-28C with 80-95% success.\",\n  \n  \"Q7\": \"How are Rohu fish different from Catla fish?\",\n  \"A7\": \"Rohu is the most important Indian major carp of the Indian Sub-continent, attaining maturity in the second year of its life and breeding only in riverine conditions during monsoon.\",\n  \n  \"Q8\": \"What is the sex ratio maintained in hapa breeding of Rohu?\",\n  \"A8\": \"A sex ratio of 1:2 female to male is maintained in hapa breeding of Rohu.\",\n  \n  \"Q9\": \"How are Rohu brooders injected for breeding?\",\n  \"A9\": \"Brooders are injected with either pituitary extract or commercial hormones to induce breeding.\",\n  \n  \"Q10\": \"What is the average fry size of Catla spawn after rearing in nursery ponds?\",\n  \"A10\": \"The spawn grow to an average fry size of 25 mm after 15-20 days of rearing in nursery ponds.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What is the dosage of hormonal formulations for induced breeding in female and male fish?\",\n  \"A1\": \"0.4-0.5 ml/kg for females and 0.2-0.3 ml/kg for males\",\n  \n  \"Q2\": \"How long does spawning occur after hormonal injection?\",\n  \"A2\": \"6-8 hours\",\n  \n  \"Q3\": \"What is the average number of eggs laid by a 1 kg female fish?\",\n  \"A3\": \"2.0 lakh eggs\",\n  \n  \"Q4\": \"What is the rate of fertilization of eggs?\",\n  \"A4\": \"80-95%\",\n  \n  \"Q5\": \"How long does it take for eggs to hatch in a hatching tank at 27-28C?\",\n  \"A5\": \"8-22 hours\",\n  \n  \"Q6\": \"What is the size of the spawn after 3 days, ready for further rearing in nursery?\",\n  \"A6\": \"5-6 mm\",\n  \n  \"Q7\": \"What is the stocking density of spawn in earthen nursery ponds and concrete nurseries?\",\n  \"A7\": \"5-10 million/ha in earthen nursery ponds and 10-20 million/ha in concrete nurseries\",\n  \n  \"Q8\": \"What is the growth rate of Kalbasu Labeo calbasu, an important carp species?\",\n  \"A8\": \"Moderate growth rate\",\n  \n  \"Q9\": \"How long does it take for the yolk-sacs of hatchlings to be absorbed, making them ready for feeding?\",\n  \"A9\": \"72 hours\",\n  \n  \"Q10\": \"What is the average size of fry after 15-20 days of rearing in nursery, ready for further growth?\",\n  \"A10\": \"20 mm\"\n}\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the maturity period of Fringed-Lipped Carp in pond conditions?\",\n    \"A\": \"Two years\"\n  },\n  {\n    \"Q\": \"Where is Fringed-Lipped Carp mainly found in India?\",\n    \"A\": \"Peninsular India\"\n  },\n  {\n    \"Q\": \"Can Fringed-Lipped Carp breed in captivity?\",\n    \"A\": \"No, it breeds in flowing waters\"\n  },\n  {\n    \"Q\": \"How are males and females of Fringed-Lipped Carp distinguishable at maturity?\",\n    \"A\": \"Females have smooth pectoral fins and bulged abdomen, while males have slender body and rough pectoral fins\"\n  },\n  {\n    \"Q\": \"What is the ratio of female to male brooders used for captive breeding of Fringed-Lipped Carp?\",\n    \"A\": \"1:2\"\n  },\n  {\n    \"Q\": \"What is the dosage of commercial hormone used for inducing breeding in female and male Fringed-Lipped Carp?\",\n    \"A\": \"0.30 ml/kg for females and 0.15 ml/kg for males\"\n  },\n  {\n    \"Q\": \"How long does it take for spawning to occur after hormone injection in Fringed-Lipped Carp?\",\n    \"A\": \"6-8 hours\"\n  },\n  {\n    \"Q\": \"How long does it take for the eggs of Fringed-Lipped Carp to hatch?\",\n    \"A\": \"14-16 hours\"\n  },\n  {\n    \"Q\": \"What is the purpose of water circulation in the hatching pool for Fringed-Lipped Carp eggs?\",\n    \"A\": \"To keep the eggs in buoyant condition\"\n  },\n  {\n    \"Q\": \"What is the average survival rate of Fringed-Lipped Carp spawn?\",\n    \"A\": \"Not specified in the text, but for another carp species, it is 70-80%\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the spawn yield of Pangusia Labeo?\",\n    \"A\": \"The spawn yield of Pangusia Labeo usually varies from 0.85-1.00 lakh/kg female.\"\n  },\n  {\n    \"Q\": \"At what density is spawn reared for raising fry in concrete nursery systems?\",\n    \"A\": \"Spawn is reared at a stocking density of 10-15 million/ha for raising fry in concrete nursery systems.\"\n  },\n  {\n    \"Q\": \"Where is the breeding and seed production of Pangusia Labeo mainly practiced?\",\n    \"A\": \"The breeding and seed production of Pangusia Labeo is mainly practiced in Karnataka, Odisha, and Andhra Pradesh.\"\n  },\n  {\n    \"Q\": \"How can sexes be distinguished in Pangusia Labeo at maturity?\",\n    \"A\": \"Females have a bulging abdomen, soft and smooth pectoral fins, and a round prominent vent, while males are slender with large and rough pectoral fins and ooze white milt on pressing the belly.\"\n  },\n  {\n    \"Q\": \"When does Pangusia Labeo breed in flowing waters?\",\n    \"A\": \"Pangusia Labeo breeds in flowing waters during the monsoon season, from May to August.\"\n  },\n  {\n    \"Q\": \"What is the size of brooders selected for induced breeding in Pangusia Labeo?\",\n    \"A\": \"Brooders of size 35-50 cm are selected for induced breeding in Pangusia Labeo.\"\n  },\n  {\n    \"Q\": \"What hormone injection is given to brooders for induced breeding in Pangusia Labeo?\",\n    \"A\": \"Brooders are given a hormone injection of Ovatide/Gonopro FH @ 1.0 ml/kg body weight to female and 0.5 ml/kg to male.\"\n  },\n  {\n    \"Q\": \"How long does it take for eggs to hatch in Pangusia Labeo?\",\n    \"A\": \"The eggs of Pangusia Labeo hatch in about 14-16 hours.\"\n  },\n  {\n    \"Q\": \"What is the conservation status of Malabar Labeo?\",\n    \"A\": \"Malabar Labeo is categorized as an endangered fish species.\"\n  },\n  {\n    \"Q\": \"How are mature males and females distinguished in Malabar Labeo?\",\n    \"A\": \"Mature females have a bulged abdomen and eggs ooze out from the vent on pressing the abdomen, while mature males have a rough surface of pectoral fins and ooze milky-milt on pressing the belly.\"\n  }\n]\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```\n[\n  {\n    \"Q\": \"What is the dosage of hormone used for inducing spawning in females?\",\n    \"A\": \"0.3 ml/kg\"\n  },\n  {\n    \"Q\": \"How long does it take for fertilized eggs to hatch?\",\n    \"A\": \"10-12 hours\"\n  },\n  {\n    \"Q\": \"What is the diameter of fertilized eggs?\",\n    \"A\": \"4.0 to 4.5 mm\"\n  },\n  {\n    \"Q\": \"Where is seed production of Bata Labeo bata mainly practiced?\",\n    \"A\": \"In the state of Kerala\"\n  },\n  {\n    \"Q\": \"What is the suitable environment for Bata Labeo bata?\",\n    \"A\": \"Eastern and north-eastern parts of the country\"\n  },\n  {\n    \"Q\": \"How are brooders of Bata Labeo bata raised?\",\n    \"A\": \"In ponds along with other carps\"\n  },\n  {\n    \"Q\": \"What is the dosage of Ovaprim/Ovatide/Gonopore FH used for inducing spawning in males?\",\n    \"A\": \"0.2 ml/kg\"\n  },\n  {\n    \"Q\": \"How long does it take for eggs of Bata Labeo bata to hatch?\",\n    \"A\": \"20-22 hours\"\n  },\n  {\n    \"Q\": \"What is the distribution of Kali Rohu Labeo dyocheilus?\",\n    \"A\": \"Colder regions of Indian sub-continent and parts of south-east Asia\"\n  },\n  {\n    \"Q\": \"At what age are fully mature brooders of Kali Rohu Labeo dyocheilus used for captive breeding?\",\n    \"A\": \"3+ years\"\n  }\n]\n```"
]