[
    "```json\n[\n  {\n    \"Q\": \"Why should remote sensing data on tuna fishing grounds be popularized?\",\n    \"A\": \"To minimize searching time and fuel in tuna fishing.\"\n  },\n  {\n    \"Q\": \"What diseases in aquaculture require attention besides catastrophic diseases?\",\n    \"A\": \"Slow growth syndrome, fecal disease, and Enterocytozoon Hepatopenaei (EHP).\"\n  },\n  {\n    \"Q\": \"What systems are needed to ensure the quality and safety of seafood for consumption?\",\n    \"A\": \"Dedicated systems must be put in place to ensure the quality and safety of seafood.\"\n  },\n  {\n    \"Q\": \"What is Ecosystem Based Fisheries Resource Management (EBFRM) focused on?\",\n    \"A\": \"It focuses on co-management and knowledge management for sustainable marine capture fisheries governance.\"\n  },\n  {\n    \"Q\": \"Why should Environmental Impact Assessment (EIA) be made mandatory for inland cage culture operations?\",\n    \"A\": \"To avoid degradation of inland (lacustrine) ecosystems.\"\n  },\n  {\n    \"Q\": \"What certification is recommended for marine fishery resources to ensure sustainability?\",\n    \"A\": \"Certification under the Marine Steward Council program.\"\n  },\n  {\n    \"Q\": \"What policy is suggested to support traditional fishers and enhance coastal tourism?\",\n    \"A\": \"A policy on decommissioned fishing vessels.\"\n  },\n  {\n    \"Q\": \"What integrated systems are recommended to reduce greenhouse gas (GHG) emissions in aquaculture?\",\n    \"A\": \"Aquaponics and Integrated Multi-Trophic Aquaculture (IMTA).\"\n  },\n  {\n    \"Q\": \"What must be made mandatory for hatcheries through policies and guidelines?\",\n    \"A\": \"Hatchery accreditation and seas certification.\"\n  },\n  {\n    \"Q\": \"What should agricultural technological options be based on for effective transfer?\",\n    \"A\": \"They should be resource-based and region-specific according to different agro-ecological areas.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What was the title of the National Symposium held at Rajasthan College of Agriculture in 2016?\",\n    \"A\": \"The title was 'The Role of Vrikshayurveda in Organic Agriculture'.\"\n  },\n  {\n    \"Q\": \"How much grant was provided by ICAR for the National Symposium on Vrikshayurveda?\",\n    \"A\": \"ICAR provided a grant of Rs. 2.00 Lakh.\"\n  },\n  {\n    \"Q\": \"What recommendation was made regarding Vrikshayurveda in the National Symposium?\",\n    \"A\": \"The recommendation was to validate ancient knowledge of Vrikshayurveda with modern science-based technologies for strengthening Sustainable Agriculture Practices (SAP).\"\n  },\n  {\n    \"Q\": \"What was the focus of the National Extension Education Congress-2017 held at ICAR-NAARM, Hyderabad?\",\n    \"A\": \"The focus was on 'Nutrition Sensitive Agriculture: Changing Role of Extension'.\"\n  },\n  {\n    \"Q\": \"What ICT-based recommendation was made during the National Extension Education Congress-2017?\",\n    \"A\": \"It was recommended to develop an ICT-based market-led supply-chain extension system to connect production practices to consumer sales.\"\n  },\n  {\n    \"Q\": \"What was the title of the seminar organized by Gramin Vikash Kendra in Nalanda, Bihar?\",\n    \"A\": \"The title was 'Promotion and Popularization of Agriculture Bio Technological Intervention for Socio-Economic Development of Rural Areas'.\"\n  },\n  {\n    \"Q\": \"How much grant was provided by ICAR for the seminar organized by Gramin Vikash Kendra?\",\n    \"A\": \"ICAR provided a grant of Rs. 1.50 Lakhs.\"\n  },\n  {\n    \"Q\": \"What recommendation was made regarding biotechnological interventions in agriculture?\",\n    \"A\": \"The recommendation was to popularize the benefits of biotechnological interventions in enhancing agricultural productivity and quality among farmers and stakeholders.\"\n  },\n  {\n    \"Q\": \"What was the title of the National Conference held at C.S. Azad University of Agriculture and Technology, Kanpur in 2017?\",\n    \"A\": \"The title was 'Farmer’s Centric Agri-Innovation for Sustainable Development'.\"\n  },\n  {\n    \"Q\": \"What recommendation was made regarding students in the National Conference on Farmer’s Centric Agri-Innovation?\",\n    \"A\": \"It was recommended to involve students in experiential learning for the production and sale of agricultural products through Agriculture Technology Information Centers (ATIC).\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What was the title of the seminar organized by Vidyarthi Kalyan Nyas, Bhopal?\",\n    \"A\": \"National Seminar on Agriculture for Prosperity and Sustainable Development.\"\n  },\n  {\n    \"Q\": \"When and where was the seminar by Vidyarthi Kalyan Nyas held?\",\n    \"A\": \"It was held on 25-26 March, 2017 at IARI, Pusa, New Delhi.\"\n  },\n  {\n    \"Q\": \"How much grant did ICAR provide for the seminar by Vidyarthi Kalyan Nyas?\",\n    \"A\": \"Rs. 5.00 Lakhs.\"\n  },\n  {\n    \"Q\": \"What was one recommendation from the seminar by Vidyarthi Kalyan Nyas?\",\n    \"A\": \"Ecological agriculture in tune with sustainable development goals may be promoted among farmers as well as in school education.\"\n  },\n  {\n    \"Q\": \"What was the title of the conference organized by SKUAST Jammu?\",\n    \"A\": \"National Conference on Innovative Technological Interventions for Doubling Farmers’ Income (NaCITI-2018).\"\n  },\n  {\n    \"Q\": \"What recommendation was made regarding horticulture in the NaCITI-2018 conference?\",\n    \"A\": \"Classification into appropriate subzones for developing the horticulture sector is important to get export quality produce, e.g., apple of Kashmir, walnut of Kishtwar, Rajmash of Bhaderwah, and Basmati of Jammu in J&K.\"\n  },\n  {\n    \"Q\": \"What was the title of the conference organized by the Trust for Advancement of Agricultural Sciences?\",\n    \"A\": \"Regional Conference on Motivating and Attracting Youth in Agriculture.\"\n  },\n  {\n    \"Q\": \"What was a key recommendation from the Regional Conference on Motivating and Attracting Youth in Agriculture?\",\n    \"A\": \"Creation of an 'Agri-youth innovation corpus fund' out of Corporate Social Responsibility (CSR) of agriculture-based industries to catalyze rural employment through special projects.\"\n  },\n  {\n    \"Q\": \"What was the title of the international conference organized by REEDS Hyderabad?\",\n    \"A\": \"SKILLS 2017 International Conference: Life Skills and Livelihood Skills-Leveraging Digital India for Rural Empowerment.\"\n  },\n  {\n    \"Q\": \"What was a recommendation from the SKILLS 2017 International Conference?\",\n    \"A\": \"Leverage the National Digital Literacy Mission Programme for enhancing the livelihood skills of rural communities.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What was the title of the event organized by Orissa Society of Extension Education, OUAT, Bhubaneswar?\",\n    \"A\": \"International Extension Congress on New Horizons of Extension: Challenges and Opportunities.\"\n  },\n  {\n    \"Q\": \"What was the grant amount provided by ICAR for the International Extension Congress at OUAT?\",\n    \"A\": \"Rs. 8.00 Lakh.\"\n  },\n  {\n    \"Q\": \"What recommendation was made regarding technology dissemination during the International Extension Congress?\",\n    \"A\": \"The time gap between technology generation and dissemination must be abridged by exploiting modern digital platforms and tools.\"\n  },\n  {\n    \"Q\": \"Who organized the National Seminar on Development of Agriculture Based Improved Technologies?\",\n    \"A\": \"Savarmati Plantation Farmers Society, Kalibari Khagaria (Bihar).\"\n  },\n  {\n    \"Q\": \"What recommendation was made regarding crop varieties during the National Seminar in Khagaria?\",\n    \"A\": \"Emphasis may be given to short duration and drought-resistant varieties to provide income support to farmers year-round.\"\n  },\n  {\n    \"Q\": \"What was the title of the event organized by All India Agricultural Students Association at AAU, Jorhat?\",\n    \"A\": \"3rd National Youth Convention on Transforming Agriculture for Entrepreneurship and Employment Generation.\"\n  },\n  {\n    \"Q\": \"What recommendation was made regarding funding for agriculture during the 3rd National Youth Convention?\",\n    \"A\": \"Funding may be increased for agriculture research, education, and development to match agricultural output.\"\n  },\n  {\n    \"Q\": \"What was the title of the event organized by Retired ICAR Employees Association (RICAREA), Hyderabad?\",\n    \"A\": \"Sustainability of small farmers in the changing Agricultural Scenario.\"\n  },\n  {\n    \"Q\": \"What recommendation was made regarding credit facilities for small and marginal farmers during the RICAREA event?\",\n    \"A\": \"Credit facilities must be extended to small and marginal farmers to enable them to take up supplementary enterprises like dairying, small ruminant rearing, piggery, and fish farming.\"\n  },\n  {\n    \"Q\": \"What was the ICAR grant amount for the event organized by Retired ICAR Employees Association in Hyderabad?\",\n    \"A\": \"Rs. 2.0 Lakh.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What was the venue and date for the event 'Federating Agri Students into Business Group for Remunerative Agriculture: The Youth Perspective'?\",\n    \"A\": \"Jawaharlal Nehru Krishi Vishwa Vidhyalaya, Jabalpur (MP) on 15-16th February, 2019.\"\n  },\n  {\n    \"Q\": \"How much grant was provided by ICAR for the event 'National Farmers Science Congress on Grassroots Innovations in Farm Production, Value Chain Integration'?\",\n    \"A\": \"Rs. 3.50 Lakh.\"\n  },\n  {\n    \"Q\": \"What recommendation was made regarding cold storage in the event held at Jawaharlal Nehru Krishi Vishwa Vidhyalaya?\",\n    \"A\": \"More emphasis needs to be given for infrastructure development for cold storage warehouses.\"\n  },\n  {\n    \"Q\": \"What was the ICAR sanction number for the event 'Integrated Farming for the Rural Area' organized by Gayatri Educational & Cultural Society?\",\n    \"A\": \"F. No. 23 (84)/2018-Cdn (Tech).\"\n  },\n  {\n    \"Q\": \"What recommendation was made for rural communities in the event organized by Gayatri Educational & Cultural Society?\",\n    \"A\": \"Judicious mix of farming and non-farming occupations for various rural communities should be encouraged to stabilize their income and livelihood.\"\n  },\n  {\n    \"Q\": \"What was the title of the event held at Sher-E-Kashmir University of Agricultural Science and Technology of Jammu in February 2019?\",\n    \"A\": \"Women Empowerment through Agro-Entrepreneurship for Livelihood Security.\"\n  },\n  {\n    \"Q\": \"What recommendation was made for farm women in the event organized by the Society for Integrated Development of Agriculture, Veterinary and Ecological Sciences?\",\n    \"A\": \"Periodic and systematic capacity building of farm women in exploiting modern tools and technologies, including decoding of weather forecasts, is required.\"\n  },\n  {\n    \"Q\": \"What was the grant amount provided by ICAR for the 'Kisan Kalyan Seminar' organized by Chaitanya Vihar Vikash Manch?\",\n    \"A\": \"Rs. 1.87 Lakhs.\"\n  },\n  {\n    \"Q\": \"What recommendation was made regarding forest resources in the 'Kisan Kalyan Seminar'?\",\n    \"A\": \"Scientific utilization of forest resources by tribal communities must be encouraged.\"\n  },\n  {\n    \"Q\": \"What was the ICAR sanction number for the event 'National Farmers Science Congress on Grassroots Innovations in Farm Production, Value Chain Integration'?\",\n    \"A\": \"F. No. 23 (16)/2018-Cdn (Tech).\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What was the venue and date for the event 'Agri Students into Business Group for Remunerative Agriculture'?\",\n        \"A\": \"Jawaharlal Nehru Krishi Vishwa Vidhyalaya, Jabalpur (MP) on 15-16 February, 2019.\"\n    },\n    {\n        \"Q\": \"How much grant was provided by ICAR for the 'Agri Students into Business Group for Remunerative Agriculture' event?\",\n        \"A\": \"Rs. 4.00 Lakhs.\"\n    },\n    {\n        \"Q\": \"What recommendation was made to expose agricultural graduates to agri-entrepreneurship and startups?\",\n        \"A\": \"The framework of the V Deans Committee must be implemented.\"\n    },\n    {\n        \"Q\": \"What was the theme of the 24th Annual Conference of AERA?\",\n        \"A\": \"Agriculture for Nutrition Security.\"\n    },\n    {\n        \"Q\": \"What recommendation was made to boost fish production in the North-Eastern region?\",\n        \"A\": \"Initiate economically sound new technological interventions.\"\n    },\n    {\n        \"Q\": \"How can poor people in tribal areas enhance economic and nutrition security according to the recommendations?\",\n        \"A\": \"By focusing on the production of non-wood forest products (NWFPs).\"\n    },\n    {\n        \"Q\": \"What recommendation was made regarding pulses production?\",\n        \"A\": \"Increase the area under pulses by utilizing fallow lands and adopting intercropping.\"\n    },\n    {\n        \"Q\": \"What was the title of the 30th National Conference on Agricultural Marketing?\",\n        \"A\": \"Agricultural Marketing.\"\n    },\n    {\n        \"Q\": \"What recommendation was made to promote e-NAM and its benefits to farmers?\",\n        \"A\": \"Creating awareness about e-NAM and future market through different extension programs.\"\n    },\n    {\n        \"Q\": \"What recommendation was made for the conservation of threatened species during the National Seminar on Forest and Tree Based Land Use Systems?\",\n        \"A\": \"Setting up priority for threatened species conservation.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the purpose of establishing a germplasm bank?\",\n    \"A\": \"To conserve high-yielding genotypes for future breeding programs and commercial utilization.\"\n  },\n  {\n    \"Q\": \"Why is coastal agroforestry research important?\",\n    \"A\": \"It is important for environmental and livelihood security.\"\n  },\n  {\n    \"Q\": \"What policy framework is needed for water-stress ecosystems?\",\n    \"A\": \"A framework to regulate the cultivation of fast-growing tree species under water-stress ecosystems.\"\n  },\n  {\n    \"Q\": \"What is the title of the conference organized by the Indian Society of Agricultural Statistics in 2016?\",\n    \"A\": \"International Conference on Statistics and Big Data Bioinformatics in Agricultural Research.\"\n  },\n  {\n    \"Q\": \"What is the recommendation for integrating farming under a digital platform?\",\n    \"A\": \"The NARS should step up research on Big Data in agriculture to integrate farming under a digital platform.\"\n  },\n  {\n    \"Q\": \"What is the title of the 31st National Conference organized by the Indian Society of Agricultural Marketing in 2017?\",\n    \"A\": \"31st National Conference on Agricultural Marketing.\"\n  },\n  {\n    \"Q\": \"What is the recommendation for efficient marketing of agri-produce?\",\n    \"A\": \"Forward and backward linkages using e-NAM should be established, along with capacity building and ease of doing business.\"\n  },\n  {\n    \"Q\": \"What is the title of the National Conference organized by the Agricultural Economics Research Association in 2017?\",\n    \"A\": \"National Conference on Doubling Farmers Income: Options and Strategies.\"\n  },\n  {\n    \"Q\": \"What strategies are recommended for doubling farmers' income?\",\n    \"A\": \"Customized strategies for skill development, promotion of successful FPOs, financial inclusion, and infrastructure development are recommended.\"\n  },\n  {\n    \"Q\": \"What recommendations are made for effective implementation of the MSP policy?\",\n    \"A\": \"Purchases should be delinked from procurement targets, and advance arrangements should be made for purchase centers, handling logistics, and timely payments.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What was the venue and date of the event organized by Culture & Technology?\",\n    \"A\": \"Bhubaneshwar – 751003 on 8th and 9th Jan, 2019.\"\n  },\n  {\n    \"Q\": \"How much grant was provided by ICAR for the event organized by Culture & Technology?\",\n    \"A\": \"Rs. 2.50 Lakhs.\"\n  },\n  {\n    \"Q\": \"What recommendation was made for women farmers in the Culture & Technology event?\",\n    \"A\": \"Women farmers need to be educated on market intelligence and capacity-building programs on e-NAM should be carried out.\"\n  },\n  {\n    \"Q\": \"What was the title of the event organized by Mukti India Foundation?\",\n    \"A\": \"Women Empowerment In Agriculture.\"\n  },\n  {\n    \"Q\": \"What recommendation was made for women farmers in the Mukti India Foundation event?\",\n    \"A\": \"Confidence build-up among women is necessary for better planning and decision-making, and awareness on environmental issues is needed.\"\n  },\n  {\n    \"Q\": \"What was the venue and date of the Indian Society of Agricultural Statistics event?\",\n    \"A\": \"ICAR-CIAE, 13.12.2018 to 15.12.2018.\"\n  },\n  {\n    \"Q\": \"What recommendation was made in the Indian Society of Agricultural Statistics event?\",\n    \"A\": \"New technologies, methods, and tools in bioinformatics and genetics are needed to enhance agricultural productivity, efficiency, and profitability.\"\n  },\n  {\n    \"Q\": \"What was the title of the event organized by Agricultural Economics Research Association?\",\n    \"A\": \"Agriculture and Sustainable Development Goals.\"\n  },\n  {\n    \"Q\": \"What recommendation was made in the Agricultural Economics Research Association event?\",\n    \"A\": \"District-wise mapping of resource endowments and vulnerability assessments are needed to cope with climate change and environmental shocks.\"\n  },\n  {\n    \"Q\": \"What was the venue and date of the event organized by the University of Agricultural Sciences, Dharwad?\",\n    \"A\": \"University of Agricultural Sciences, Dharwad 26.02.2019 to 28.02.2019.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What was the title of the 19th Indian Agricultural Scientists and Farmers Congress?\",\n        \"A\": \"Prospects of Green Economy and Value Addition Technology for attracting and retaining youth in Agriculture and Rural Sector.\"\n    },\n    {\n        \"Q\": \"Where and when was the 19th Indian Agricultural Scientists and Farmers Congress held?\",\n        \"A\": \"It was held on 18th-19th February 2017 at Auditorium of Bioved Krishi Prodyogiki Gram, Moharab, Sringverpur, Allahabad.\"\n    },\n    {\n        \"Q\": \"What recommendation was made to attract and retain youth in agriculture?\",\n        \"A\": \"Innovative measures may be developed and demonstrated to open new vistas for attracting and retaining youth in agriculture.\"\n    },\n    {\n        \"Q\": \"What was the focus of the National Conference organized by Dr. Panjabrao Deshmukh Krishi Vidyapeeth?\",\n        \"A\": \"Agro processing-based entrepreneurship development for sustainable livelihood.\"\n    },\n    {\n        \"Q\": \"What recommendation was made regarding entrepreneurship in agriculture?\",\n        \"A\": \"Entrepreneurship must include areas of agri-inputs such as soil testing, seed and fertilizers, and the agro-processing sector.\"\n    },\n    {\n        \"Q\": \"What was the title of the programme organized by Chanchal Mukti Sudha Mahila Silai Udyog Boutique Prashikshan Sansthan?\",\n        \"A\": \"The programme for the rural farmers on Processing and value addition-Farm Gate opportunities.\"\n    },\n    {\n        \"Q\": \"What recommendation was made to reduce drudgery in agriculture for farm women?\",\n        \"A\": \"Augmentation of mechanization at farmers' fields through custom hiring will help in reducing drudgery in agriculture and enhance efficiency.\"\n    },\n    {\n        \"Q\": \"What was the theme of the National Workshop organized by the Society for Disability and Rehabilitation Studies?\",\n        \"A\": \"Economic Empowerment of Disabled Farmers through Skill Development and Self Help Groups.\"\n    },\n    {\n        \"Q\": \"What recommendations were made for disabled farmers during the National Workshop?\",\n        \"A\": \"Promotion of R&D activities for innovation of new tools and techniques, training through the National Skill Development Corporation, and financial support for assistive devices through PSUs/PSBs under CSR activities.\"\n    },\n    {\n        \"Q\": \"What was the title of the National Symposium organized by the Department of Bioenergy, Agricultural Engg. College and Research Institute, TNAU, Coimbatore?\",\n        \"A\": \"National Symposium on Trends in Agricultural and Bio-systems Engineering (TABE 2016).\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the purpose of establishing a farm machinery bank?\",\n    \"A\": \"The purpose is to provide access to machines in regions with low farm power availability, especially for high-cost machinery.\"\n  },\n  {\n    \"Q\": \"What model is suggested for high-cost farm machinery?\",\n    \"A\": \"A custom service or rental model is suggested, which can be adopted by private players or governmental organizations.\"\n  },\n  {\n    \"Q\": \"What improvements are needed to achieve higher agricultural production levels?\",\n    \"A\": \"The quality of farm operations like seedbed preparation, sowing, fertilizer application, irrigation, weeding, harvesting, and threshing needs to be improved using precision and efficient equipment.\"\n  },\n  {\n    \"Q\": \"What technologies are prioritized under the climate change scenario?\",\n    \"A\": \"Solar power, greenhouses for production, drones in agriculture, and remote sensing are prioritized for research and technology transfer.\"\n  },\n  {\n    \"Q\": \"What is recommended for increasing the profitability of agro-processing?\",\n    \"A\": \"Customized tools and machinery for agro-processing of diverse commodities should be developed, improved, and commercialized.\"\n  },\n  {\n    \"Q\": \"What storage solutions are recommended for agro-processing?\",\n    \"A\": \"Cost-effective storage systems of different capacities need to be developed and popularized.\"\n  },\n  {\n    \"Q\": \"What training is recommended for improving grain storage systems?\",\n    \"A\": \"Need-based training for farmers and grain storage agency workers on bulk storage systems with long shelf-life is recommended.\"\n  },\n  {\n    \"Q\": \"What is recommended for managing paddy straw effectively?\",\n    \"A\": \"In situ decomposition of paddy straw using a straw cutting machine is recommended.\"\n  },\n  {\n    \"Q\": \"What equipment is suggested to increase the area under pulses?\",\n    \"A\": \"Tractor-operated raised-bed planters are suggested to increase the area under pulses.\"\n  },\n  {\n    \"Q\": \"What is the purpose of electrostatic prescription (ESP) in agriculture?\",\n    \"A\": \"Electrostatic prescription (ESP) is used for grain cleaning and other grain-related processes.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What should be recommended for grain mills to avoid dust pollution?\",\n    \"A\": \"Dust control units should be recommended for grain mills to avoid dust pollution.\"\n  },\n  {\n    \"Q\": \"What technologies are encouraged for detecting and controlling microorganisms in stored food grains?\",\n    \"A\": \"Bio-signal processing and antimicrobial packaging for baked foods are encouraged.\"\n  },\n  {\n    \"Q\": \"What water-saving method is recommended for irrigation purposes?\",\n    \"A\": \"The use of gray water with an efficient filtration system is recommended for irrigation.\"\n  },\n  {\n    \"Q\": \"What was the title of the conference organized by The Energy and Resource Institute in 2017?\",\n    \"A\": \"The title was 'International Conference on Nano biotechnology for Agriculture: from Research to Innovation (nanoforagri2017)'.\"\n  },\n  {\n    \"Q\": \"What is the role of nanotechnology in agriculture as per the recommendations?\",\n    \"A\": \"Nanotechnology should be promoted for seed treatment, nutrient management, pesticide use, and waste disposal.\"\n  },\n  {\n    \"Q\": \"What safety measure is recommended for nanotechnology products in agriculture?\",\n    \"A\": \"Safety certification of nanotechnology products should be implemented over time.\"\n  },\n  {\n    \"Q\": \"What technologies are recommended to be promoted for food security and climate-resilient agriculture?\",\n    \"A\": \"Hydroponics, tissue culture, and marker-assisted breeding technologies are recommended.\"\n  },\n  {\n    \"Q\": \"What was the recommendation made during the Indian Plant Science Congress regarding plant biology?\",\n    \"A\": \"Plant biology should be integrated into the curriculum of engineering, physics, chemistry, and biotechnology.\"\n  },\n  {\n    \"Q\": \"What proactive regulatory measure is suggested to enhance crop production and nutrient quality?\",\n    \"A\": \"A proactive regulatory regime for gene editing technologies is suggested.\"\n  },\n  {\n    \"Q\": \"What was the title of the convention held at Banaras Hindu University in 2017?\",\n    \"A\": \"The title was 'National Intellectual Convention on Resurrection of Agricultural Education and Research in India'.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What tools should be integrated into the learning ecosystem for strengthening it?\",\n    \"A\": \"Best practices including e-media and ICT tools should be integrated into the learning ecosystem.\"\n  },\n  {\n    \"Q\": \"What disaster management topics are recommended for inclusion in graduate programs?\",\n    \"A\": \"Topics like weather, flood, and drought are recommended for inclusion in graduate programs.\"\n  },\n  {\n    \"Q\": \"What is the name of the society associated with the IAUA Golden Jubilee International Conference?\",\n    \"A\": \"The society is the Indian Agricultural Universities Association (IAUA).\"\n  },\n  {\n    \"Q\": \"What is the recommended model for establishing an EARTH University in India?\",\n    \"A\": \"The EARTH University in Costa Rica is the recommended model for establishing an EARTH University in India.\"\n  },\n  {\n    \"Q\": \"What is the purpose of the 'World Grant University' concept?\",\n    \"A\": \"The 'World Grant University' concept aims to promote effective international cooperation, including South-South, South-North, and Tri-lateral collaborations.\"\n  },\n  {\n    \"Q\": \"How many cows are estimated to be unproductive and aged in India?\",\n    \"A\": \"Around 5.3 million cows are estimated to be unproductive and aged in India.\"\n  },\n  {\n    \"Q\": \"What percentage of total milk production in India is contributed by cattle?\",\n    \"A\": \"Cattle contribute 45% of the total milk production in India.\"\n  },\n  {\n    \"Q\": \"How many gaushalas are currently functioning in India?\",\n    \"A\": \"More than five thousand gaushalas are currently functioning in India.\"\n  },\n  {\n    \"Q\": \"What are the primary challenges in managing gaushalas in India?\",\n    \"A\": \"The primary challenges include managing unproductive and aged cows and transitioning from traditional to scientific management practices.\"\n  },\n  {\n    \"Q\": \"Who compiled and edited the 'Management of Gaushalas' manual?\",\n    \"A\": \"The manual was compiled and edited by a committee constituted by ICAR, as per letter No. AS/11/36/2016-ASR-II dated 3rd May 2016.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the purpose of the Manual on Management of Gaushalas prepared by ICAR?\",\n    \"A\": \"The manual aims to help in capacity building of gaushala staff for the scientific rearing of cows by providing information on housing, sanitation, feeding, breeding, and health aspects of cattle management.\"\n  },\n  {\n    \"Q\": \"What topics are covered in the Manual on Management of Gaushalas?\",\n    \"A\": \"The manual covers housing, sanitation, feeding, breeding, health, infrastructure requirements, animal identification and record keeping, segregation and isolation, veterinary care, hygiene, waste disposal, and emergency preparedness.\"\n  },\n  {\n    \"Q\": \"How many gaushalas are currently operating in India?\",\n    \"A\": \"There are more than 5,100 registered gaushalas operating in India.\"\n  },\n  {\n    \"Q\": \"What percentage of the total livestock wealth in India is represented by cattle?\",\n    \"A\": \"Cattle represent 37.28% of the total livestock wealth of India.\"\n  },\n  {\n    \"Q\": \"Why is the slaughter of cows and their progeny banned in many Indian states?\",\n    \"A\": \"The slaughter of cows and their progeny is banned in many Indian states due to religious sentiments.\"\n  },\n  {\n    \"Q\": \"What is the average herd size of cows per household in India?\",\n    \"A\": \"The average herd size of cows per household in India is about three animals.\"\n  },\n  {\n    \"Q\": \"What is the primary issue faced by gaushalas in India?\",\n    \"A\": \"Most gaushalas in India are not well aware of the scientific rearing of cows.\"\n  },\n  {\n    \"Q\": \"What special needs are addressed in the manual for cattle management?\",\n    \"A\": \"The manual addresses the special needs of disabled and infirm animals, emergency preparedness, and management/handling.\"\n  },\n  {\n    \"Q\": \"Who contributed to the preparation and editing of the Manual on Management of Gaushalas?\",\n    \"A\": \"Scientists and Directors of ICAR-NDRI, Karnal, and ICAR-IVRI, Izatnagar contributed to the preparation and editing of the manual.\"\n  },\n  {\n    \"Q\": \"What is the significance of this manual for gaushala staff and livestock keepers?\",\n    \"A\": \"The manual will help gaushala staff and livestock keepers in better management of cows, improving animal welfare, and addressing important aspects of cattle care.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the purpose of the manual prepared by the Indian Council of Agricultural Research?\",\n        \"A\": \"The manual provides protocols on housing, feeding, breeding, health management, emergency preparedness, and emergency management for gaushalas.\"\n    },\n    {\n        \"Q\": \"Which institutions contributed to the preparation of the gaushala management manual?\",\n        \"A\": \"The National Dairy Research Institute and the Indian Veterinary Research Institute contributed to the manual.\"\n    },\n    {\n        \"Q\": \"What are the two common housing systems for sheltering cows in India?\",\n        \"A\": \"The two common housing systems are loose housing and conventional closed (tie) housing.\"\n    },\n    {\n        \"Q\": \"What is the loose housing system for cows?\",\n        \"A\": \"In loose housing, animals are kept in open paddocks in groups of 40-50 with a continuous manger, covered standing space, and a common water trough.\"\n    },\n    {\n        \"Q\": \"For which regions is the loose housing system ideal?\",\n        \"A\": \"The loose housing system is ideal for regions with low rainfall, such as Punjab, Haryana, Rajasthan, Western Uttar Pradesh, Gujarat, Madhya Pradesh, and Maharashtra.\"\n    },\n    {\n        \"Q\": \"What is the main advantage of the loose housing system?\",\n        \"A\": \"The loose housing system is cheap to construct, easy to expand, congenial to efficient management, and not prone to fire hazards.\"\n    },\n    {\n        \"Q\": \"What is the close (tie) housing system for cows?\",\n        \"A\": \"In the close housing system, animals are tied in one place, and milking and other routine operations are carried out at the same place.\"\n    },\n    {\n        \"Q\": \"What are the benefits of the close (tie) housing system?\",\n        \"A\": \"The close housing system provides greater protection during winter but has higher construction costs.\"\n    },\n    {\n        \"Q\": \"What are some of the topics covered in the gaushala management manual?\",\n        \"A\": \"The manual covers topics like infrastructure requirements, animal identification, feeding, veterinary care, hygiene, and emergency management.\"\n    },\n    {\n        \"Q\": \"Why is the loose housing system recommended for most gaushalas in India?\",\n        \"A\": \"The loose housing system is recommended because it is cost-effective, easy to manage, and suitable for most regions in India.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the primary purpose of cattle accommodation in gaushalas?\",\n    \"A\": \"The accommodation should provide shelter, enough space for movement, and allow animals to interact while ensuring comfort and minimizing stress.\"\n  },\n  {\n    \"Q\": \"Why is sufficient floor space important for cattle?\",\n    \"A\": \"Sufficient floor space helps keep cows clean, comfortable, and prevents joint damage while allowing them to lie down and stand up easily.\"\n  },\n  {\n    \"Q\": \"What are the floor space requirements for young calves under 8 weeks according to BIS standards?\",\n    \"A\": \"Young calves under 8 weeks require 1.0 m² of covered area and 2.0 m² of open area.\"\n  },\n  {\n    \"Q\": \"How much floor space is required for cows approaching calving according to BIS standards?\",\n    \"A\": \"Cows approaching calving require 12.0 m² of covered area and 20-25 m² of open area.\"\n  },\n  {\n    \"Q\": \"What is the floor space requirement for bulls in loose housing as per BIS standards?\",\n    \"A\": \"Bulls require 12.0 m² of covered area and 120.0 m² of open area.\"\n  },\n  {\n    \"Q\": \"How does the FAO recommend allocating floor space for cattle?\",\n    \"A\": \"The FAO recommends allocating floor space based on the body weight of the cattle.\"\n  },\n  {\n    \"Q\": \"What is the floor space requirement for large milking cows weighing over 600 kg according to FAO recommendations?\",\n    \"A\": \"Large milking cows weighing over 600 kg require 5.0 m² in a fully covered shed and 3.5 m² in an exercise yard.\"\n  },\n  {\n    \"Q\": \"What is the feeding manger length requirement for cows according to BIS IS 11799:2005?\",\n    \"A\": \"The feeding manger length requirement for cows is specified in BIS IS 11799:2005, but the exact dimensions were not provided in the provided text.\"\n  },\n  {\n    \"Q\": \"Why should feeding and watering troughs be properly designed in cattle houses?\",\n    \"A\": \"Feeding and watering troughs should be designed to prevent animals from getting into them and to keep the troughs clean.\"\n  },\n  {\n    \"Q\": \"What is the recommended floor space for young stock aged 1.5 to 3 months and weighing 70-100 kg according to FAO?\",\n    \"A\": \"Young stock aged 1.5 to 3 months and weighing 70-100 kg require 1.5 m² in a fully covered shed and 1.4 m² in an exercise yard.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the recommended water trough length per young calf (< 8 weeks)?\",\n        \"A\": \"The recommended water trough length per young calf is 10-15 cm.\"\n    },\n    {\n        \"Q\": \"What are the dimensions of the manger for adult cows?\",\n        \"A\": \"The dimensions of the manger for adult cows are 60 cm width, 40 cm depth, and 50 cm height of the inner wall.\"\n    },\n    {\n        \"Q\": \"Why are elevated mangers not desirable for feeding cows?\",\n        \"A\": \"Elevated mangers are not desirable as they negatively impact the feeding behavior of cows and feed utilization.\"\n    },\n    {\n        \"Q\": \"What is the advantage of the fence-line feeding system?\",\n        \"A\": \"The fence-line feeding system allows natural ingestive behavior, prevents animals from walking and defecating on the feed, is economical to construct, and saves labor.\"\n    },\n    {\n        \"Q\": \"What is the throat height for cattle aged 6-8 months in a fence-line feed barrier?\",\n        \"A\": \"The throat height for cattle aged 6-8 months is 14 inches.\"\n    },\n    {\n        \"Q\": \"What facilities should a veterinary clinic in a Gaushala have?\",\n        \"A\": \"A veterinary clinic should have an animal examination room, operating room, separate animal indoor accommodation, and an animal handling yard.\"\n    },\n    {\n        \"Q\": \"What is the purpose of the quarantine facility in a Gaushala?\",\n        \"A\": \"The quarantine facility is used to isolate animals suffering from suspected infectious diseases to prevent the spread of disease to other areas.\"\n    },\n    {\n        \"Q\": \"What is the size of the handling yard for a Gaushala with 500 cows?\",\n        \"A\": \"The size of the handling yard for 500 cows is 20 meters in length and 5 meters in width.\"\n    },\n    {\n        \"Q\": \"What equipment should the animal examination room in a Gaushala have?\",\n        \"A\": \"The animal examination room should have an easily cleaned and disinfected examination table, a hand wash basin with hot and cold water, and instruments for clinical examinations.\"\n    },\n    {\n        \"Q\": \"What is the height of the neck rail for cattle aged 9-12 months in a fence-line feed barrier?\",\n        \"A\": \"The height of the neck rail for cattle aged 9-12 months is 30 inches.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What percentage of Gaushala workers should be accommodated on the premises?\",\n    \"A\": \"At least 10-25% of the workers should be accommodated on the Gaushala premises.\"\n  },\n  {\n    \"Q\": \"What guidelines should be followed for space requirements for staff quarters in a Gaushala?\",\n    \"A\": \"The space requirements for staff quarters should follow the Central Government Guidelines for various categories of Central Government employees.\"\n  },\n  {\n    \"Q\": \"What types of feeds require storage space in a Gaushala?\",\n    \"A\": \"Feeds such as hay, straw, bran, grain, and oil cakes require storage space in a Gaushala.\"\n  },\n  {\n    \"Q\": \"How much storage space is required for 1 quintal of loose hay?\",\n    \"A\": \"1 quintal of loose hay requires approximately 1.60 m³ of storage space.\"\n  },\n  {\n    \"Q\": \"How much dry fodder does an adult cow consume per day?\",\n    \"A\": \"An adult cow consumes about 4-5 kg of dry fodder per day.\"\n  },\n  {\n    \"Q\": \"What factors determine the land required for fodder cultivation in a Gaushala?\",\n    \"A\": \"Factors such as climate, soil type, fertility, and availability and quality of irrigation water determine the land required for fodder cultivation.\"\n  },\n  {\n    \"Q\": \"How many cows and their followers can be maintained on one acre of fertile agricultural land with irrigation?\",\n    \"A\": \"4 to 5 cows along with their followers can be maintained on one acre of fertile agricultural land with assured irrigation.\"\n  },\n  {\n    \"Q\": \"How much land is sufficient for producing fodder for 6-7 cows and their calves?\",\n    \"A\": \"One acre of land is sufficient for producing fodder for 6-7 cows and their calves.\"\n  },\n  {\n    \"Q\": \"What facilities are included in the total land required for setting up a Gaushala?\",\n    \"A\": \"Facilities such as animal housing, store, chaff cutter, milking parlour, sick animal unit, veterinary dispensary, and manure storage are included in the total land requirement.\"\n  },\n  {\n    \"Q\": \"Why is it necessary to store dry fodder in a Gaushala?\",\n    \"A\": \"Dry fodder needs to be stored because its availability is seasonal and must be preserved for use throughout the year.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"How much land is required for a gaushala with 100 cows?\",\n    \"A\": \"Approximately 1 acre for the gaushala premises and 15 acres for fodder cultivation.\"\n  },\n  {\n    \"Q\": \"What machinery is needed for a gaushala with 500 cows?\",\n    \"A\": \"For a 500-cow gaushala, the required machinery includes 2 animal ambulances, 1 tractor with trailer, 1 high-capacity chaff/fodder cutter, 10 bucket milking machines, 1 utility vehicle, 1 40 KVA electricity generator set, and 10 milk cans with mushroom lids.\"\n  },\n  {\n    \"Q\": \"What is the purpose of animal identification in gaushalas?\",\n    \"A\": \"Animal identification helps in maintaining animal records and routine management of the animals.\"\n  },\n  {\n    \"Q\": \"How are newly born calves identified in a gaushala?\",\n    \"A\": \"Newly born calves are identified by tattooing in the ear.\"\n  },\n  {\n    \"Q\": \"What are the two methods of animal identification mentioned in the text?\",\n    \"A\": \"The two methods are tattooing and ear tagging.\"\n  },\n  {\n    \"Q\": \"What are the advantages of record keeping in gaushalas?\",\n    \"A\": \"Record keeping is vital for genetic improvement, scientific feeding, breeding, and healthcare of the animals.\"\n  },\n  {\n    \"Q\": \"What type of tags are used for ear tagging, and how are they applied?\",\n    \"A\": \"Tags are made of strong plastic and can be self-piercing or non-piercing. They are fixed to the ear using tagging forceps, with non-piercing tags requiring a hole to be made first.\"\n  },\n  {\n    \"Q\": \"What equipment is recommended for record keeping in gaushalas?\",\n    \"A\": \"A personal computer with accessories is recommended for record keeping in gaushalas.\"\n  },\n  {\n    \"Q\": \"What machinery is required for a gaushala with 1,000 cows?\",\n    \"A\": \"For a 1,000-cow gaushala, the required machinery includes 2 animal ambulances, 2 tractors with trailers, 2 high-capacity chaff/fodder cutters, 20 bucket milking machines, 2 utility vehicles, 1 40 KVA electricity generator set, 1 bulk milk chiller, and 10 milk cans with mushroom lids.\"\n  },\n  {\n    \"Q\": \"What are the benefits of tattooing for animal identification?\",\n    \"A\": \"Tattooing provides permanent identification for animals, making it ideal for newborn calves.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the purpose of maintaining a history sheet in a gaushala?\",\n        \"A\": \"The history sheet helps track details such as the animal's breed, sire, dam, date of birth, purchase value, calving dates, milk yield, and other performance metrics.\"\n    },\n    {\n        \"Q\": \"What information is recorded in the calving register?\",\n        \"A\": \"The calving register records the cow number, due date of calving, actual date of calving, sire number, calf number, sex of the calf, birth weight, breed, and remarks.\"\n    },\n    {\n        \"Q\": \"What details are tracked in the calf register?\",\n        \"A\": \"The calf register tracks the cow number, date of birth, calf number, sire number, dam number, sex of the calf, birth weight, disposal details, and remarks.\"\n    },\n    {\n        \"Q\": \"What is the purpose of the growth record of young stock?\",\n        \"A\": \"The growth record tracks the animal's weight at birth, weekly weights, monthly weights, weight at first service, weight at first calving, and additional remarks.\"\n    },\n    {\n        \"Q\": \"What information is maintained in the daily feeding register?\",\n        \"A\": \"The daily feeding register tracks the number of animals and the quantities of concentrate, green fodder, dry fodder, and other feeds received, issued, and remaining as balance.\"\n    },\n    {\n        \"Q\": \"What is recorded in the herd health register?\",\n        \"A\": \"The herd health register records the date, animal number, history of health issues, symptoms, diagnosis, treatment, results (cured or dead), name of the veterinarian, cost of treatment, and vaccination details.\"\n    },\n    {\n        \"Q\": \"What details are included in the cattle breeding register?\",\n        \"A\": \"The cattle breeding register includes details such as cow number, calving dates, service dates, bull numbers, pregnancy diagnosis results, expected and actual calving dates, calf number, and remarks.\"\n    },\n    {\n        \"Q\": \"What is the purpose of the dairy milk record?\",\n        \"A\": \"The dairy milk record tracks the daily milk yield of cows, both in the morning (AM) and evening (PM), for each day of the month.\"\n    },\n    {\n        \"Q\": \"What information is included in the lactation record?\",\n        \"A\": \"The lactation record includes details such as cow number, monthly milk yield with average fat percentage, lactation yield, lactation length, dry period, and remarks.\"\n    },\n    {\n        \"Q\": \"What is tracked in the daily livestock register?\",\n        \"A\": \"The daily livestock register tracks the number of cows, bulls, calves, heifers, and bullocks, along with additions and deductions in livestock during the day, and their sources or reasons.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What does the term 'isolation' mean in the context of animal management?\",\n        \"A\": \"Isolation refers to the segregation of affected animals and in-contact animals during an outbreak of a contagious disease from apparently healthy ones.\"\n    },\n    {\n        \"Q\": \"What is the purpose of quarantine in a gaushala?\",\n        \"A\": \"Quarantine is used to segregate apparently healthy animals that have been exposed to infection risk, allowing time for any contagious diseases in the incubation stage to become active and detectable.\"\n    },\n    {\n        \"Q\": \"What is the recommended duration for isolating animals in case of a contagious disease outbreak?\",\n        \"A\": \"Animals should be isolated for 21-30 days.\"\n    },\n    {\n        \"Q\": \"What measures should be taken for isolated animals in a gaushala?\",\n        \"A\": \"Measures include using separate housing and feeding areas, preventing contact with other animals, preventing manure movement from the isolation area, milking isolated cows last, and testing for diseases before reintroducing them to the herd.\"\n    },\n    {\n        \"Q\": \"What is the significance of detecting and eliminating carriers in a herd?\",\n        \"A\": \"Carriers are animals that carry disease-producing organisms without symptoms and shed them in secretions and excretions. Detecting and eliminating carriers is crucial to keeping the herd disease-free.\"\n    },\n    {\n        \"Q\": \"What types of expenditures are recorded for feeds and fodders in a gaushala?\",\n        \"A\": \"Expenditures include costs for green fodder, dry fodder, concentrate, and silage.\"\n    },\n    {\n        \"Q\": \"What are the main categories of labor expenditure in a gaushala?\",\n        \"A\": \"Labor expenditure is categorized into permanent labor, casual labor, and contract labor.\"\n    },\n    {\n        \"Q\": \"What are the key components of miscellaneous expenditure in a gaushala?\",\n        \"A\": \"Miscellaneous expenditures include costs for servicing, veterinary/health care, electricity, water, and consumables.\"\n    },\n    {\n        \"Q\": \"What types of production are recorded from a gaushala?\",\n        \"A\": \"Production includes total milk quantity, value of dung/manure, and value of surplus animals sold.\"\n    },\n    {\n        \"Q\": \"What protocol should be followed to prevent disease spread from isolated animals?\",\n        \"A\": \"Protocols include preventing contact with other animals, isolating manure movement, observing animals for early disease detection, and testing for diseases before reintroducing them to the main herd.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the purpose of the Tuberculin test in cattle?\",\n    \"A\": \"The Tuberculin test is used to detect the toxic product released by Mycobacterium tuberculosis, diagnosing non-clinical cases of tuberculosis in cattle.\"\n  },\n  {\n    \"Q\": \"How often should the Tuberculin test be conducted?\",\n    \"A\": \"The Tuberculin test should be conducted half-yearly in the initial stage and later on annually, with January being the ideal month.\"\n  },\n  {\n    \"Q\": \"What disease does the Brucellosis test detect, and what causes it?\",\n    \"A\": \"The Brucellosis test detects Brucella abortus, a disease that causes abortion in late pregnancy and high infertility rates.\"\n  },\n  {\n    \"Q\": \"What is the principle behind the Brucellosis test?\",\n    \"A\": \"The Brucellosis test is a serological test based on the antigen-antibody reaction, resulting in agglutination of bacterial cells in positive cases.\"\n  },\n  {\n    \"Q\": \"What is the Johnin test used for?\",\n    \"A\": \"The Johnin test is used to detect the toxic product released by Mycobacterium paratuberculosis, diagnosing Johne’s disease in bovines.\"\n  },\n  {\n    \"Q\": \"What does the California Mastitis Test (CMT) detect?\",\n    \"A\": \"The California Mastitis Test (CMT) detects sub-clinical mastitis in a herd.\"\n  },\n  {\n    \"Q\": \"How often should the California Mastitis Test (CMT) be conducted?\",\n    \"A\": \"The California Mastitis Test (CMT) should be conducted at least once a month to screen all cows in a herd.\"\n  },\n  {\n    \"Q\": \"What is a balanced ration for cattle?\",\n    \"A\": \"A balanced ration provides essential nutrients in the right proportions and amounts to meet the proper nourishment requirements of a particular animal for 24 hours.\"\n  },\n  {\n    \"Q\": \"What factors determine the dry matter (DM) requirement for cattle?\",\n    \"A\": \"The DM requirement depends on the body weight of the animal, with indigenous cows generally requiring 2.0 to 2.5% of their body weight.\"\n  },\n  {\n    \"Q\": \"Why do cows in their first and second lactation need additional nutrients?\",\n    \"A\": \"Cows in their first and second lactation are still growing and need additional nutrients for growth. They also require extra nutrients during the last quarter of gestation for fetal growth and building body reserves for the next lactation.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What proportion of dry matter (DM) should come from roughages in cattle feeding?\",\n    \"A\": \"Two-thirds of DM (or three-fourths if sufficient legumes are available) should come from roughages, with the rest coming from concentrates.\"\n  },\n  {\n    \"Q\": \"What is the recommended proportion of dry and green roughages in cattle feeding?\",\n    \"A\": \"Two-thirds of roughages should be dry, and one-third should be green.\"\n  },\n  {\n    \"Q\": \"What is the range of DM from roughages based on the cow's live weight?\",\n    \"A\": \"The DM from roughages should not exceed 2% of the cow’s live weight and should not be less than 1%.\"\n  },\n  {\n    \"Q\": \"What factors determine the requirement of digestible crude protein (DCP) and energy (TDN) for animals?\",\n    \"A\": \"The requirement is based on the physiological needs of the animal, such as maintenance, milk production, or advanced pregnancy.\"\n  },\n  {\n    \"Q\": \"How is a ration computed for cattle feeding?\",\n    \"A\": \"A suitable combination of locally available roughages and concentrates is selected to meet the animal's total requirements.\"\n  },\n  {\n    \"Q\": \"What is the thumb rule for feeding cattle?\",\n    \"A\": \"The thumb rule simplifies feeding by using practical experience to determine the quantities of straws and concentrates, rather than detailed scientific calculations.\"\n  },\n  {\n    \"Q\": \"What are the daily feeding requirements for young calves up to 6 months old?\",\n    \"A\": \"Young calves require 5 kg of green fodder, 1 kg of dry fodder, and 0.5-1.0 kg of concentrate mixture per day.\"\n  },\n  {\n    \"Q\": \"How much green fodder is recommended for crossbred milking cows daily?\",\n    \"A\": \"Crossbred milking cows require 30-40 kg of green fodder daily.\"\n  },\n  {\n    \"Q\": \"What are the daily feeding requirements for breeding bulls?\",\n    \"A\": \"Breeding bulls require 40-50 kg of green fodder, 4-5 kg of dry fodder, and 4-5 kg of concentrate mixture per day.\"\n  },\n  {\n    \"Q\": \"What are the feeding requirements for old or retired cows and bullocks?\",\n    \"A\": \"Old or retired cows and bullocks require 20-25 kg of green fodder, 2-3 kg of dry fodder, and 1-2 kg of concentrate mixture daily.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the recommended concentrate mixture formulation for cows producing up to 20 kg of milk per day?\",\n        \"A\": \"The concentrate mixture should be formulated as per BIS Type II for cows producing up to 20 kg of milk per day.\"\n    },\n    {\n        \"Q\": \"What is the recommended concentrate mixture formulation for cows producing up to 40 kg of milk per day?\",\n        \"A\": \"The concentrate mixture should be formulated as per BIS Type I for cows producing up to 40 kg of milk per day.\"\n    },\n    {\n        \"Q\": \"What are the main ingredients and their proportions in an ideal concentrate mixture?\",\n        \"A\": \"The ideal concentrate mixture includes: Maize grains (33 kg), Groundnut cake (21 kg), Mustard cake (12 kg), Wheat bran (20 kg), Deoiled rice polish (11 kg), Mineral mixture (2 kg), and Common salt (1 kg).\"\n    },\n    {\n        \"Q\": \"How much concentrate mixture should be provided to a lactating cow per kg of milk produced?\",\n        \"A\": \"Lactating cows should be provided 400 g of concentrate mixture for every 1 kg of milk produced, along with 1.5 kg additional concentrate mixture for maintenance.\"\n    },\n    {\n        \"Q\": \"What is the recommended protein content in concentrate mixtures for higher productivity?\",\n        \"A\": \"The concentrate mixture should have a protein content of not less than 22% for higher productivity.\"\n    },\n    {\n        \"Q\": \"What is the feeding recommendation for newborn calves in terms of colostrum?\",\n        \"A\": \"Newborn calves should receive colostrum (about 10% of body weight, at least 2-3 liters) within the first six hours after birth for up to 4-5 days.\"\n    },\n    {\n        \"Q\": \"What is the total milk requirement for feeding one calf up to 4 months of age?\",\n        \"A\": \"The total milk requirement for feeding one calf up to 4 months of age is 237.5 kg.\"\n    },\n    {\n        \"Q\": \"What is the feeding schedule for calves aged 6-30 days?\",\n        \"A\": \"Calves aged 6-30 days should be fed 3.5 kg of whole milk per day.\"\n    },\n    {\n        \"Q\": \"What is the importance of colostrum feeding for newborn calves?\",\n        \"A\": \"Colostrum provides local immunity in the gut and serves as a highly digestible, high-quality food for newborn calves.\"\n    },\n    {\n        \"Q\": \"What should be ensured for the nutritional management of heifers?\",\n        \"A\": \"Heifers should be fed according to recommended feeding standards to meet growth targets, as nutrition and growth rate affect the age of first calving and lifetime productivity.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What factors influence the formulation of diets for cattle?\",\n    \"A\": \"Diets are influenced by production level, reproductive stage, body size, housing, and weather conditions.\"\n  },\n  {\n    \"Q\": \"Why is it important to test the nutrient content of feed ingredients periodically?\",\n    \"A\": \"Periodic testing ensures that feed ingredients meet nutritional requirements and are of good quality.\"\n  },\n  {\n    \"Q\": \"How should changes in cattle feed be introduced?\",\n    \"A\": \"Changes in feed should be introduced gradually over a 7-10 day period to avoid abrupt dietary changes.\"\n  },\n  {\n    \"Q\": \"What is the recommended increase in concentrates for cattle, and how should it be done?\",\n    \"A\": \"Concentrates should be increased gradually by 0.5 to 0.7 kg per head per day, based on appetite.\"\n  },\n  {\n    \"Q\": \"What is the ideal feeding space required per cow to ensure adequate access to feed?\",\n    \"A\": \"Each cow should have 60 cm of linear feeding space to prevent dominant cows from restricting access.\"\n  },\n  {\n    \"Q\": \"What are the key components of a good husbandry and animal care program in a gaushala?\",\n    \"A\": \"Key components include proper nutrition, housing, disease prevention, rapid diagnosis, and treatment programs.\"\n  },\n  {\n    \"Q\": \"Why is vaccination important in a herd health management program?\",\n    \"A\": \"Vaccination reduces the incidence of disease by stimulating the immune system to respond to disease-causing agents.\"\n  },\n  {\n    \"Q\": \"What factors can influence the immune response to vaccinations in cattle?\",\n    \"A\": \"Factors include stress, vitamin and mineral balance, nutrition, and the overall health of the animal.\"\n  },\n  {\n    \"Q\": \"What type of shelter is recommended for weaned calves and cows calving?\",\n    \"A\": \"Weaned calves and cows calving require at least an open shed for shelter.\"\n  },\n  {\n    \"Q\": \"What is the purpose of animal crates in cattle management?\",\n    \"A\": \"Animal crates are used for efficient maintenance and care, such as deworming, dehorning, palpating, or vaccinating.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"Why is it important to protect animals during inclement weather?\",\n    \"A\": \"Protecting animals during inclement weather helps avoid stress and the precipitation of diseases.\"\n  },\n  {\n    \"Q\": \"What are the two main classes of cattle feed?\",\n    \"A\": \"The two main classes of cattle feed are roughages and concentrates.\"\n  },\n  {\n    \"Q\": \"What are examples of roughages for cattle?\",\n    \"A\": \"Examples of roughages include grazable pasture, alfalfa, grass hay, and straws.\"\n  },\n  {\n    \"Q\": \"What are examples of concentrates for cattle?\",\n    \"A\": \"Examples of concentrates include grains, cottonseed meal, wheat bran, and soybean meal.\"\n  },\n  {\n    \"Q\": \"What is the purpose of dehorning calves?\",\n    \"A\": \"Dehorning calves is done to avoid injury to herdmates and personnel, reduce feeder space requirements, and increase handling ease.\"\n  },\n  {\n    \"Q\": \"Why is castration of male calves recommended?\",\n    \"A\": \"Castration reduces the chance of unplanned mating, venereal disease, and aggression against other animals and caretakers.\"\n  },\n  {\n    \"Q\": \"What are the benefits of weaning calves from their mothers?\",\n    \"A\": \"Weaning calves promotes cessation of milk production in cows and restores their heat cycle.\"\n  },\n  {\n    \"Q\": \"What are some routine procedures for cow health management?\",\n    \"A\": \"Routine procedures include regular vaccination, disease screening, deworming, parasite control, and maintaining health and reproduction records.\"\n  },\n  {\n    \"Q\": \"How can resistance in animals to infectious agents be promoted?\",\n    \"A\": \"Resistance can be promoted through good nutrition and wellness care.\"\n  },\n  {\n    \"Q\": \"What is the importance of bio-security measures in gaushalas?\",\n    \"A\": \"Bio-security measures help prevent the introduction and spread of infectious diseases among animals.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What are the practices for minimizing disease incidence in cattle?\",\n    \"A\": \"Provide adequate housing, avoid temperature extremes, practice good sanitation, isolate new animals, ensure proper feed and water, protect feed and water from contamination, and observe animals daily for signs of disease.\"\n  },\n  {\n    \"Q\": \"Why should new animals be isolated before entering the gaushala?\",\n    \"A\": \"New animals should be isolated for a minimum of 21 days to prevent the spread of diseases and ensure they are vaccinated against endemic diseases.\"\n  },\n  {\n    \"Q\": \"What are some common cattle diseases prevalent in India?\",\n    \"A\": \"Common cattle diseases include foot and mouth disease, haemorrhagic septicaemia, black quarter, anthrax, enterotoxaemia, cowpox, brucellosis, rabies, parasitic diseases, protozoan diseases, tuberculosis, mange infestations, and mastitis.\"\n  },\n  {\n    \"Q\": \"What are the signs and symptoms of common cattle diseases?\",\n    \"A\": \"Symptoms include abnormal gait, loss of appetite, stoppage of rumination, rough dry skin, dry muzzle, variations in body temperature, pulse, and respiration rate, diarrhoea or constipation, abnormal urine color or odor, reproductive problems, weight loss, presence of parasites, and respiratory problems.\"\n  },\n  {\n    \"Q\": \"What is the vaccination protocol for foot and mouth disease in cattle?\",\n    \"A\": \"The vaccination protocol involves administering a 3 ml dose of polyvalent FMD vaccine subcutaneously, providing immunity for 1 year. The first vaccination is given at 3 months of age and repeated as per the vaccine used.\"\n  },\n  {\n    \"Q\": \"When should cattle be vaccinated for haemorrhagic septicaemia?\",\n    \"A\": \"Cattle should receive a 5 ml dose of HS vaccine subcutaneously at 6 months of age, providing immunity for 6 months to 1 year. Vaccination is repeated yearly in May-June.\"\n  },\n  {\n    \"Q\": \"What is the vaccination schedule for black quarter disease?\",\n    \"A\": \"Cattle are vaccinated with a 5 ml dose of BQ vaccine subcutaneously at 6 months of age, providing immunity for 6 months to 1 year. The vaccination is repeated yearly in May-June.\"\n  },\n  {\n    \"Q\": \"Which vaccine is used for brucellosis in female cattle calves?\",\n    \"A\": \"The Brucella S-19 vaccine is used, with a 5 ml dose administered subcutaneously to female cattle calves aged 4-8 months, providing immunity for 2 years.\"\n  },\n  {\n    \"Q\": \"What is the vaccination protocol for rabies in cattle?\",\n    \"A\": \"The rabies post-bite vaccine is administered in a 1 ml dose subcutaneously at intervals of 0, 3, 7, 14, 28, and 90 days, providing immunity for 1 year.\"\n  },\n  {\n    \"Q\": \"Why is it important to observe cattle daily for signs of disease?\",\n    \"A\": \"Daily observation helps detect abnormal behavior or signs of disease early, allowing for prompt treatment to minimize the impact on the animal's health and prevent the spread of disease.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the recommended schedule for post-exposure rabies vaccination in cows?\",\n    \"A\": \"Post-exposure rabies vaccination is recommended on days 0, 3, 7, 14, 28, and 90.\"\n  },\n  {\n    \"Q\": \"When should post-exposure rabies vaccination start if a cow is bitten by a dog confirmed to have rabies?\",\n    \"A\": \"The vaccination course should start immediately if a cow is bitten by a dog confirmed to have rabies.\"\n  },\n  {\n    \"Q\": \"How can external parasites in cows be controlled?\",\n    \"A\": \"External parasites can be controlled using ectoparasiticides in the form of sprays and injections.\"\n  },\n  {\n    \"Q\": \"Why is it important to control ectoparasites during summer or rainy seasons?\",\n    \"A\": \"Protozoan diseases are more common during summer or rainy seasons due to higher tick activity.\"\n  },\n  {\n    \"Q\": \"What is the recommended deworming schedule for young animals up to 18 months old?\",\n    \"A\": \"Young animals should be dewormed at least 4 times a year or monthly if necessary, depending on the climate and management.\"\n  },\n  {\n    \"Q\": \"What precautions should be taken to prevent resistance when using anthelmintic drugs?\",\n    \"A\": \"Routine use of the same anthelmintic drugs should be avoided, and the correct dosage should be used to prevent resistance.\"\n  },\n  {\n    \"Q\": \"What is the recommended method for disposing of dead animals?\",\n    \"A\": \"Dead animals should be buried deeply or burned, with burning being the most sanitary method.\"\n  },\n  {\n    \"Q\": \"What tests are commonly used for early detection of mastitis in cows?\",\n    \"A\": \"The Strip-cup test and Modified California Mastitis Test (MCMT) are commonly used for early detection of mastitis.\"\n  },\n  {\n    \"Q\": \"What practices can reduce the incidence of udder problems in milking cows?\",\n    \"A\": \"Teat dipping before and after milking, drying-up therapy with antibiotics, and maintaining hygienic milking practices can reduce udder problems.\"\n  },\n  {\n    \"Q\": \"What should be done if a cow has a retained placenta for more than 24-72 hours after calving?\",\n    \"A\": \"Manual removal of the placenta is not advised; treatment should be carried out under veterinary guidance.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What type of environment should be provided for cows at the time of calving?\",\n    \"A\": \"Dry, sanitary maternity pens or paddocks should be provided at the time of calving.\"\n  },\n  {\n    \"Q\": \"Why is colostrum important for calves, and when should it be provided?\",\n    \"A\": \"Colostrum is important for providing immunity and should be given soon after birth.\"\n  },\n  {\n    \"Q\": \"What type of milk should be fed to calves?\",\n    \"A\": \"Calves should be fed a high-quality milk replacer or pasteurized milk, avoiding milk from cows treated with antibiotics.\"\n  },\n  {\n    \"Q\": \"What immediate care should be given to a calf's navel after birth?\",\n    \"A\": \"The navel should be dipped in disinfectant as soon as possible after birth.\"\n  },\n  {\n    \"Q\": \"What are the requirements for transporting calves?\",\n    \"A\": \"Calves should be able to walk unassisted, not be wobbly, have a dry navel, and be transported in appropriate vehicles with ventilation, bedding, and protection.\"\n  },\n  {\n    \"Q\": \"What measures should be taken to minimize stress during weaning?\",\n    \"A\": \"Stressful procedures during weaning should be avoided to ensure calf well-being.\"\n  },\n  {\n    \"Q\": \"How often should calves be monitored, and what records should be maintained?\",\n    \"A\": \"Calves should be monitored at least twice daily, and records of their health and any medication used should be maintained.\"\n  },\n  {\n    \"Q\": \"What is biosecurity, and why is it important in gaushalas?\",\n    \"A\": \"Biosecurity involves procedures to prevent the introduction and spread of infectious agents, maintaining animal health in gaushalas.\"\n  },\n  {\n    \"Q\": \"What physical barriers can be used to ensure biosecurity in a gaushala?\",\n    \"A\": \"Walls, fences, or natural vegetation can be used to limit the entry of disease-carrying animals.\"\n  },\n  {\n    \"Q\": \"What hygiene measures should be implemented at gaushala entry/exit points?\",\n    \"A\": \"Foot baths, clean clothes/overalls, and boots/shoes for visitors should be maintained at entry/exit points.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What diseases should new animals be checked for before entering the herd?\",\n    \"A\": \"New animals should be checked for tuberculosis, Johne’s disease, and brucellosis.\"\n  },\n  {\n    \"Q\": \"How long should new animals be isolated before joining the herd?\",\n    \"A\": \"New animals should be isolated for a minimum of 30 days before joining the herd.\"\n  },\n  {\n    \"Q\": \"How should animals of different physiological stages or ages be managed?\",\n    \"A\": \"Animals of different physiological stages or ages should be kept in separate paddocks or units with separate management strategies.\"\n  },\n  {\n    \"Q\": \"What should be done with dead animals to avoid the risk of infection?\",\n    \"A\": \"Dead animals should be removed immediately and disposed of in a sanitary manner.\"\n  },\n  {\n    \"Q\": \"Why is a clean shelter important for animals?\",\n    \"A\": \"A clean shelter increases the comfort level of animals and helps avoid bacterial, viral, and parasitic infections.\"\n  },\n  {\n    \"Q\": \"What is the objective of sanitation in animal shelters?\",\n    \"A\": \"The objective of sanitation is to clean and remove most germs, parasites, and dirt from animal shelters to reduce the risk of infections.\"\n  },\n  {\n    \"Q\": \"What is the most effective means of cleaning animal sheds?\",\n    \"A\": \"An abundant supply of water under pressure is the easiest and most effective means of cleaning animal sheds.\"\n  },\n  {\n    \"Q\": \"What factors make porous surfaces harder to disinfect than smooth surfaces?\",\n    \"A\": \"Porous surfaces are harder to disinfect because they are more difficult to clean, have heavier soil loads, and allow germs to remain in cracks and crevices.\"\n  },\n  {\n    \"Q\": \"What is one of the most effective, safe, and inexpensive methods of disinfection?\",\n    \"A\": \"Direct rays from the sun are one of the most effective, safe, and inexpensive methods of disinfection.\"\n  },\n  {\n    \"Q\": \"How should farm buildings be oriented to maximize the benefits of sunlight for disinfection?\",\n    \"A\": \"Farm buildings should have a north-south orientation with an open front and back to allow direct sunlight into the sheds in the mornings and evenings.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What are common disinfectants used in animal sheds?\",\n    \"A\": \"Common disinfectants include boric acid, quaternary ammonium compounds, bleach (sodium hypochlorite), potassium peroxy-monosulfate, alcohol, chlorhexidine, and phenolic disinfectants.\"\n  },\n  {\n    \"Q\": \"How should disinfectants be applied in animal sheds?\",\n    \"A\": \"Disinfectants can be applied by mopping or spraying after thorough cleaning of the area.\"\n  },\n  {\n    \"Q\": \"Why is it important to clean the area before applying disinfectants?\",\n    \"A\": \"The effectiveness of chemical disinfectants is greatly reduced in the presence of organic matter.\"\n  },\n  {\n    \"Q\": \"What is the daily disinfection protocol for cattle sheds under normal circumstances?\",\n    \"A\": \"Daily scrubbing and washing of floors, water troughs, and mangers, along with exposure to sunlight, are sufficient to keep cattle sheds moderately germ-free.\"\n  },\n  {\n    \"Q\": \"What additional measures are required during a disease outbreak in cattle sheds?\",\n    \"A\": \"All floors, walls up to 1.5 m, water troughs, mangers, and equipment should be thoroughly scrubbed, washed, and disinfected with an approved disinfectant.\"\n  },\n  {\n    \"Q\": \"What is the protocol for disinfection during an anthrax outbreak?\",\n    \"A\": \"Dung and litter should be disinfected in situ, the top 10 cm of earth floors removed, and the area scrubbed and washed with 4% hot washing soda solution before applying a disinfectant.\"\n  },\n  {\n    \"Q\": \"What should be done to water troughs and mangers after disinfection?\",\n    \"A\": \"The interiors of water troughs and mangers should be whitewashed.\"\n  },\n  {\n    \"Q\": \"What is the purpose of disinfestation in gaushala premises?\",\n    \"A\": \"Disinfestation aims to eliminate sources of parasitic infection, prevent animals from accessing infestation sources, and eliminate intermediate hosts.\"\n  },\n  {\n    \"Q\": \"How can stagnant water sources around gaushalas be managed?\",\n    \"A\": \"Stagnant water pools, ponds, and ditches should be filled, leveled, or fenced to prevent animal access.\"\n  },\n  {\n    \"Q\": \"What is the recommended cleaning frequency for feed and water troughs in gaushalas?\",\n    \"A\": \"Feed and water troughs should be scrubbed and cleaned regularly, and their interiors whitewashed at least once a week.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"Why should animals of different ages be housed separately?\",\n    \"A\": \"Animals of different ages should be housed separately to prevent the spread of diseases and to manage them effectively.\"\n  },\n  {\n    \"Q\": \"What is the importance of deworming animals before putting them in a shed or gaushala?\",\n    \"A\": \"Proper deworming prevents parasitic infections and ensures the health of animals.\"\n  },\n  {\n    \"Q\": \"What is rotational grazing, and why is it practiced?\",\n    \"A\": \"Rotational grazing involves dividing pastures into blocks and rotating grazing among them to prevent overgrazing and maintain pasture health.\"\n  },\n  {\n    \"Q\": \"Why should humans avoid defecating on grazing fields?\",\n    \"A\": \"Human defecation on grazing fields can contaminate them with tapeworm eggs, posing health risks to animals.\"\n  },\n  {\n    \"Q\": \"What precautions should be taken to prevent access of dogs, crows, and other birds to the gaushala?\",\n    \"A\": \"Dogs, crows, and other birds should be prevented from accessing the gaushala as they can act as intermediate hosts or mechanical carriers of diseases.\"\n  },\n  {\n    \"Q\": \"How should solid manure be collected and removed from cattle sheds?\",\n    \"A\": \"Solid manure should be collected using shovels, lifted into wheelbarrows, and carried out of sheds twice daily under ideal management conditions.\"\n  },\n  {\n    \"Q\": \"What is the purpose of 'U'-shaped drains in cattle sheds?\",\n    \"A\": \"The 'U'-shaped drains are used to carry off liquid manure and wash water from the sheds efficiently.\"\n  },\n  {\n    \"Q\": \"How can liquid manure be managed outside the shed?\",\n    \"A\": \"Liquid manure can be routed through closed or sub-surface drains to a main farm drain, which leads to a storage tank through inspection and setting chambers.\"\n  },\n  {\n    \"Q\": \"What are the benefits of using manure pits for solid manure storage?\",\n    \"A\": \"Manure pits allow proper decomposition of manure, prevent fly menace, and conserve plant nutrients for use as farm manure.\"\n  },\n  {\n    \"Q\": \"How can mix wash water from cattle sheds be utilized effectively?\",\n    \"A\": \"Mix wash water can be led directly into fields for fodder grasses or fed as slurry into biogas plants.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"Why should manure pits be located at a minimum distance from wells, rivers, and tanks?\",\n    \"A\": \"Manure pits should be at least 10 meters away from wells, rivers, and tanks to prevent contamination and maintain hygiene.\"\n  },\n  {\n    \"Q\": \"What is the average manure production per adult cow unit per day?\",\n    \"A\": \"On average, an adult cow unit produces 30 to 40 kg of manure per day.\"\n  },\n  {\n    \"Q\": \"How much space is required for manure storage per cow in a manure pit?\",\n    \"A\": \"An average of 2.2 m³ of space is required per cow for manure storage in a manure pit.\"\n  },\n  {\n    \"Q\": \"What type of floor is recommended for housing disabled animals in gaushalas?\",\n    \"A\": \"A kuchcha floor with a 20 cm thick layer of sand or straw is recommended to prevent skin and nerve damage.\"\n  },\n  {\n    \"Q\": \"What provisions should be made for the comfort of disabled animals in gaushalas?\",\n    \"A\": \"The shelter should include ceiling fans, exhaust fans, heating and cooling devices, and comfortable bedding like rubber mats or mattresses.\"\n  },\n  {\n    \"Q\": \"How should enclosures for disabled animals be designed to prevent fly infestations?\",\n    \"A\": \"Enclosures for disabled animals should be made fly-proof, particularly for injured or wounded animals.\"\n  },\n  {\n    \"Q\": \"What type of diet is recommended for recumbent animals in gaushalas?\",\n    \"A\": \"A balanced, easily digestible diet with palatable green grasses is recommended over concentrate-based diets.\"\n  },\n  {\n    \"Q\": \"What special care should be taken for animals that are unable to get up?\",\n    \"A\": \"Animals unable to get up should be maintained in sternal recumbency with support from sandbags or straw bales to prevent bloat and regurgitation.\"\n  },\n  {\n    \"Q\": \"What features should water troughs and feeding trays have for disabled animals?\",\n    \"A\": \"Water troughs and feeding trays should be shallow with a wide base to accommodate the needs of disabled animals.\"\n  },\n  {\n    \"Q\": \"Why should separate wards be constructed for disabled animals in gaushalas?\",\n    \"A\": \"Separate wards help segregate disabled animals to provide proper care, treatment, and to avoid injuries from healthy animals.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"Why should a recumbent animal be rolled every 2-3 hours?\",\n        \"A\": \"To minimize tissue damage and prevent the development of decubital ulcers.\"\n    },\n    {\n        \"Q\": \"What provisions should be made to help recumbent animals get up?\",\n        \"A\": \"Provisions for slings and well-padded hip clamps should be made to support the animal.\"\n    },\n    {\n        \"Q\": \"How can ischemic myonecrosis be prevented in disabled animals?\",\n        \"A\": \"Massaging and assisted locomotion can help prevent ischemic myonecrosis.\"\n    },\n    {\n        \"Q\": \"What is the purpose of floating tanks for disabled animals?\",\n        \"A\": \"Floating tanks allow disabled animals to swim for 6-8 hours daily, aiding their recovery.\"\n    },\n    {\n        \"Q\": \"Why should milk animals be milked regularly in case of disability?\",\n        \"A\": \"To prevent the development of mastitis in milk animals.\"\n    },\n    {\n        \"Q\": \"What should be included in an evacuation kit for emergency situations in gaushalas?\",\n        \"A\": \"The kit should include handling equipment, water, feed, buckets, medications, sanitation tools, first aid kit, power generators, and communication devices.\"\n    },\n    {\n        \"Q\": \"Why should cows be housed in a loose system of housing during emergencies?\",\n        \"A\": \"Loose housing allows cows to escape to safety during emergencies like floods or fires, whereas tethered cows are at greater risk.\"\n    },\n    {\n        \"Q\": \"What precautions should be taken when setting up gaushalas in flood-prone areas?\",\n        \"A\": \"Gaushalas should not be set up in poorly drained or low-lying areas to avoid risks during floods.\"\n    },\n    {\n        \"Q\": \"What should be done to prepare animals for evacuation during emergencies?\",\n        \"A\": \"Animals should be trained to be loaded and transported, and evacuation sites and routes should be prearranged.\"\n    },\n    {\n        \"Q\": \"How often should a disabled animal be assessed for improvement?\",\n        \"A\": \"The animal should be assessed every 2-4 hours for signs of improvement.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What should be assessed to ensure a safe environment for animals in gaushalas?\",\n    \"A\": \"The stability and safety of cow sheds and other structures should be assessed.\"\n  },\n  {\n    \"Q\": \"What steps should be taken to remove hazards in animal holding locations?\",\n    \"A\": \"Dead trees or debris should be removed, and loose equipment or materials like feed troughs should be secured.\"\n  },\n  {\n    \"Q\": \"What is the aim of first aid for injured or disabled animals in gaushalas?\",\n    \"A\": \"The aim is to alleviate suffering, preserve life, promote recovery, and prevent aggravation of the condition until specialized treatment is available.\"\n  },\n  {\n    \"Q\": \"What are some common accidents that cows are prone to in gaushalas?\",\n    \"A\": \"Cows are prone to injuries, fractures, poisoning, obstetrical troubles, burns, and scalds.\"\n  },\n  {\n    \"Q\": \"What items should be included in a first aid kit for gaushalas?\",\n    \"A\": \"Items like cotton wool, bandages, surgical gauze, surgical scissors, disinfectants, thermometers, antibiotic eye drops, obstetric ropes, tincture iodine, and splints should be included.\"\n  },\n  {\n    \"Q\": \"What is the purpose of disinfectants in the first aid kit?\",\n    \"A\": \"Disinfectants like potassium permanganate and Dettol are used to prevent infections in wounds.\"\n  },\n  {\n    \"Q\": \"How many cows can one worker manage on average in a gaushala?\",\n    \"A\": \"On average, one worker can manage routine activities for 10-15 cows along with their followers, excluding fodder harvesting.\"\n  },\n  {\n    \"Q\": \"What specialized jobs require trained workers in gaushalas?\",\n    \"A\": \"Specialized jobs include artificial insemination (AI), first aid, animal identification, and deworming.\"\n  },\n  {\n    \"Q\": \"What technical manpower is required in large gaushalas?\",\n    \"A\": \"Large gaushalas require technically qualified persons like farm managers, veterinarians, stockmen, and ministerial staff.\"\n  },\n  {\n    \"Q\": \"What routine activities require experienced workers in gaushalas?\",\n    \"A\": \"Routine activities like milking, heat detection, and care of down-calvers and neonates require experienced workers.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the role of a Gaushala Manager-cum-Veterinary Officer in gaushalas?\",\n    \"A\": \"The Gaushala Manager-cum-Veterinary Officer oversees the management of gaushala animals and veterinary care.\"\n  },\n  {\n    \"Q\": \"How many unskilled workers are required for a gaushala with 100 cows?\",\n    \"A\": \"A gaushala with 100 cows requires 8 unskilled workers.\"\n  },\n  {\n    \"Q\": \"What is the training duration for the Gaushala Manager-cum-Veterinary Officer and Veterinary Stock Assistants?\",\n    \"A\": \"The training duration is 2 weeks.\"\n  },\n  {\n    \"Q\": \"Where can the training for gaushala staff be conducted?\",\n    \"A\": \"Training can be conducted at NDRI, Karnal, or any nearby Veterinary and Animal Husbandry University.\"\n  },\n  {\n    \"Q\": \"How many Veterinary Stock Assistants-cum-Supervisors are needed for a gaushala with 1000 cows?\",\n    \"A\": \"A gaushala with 1000 cows requires 3 Veterinary Stock Assistants-cum-Supervisors.\"\n  },\n  {\n    \"Q\": \"What is the total number of staff required for a gaushala with 500 cows?\",\n    \"A\": \"A gaushala with 500 cows requires a total of 36 staff members.\"\n  },\n  {\n    \"Q\": \"What type of technicians are required in gaushalas?\",\n    \"A\": \"Technicians for mechanical, plumbing, and electrical works are required in gaushalas.\"\n  },\n  {\n    \"Q\": \"How many drivers are required for a gaushala with 1000 cows?\",\n    \"A\": \"A gaushala with 1000 cows requires 2 drivers.\"\n  },\n  {\n    \"Q\": \"What is the purpose of the ICAR guidelines mentioned in the text?\",\n    \"A\": \"The ICAR guidelines are for promoting the ICAR brand and providing internal operational rules.\"\n  },\n  {\n    \"Q\": \"Who published the manual on the management of gaushalas?\",\n    \"A\": \"The manual on the management of gaushalas was published by the Indian Council of Agricultural Research (ICAR).\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the main focus of ICAR's efforts mentioned in the text?\",\n    \"A\": \"The main focus is on promoting animal breeds, resource conservation, sustainable production technologies, and taking them to farmers' fields through frontline demonstrations.\"\n  },\n  {\n    \"Q\": \"Why is branding important for ICAR?\",\n    \"A\": \"Branding is important to increase visibility, gain stakeholders' attention, and provide a feel-good experience when interacting with the ICAR brand.\"\n  },\n  {\n    \"Q\": \"What does the publication 'ICAR Guidelines for Promoting Brand ICAR' aim to achieve?\",\n    \"A\": \"It aims to provide details and modalities to enhance the brand value of ICAR and its technologies globally.\"\n  },\n  {\n    \"Q\": \"What are the two major factors contributing to the pride of any organization, as mentioned in the text?\",\n    \"A\": \"Visibility and credibility are the two major factors.\"\n  },\n  {\n    \"Q\": \"What has ICAR become globally renowned for?\",\n    \"A\": \"ICAR is globally renowned for agricultural technologies that enhance agricultural productivity.\"\n  },\n  {\n    \"Q\": \"Why is having one unified brand 'ICAR' considered beneficial?\",\n    \"A\": \"A unified brand helps spread developed technologies and human resources to a wider geographical area and reach clients with more confidence.\"\n  },\n  {\n    \"Q\": \"What is the potential benefit of consolidating ICAR’s branding efforts?\",\n    \"A\": \"Consolidating branding efforts can improve visibility and credibility on a larger platform.\"\n  },\n  {\n    \"Q\": \"What should ICAR’s technologies, protocols, and methodologies achieve in their respective markets?\",\n    \"A\": \"They should stand out in their respective markets or ecosystems.\"\n  },\n  {\n    \"Q\": \"How can successful endeavours by ICAR’s constituent bodies benefit others?\",\n    \"A\": \"Successful endeavours can serve as examples for other functionaries, helping to build visibility and credibility on a larger scale.\"\n  },\n  {\n    \"Q\": \"What issue is addressed by creating consolidated guidelines for ICAR branding?\",\n    \"A\": \"The issue of having different guidelines and formats issued at different times and contexts is addressed by creating consolidated guidelines.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What prompted the creation of the document for promoting Brand ICAR?\",\n    \"A\": \"The need to address issues related to the organization, its personnel, and their interaction with the world, as well as to establish 'Brand ICAR'.\"\n  },\n  {\n    \"Q\": \"What are some of the issues addressed in the document for promoting Brand ICAR?\",\n    \"A\": \"Issues such as interaction with media, effective utilization of spaces, dealing with stakeholders and the public, and contracting and outsourcing certain activities.\"\n  },\n  {\n    \"Q\": \"What are the key objectives of the document for promoting Brand ICAR?\",\n    \"A\": \"To raise the visibility, marketability, feel-good factors, belongingness, and overall impression of ICAR.\"\n  },\n  {\n    \"Q\": \"When was the document for promoting Brand ICAR approved?\",\n    \"A\": \"The document was approved by the ICAR’s Governing Body on 29th June, 2020.\"\n  },\n  {\n    \"Q\": \"What are the four levels at which Brand ICAR can be promoted?\",\n    \"A\": \"The four levels are Individual, Institute, Organisation (ICAR), and Third Party.\"\n  },\n  {\n    \"Q\": \"What are some individual-level branding efforts suggested for ICAR?\",\n    \"A\": \"Individual-level branding efforts include ID cards, visiting cards, letterheads, personal items (caps, neckties, T-shirts, tie-pins, lapel pins), and email signatures.\"\n  },\n  {\n    \"Q\": \"What are some institute-level branding efforts suggested for ICAR?\",\n    \"A\": \"Institute-level efforts include websites, building façades, boundary walls, displays, hoardings, media activities, goodies, products, carry bags, packaging materials, and stickers.\"\n  },\n  {\n    \"Q\": \"What are some organizational-level branding efforts suggested for ICAR?\",\n    \"A\": \"Organizational-level efforts include print and social media presence, advertisements, and participation in national-level programs.\"\n  },\n  {\n    \"Q\": \"What is the role of third parties in promoting Brand ICAR?\",\n    \"A\": \"Third parties, such as technology licensees, are involved in promoting Brand ICAR through external collaborations.\"\n  },\n  {\n    \"Q\": \"What annexures are included in the document for promoting Brand ICAR?\",\n    \"A\": \"Annexures include governing body approval, specifications for ID and visiting cards, letterheads, terms of reference for media specialists, guidelines for ICAR logo usage, and participation in exhibitions and Kisan Melas.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What must all ICAR employees carry during office time and official engagements?\",\n        \"A\": \"All ICAR employees must compulsorily carry their identity card during office time and official engagements.\"\n    },\n    {\n        \"Q\": \"What email account should ICAR employees use for official communications?\",\n        \"A\": \"ICAR employees should use their ICAR email account for all official communications.\"\n    },\n    {\n        \"Q\": \"What is encouraged for ICAR employees while representing ICAR or their institute?\",\n        \"A\": \"ICAR employees are encouraged to use ICAR ties, scarves, and/or lapel pins while representing ICAR or their institute.\"\n    },\n    {\n        \"Q\": \"What must be uniform in the identity cards of ICAR employees?\",\n        \"A\": \"The identity cards of ICAR employees must have a uniform basic design as per the guidelines in Annexure II.\"\n    },\n    {\n        \"Q\": \"What should be included on the visiting cards of ICAR officials?\",\n        \"A\": \"The visiting cards of ICAR officials must include the ICAR server-based email address and adhere to specifications in Annexure III.\"\n    },\n    {\n        \"Q\": \"What should be included on the letterheads used by ICAR scientists and officers?\",\n        \"A\": \"The letterheads must include the ICAR server-based email address and follow the specifications in Annexure IV, including the same color scheme.\"\n    },\n    {\n        \"Q\": \"What digital facility must every ICAR institute or KVK have?\",\n        \"A\": \"Every ICAR institute or KVK must have an Agricultural Technology Information Center (ATIC) with adequate digital display facilities.\"\n    },\n    {\n        \"Q\": \"How often should ICAR institutes update their social media accounts?\",\n        \"A\": \"ICAR institutes should update their social media accounts at least weekly and send updates to the ICAR Social Media Coordinator at ICAR HQ.\"\n    },\n    {\n        \"Q\": \"What should ICAR institutes declare on their website and official letterheads?\",\n        \"A\": \"ICAR institutes must declare their verified official social media accounts on their website and official letterheads.\"\n    },\n    {\n        \"Q\": \"What language(s) should press notes for institutional events be released in?\",\n        \"A\": \"Press notes for institutional events should be released in English, Hindi, and other regional languages, as appropriate.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What should be done before sharing content with the media?\",\n    \"A\": \"Any content going to the media should be approved by the Director.\"\n  },\n  {\n    \"Q\": \"What attire is recommended for ICAR employees during media interactions?\",\n    \"A\": \"ICAR employees are encouraged to wear an ICAR necktie and/or lapel pin during planned media programmes.\"\n  },\n  {\n    \"Q\": \"Where should media interactions preferably take place?\",\n    \"A\": \"Media interactions should preferably take place where the ICAR logo is clearly visible in the background.\"\n  },\n  {\n    \"Q\": \"What should be included on nameplates and entrance boards of ICAR facilities?\",\n    \"A\": \"Nameplates and entrance boards should have the ICAR logo, with the institute logo being optional.\"\n  },\n  {\n    \"Q\": \"How often should Institute-Industry or business meets be conducted?\",\n    \"A\": \"Institute-Industry or business meets should be conducted at least twice a year.\"\n  },\n  {\n    \"Q\": \"What activities can promote public engagement with ICAR institutes?\",\n    \"A\": \"Activities like open days, conducted tours for school/college students, and tourism-related tours can promote public engagement.\"\n  },\n  {\n    \"Q\": \"How can institutes showcase their scientific efforts to citizens?\",\n    \"A\": \"Institutes can observe open days to let citizens experience labs and advanced science, showcasing their efforts.\"\n  },\n  {\n    \"Q\": \"What is the guideline for tours of ICAR institutes from a tourism perspective?\",\n    \"A\": \"Conducted tours can be arranged on holidays, but over-engagement of staff and exposure to sensitive areas should be avoided.\"\n  },\n  {\n    \"Q\": \"What events should deemed universities under ICAR organize annually?\",\n    \"A\": \"Deemed universities should annually organize alumni meets to promote the ICAR brand.\"\n  },\n  {\n    \"Q\": \"What is the suggested format for nameplates on room doors in ICAR institutes?\",\n    \"A\": \"Nameplates should follow a similar format, including color scheme, size, font, and the ICAR logo.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What compliance should an Institute's website adhere to?\",\n    \"A\": \"An Institute's website should be GIGW compliant and have appropriate security certification.\"\n  },\n  {\n    \"Q\": \"Where is it recommended to host an Institute's website?\",\n    \"A\": \"It is recommended to host the website on the ICAR data centre.\"\n  },\n  {\n    \"Q\": \"What should be done if the website is not hosted on the ICAR data centre?\",\n    \"A\": \"Efforts should be made to switch the website to the ICAR server at the earliest.\"\n  },\n  {\n    \"Q\": \"How often should an Institute's website be updated?\",\n    \"A\": \"The website should be updated frequently with new achievements, events, and other important news as soon as they happen.\"\n  },\n  {\n    \"Q\": \"Who should audit and approve the content of an Institute's website?\",\n    \"A\": \"The content should be audited and approved by a competent authority designated by the Director of the Institute.\"\n  },\n  {\n    \"Q\": \"What format should the Tab(meta) title of all websites follow?\",\n    \"A\": \"The Tab(meta) title should include the institute name in the format 'ICAR- Institute Name'.\"\n  },\n  {\n    \"Q\": \"What should be used as the FAVICON for all websites?\",\n    \"A\": \"The FAVICON for all websites should be the ICAR logo.\"\n  },\n  {\n    \"Q\": \"What are some potential spaces for promoting the ICAR brand?\",\n    \"A\": \"Potential spaces include building facades, fences, boundary walls, farm/field facing roads, cross roads, public thoroughfare, entrance gates, and official vehicles.\"\n  },\n  {\n    \"Q\": \"What should be displayed at prominent offices and places of ICAR institutes?\",\n    \"A\": \"The ICAR logo should be displayed prominently, and the institute logo may also be displayed without compromising the prominence of the ICAR logo.\"\n  },\n  {\n    \"Q\": \"What features should group photograph backdrops have at ICAR institutes?\",\n    \"A\": \"Group photograph backdrops should be designed to suit the institute theme with the ICAR logo prominently displayed.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"Where should the name of the institute be displayed?\",\n    \"A\": \"The name of the institute should be displayed prominently near the main gate in Hindi, English, and the local language, with appropriate illumination for visibility at night.\"\n  },\n  {\n    \"Q\": \"What should be provided near the gate for flexi banners?\",\n    \"A\": \"An earmarked area near the gate should be reserved for flexi banners with decent-looking frames or hooks, and the size of the flexis should be uniform.\"\n  },\n  {\n    \"Q\": \"How should walls emerging from the entrance be used?\",\n    \"A\": \"Walls emerging from the entrance should showcase the institute's salient achievements, such as technology development, farmers' engagement, success stories, and government initiatives, mostly in a pictorial format with proper illumination.\"\n  },\n  {\n    \"Q\": \"What are the conditions for commercial advertisements on boundary walls?\",\n    \"A\": \"Conditions include ensuring proper and authentic information, adding disclaimers on business proposals, approving advertisement content beforehand, matching ad paintings with the institute's base paint, and repainting with the base color after the contract period.\"\n  },\n  {\n    \"Q\": \"Who should be given preference for advertisements on boundary walls?\",\n    \"A\": \"Preference should be given to licensees, incubators, supported start-ups, related entrepreneurs, and the local industry that align with the institute's mandate.\"\n  },\n  {\n    \"Q\": \"What should be considered for hoardings on the roadside inside the boundary?\",\n    \"A\": \"Hoardings can include LED/LCD panels visible in daylight, boards for painting or flexi banners, and they should showcase institutional achievements and technologies with preferred illumination.\"\n  },\n  {\n    \"Q\": \"What type of signage can be used on rooftops?\",\n    \"A\": \"Rooftops can have LED/LCD/glow signage or illuminated painted hoardings, but only for non-commercial use and in accordance with local laws.\"\n  },\n  {\n    \"Q\": \"What guidelines are provided for road signage?\",\n    \"A\": \"Road signage should be placed near airports, railway stations, or within a 1 km vicinity of the institute/KVK, with appropriate permission from local authorities.\"\n  },\n  {\n    \"Q\": \"What branding should be done on official ICAR vehicles?\",\n    \"A\": \"All official ICAR vehicles should have the ICAR logo conspicuously displayed.\"\n  },\n  {\n    \"Q\": \"What is recommended for the aesthetics of the institute's branding?\",\n    \"A\": \"A sober color scheme and format should be used to maintain the aesthetics of the institute's branding.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What should be displayed on either side of gates to promote ICAR?\",\n    \"A\": \"At least 50 meters on either side of gates should be used to display ICAR/institute technologies and government schemes.\"\n  },\n  {\n    \"Q\": \"What should be done to comply with election code of conduct?\",\n    \"A\": \"Faces/names of political leaders and party logos should be hidden during the election code of conduct.\"\n  },\n  {\n    \"Q\": \"How can professional artists or students contribute to promoting ICAR?\",\n    \"A\": \"Workshops can be conducted with professional artists or fine arts students to create artifacts or artwork.\"\n  },\n  {\n    \"Q\": \"What is the guideline regarding the language used on banners and hoardings?\",\n    \"A\": \"Content should follow the Official Language Rules of the Government of India and must include Hindi (Devnagari fonts), English, and the local language if applicable.\"\n  },\n  {\n    \"Q\": \"What is the suggested font size for banners to ensure best legibility at a 30-meter distance?\",\n    \"A\": \"For a 30-meter legibility distance, the suggested font size is 720 pt.\"\n  },\n  {\n    \"Q\": \"What are the guidelines for labeling edible products under ICAR branding?\",\n    \"A\": \"Edible products should have labels with content, weight, date of manufacture/packaging, 'best before' date, nutritional value, and warnings, following FSSAI guidelines.\"\n  },\n  {\n    \"Q\": \"What must be included on non-edible products under ICAR branding?\",\n    \"A\": \"Non-edible products must have the ICAR logo embossed, engraved, weaved, or printed, and statutory labeling guidelines must be followed.\"\n  },\n  {\n    \"Q\": \"What is discouraged in terms of aesthetics for ICAR branding?\",\n    \"A\": \"Individual decisions in terms of aesthetics are discouraged.\"\n  },\n  {\n    \"Q\": \"Why should re-advertisement by the same company and product be avoided?\",\n    \"A\": \"Re-advertisement by the same company and product should be avoided to ensure fairness and diversity in advertising.\"\n  },\n  {\n    \"Q\": \"What should be avoided while interacting with media regarding ICAR activities?\",\n    \"A\": \"Negative comments about institutional activities and making all scientists spokespersons should be avoided.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is prohibited regarding the resale or redistribution of ICAR research products?\",\n    \"A\": \"Resale or redistribution of ICAR research products distributed for limited promotion and consumer response is prohibited.\"\n  },\n  {\n    \"Q\": \"What types of goodies can ICAR institutes produce for personal use?\",\n    \"A\": \"ICAR institutes can produce caps, T-shirts, neck ties, scarves, cups/mugs, souvenirs, pens, and key chains.\"\n  },\n  {\n    \"Q\": \"What material is recommended for ICAR goodies and souvenirs?\",\n    \"A\": \"As far as possible, ICAR goodies and souvenirs should be made of natural or biodegradable materials.\"\n  },\n  {\n    \"Q\": \"What must be displayed on all ICAR goodies, souvenirs, and gifts?\",\n    \"A\": \"The ICAR logo must be conspicuously displayed on all ICAR goodies, souvenirs, and gifts.\"\n  },\n  {\n    \"Q\": \"What is the guideline regarding the use of plastic in ICAR souvenirs?\",\n    \"A\": \"As far as possible, ICAR souvenirs should not be made of plastic.\"\n  },\n  {\n    \"Q\": \"What is suggested for promoting the ICAR brand during state-level Republic Day parades?\",\n    \"A\": \"ICAR institutes should participate in Republic Day parades at state capitals by displaying a tableau.\"\n  },\n  {\n    \"Q\": \"What is recommended for the design of ICAR souvenirs and products?\",\n    \"A\": \"ICAR institutes should engage professional agencies for the aesthetic design of souvenirs, goodies, and other products.\"\n  },\n  {\n    \"Q\": \"What information should be displayed on the ICAR website and documents?\",\n    \"A\": \"Information about certified official media accounts should be displayed on the ICAR website and relevant organizational documents.\"\n  },\n  {\n    \"Q\": \"What types of items can ICAR institutes produce for distribution among stakeholders?\",\n    \"A\": \"ICAR institutes can produce diaries, pocket diaries, slip pads, file covers, calendars, caps, neck-ties, lapel pins, pens, brooches, and scarves for distribution among stakeholders.\"\n  },\n  {\n    \"Q\": \"What is ICAR's plan for promoting agri-tourism?\",\n    \"A\": \"ICAR plans to promote agri-tourism by creating a calendar of events like harvesting, planting, plucking, fish harvesting, animal rides, and farm trailing at institutes in tourist-interest locations.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is suggested for promoting ICAR internationally?\",\n        \"A\": \"Participation in international exhibitions, presentations by ICAR employees during official assignments, and wearing ICAR-branded items during international events.\"\n    },\n    {\n        \"Q\": \"How should ICAR technologies and achievements be promoted for mass outreach?\",\n        \"A\": \"ICAR technologies and achievements should be promoted through the DD-Kisan platform and other TV channels, as per expenditure guidelines.\"\n    },\n    {\n        \"Q\": \"What is recommended for ICAR institutes regarding accreditation?\",\n        \"A\": \"ICAR should ensure at least one laboratory in every institute is accredited by agencies like NABL, BIS, FSSAI, MOFPI, or DOAC.\"\n    },\n    {\n        \"Q\": \"What should ICAR institutes and headquarters ensure regarding ISO certification?\",\n        \"A\": \"ICAR institutes and headquarters should have ISO certification, and it should be renewed at the appropriate time.\"\n    },\n    {\n        \"Q\": \"Who is designated as the Link Officer for media activities at ICAR level?\",\n        \"A\": \"The PD, DKMA is designated as the Link Officer for all media activities at the ICAR level.\"\n    },\n    {\n        \"Q\": \"What is recommended for the museum/display centers at ICAR and its institutes?\",\n        \"A\": \"The museum/display centers should be in presentable condition with the ICAR logo displayed prominently and a media address point with a suitable backdrop.\"\n    },\n    {\n        \"Q\": \"What should be played before any important ICAR meeting?\",\n        \"A\": \"The ICAR song, with subtitles in English and regional languages, should be played before any important meeting.\"\n    },\n    {\n        \"Q\": \"Who can be selected as ICAR brand ambassadors?\",\n        \"A\": \"Philanthropic brand ambassadors, mentors, farmers, agri-innovators, entrepreneurs, students, and alumni can be selected as ICAR brand ambassadors for about two years.\"\n    },\n    {\n        \"Q\": \"What uniform requirement is suggested for drivers of ICAR staff cars?\",\n        \"A\": \"Drivers of ICAR staff cars should wear uniforms with the ICAR logo on the front pocket of their shirts while on duty.\"\n    },\n    {\n        \"Q\": \"What should third-party beneficiaries of ICAR support be encouraged to do?\",\n        \"A\": \"Third-party beneficiaries, such as licensees, startups, and educational institutes, should be encouraged to use the ICAR logo on their banners, publications, websites, and extension materials.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"Who can use the ICAR and institute logos?\",\n        \"A\": \"IP beneficiaries, trainees, and stakeholders under MoU with ICAR or its constituent bodies can use ICAR and institute logos with prior permission.\"\n    },\n    {\n        \"Q\": \"What is the limitation for using ICAR logos?\",\n        \"A\": \"The usage is limited to the product, service, reports, technology, license, event, or software availed from ICAR or its constituent body.\"\n    },\n    {\n        \"Q\": \"Who is authorized to grant permission for using ICAR logos at the institute level?\",\n        \"A\": \"Directors of ICAR institutes, bureaus, directorates, centers, and the CEO of Agrinnovate India Ltd. are authorized to grant permissions.\"\n    },\n    {\n        \"Q\": \"Who has the ultimate authority to revoke or invoke permissions for logo usage?\",\n        \"A\": \"The Director General of ICAR is the ultimate competent authority for invoking or revoking permissions.\"\n    },\n    {\n        \"Q\": \"What must third parties ensure when using ICAR logos and names?\",\n        \"A\": \"Third parties must ensure that ICAR's name is not defamed and indemnify ICAR from any claims, loss, or damages caused by their actions.\"\n    },\n    {\n        \"Q\": \"What material should be used for ICAR personal visiting cards?\",\n        \"A\": \"Visiting cards should be made from 200 gsm card sheets or biodegradable materials with sufficient stiffness and printability. Plastic sheets should be avoided.\"\n    },\n    {\n        \"Q\": \"What is the size specification for ICAR personal visiting cards?\",\n        \"A\": \"The size of ICAR personal visiting cards should be 9.2 × 5.5 cm.\"\n    },\n    {\n        \"Q\": \"What features are specified for ICAR official letterheads?\",\n        \"A\": \"There are specific designs for ICAR Headquarters, ICAR-KVKs, and institutes, with variations for those having independent logos.\"\n    },\n    {\n        \"Q\": \"What is the purpose of empaneling press and media communication specialists for ICAR?\",\n        \"A\": \"The empanelment aims to improve publicity and dissemination of information for public benefit.\"\n    },\n    {\n        \"Q\": \"What must be included on the back of ICAR-designed materials like cards?\",\n        \"A\": \"The back of ICAR-designed materials should include a barcode or QR code.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the main goal of empanelling press and media communication specialists for ICAR?\",\n    \"A\": \"The goal is to enhance agricultural communication and awareness by disseminating ICAR achievements in non-scientific and easy-to-understand language.\"\n  },\n  {\n    \"Q\": \"What are the broad objectives of communication specialists for ICAR?\",\n    \"A\": \"The objectives include strengthening agricultural communication, collating information from ICAR resources, editing and designing content, and publishing agricultural research technologies across various media platforms.\"\n  },\n  {\n    \"Q\": \"What types of media platforms are used to disseminate ICAR achievements?\",\n    \"A\": \"Media platforms include print media, electronic media, and social media platforms such as Facebook, Twitter, and YouTube.\"\n  },\n  {\n    \"Q\": \"What are the main tasks of press and media communication specialists?\",\n    \"A\": \"The tasks include writing features on new technologies, editing and designing content, and publishing success stories and news items in various media formats.\"\n  },\n  {\n    \"Q\": \"How long will the empanelment of press and media communication specialists last?\",\n    \"A\": \"The empanelment will last for one year.\"\n  },\n  {\n    \"Q\": \"What are the deliverables expected from press and media communication specialists?\",\n    \"A\": \"Deliverables include publishing agricultural success stories, developing feature/news reports for newspapers, and disseminating ICAR technologies through various media platforms.\"\n  },\n  {\n    \"Q\": \"What outcomes are expected from the work of press and media communication specialists?\",\n    \"A\": \"Expected outcomes include enhanced visibility of ICAR technologies, regular coverage of agricultural issues, creation of a sustainable information flow system, and increased awareness among farmers about innovative technologies.\"\n  },\n  {\n    \"Q\": \"How will the performance of press and media communication specialists be monitored?\",\n    \"A\": \"A committee will monitor their performance on a quarterly basis.\"\n  },\n  {\n    \"Q\": \"What qualifications are required for press and media communication specialists?\",\n    \"A\": \"Essential qualifications include a Master’s degree in Mass Communication or a PG Diploma in Mass Communication.\"\n  },\n  {\n    \"Q\": \"What are the key responsibilities of press and media communication specialists?\",\n    \"A\": \"Responsibilities include writing features, editing and designing content, publishing success stories, and ensuring regular coverage of agricultural technologies in regional and national media.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the required educational qualification for a press and media communication specialist?\",\n    \"A\": \"A Master’s Degree in Journalism from a recognized university/institute is required.\"\n  },\n  {\n    \"Q\": \"What is the minimum experience required for a press and media communication specialist?\",\n    \"A\": \"At least 5 years’ experience in content writing/development for social/digital media in reputed press/media organizations.\"\n  },\n  {\n    \"Q\": \"What additional skills are desirable for the role of a press and media communication specialist?\",\n    \"A\": \"Excellent writing, editing, presentation, and communication skills in English, Hindi, and regional languages.\"\n  },\n  {\n    \"Q\": \"How are candidates selected for the position of press and media communication specialists?\",\n    \"A\": \"Candidates are selected through open advertisement as per GFR provisions and evaluated based on qualifications, experience, and interview performance.\"\n  },\n  {\n    \"Q\": \"How are marks for a Master’s Degree calculated in the selection process?\",\n    \"A\": \"Marks are calculated as (maximum marks assigned × % score) ÷ 100. For example, if a candidate secures 70%, the marks will be (20 × 70) ÷ 100 = 14.\"\n  },\n  {\n    \"Q\": \"What is the maximum number of marks assigned for experience in the selection criteria?\",\n    \"A\": \"A maximum of 30 marks is assigned for experience, with 5 marks for each year and 2.5 marks for half a year of experience.\"\n  },\n  {\n    \"Q\": \"What is the remuneration for content writers under this guideline?\",\n    \"A\": \"Content writers are paid Rs. 10,000 per article (3-6 pages), with a ceiling of Rs. 60,000 per month for six articles.\"\n  },\n  {\n    \"Q\": \"Is TA/DA provided for the role of press and media communication specialists?\",\n    \"A\": \"No, TA/DA is not provided for this role.\"\n  },\n  {\n    \"Q\": \"What does the ICAR logo symbolize?\",\n    \"A\": \"The ICAR logo symbolizes wheat in the growing stage and the encircling component represents the strength of research.\"\n  },\n  {\n    \"Q\": \"Where should the ICAR logo be used?\",\n    \"A\": \"The ICAR logo should be used in all official documents, posters, banners, extension materials, publications, websites, social media content, and other advertising and marketing materials.\"\n  }\n]\n```"
]