[
    "1. **Question:** Which states in India predominantly practice burning of crop residues?\n   **Answer:** The northern and central states of Punjab, Haryana, Uttar Pradesh, Rajasthan, and Madhya Pradesh predominantly practice burning of crop residues.\n\n2. **Question:** What is the purpose of the Central Sector Scheme on In-situ Crop Residue Management?\n   **Answer:** The purpose of the scheme is to reduce the incidents of crop residue burning.\n\n3. **Question:** How long has the Central Sector Scheme on In-situ Crop Residue Management been in operation?\n   **Answer:** The scheme has been in operation for the past three years.\n\n4. **Question:** What are some ex-situ crop residue management options mentioned in the text?\n   **Answer:** Some ex-situ crop residue management options include conversion of crop residue biomass into pellets, biogas production from paddy straw, production of compressed bio-gas from paddy straw, alcohol production from paddy straw, and composting of paddy straw.\n\n5. **Question:** What factors influence the choice of ex-situ crop residue management options?\n   **Answer:** The effectiveness and cost economics of the options influence the choice of ex-situ crop residue management.\n\n6. **Question:** Who constituted the committee to analyze ex-situ crop residue management options?\n   **Answer:** The committee was constituted by the Indian Council of Agricultural Research (ICAR).\n\n7. **Question:** What document is being prepared based on the committee's analysis of ex-situ crop residue management options?\n   **Answer:** A document entitled 'Ex-situ Crop Residue Management Options' is being prepared based on the committee's analysis.\n\n8. **Question:** Who expressed thanks to various officials and members for their support in drafting the recommendations?\n   **Answer:** The Committee on economic analysis of alternative/ex-situ options of crop residue management expressed thanks.\n\n9. **Question:** What is one of the benefits hoped for from the analysis in the document being prepared?\n   **Answer:** The analysis is hoped to support decision-making for appropriate alternative use of crop residues.\n\n10. **Question:** What is the role of Dr. Trilochan Mohapatra in relation to the ex-situ crop residue management initiative?\n    **Answer:** Dr. Trilochan Mohapatra is the Secretary of DARE and DG of ICAR, credited with formulating concepts and ideas for ex-situ management of crop residues and providing valuable inputs for the document.",
    "1. **Question:** Who is the Member Secretary of the Committee on Economic Analysis of Alternative / Ex-situ Crop Residue Management Options?\n   **Answer:** Dr. Kanchan Kumar Singh, Assistant Director General (Farm Engineering).\n\n2. **Question:** What is the primary reason for burning paddy straw in Punjab and Haryana?\n   **Answer:** It is primarily to clear the field after the harvest of the preceding crop for sowing the next crop.\n\n3. **Question:** What are some of the adverse effects of burning crop residues?\n   **Answer:** Burning results in emissions of gases such as CH4, CO, N2O, and NOx; loss of plant nutrients; deterioration of soil health; health hazards; air pollution; and loss of micro-biodiversity.\n\n4. **Question:** How many hectares are under rice-wheat rotation in Punjab and Haryana?\n   **Answer:** About 3.1 million hectares are under rice-wheat rotation.\n\n5. **Question:** What are the two classifications of Crop Residue Management Options?\n   **Answer:** Crop Residue Management Options can be classified as in-situ and ex-situ management.\n\n6. **Question:** What is one of the alternative uses of paddy straw mentioned in the report?\n   **Answer:** Biomass pellets from crop residues can be used as a fuel supplement in thermal power plants.\n\n7. **Question:** What is the role of Dr. K. Alagusundaram in the Committee?\n   **Answer:** Dr. K. Alagusundaram is the Deputy Director General (Engg.) of ICAR and serves as the Chairman of the Committee.\n\n8. **Question:** What is one method of biogas production discussed in the Committee's report?\n   **Answer:** Biogas production from paddy straw at the domestic or community level.\n\n9. **Question:** Which type of biomass is mentioned as a source for alcohol production in the report?\n   **Answer:** Lignocellulosic biomass, specifically from paddy straw.\n\n10. **Question:** What are the contents listed in the Committee's report?\n    **Answer:** The contents include an executive summary, introduction, various sections on biomass and biogas production, power generation, alcohol production, composting, recommendations, and references.",
    "1. **Question:** What are the two possible in-situ crop residue management options mentioned in the text?  \n   **Answer:** The two possible in-situ crop residue management options are retaining, incorporating, or mulching the crop residues in the field and decomposing using consortia of microbes.\n\n2. **Question:** Which states in India are included in the Central Sector Scheme for in-situ management of crop residue?  \n   **Answer:** The states included are Punjab, Haryana, Uttar Pradesh, and the National Capital Territory (NCT) of Delhi.\n\n3. **Question:** What was the budget allocated to the scheme for the years 2018-19 and 2019-2020?  \n   **Answer:** The budget allocated was ₹591.65 crore for 2018-19 and ₹560.15 crore for 2019-2020.\n\n4. **Question:** How much was the budget extended for the scheme in 2020-21?  \n   **Answer:** The budget extended for 2020-21 was ₹600 crores.\n\n5. **Question:** What alternative method for crop residue management is proposed for thermal power plants?  \n   **Answer:** Biomass pellets from crop residues are proposed as a fuel substitution in thermal power plants.\n\n6. **Question:** How much paddy straw would be consumed annually if all existing power plants in North India substitute their fuel with paddy straw-based pellets?  \n   **Answer:** They would consume 17.82 million tons of paddy straw every year.\n\n7. **Question:** What is the cost and lifespan of the PAU Model–II biogas plant mentioned in the text?  \n   **Answer:** The cost of the PAU Model–II biogas plant is ₹2.1 lakhs and its lifespan is 20 years.\n\n8. **Question:** What is the estimated budget required for one-time subsidy if one biogas plant per farm is established in Punjab?  \n   **Answer:** The estimated budget required for one-time subsidy will be ₹13,860 crores for nearly 1.1 million land holdings.\n\n9. **Question:** How many tons of paddy straw will 1.1 million biogas plants consume each year?  \n   **Answer:** The biogas plants will consume 5.28 million tons of paddy straw every year.\n\n10. **Question:** What is the cost of establishing a bio-CNG plant with a capacity of 5,600 kg per day?  \n   **Answer:** The cost of establishing one bio-CNG plant is ₹30.20 crores.",
    "1. **Question:** How much expenditure will the government incur for a 50% support on establishing 1,000 bio-CNG plants?\n   **Answer:** The government will incur an expenditure of ₹15,100 crores.\n\n2. **Question:** What is the annual consumption of paddy straw by 1,000 bio-CNG plants?\n   **Answer:** 1,000 bio-CNG plants will consume 11 million tons of paddy straw every year.\n\n3. **Question:** What is the cost of establishing one 18 MW biomass-based power generation unit?\n   **Answer:** The cost of establishing one 18 MW biomass-based power generation unit is ₹150 crores.\n\n4. **Question:** How much electricity will be produced annually by 1,000 biomass power generation units?\n   **Answer:** 1,000 biomass power generation units will produce 10,000 crore units of electricity per year.\n\n5. **Question:** What is the profit per plant per year if a 40% subsidy is applied to the cost of the biomass plant?\n   **Answer:** The profit per plant per year will be ₹29.80 crores.\n\n6. **Question:** How long will it take to reach breakeven for a biomass power generation unit with the given profit?\n   **Answer:** The breakeven will occur in 5 years.\n\n7. **Question:** What is the total paddy straw consumption by 1,000 biomass power generation units annually?\n   **Answer:** The total paddy straw consumed by 1,000 biomass power generation units will be 16.20 million tons per year.\n\n8. **Question:** Why is alcohol production from paddy straw not recommended for further consideration?\n   **Answer:** Alcohol production from paddy straw is not recommended because technical and commercial data on plant performances are not available, and India's experience is limited.\n\n9. **Question:** What is the estimated loss incurred from a plant producing alcohol from paddy straw?\n   **Answer:** The estimated loss incurred from such a plant will be ₹15,993 crores per year.\n\n10. **Question:** What are the environmental consequences of burning paddy straw in fields?\n    **Answer:** Burning paddy straw causes pollution problems, huge nutritional loss, physical health deterioration to the soil, and emission of harmful gases such as CH4, CO, N2O, and NO.",
    "1. **Question:** What percentage of nitrogen (N) is lost in the form of gaseous and particulate matters from crop residues?  \n   **Answer:** Approximately 80 to 90% of nitrogen (N) is lost from crop residues.\n\n2. **Question:** Which greenhouse gas is emitted in the highest percentage from crop residue burning?  \n   **Answer:** CO2 (carbon dioxide) is emitted in the highest percentage, accounting for about 70%.\n\n3. **Question:** How much particulate matter is released by burning one tonne of rice residue?  \n   **Answer:** Burning one tonne of rice residue releases 13 kg of particulate matter.\n\n4. **Question:** What is the estimated annual loss of carbon equivalent (in CO2-equivalent) due to burning 23 million tonnes of rice residues in North-West India?  \n   **Answer:** The estimated annual loss is about 34 million tonnes of CO2-equivalent.\n\n5. **Question:** What are the two major options for in-situ crop residue management?  \n   **Answer:** The two major options are retaining, incorporating, or mulching the crop residues in the field.\n\n6. **Question:** What was the budget allocated for the Central Sector Scheme on “Promotion of Agricultural Mechanization for In-situ Management of Crop Residue” for the years 2018-19?  \n   **Answer:** The budget allocated was ` 591.65 crore for the year 2018-19.\n\n7. **Question:** Which machine is specifically mentioned as being part of the financial assistance for straw management implements?  \n   **Answer:** The Super Straw Management System (Super SMS) is mentioned as part of the financial assistance for straw management implements.\n\n8. **Question:** By what percentage did crop residue burning events decrease in Punjab, Haryana, and Uttar Pradesh in 2019 compared to 2018?  \n   **Answer:** Crop residue burning events decreased by 18.8% in 2019 compared to 2018.\n\n9. **Question:** What health and environmental issues are caused by straw burning according to the text?  \n   **Answer:** Straw burning causes deterioration of soil physical health, health hazards, accidents, air pollution, emission of greenhouse gases, and loss of micro-biodiversity.\n\n10. **Question:** How many machines were delivered during the project period mentioned in the text?  \n    **Answer:** During the project period, 1.53 lakh machines were delivered.",
    "1. **Question:** How many Custom Hiring Centres (CHCs) were established for small and marginal farmers in the region?  \n   **Answer:** About 28,730 Custom Hiring Centres (CHCs) were established in the region.\n\n2. **Question:** Which state received the highest number of deliveries among Punjab, Haryana, Uttar Pradesh, and NCT Delhi?  \n   **Answer:** Punjab farmers received the highest number of deliveries, with 68,762.\n\n3. **Question:** What was the percentage decline in paddy area burnt in Punjab from 2017 to 2019?  \n   **Answer:** There was a 23.3% decline in the paddy area burnt in Punjab from 2017 to 2019.\n\n4. **Question:** What was the estimated reduction in Green House Gases (GHGs) emitted from paddy residue burning in 2019 compared to 2017?  \n   **Answer:** The estimated reduction in GHGs was from 28 million tonnes in 2017 to 19.7 million tonnes in 2019, which is a 29.6% decrease.\n\n5. **Question:** What percentage of Nitrogen can be saved by continuously adopting in-situ methods of straw management?  \n   **Answer:** Continuous adoption of in-situ methods of straw management can result in a saving of 30 to 35% Nitrogen.\n\n6. **Question:** What is one method being tested for decomposing paddy straw residues?  \n   **Answer:** Decomposing using consortia of microbes developed by various institutes is one method being tested.\n\n7. **Question:** What are some of the options discussed for ex-situ crop residue management?  \n   **Answer:** Options include biomass pellets as fuel, biogas production, industrial biogas production, power generation from biomass, alcohol production, and ex-situ composting.\n\n8. **Question:** How many tonnes of particulate matters were emitted during 2018 from paddy residue burning?  \n   **Answer:** The emission during 2018 was estimated at 23 million tonnes.\n\n9. **Question:** Who constituted the committee for economic analysis of alternative ex-situ options for crop residue management?  \n   **Answer:** The committee was constituted by the Secretary, DARE and Director General, ICAR.\n\n10. **Question:** What is one key benefit of continuously adopting in-situ straw management besides saving nutrients?  \n    **Answer:** It helps in restoring microbial activities in the soil.",
    "1. **Question:** What are the environmental benefits of using crop residues as fuel for power generation?\n   **Answer:** Using crop residues as fuel for power generation discourages in-field crop residue burning, abates air pollution, and reduces the carbon footprint of coal-based power plants.\n\n2. **Question:** What does the Government of India allow regarding ethanol production?\n   **Answer:** The Government of India allows the procurement of ethanol produced from non-food feedstock cellulose and lignocellulosic materials, in addition to molasses, provided it meets the relevant BIS standards.\n\n3. **Question:** Why are biomass pellets preferred in thermal power plants?\n   **Answer:** Biomass pellets are preferred in thermal power plants due to their small diameter and size, good binding strength, and ease of burning alongside coal.\n\n4. **Question:** What is the typical size range for biomass pellets?\n   **Answer:** Biomass pellets typically have a cylindrical shape and measure about 6-25 mm in diameter and 3-50 mm in length.\n\n5. **Question:** What is the recommended particle size for biomass before feeding it into pellet mills?\n   **Answer:** The biomass should be reduced to small particles of no more than 3 mm in size before being fed into pellet mills.\n\n6. **Question:** What types of equipment are available for pellet-making?\n   **Answer:** Pellet-making equipment is available in various sizes and scales, allowing for manufacture at both domestic and industrial levels.\n\n7. **Question:** What role do binders play in the pelletizing process?\n   **Answer:** Binders or lubricants can be added to produce higher quality pellets by increasing their density and durability.\n\n8. **Question:** What are some examples of binders used in making biomass pellets from crop residues?\n   **Answer:** Commonly used binders for biomass pellets from crop residues include distillers' dry grains and potato starch.\n\n9. **Question:** What happens to the pellets due to the friction generated in the die during pelletizing?\n   **Answer:** The friction generated in the die develops excess heat, causing the pellets to become soft and hot, reaching temperatures of about 70 to 90°C.\n\n10. **Question:** Why might agricultural residues require additional stabilizing agents during pelletizing?\n    **Answer:** Agricultural residues do not contain much resins or lignin, which are natural binding agents, so stabilizing agents need to be added to improve pellet quality.",
    "1. **Question:** What is the cost range for commercially available biomass pellets?  \n   **Answer:** The cost of commercially available biomass pellets is ₹9,000-10,000 per tonne.\n\n2. **Question:** What is the total installed capacity of coal-based thermal power plants in North India?  \n   **Answer:** The total installed capacity of coal-based thermal power plants in North India is 44,560 MW.\n\n3. **Question:** What is the recommended percentage of biomass pellet substitution with coal in thermal power plants?  \n   **Answer:** The recommended biomass-based pellet substitution in thermal power plants is 10% with coal.\n\n4. **Question:** How much coal is consumed in power plants per MW of power per year at an 85% Plant Load Factor (PLF)?  \n   **Answer:** The coal consumption in power plants is approximately 4,000 tonnes per MW of power per year at 85% PLF.\n\n5. **Question:** What is the cost of biomass pellets at the plant site, including production and transport costs?  \n   **Answer:** The cost of biomass pellets at the plant site is approximately ₹10 per kg.\n\n6. **Question:** What is the approximate cost of coal at the plant site?  \n   **Answer:** The cost of coal at the plant site is approximately ₹6 per kg.\n\n7. **Question:** What is the increase in operating cost of power generation due to a 10% substitution of biomass pellets with coal?  \n   **Answer:** The increase in operating cost of power generation due to the substitution of 10% pellets with coal will be 6.7%.\n\n8. **Question:** By how much does the cost of production increase per unit (kWh) of power due to the addition of crop residue-based biomass pellets?  \n   **Answer:** The cost of production will increase by ₹0.20 per unit (kWh) of power.\n\n9. **Question:** What is the paddy straw consumption for the total installed capacity of 44,560 MW?  \n   **Answer:** The paddy straw consumption for 44,560 MW capacity is 17.82 million tons per year.\n\n10. **Question:** What is the process used for biogas production from paddy straw?  \n    **Answer:** Paddy straw can be digested by anaerobic means for the production of biogas, which involves the semi-dry fermentation of organic wastes in an anaerobic digester.",
    "1. **Question:** What type of plant has the PAU Ludhiana centre developed for biogas production from paddy straw?  \n   **Answer:** The PAU Ludhiana centre has developed a biogas plant designed specifically for paddy straw-based biogas production.\n\n2. **Question:** How does the PAU biogas plant handle the anaerobic digestion of paddy straw?  \n   **Answer:** The PAU biogas plant uses a masonry structure as a digester to facilitate the anaerobic digestion of paddy straw, which cannot be done using conventional anaerobic processes due to the floating characteristics of the straw.\n\n3. **Question:** What is the diameter and height of the digester in the PAU biogas plant?  \n   **Answer:** The digester has a diameter of about 3.0 meters and a height of 2.7 meters.\n\n4. **Question:** How much paddy straw and cow dung can each batch of the biogas plant hold?  \n   **Answer:** Each batch can hold 1.60 tonnes of paddy straw and 0.40 tonnes of cow dung.\n\n5. **Question:** What is the estimated cost of the biogas plant designed for handling 1.6 tonnes of paddy straw?  \n   **Answer:** The estimated cost of the biogas plant is ₹1.2 lakhs.\n\n6. **Question:** How much biogas can the PAU biogas plant produce per day?  \n   **Answer:** The plant can produce about 3 to 4 m³ of biogas per day.\n\n7. **Question:** For how long does each batch of biomass produce biogas after activation?  \n   **Answer:** Each batch produces biogas for a period of about 3 months after loading and activation.\n\n8. **Question:** How many biogas plants have been installed in Punjab, and how are they performing?  \n   **Answer:** Six biogas plants have been installed in Punjab, and all of them are working very well.\n\n9. **Question:** What is the total yielding life of the PAU Model – I biogas plant?  \n   **Answer:** The total yielding life of the PAU Model – I biogas plant is 20 years.\n\n10. **Question:** How often can batches be loaded into the biogas plant in a year?  \n    **Answer:** In a year, 3 batches can be loaded into the biogas plant, allowing for biogas production for 9 months in total.",
    "1. **Question:** What is the cost of 1 kg of LPG as mentioned in the document?  \n   **Answer:** The cost of 1 kg of LPG is ` 56.34.\n\n2. **Question:** How much biogas does the PAU Model-I biogas plant produce per day?  \n   **Answer:** The PAU Model-I biogas plant produces 1.30 kg of LPG per day, which is equivalent to 3 m³ of biogas.\n\n3. **Question:** What are the total operational costs for running the PAU Model-I biogas plant per year?  \n   **Answer:** The total operational costs for the PAU Model-I biogas plant per year are ` 9,750.00.\n\n4. **Question:** What is the total fixed cost associated with the PAU Model-I biogas plant?  \n   **Answer:** The total fixed costs associated with the PAU Model-I biogas plant are ` 24,300.00.\n\n5. **Question:** What is the total cost (operational + fixed costs) for the PAU Model-I biogas plant?  \n   **Answer:** The total costs for the PAU Model-I biogas plant amount to ` 34,050.00.\n\n6. **Question:** How much is the net loss to the farmer when he invests 100% of the initial cost for the PAU Model-I biogas plant?  \n   **Answer:** The net loss to the farmer is ` -14,275.00.\n\n7. **Question:** At what subsidy rate does the farmer achieve the breakeven point for the PAU Model-I biogas plant?  \n   **Answer:** The farmer achieves the breakeven point when the subsidy rate is about 60% of the initial cost.\n\n8. **Question:** What is the installation cost of the PAU Model-II biogas plant?  \n   **Answer:** The installation cost of the PAU Model-II biogas plant is ` 2.10 lakhs.\n\n9. **Question:** What is the paddy straw holding capacity per batch for the PAU Model-II biogas plant?  \n   **Answer:** The paddy straw holding capacity per batch for the PAU Model-II biogas plant is 1.6 tonnes.\n\n10. **Question:** How long does each batch of the PAU Model-II biogas plant produce biogas?  \n    **Answer:** Each batch of the PAU Model-II biogas plant produces biogas for a period of 3 months.",
    "1. **Question:** What is the cost of the PAU Model – II biogas plant?  \n   **Answer:** The cost of the PAU Model – II biogas plant is `2.10 lakhs.\n\n2. **Question:** How much biogas does the PAU Model – II biogas plant produce per day?  \n   **Answer:** The PAU Model – II biogas plant produces 1.30 kg of biogas per day.\n\n3. **Question:** What is the price realized from biogas production annually?  \n   **Answer:** The price realized from biogas production annually is `19,775.00.\n\n4. **Question:** At what subsidy rate does a farmer break even on the investment in the PAU Model – II biogas plant?  \n   **Answer:** A farmer breaks even on the investment when the subsidy rate is about 57% of the initial cost.\n\n5. **Question:** What is the total annual cost (operational + fixed) for the PAU Model – II biogas plant?  \n   **Answer:** The total annual cost for the PAU Model – II biogas plant is `35,850.00.\n\n6. **Question:** How much paddy straw is consumed per biogas plant per year?  \n   **Answer:** Each biogas plant consumes 4.8 tonnes of paddy straw per year.\n\n7. **Question:** What is the estimated total subsidy required for 1.10 million units of biogas plants in Punjab at a 60% subsidy rate?  \n   **Answer:** The estimated total subsidy required is `13,860 crores.\n\n8. **Question:** What is the energy yield per tonne of paddy straw when converted to bio-methane?  \n   **Answer:** The estimated total energy yield per tonne of paddy straw when converted to bio-methane is 8.0 GJ.\n\n9. **Question:** How long is the lifespan of the PAU Model – II biogas plant?  \n   **Answer:** The lifespan of the PAU Model – II biogas plant is 20 years.\n\n10. **Question:** What is one of the environmental benefits of utilizing surplus crop residue like paddy straw for biogas production?  \n    **Answer:** One environmental benefit is the reduction of non-renewable LPG demand and a safer method of disposing of straw.",
    "1. **Question**: What is the primary use of raw biogas generated from paddy straw?\n   **Answer**: Raw biogas generated from paddy straw can be used for producing bio-CNG or bio-power (electricity).\n\n2. **Question**: What are the main steps involved in the production of bio-CNG?\n   **Answer**: The main steps involved in the production of bio-CNG include feedstock collection, segregation, pre-treatment, bio-methanation, biogas scrubbing, and compression & bottling of scrubbed biogas.\n\n3. **Question**: What percentage of methane is found in bio-CNG?\n   **Answer**: Bio-CNG comprises more than 90% methane.\n\n4. **Question**: What is the calorific value range of bio-CNG per kilogram?\n   **Answer**: The calorific value of bio-CNG ranges from 11,200 to 11,500 kcal per kg.\n\n5. **Question**: What is the biogas production potential of paddy straw?\n   **Answer**: The biogas production potential of paddy straw ranges from 250 to 300 m³ per tonne of straw.\n\n6. **Question**: How much CNG can be obtained from the biogas produced from paddy straw?\n   **Answer**: From the biogas produced from paddy straw, about 120 to 140 kg of CNG can be obtained.\n\n7. **Question**: What was the initiative taken by MNRE during the year 2008-09?\n   **Answer**: During the year 2008-09, MNRE initiated a technology demonstration on biogas bottling projects in entrepreneurial mode for Industrial Level Plants for the production of Biogas/Bio-CNG/Compressed Biogas (CBG) from paddy straw.\n\n8. **Question**: What organization is assigned for technical monitoring of biogas projects in India?\n   **Answer**: The Indian Institute of Technology (IIT), Delhi is assigned for technical monitoring and handholding of consultants/promoters for biogas projects.\n\n9. **Question**: What environmental benefit do biogas bottling plants provide?\n   **Answer**: Biogas bottling plants help mitigate climate change by preventing black carbon emissions from biomass chulha and avoiding methane emissions from untreated cattle dung and biomass wastes.\n\n10. **Question**: Which organization signed a Memorandum of Understanding (MoU) with Punjab Energy Development Agency for setting up CBG projects?\n    **Answer**: Indian Oil Corporation signed a MoU with Punjab Energy Development Agency (PEDA) for setting up 400 CBG projects.",
    "1. **Question:** What is the SATAT initiative launched by Oil PSUs?  \n   **Answer:** The SATAT initiative, launched on 1st October 2018, aims to establish 5000 CBG plants across the country to procure compressed biogas (CBG) from potential entrepreneurs, with an estimated production target of 15 MMT CBG per annum by 2023.\n\n2. **Question:** What is the price offered by Oil PSUs for CBG?  \n   **Answer:** Oil PSUs have offered a price of ₹46 per kg of CBG.\n\n3. **Question:** What is the purpose of the CBG procured under the SATAT initiative?  \n   **Answer:** The CBG procured will be supplied to the transport sector and industries through the channels of Oil PSUs.\n\n4. **Question:** Which companies are involved in the establishment of bio-CNG plants in Punjab?  \n   **Answer:** M/s Mahindra Waste to Energy Solutions Ltd. and the Government of Punjab have signed a MoU for setting up bio-CNG/CBG plants and organic fertiliser production from paddy straw.\n\n5. **Question:** What is the investment amount for the pilot projects related to paddy straw in Punjab?  \n   **Answer:** The investment for the pilot projects is ₹17 crore.\n\n6. **Question:** How much paddy straw is the Sampurn Agri-Venture Pvt. Ltd.'s biogas power generation plant currently utilizing per day?  \n   **Answer:** The plant is currently utilizing 10 tonnes of paddy straw per day.\n\n7. **Question:** What is the daily production capacity of biogas from the paddy straw at the plant in Punjab?  \n   **Answer:** The plant is producing 300 m³ of biogas per day from paddy straw.\n\n8. **Question:** What is the electricity generation capacity of the biogas generated from paddy straw?  \n   **Answer:** The biogas generated is used to produce electricity with a capacity of 1 MW.\n\n9. **Question:** How does the plant acquire paddy straw for biogas production?  \n   **Answer:** The plant buys paddy straw from vendors/aggregators who bring it in rectangular bales to the plant site.\n\n10. **Question:** What is the cost range for paddy straw bales at the plant site?  \n    **Answer:** The cost of the bales is around ₹1,500 to ₹2,000 per tonne, depending on the location from the collection point of straw.",
    "1. **Question:** What is the primary purpose of covering bales of paddy straw with waterproof sheets?  \n   **Answer:** The primary purpose is to prevent damage due to rain or condensing water particles.\n\n2. **Question:** What are the main components of the biogas plant as mentioned in the text?  \n   **Answer:** The main components are the Feed preparation unit, Substrate feeding unit, Biogas reactors, Hydrogen sulphide scrubbing unit, Power generation and grid feeding unit, and Bio-fertilizer preparation unit.\n\n3. **Question:** What is the daily paddy straw handling capacity of the biogas plant referenced in the text?  \n   **Answer:** The daily paddy straw handling capacity is 40 tonnes per day.\n\n4. **Question:** How much animal dung is required per day for the operation of the biogas plant?  \n   **Answer:** The plant requires 6 tonnes of animal dung per day for operation.\n\n5. **Question:** What is the installation cost of the biogas plant or Bio-CNG plant?  \n   **Answer:** The installation cost is ₹3,000 lakhs.\n\n6. **Question:** What is the total operational life of the biogas plant?  \n   **Answer:** The total operational life of the plant is 20 years.\n\n7. **Question:** How much biogas is produced daily by the biogas plant?  \n   **Answer:** The plant produces 12,000 m³ of biogas per day, which is equivalent to 5,600 kg of bio-CNG.\n\n8. **Question:** What is the price realized per kg of bio-CNG based on the text?  \n   **Answer:** The price realized is ₹46 per kg of bio-CNG.\n\n9. **Question:** What are the total operational costs for the bio-CNG plant per year?  \n   **Answer:** The total operational costs amount to ₹357.20 lakhs per year.\n\n10. **Question:** What is the depreciation cost included in the fixed costs for the biogas plant?  \n    **Answer:** The depreciation cost is ₹135.90 lakhs.",
    "1. **Question:** What is the total fixed cost for establishing a bio-CNG plant according to the provided content?  \n   **Answer:** The total fixed cost is 407.70 lakhs.\n\n2. **Question:** How much does it cost to establish one bio-CNG plant?  \n   **Answer:** The cost of one bio-CNG plant is 30 crores.\n\n3. **Question:** What is the daily bio-CNG production from one plant?  \n   **Answer:** The daily bio-CNG production from one plant is 5,600 kg.\n\n4. **Question:** How much paddy straw is consumed per day by one bio-CNG plant?  \n   **Answer:** One bio-CNG plant consumes 40 tonnes of paddy straw per day.\n\n5. **Question:** What is the selling price of bio-CNG per kilogram?  \n   **Answer:** The selling price of bio-CNG is 46 rupees per kg.\n\n6. **Question:** How many working days are there in a year for the bio-CNG plant?  \n   **Answer:** There are 275 working days in a year for the bio-CNG plant.\n\n7. **Question:** What is the total subsidy required for establishing 1,000 bio-CNG plants?  \n   **Answer:** The total subsidy required for 1,000 plants is 15,100 crores.\n\n8. **Question:** What is the annual net profit when 50% of the plant and machinery costs are subsidized by the government?  \n   **Answer:** The annual net profit when 50% of the costs are subsidized is 209.23 lakhs.\n\n9. **Question:** How much manure compost does one bio-CNG plant produce daily?  \n   **Answer:** One bio-CNG plant produces 45 tonnes of manure compost daily.\n\n10. **Question:** How much total paddy straw is consumed per unit per year?  \n    **Answer:** The total paddy straw consumed per unit per year is 11,000 tonnes.",
    "1. **Question:** What are the environmental advantages of biomass power projects compared to coal-based thermal power plants?\n   **Answer:** Biomass power projects are environmentally friendly due to relatively lower CO2 and particulate emissions and they displace fossil non-renewable fuels such as coal.\n\n2. **Question:** How does biomass power generation contribute to local economies?\n   **Answer:** Biomass power generation offers employment opportunities to locals and helps in local revenue generation and upliftment of the rural population.\n\n3. **Question:** What is the estimated electricity production capacity from biomass in Punjab?\n   **Answer:** Punjab has the potential to produce about 1000 MW of electricity from biomass/agro waste.\n\n4. **Question:** What are the challenges faced by biomass power plants in utilizing biomass to their full capacity?\n   **Answer:** The challenges include poor biomass supply chain during the season and year-round non-availability of biomass at affordable prices.\n\n5. **Question:** What solution is suggested for improving straw collection in biomass management?\n   **Answer:** The use of balers is encouraged for the collection of straw from the field to enhance the efficiency of straw management.\n\n6. **Question:** What is the total capacity of biomass power projects commissioned in Punjab by PEDA?\n   **Answer:** The total capacity of biomass power projects commissioned in Punjab by PEDA is 97.50 MW.\n\n7. **Question:** Which company operates a biomass power plant with a capacity of 18 MW in Faridkot?\n   **Answer:** Sukhbir Agro Energy Ltd. operates a biomass power plant with a capacity of 18 MW in Faridkot.\n\n8. **Question:** What was the operational capacity and year of commissioning for M/s. Universal Biomass Energy Pvt. Ltd. in Mukatsar?\n   **Answer:** M/s. Universal Biomass Energy Pvt. Ltd. has an operational capacity of 14.50 MW and was commissioned in October 2009.\n\n9. **Question:** Why is the collection of straw considered a major bottleneck in the straw management chain?\n   **Answer:** The collection of straw is a bottleneck because the time for collection is very limited, and there is a scarcity of manpower during this period.\n\n10. **Question:** How much paddy straw does M/s. Malwa Power Ltd. utilize per year, and when was it commissioned?\n    **Answer:** M/s. Malwa Power Ltd. utilizes 54,000 tonnes of paddy straw per year and was commissioned in May 2005.",
    "1. **Question:** What is the capacity of the paddy straw-based power generation project by M/s. Green Planet Energy?  \n   **Answer:** The capacity is 4.00 MW.\n\n2. **Question:** How much paddy straw will M/s. Sukhbir Agro Energy utilize per year?  \n   **Answer:** They will use 90,000 tonnes of paddy straw per year.\n\n3. **Question:** What is the total capacity of the paddy straw-based power generation projects mentioned in the text?  \n   **Answer:** The total capacity is 14.00 MW.\n\n4. **Question:** What is the price realized by selling electricity at the mentioned power generation plant?  \n   **Answer:** The price realized is 8,000.00 lakhs per year.\n\n5. **Question:** What are the total operational costs for the paddy straw-based power generation plant?  \n   **Answer:** The total operational costs are 3,670.00 lakhs per year.\n\n6. **Question:** What is the estimated net profit to the promoter when investing 100% in the plant and machinery?  \n   **Answer:** The estimated net profit is 2,080.00 lakhs.\n\n7. **Question:** How much ash is produced by the biomass-based power plant per day per MW?  \n   **Answer:** The plant produces about 4.5 tonnes of ash per day per MW.\n\n8. **Question:** What is the daily biomass consumption of the power plant per MW?  \n   **Answer:** The biomass consumption is about 30 tonnes per day per MW.\n\n9. **Question:** What will be the net profit for the promoter if a subsidy of 40% on the cost of plant and machinery is provided?  \n   **Answer:** The net profit will be ₹ 29.80 crores per year.\n\n10. **Question:** Over how many years is the total life of the paddy straw-based power generation plant estimated?  \n    **Answer:** The total life of the plant is estimated to be 15 years.",
    "1. **Question:** What is the assumed percentage of paddy straw used by the power generation plant for electricity generation?\n   **Answer:** The plant is assumed to use 100% paddy straw for power generation.\n\n2. **Question:** What is the cost of the plant and machinery for an 18 MW power generation capacity?\n   **Answer:** The cost is `150 crores.\n\n3. **Question:** How many working days does the power generation plant operate in a year?\n   **Answer:** The plant operates for 300 days in a year.\n\n4. **Question:** What is the annual consumption of paddy straw by the power generation plant?\n   **Answer:** The plant consumes 1,62,000 tonnes of paddy straw per year.\n\n5. **Question:** What is the cost of paddy straw per tonne for baling and transporting to the plant site?\n   **Answer:** The cost of paddy straw is `2,000 per tonne.\n\n6. **Question:** How much electricity does one 18 MW power generation plant produce per year?\n   **Answer:** One plant produces 10.00 crore units of electricity per year.\n\n7. **Question:** What is the net profit generated by one power generation plant per year?\n   **Answer:** The net profit is `29.80 crores per year.\n\n8. **Question:** If 100 power generation plants are established, what will be the total paddy straw consumption per year?\n   **Answer:** The total paddy straw consumption will be 16.2 million tonnes per year.\n\n9. **Question:** What is the total subsidy provided for 100 power generation plants at a rate of 40%?\n   **Answer:** The total subsidy is `60,000 crores.\n\n10. **Question:** What are the four steps involved in the production of ethanol from lignocellulosic biomass?\n    **Answer:** The four steps are feedstock pre-treatment, enzymatic saccharification, fermentation, and ethanol recovery.",
    "1. **Question:** What is DBT-ICT technology and who developed it?\n   **Answer:** DBT-ICT technology is India's first homegrown technology to convert biomass to ethanol, developed by the Institute of Chemical Technology (ICT), Mumbai, with funding from the Department of Biotechnology.\n\n2. **Question:** Where is the demonstration plant for DBT-ICT technology located and what is its capacity?\n   **Answer:** The demonstration plant for DBT-ICT technology is located in Kashipur, Uttarakhand, and has a capacity of 10 tonnes per day.\n\n3. **Question:** What type of biomass is used in the DBT-ICT technology for ethanol production?\n   **Answer:** The DBT-ICT technology uses paddy straw (lignocellulosic biomass) for ethanol production.\n\n4. **Question:** What is the capacity of the demonstration project set up by Praj Industries?\n   **Answer:** The demonstration project set up by Praj Industries has a capacity of 12 tonnes per day.\n\n5. **Question:** In which year was the Praj Industries project established?\n   **Answer:** The Praj Industries project was established in 2017.\n\n6. **Question:** What investment amount is associated with the Oil PSUs' plan to set up twelve 2G Ethanol projects in India?\n   **Answer:** The Oil PSUs are planning to invest approximately ₹10,000 crore to set up twelve 2G Ethanol projects in India.\n\n7. **Question:** What is the estimated capital investment required for a typical 100 kl per day bio-refinery?\n   **Answer:** A typical 100 kl per day bio-refinery is estimated to require around ₹800-1,000 crore of capital investment.\n\n8. **Question:** How much biomass does a 100 kl per day bio-refinery consume annually, and how much ethanol does it produce?\n   **Answer:** A 100 kl per day bio-refinery consumes around 0.15 million tonnes of biomass per annum and produces around 300 lakh litres of ethanol per annum.\n\n9. **Question:** What challenges are associated with 2G Ethanol projects?\n   **Answer:** Challenges associated with 2G Ethanol projects include lower commercial viability at lower feedstock scale, nascent technology, inconsistent feedstock availability, higher enzyme/chemicals cost, and higher operational expenses (OPEX).\n\n10. **Question:** What is the purpose of the \"Pradhan Mantri JI-VAN Yojana\" announced by the Government of India?\n    **Answer:** The \"Pradhan Mantri JI-VAN Yojana\" aims to provide financial support for Integrated Bio-Ethanol Projects using lignocellulosic biomass and other renewable feedstock, with a total financial outlay of ₹1,969.50 crore for the period 2018-19 to 2023-24.",
    "1. **Question:** What type of ethanol projects are supported under the Yojana mentioned in the text?  \n   **Answer:** The Yojana supports 12 Commercial Scale and 10 demonstration scale Second Generation (2G) Ethanol Projects.\n\n2. **Question:** What is the duration of Phase-I for the support of ethanol projects?  \n   **Answer:** Phase-I runs from 2018-19 to 2022-23.\n\n3. **Question:** How much alcohol can be produced from 1 ton of paddy straw?  \n   **Answer:** 1 ton of paddy straw can produce 200 litres of alcohol.\n\n4. **Question:** What is the estimated cost of plant and machinery for a 100,000 litre alcohol production capacity per day?  \n   **Answer:** The estimated cost is about ₹800 to ₹1,000 crores, which is taken as ₹900 crores.\n\n5. **Question:** How much biomass does a 100,000 litre alcohol per day capacity plant consume annually?  \n   **Answer:** It consumes around 0.15 million tonnes of biomass per year.\n\n6. **Question:** What is the procurement price of alcohol by the Government of India for ‘C-heavy molasses’?  \n   **Answer:** The procurement price is ₹45.69 per litre.\n\n7. **Question:** How much compost manure is produced as a by-product per litre of alcohol?  \n   **Answer:** 6 kg of compost manure is produced per litre of alcohol.\n\n8. **Question:** What is the total cost of producing 300 lakh litres of alcohol per year from paddy straw?  \n   **Answer:** The total cost of production is ₹31,500 lakhs per year.\n\n9. **Question:** What is the net loss per year from a plant with a production capacity of 300 lakh litres?  \n   **Answer:** The net loss per year is ₹15,993 lakhs.\n\n10. **Question:** Why was the option of alcohol production from paddy straw dropped from further consideration?  \n    **Answer:** It was dropped due to heavy monetary loss, approximately ₹16,000 lakhs per year.",
    "1. **Question:** What are the main benefits of using organic fertilizers compared to inorganic fertilizers?\n   **Answer:** Organic fertilizers contain beneficial micronutrients, enzymes, and microorganisms that are not usually found in inorganic fertilizers.\n\n2. **Question:** What is the key to making good compost?\n   **Answer:** The key to making good compost is an adequate supply of nitrogen (N), moisture content, and abundant microorganisms.\n\n3. **Question:** What is the recommended size for chopping paddy straw/biomass for composting?\n   **Answer:** Paddy straw/biomass should be chopped into small pieces of sizes 3 to 5 cm for better composting.\n\n4. **Question:** What is the purpose of sprinkling a dilute solution of nitrogen fertilizer or a microorganism solution on composting biomass?\n   **Answer:** Sprinkling a dilute solution of nitrogen fertilizer (like urea) and/or a microorganism solution (e.g., Trichoderma harzianum) aids in the decomposition process.\n\n5. **Question:** What dimensions are suggested for trenches used in making farm compost?\n   **Answer:** Trenches for composting should be approximately 4.5 m to 5.0 m long, 1.5 m to 2.0 m wide, and 1.0 m to 2.0 m deep.\n\n6. **Question:** How should layers be organized when placing crop/farm waste in trenches for composting?\n   **Answer:** Crop/farm waste should be placed in trenches layer by layer, with each layer well moistened by sprinkling cow dung slurry or water.\n\n7. **Question:** What is the minimum height that should be maintained for a compost heap during heap formation?\n   **Answer:** A minimum height of 4 feet should be maintained for composting during heap formation.\n\n8. **Question:** Why is aeration important in the composting process?\n   **Answer:** Sufficient oxygen is necessary for the compost heap, and turning the compost heap allows fresh air to enter, activating the microbial process and hastening composting.\n\n9. **Question:** What moisture level should be maintained throughout the composting period?\n   **Answer:** Throughout the composting period, 60% moisture should be maintained to prevent the death of microorganisms.\n\n10. **Question:** What role do bulking agents, like wood chips, play in the composting process?\n    **Answer:** Bulking agents such as wood chips provide more air space to the compost material, which helps in aerating the compost and promoting microbial activity.",
    "1. **Question:** What is the purpose of using straw thatch in agriculture?\n   **Answer:** Straw thatch is used to protect from sunlight and reduce moisture evaporation.\n\n2. **Question:** What are the indicators of compost maturity?\n   **Answer:** Indicators of compost maturity include volume reduction, black color, earthy odor, and a reduction in particle size.\n\n3. **Question:** What is the process after composting to achieve uniform composted material?\n   **Answer:** After compost maturity is satisfied, the compost heap can be disturbed and spread on the floor for curing, followed by sieving through a 4 mm sieve.\n\n4. **Question:** What microorganisms are recommended for compost enrichment?\n   **Answer:** Beneficial microorganisms such as Azotobacter, Azospirillum, Pseudomonas, and Phosphobacteria are recommended for compost enrichment.\n\n5. **Question:** How much moisture should be maintained for the growth of inoculated microorganisms in compost?\n   **Answer:** A moisture level of 40% should be maintained for the maximum growth of inoculated microorganisms in compost.\n\n6. **Question:** What is the incubation period required for microorganisms to reach maximum population in enriched compost?\n   **Answer:** The incubation period required is 20 days for microorganisms to reach maximum population in enriched compost.\n\n7. **Question:** What is the advantage of enriched compost over normal compost?\n   **Answer:** The advantage of enriched compost is its higher nutrient status, better quality manure, and a higher number of beneficial microorganisms and plant growth-promoting substances.\n\n8. **Question:** How long does the composting process of crop residue typically take?\n   **Answer:** The composting process of crop residue takes about 8 to 10 weeks.\n\n9. **Question:** What is the estimated total paddy straw available from 1 hectare of field?\n   **Answer:** The total paddy straw available from 1 hectare of field is estimated to be 6 tonnes.\n\n10. **Question:** Why was off-field composting of paddy straw considered unviable?\n    **Answer:** Off-field composting of paddy straw was considered unviable due to a monetary loss of ₹1,500 per hectare, resulting in a total loss of ₹653 crores for the 4.35 million hectares under paddy cultivation in Punjab and Haryana.",
    "1. **Question:** What is the impact of ex-situ crop residue management on cultivable land area?  \n   **Answer:** It causes a cultivable land area of 1% to be used for composting yard space and operational space, which is equivalent to 43,500 hectares every year.\n\n2. **Question:** How much yield reduction is expected annually due to ex-situ crop residue management?  \n   **Answer:** There will be a reduction in yield of 4.35 lakh tonnes every year.\n\n3. **Question:** What makes the process of collecting and transporting straw for composting labor-intensive?  \n   **Answer:** The process involves the collection and transportation of straw from the field to the compost site and managing it over the composting period, which is cumbersome.\n\n4. **Question:** What alternative composting method is being tested by various institutions of ICAR?  \n   **Answer:** In-situ composting using consortia of microbes is being tested and may become a more viable option than off-field composting.\n\n5. **Question:** What are the total costs involved in producing 5 tonnes of compost from 6 tonnes of paddy straw?  \n   **Answer:** The total costs involved are ₹6,500.00 (including production loss).\n\n6. **Question:** What is the net loss to the farmer per hectare of land when composting paddy straw?  \n   **Answer:** The net loss to the farmer per hectare of land is ₹1,500.00.\n\n7. **Question:** What is one of the recommendations for using crop residues in thermal power plants?  \n   **Answer:** One option is to produce biomass pellets from crop residues as a fuel substitution in thermal power plants.\n\n8. **Question:** What is the purpose of integrating Bio-CNG/Compressed Bio-gas projects with existing retail networks?  \n   **Answer:** It provides off-take assurance for crop residues to the CBG project developers.\n\n9. **Question:** What has the Government of India allowed regarding ethanol production?  \n   **Answer:** The Government of India has allowed the procurement of ethanol produced from non-food feedstock, cellulose, and lignocellulosic-based materials besides molasses, provided it meets the relevant BIS standards.\n\n10. **Question:** What are some of the options for ex-situ management of crop residues recommended by the committee?  \n    **Answer:** Options include biomass pellets, biogas production, industrial production of Bio-CNG, power generation from biomass, alcohol production, and ex-situ composting of paddy straw.",
    "1. **Question:** What is the expected increase in production cost per unit of power when substituting biomass pellets from crop residues at a rate of 10% of coal?  \n   **Answer:** The cost of production will increase by 20 paisa per unit of power.\n\n2. **Question:** How much paddy straw would be consumed annually if all power plants in North India substitute their fuel with paddy straw?  \n   **Answer:** They would consume 17.82 million tons of paddy straw every year.\n\n3. **Question:** What is the estimated cost of a PAU Model – II biogas plant?  \n   **Answer:** The cost of the biogas plant is ` 2.1 lakhs.\n\n4. **Question:** What government support is needed for farmers to break even on the cost of the biogas plant?  \n   **Answer:** The government needs to extend a one-time support at the rate of 60% of the cost of the plant.\n\n5. **Question:** How much budget is required for one-time subsidy if one biogas plant is established per farm in Punjab?  \n   **Answer:** The budget required for one-time subsidy will be ` 13,860 crores.\n\n6. **Question:** What is the expected annual consumption of paddy straw if 1.1 million biogas plants are established?  \n   **Answer:** They will consume 5.28 million tonnes of paddy straw every year.\n\n7. **Question:** What is the cost of establishing one bio-CNG plant with a capacity of 5,600 kg per day?  \n   **Answer:** The cost is ` 30.20 crores.\n\n8. **Question:** How much paddy straw would be consumed by 1000 bio-CNG plants annually?  \n   **Answer:** They would consume 11 million tonnes of paddy straw every year.\n\n9. **Question:** What is the profit expected per year for a bio-CNG plant if 50% of the cost is supported by the government?  \n   **Answer:** The annual profit will be ` 209.23 lakhs per year.\n\n10. **Question:** How many crore units of power will be produced annually by one 18 MW biomass-based power generation unit?  \n    **Answer:** It will produce 10 crore units of power every year.",
    "1. **Question:** What is the estimated cost for machinery for a plant with a capacity of 300 lakh litres of alcohol per year?  \n   **Answer:** The estimated cost is between ₹800 to ₹1,000 crores.\n\n2. **Question:** How much paddy straw will a plant with a capacity of 300 lakh litres of alcohol consume annually?  \n   **Answer:** It will consume 0.15 million tonnes of paddy straw every year.\n\n3. **Question:** What is the annual loss incurred from operating a plant that produces alcohol from paddy straw?  \n   **Answer:** The annual loss incurred from such a plant is ₹15,993 crores.\n\n4. **Question:** What is the financial loss a farmer incurs by composting paddy straw off the field?  \n   **Answer:** A farmer incurs a loss of ₹1,500 per hectare per year.\n\n5. **Question:** What percentage of land area will be lost due to the establishment of a composting yard for paddy straw?  \n   **Answer:** 1% of the land area will be lost for the composting yard.\n\n6. **Question:** What is the total area in hectares that will be lost in Punjab and Haryana due to composting?  \n   **Answer:** The total area lost will be 43,500 hectares.\n\n7. **Question:** How much grain production is expected to be lost every year due to composting in Punjab and Haryana?  \n   **Answer:** The grain production loss is expected to be 4.35 lakh tonnes every year.\n\n8. **Question:** Which two options for ex-situ management of crop residues are not recommended for further consideration?  \n   **Answer:** The options not recommended are alcohol production from paddy straw and ex-situ composting of paddy straw.\n\n9. **Question:** What are some recommended options for ex-situ crop residue management?  \n   **Answer:** Recommended options include biomass pellets from crop residues for fuel, biogas production from paddy straw, industrial production of biogas/Bio-CNG/Compressed Bio-gas from paddy straw, and power generation from biomass.\n\n10. **Question:** What organization approved the committee for economic analysis of alternative/ex-situ options for crop residue management?  \n   **Answer:** The committee was approved by the Secretary, DARE and the Director General of ICAR.",
    "1. **Question:** Who is the Chairman of the committee analyzing alternative options for crop residue management?  \n   **Answer:** Deputy Director General (Engg.), ICAR.\n\n2. **Question:** What is the primary focus of the committee mentioned in the document?  \n   **Answer:** The analysis of alternative/ex-situ options for crop residue management.\n\n3. **Question:** By when is the committee requested to complete their task?  \n   **Answer:** By mid-November 2020.\n\n4. **Question:** Which organization does Dr. Trilochan Mohapatra represent?  \n   **Answer:** Indian Council of Agricultural Research.\n\n5. **Question:** What type of management do the biopesticides discussed in the document aim to support?  \n   **Answer:** Eco-friendly pest management.\n\n6. **Question:** Which city is the Director of the CIAE located in?  \n   **Answer:** Bhopal.\n\n7. **Question:** Who compiled the ICAR Technologies publication on biopesticides?  \n   **Answer:** Dr. Anil Kumar Saxena.\n\n8. **Question:** What is the publication year of the document discussing biopesticides?  \n   **Answer:** 2021.\n\n9. **Question:** What does ICAR stand for?  \n   **Answer:** Indian Council of Agricultural Research.\n\n10. **Question:** What was the lesson learned from the indiscriminate use of chemical fertilizers and pesticides post-green revolution?  \n    **Answer:** The importance of sustainable utilization of resources in agriculture.",
    "1. **Question:** What are biopesticides and how do they differ from chemical pesticides?  \n   **Answer:** Biopesticides are eco-friendly alternatives to chemical pesticides that do not lead to the development of resistance in pests and pathogens, unlike chemical pesticides.\n\n2. **Question:** What challenges do biopesticides face in the market compared to chemical pesticides?  \n   **Answer:** Biopesticides struggle to find their place in the market due to technological challenges and acceptance issues among the farming community.\n\n3. **Question:** What does the National Policy for Farmers (NPF), 2007, recommend regarding biopesticides?  \n   **Answer:** The NPF recommends the promotion of biopesticides to improve the economic viability of farming and increase farmers' net income.\n\n4. **Question:** What percentage of the overall pesticide market in India is represented by biopesticides?  \n   **Answer:** Biopesticides represent only 4.2% of the overall pesticide market in India.\n\n5. **Question:** How does the percentage of biopesticides in the pesticide market in the USA compare to that in India?  \n   **Answer:** In the USA, biopesticides account for 40% of the pesticide market, which is significantly higher than the 4.2% in India.\n\n6. **Question:** When did the Indian Council of Agricultural Research (ICAR) start the All India Coordinated Research Project (AICRP) on Biological control of Crop Pests and Weeds?  \n   **Answer:** The AICRP was initiated in 1977.\n\n7. **Question:** How many biopesticide products have been registered with the Central Insecticide Board and Registration Committee (CIB & RC) in India?  \n   **Answer:** More than 970 biopesticide products have been registered with the CIB & RC.\n\n8. **Question:** What limitation do most biopesticide producing companies face in their commercial production?  \n   **Answer:** Most companies are dependent on either a single strain or a handful of microbes, which results in limited applications and narrow activity ranges of their products.\n\n9. **Question:** What is the potential benefit of having a wider variety of bioagents available for biopesticide development?  \n   **Answer:** The availability of many bioagents can help address the challenges faced by biopesticides in the market, allowing for broader pest and pathogen management.\n\n10. **Question:** What is the title of the compendium compiled by ICAR that focuses on biopesticides?  \n    **Answer:** The compendium is titled “ICAR Technologies: Biopesticides for Eco-friendly Pest Management.”",
    "1. **Question:** What has the Government of India encouraged to combat pests and pathogens in agriculture?  \n   **Answer:** The Government of India has encouraged the use of biopesticides by including them as a component in several agricultural programs.\n\n2. **Question:** What are some examples of microbial biopesticides mentioned in the text?  \n   **Answer:** Examples of microbial biopesticides include Bacillus thuringiensis, Trichoderma, Pseudomonas, Metarhizium, and Beauveria.\n\n3. **Question:** How many microorganisms are currently registered as biopesticides with the Central Insecticide Board and Registration Committee (CIB & RC) in India?  \n   **Answer:** There are currently about 20 microorganisms registered as biopesticides with CIB & RC.\n\n4. **Question:** What role does the Indian Council of Agricultural Research (ICAR) play in the development of microbial biopesticides?  \n   **Answer:** ICAR is engaged in the development and evaluation of microbial biopesticides through its constituent institutes.\n\n5. **Question:** What recent agricultural challenges have been managed with microbial agents developed by ICAR?  \n   **Answer:** The recent invasions of fall armyworm (FAW) infesting maize and the devastating infection of banana by Fusarium cubense TR4 have been successfully managed.\n\n6. **Question:** What is the significance of the compendium titled “ICAR Technologies: Biopesticides for Eco-friendly Pest Management”?  \n   **Answer:** The compendium is significant as it highlights the vital role of microorganisms in shaping the future of agriculture and promotes eco-friendly pest management.\n\n7. **Question:** What is one challenge faced by biopesticides at the farm level according to the text?  \n   **Answer:** Biopesticides are facing challenges at the farm level due to declining interest among farmers.\n\n8. **Question:** What is one of the formulations developed at ICAR mentioned in the text?  \n   **Answer:** One of the formulations developed at ICAR is called \"Shatpada Larvicide.\"\n\n9. **Question:** How does the use of biopesticides affect soil health and the environment compared to chemical pesticides?  \n   **Answer:** The use of biopesticides aims to protect crops from pests and pathogens without negatively influencing soil health and the environment, unlike chemical pesticides.\n\n10. **Question:** Who is credited with guidance and support in the preparation of the compendium on biopesticides?  \n    **Answer:** Dr. T. Mohapatra, Hon'ble Secretary, Department of Agricultural Research and Education and Director General, ICAR, is credited with guidance and support in the preparation of the compendium.",
    "1. **Question:** What impact has climate change had on pest and pathogen behavior?\n   **Answer:** Climate change has worsened the situation, leading to changes in pest and pathogen behavior and the development of resistance.\n\n2. **Question:** What are biopesticides and how do they differ from chemical pesticides?\n   **Answer:** Biopesticides are derived from microorganisms and help manage pests and pathogens without adverse effects on soil health and the environment, unlike chemical pesticides.\n\n3. **Question:** Which microorganisms are known for their role in the management of pests and pathogens?\n   **Answer:** Microorganisms such as Trichoderma, Beauveria, Metarhizium, Bacillus, and Pseudomonas are known for their role in pest and pathogen management.\n\n4. **Question:** How many microorganisms are currently registered as biopesticides with the Central Insecticide Board and Registration Committee?\n   **Answer:** Approximately 20 microorganisms are registered as biopesticides with the Central Insecticide Board and Registration Committee (CIB & RC).\n\n5. **Question:** What challenges do biopesticides face in agricultural applications?\n   **Answer:** Biopesticides face challenges such as lower efficacy and shelf life, narrow host range, and the inability to reproduce results under field conditions.\n\n6. **Question:** What organization is responsible for developing and validating various formulations of biopesticides in India?\n   **Answer:** The Indian Council of Agricultural Research (ICAR) is responsible for developing and validating various formulations of biopesticides.\n\n7. **Question:** What is the significance of the bulletin mentioned in the text?\n   **Answer:** The bulletin is a compilation of 31 biopesticides developed by ICAR that are at various stages of registration and commercialization.\n\n8. **Question:** What are some of the secondary metabolites produced by microorganisms?\n   **Answer:** Microorganisms produce secondary metabolites such as antimicrobial peptides, volatiles, toxins, and enzymes.\n\n9. **Question:** What is the role of ICAR in addressing the challenges faced by biopesticides?\n   **Answer:** ICAR is making constant efforts to overcome the challenges faced by biopesticides, such as enhancing efficacy and expanding host range.\n\n10. **Question:** List any three abbreviations related to agricultural research mentioned in the text.\n    **Answer:** Three abbreviations related to agricultural research mentioned are ICAR (Indian Council of Agricultural Research), AICRP (All India Coordinated Research Project), and CIB&RC (Central Insecticide Board and Registration Committee).",
    "1. **Question:** What is the microbial constituent of the biopesticide known as Shatpada Aphid Kill?  \n   **Answer:** The microbial constituent is Beauveria bassiana.\n\n2. **Question:** What type of formulation is used for the Shatpada Aphid Kill biopesticide?  \n   **Answer:** It is an oil formulation with a concentration of 1 × 10^8 cfu/mL.\n\n3. **Question:** What pests does Shatpada Aphid Kill target?  \n   **Answer:** It targets aphids in chilli (Aphis gossypii), brinjal, cabbage (Brevicoryne brassicae), and cowpea (Aphis craccivora).\n\n4. **Question:** How should Shatpada Aphid Kill be applied for effective pest control?  \n   **Answer:** It should be applied as three foliar sprays at a rate of 5 mL/L of water at 15-day intervals after pest incidence.\n\n5. **Question:** What is the shelf life of the Shatpada Aphid Kill biopesticide?  \n   **Answer:** The shelf life is 12 months at temperatures between 25-35°C.\n\n6. **Question:** What percentage of pest reduction can be expected from using Shatpada Aphid Kill?  \n   **Answer:** A pest reduction of 50-83% can be expected.\n\n7. **Question:** Which states in India were targeted for the validation of the Shatpada Aphid Kill?  \n   **Answer:** The target agroecological zone for validation is Karnataka.\n\n8. **Question:** What is the microbial constituent of the biopesticide known as Shatpada Rugose Whitefly Kill?  \n   **Answer:** The microbial constituent is Isaria fumosorosea.\n\n9. **Question:** How is Shatpada Rugose Whitefly Kill applied to coconut and oil palm?  \n   **Answer:** It is applied as two to three foliar sprays at 5 mL/L of water (or 5 g/L of water for talc formulation) at 15-day intervals after pest incidence.\n\n10. **Question:** What pest does the Shatpada Rugose Whitefly Kill specifically target?  \n    **Answer:** It targets the Rugose Spiralling Whitefly (Aleurodicus rugioperculatus).",
    "1. **Question:** What is the target agroecological zone for the pest control measures mentioned in the text?\n   **Answer:** The target agroecological zone is Karnataka.\n\n2. **Question:** What is the microbial constituent used in the Shatpada Grubicide for controlling white grubs in sugarcane?\n   **Answer:** The microbial constituent used is Metarhizium anisopliae.\n\n3. **Question:** How much biopesticide is recommended for soil application per hectare for sugarcane?\n   **Answer:** The recommended amount is 2.5 kg mixed with 250 kg of farmyard manure per hectare.\n\n4. **Question:** What is the shelf life of the biopesticides mentioned in the text when stored at 25-35°C?\n   **Answer:** The shelf life is 12 months.\n\n5. **Question:** How much water is required for each foliar spray of the Shatpada larvicide for maize?\n   **Answer:** Each spray requires 200 L/ha of water.\n\n6. **Question:** What percentage of pest reduction is achieved with the Shatpada Grubicide for sugarcane?\n   **Answer:** The Shatpada Grubicide achieves a pest reduction of 75-96%.\n\n7. **Question:** How many foliar sprays are suggested for the Fall armyworm in maize, and at what intervals?\n   **Answer:** Three foliar sprays are suggested at 20, 30, and 40 days after sowing.\n\n8. **Question:** What is the increase in yield reported from using the Shatpada Sucking Pest Hit on chilli aphids?\n   **Answer:** The increase in yield is reported to be 24-27%.\n\n9. **Question:** Which states are targeted for the application of the biopesticide against the Fall armyworm?\n   **Answer:** The targeted states are Karnataka, Andhra Pradesh, Tamil Nadu, and Maharashtra.\n\n10. **Question:** What is the commercial status of the biopesticides mentioned in the text?\n    **Answer:** The biopesticides are available for licensing and have been commercialized.",
    "1. **Question:** What is the microbial constituent of the biopesticide ICAR-NBAIR BT25?\n   **Answer:** The microbial constituent of ICAR-NBAIR BT25 is Bacillus thuringiensis var. kurstaki.\n\n2. **Question:** What is the shelf life of ICAR-NBAIR BT25 when stored at 25-35°C?\n   **Answer:** The shelf life of ICAR-NBAIR BT25 is 12 months at 25-35°C.\n\n3. **Question:** Which pest does ICAR-NBAIR BT25 target in maize?\n   **Answer:** ICAR-NBAIR BT25 targets the fall armyworm (Spodoptera frugiperda) in maize.\n\n4. **Question:** How many foliar sprays are recommended for the application of ICAR-NBAIR BT25?\n   **Answer:** Two to three foliar sprays are recommended for the application of ICAR-NBAIR BT25.\n\n5. **Question:** What is the water requirement per hectare for each spray of ICAR-NBAIR BT25?\n   **Answer:** The water requirement for each spray of ICAR-NBAIR BT25 is 200 L/ha.\n\n6. **Question:** In which states is ICAR-NBAIR BT25 validated for use?\n   **Answer:** ICAR-NBAIR BT25 is validated for use in Karnataka, Andhra Pradesh, Maharashtra, Tamil Nadu, Gujarat, and Odisha.\n\n7. **Question:** What percentage of pest reduction is achieved using Shatpada Armour?\n   **Answer:** Shatpada Armour achieves an 85-90% reduction in pest populations.\n\n8. **Question:** What is the microbial constituent of the biopesticide ICAR-NBAIR BTG4?\n   **Answer:** The microbial constituent of ICAR-NBAIR BTG4 is Bacillus thuringiensis var. kurstaki.\n\n9. **Question:** When was ICAR-NBAIR BTG4 commercialized?\n   **Answer:** ICAR-NBAIR BTG4 was commercialized in 2020.\n\n10. **Question:** What is the method of application for ICAR-NBAIR BTG4?\n    **Answer:** The method of application for ICAR-NBAIR BTG4 involves two to three foliar sprays at 20 mL/L of water at pre-flowering and post-flowering stages.",
    "1. **Question:** What is the method of application for managing thrips in capsicum using the product mentioned?  \n   **Answer:** The method of application is foliar application at 20 g/L of water at 20, 30, 40, and 50 days after transplanting.\n\n2. **Question:** How much water is required for the application per hectare when managing thrips in capsicum?  \n   **Answer:** 200 L of water is required per hectare.\n\n3. **Question:** What is the soil application rate for managing red gram wilt?  \n   **Answer:** The soil application rate for managing red gram wilt is 2.5 kg/ha during 25, 40, and 55 days after sowing.\n\n4. **Question:** In which agroecological zones or states is the technology for managing thrips and Fusarium wilt targeted?  \n   **Answer:** The targeted agroecological zones are Karnataka and Telangana.\n\n5. **Question:** What percentage of thrips reduction is reported with the use of the technology?  \n   **Answer:** The technology has reported a 70-90% reduction in thrips.\n\n6. **Question:** What increase in yield can be expected from using the technology for managing Fusarium wilt?  \n   **Answer:** An increase in yield of 50-60% can be expected.\n\n7. **Question:** What microbial constituent is used in the Shatpada All Rounder biopesticide?  \n   **Answer:** The microbial constituent used is Bacillus albus NBAIR-BATP.\n\n8. **Question:** What is the shelf life of the Shatpada All Rounder biopesticide?  \n   **Answer:** The shelf life is 12 months at 25-35°C.\n\n9. **Question:** What are the expected reductions in pests using the Shatpada All Rounder biopesticide?  \n   **Answer:** The expected reductions are 70-80% for fall armyworm, 80-90% for tomato pinworm, and 45-50% for Fusarium wilt.\n\n10. **Question:** What increase in yield can be expected for maize when using the Shatpada All Rounder biopesticide?  \n    **Answer:** An increase of 26-29% in maize yield can be expected.",
    "1. **Question:** What is the type and formulation of the product AIMCC-SF-0030?  \n   **Answer:** AIMCC-SF-0030 is a wettable powder formulation with a concentration of 1 × 10^7 cfu/g.\n\n2. **Question:** What is the shelf life of AIMCC-SF-0030?  \n   **Answer:** The shelf life of AIMCC-SF-0030 is 12 months at a temperature range of 25-35°C.\n\n3. **Question:** Which specific disease does AIMCC-SF-0030 target in banana crops?  \n   **Answer:** AIMCC-SF-0030 targets Fusarium wilt of banana caused by Fusarium oxysporum f. sp. cubense Tropical race 4 and race 1.\n\n4. **Question:** How should AIMCC-SF-0030 be applied to the soil?  \n   **Answer:** It should be applied as a soil drenching at a concentration of 3% (w/v) in water, at a rate of 1 L per plant, four times during specific months after planting.\n\n5. **Question:** In which states is AIMCC-SF-0030 validated for use?  \n   **Answer:** AIMCC-SF-0030 is validated for use in Uttar Pradesh, Bihar, Andhra Pradesh, Tamil Nadu, Assam, Nagaland, West Bengal, and Gujarat.\n\n6. **Question:** What is the microbial constituent of the ICAR-FUSICONT product?  \n   **Answer:** The microbial constituent of ICAR-FUSICONT is Pseudomonas fluorescens (NAIMCC-SB-0053).\n\n7. **Question:** What type of pests and diseases does ICAR-FUSICONT address?  \n   **Answer:** ICAR-FUSICONT addresses spot blotch of wheat, sheath blight of rice, and wilt of tomato and chickpea.\n\n8. **Question:** What is the method of application for ICAR-FUSICONT?  \n   **Answer:** ICAR-FUSICONT is applied as a seed treatment at a rate of 10 g per kg of seed.\n\n9. **Question:** How much reduction in disease incidence can be expected from using ICAR-FUSICONT?  \n   **Answer:** ICAR-FUSICONT can achieve a 45-55% reduction in spot blotch disease of wheat, sheath blight in rice, and wilt of tomato.\n\n10. **Question:** What is the shelf life of the microbial constituents Trichoderma harzianum and Bacillus amyloliquefaciens?  \n    **Answer:** Both Trichoderma harzianum and Bacillus amyloliquefaciens have a shelf life of 12 months at a temperature range of 25-35°C.",
    "1. **Question:** What are the four KVKs in Madhya Pradesh mentioned for chickpea validation?\n   **Answer:** The four KVKs are located at Hamirpur, Chhattarpur, Tikamgarh, and Panna.\n\n2. **Question:** Which KVK in Uttar Pradesh is involved in chickpea validation?\n   **Answer:** KVK Ghazipur is involved in chickpea validation in Uttar Pradesh.\n\n3. **Question:** What is the yield increase percentage for chickpea, pea, and lentil due to certain benefits mentioned?\n   **Answer:** The yield increase is 10-15% for chickpea, pea, and lentil.\n\n4. **Question:** What is the microbial constituent used in the bio-pesticide ICAR-CAZRI AZNF-5?\n   **Answer:** The microbial constituent used is Trichoderma harzianum.\n\n5. **Question:** How long is the shelf life of the bio-pesticide ICAR-CAZRI AZNF-5 at 55°C?\n   **Answer:** The shelf life is 4 months at 55°C.\n\n6. **Question:** What method of application is recommended for Trichoderma harzianum in cumin?\n   **Answer:** The method of application is seed treatment (4 g/kg seed) and soil application (1 kg/ha with 50 kg FYM) before sowing.\n\n7. **Question:** What is the reduction in plant mortality achieved with Maru sena 1 on cumin?\n   **Answer:** The reduction in plant mortality is 34-52%.\n\n8. **Question:** What type of formulation is Bacillus firmus ICAR-CAZRI AZ-1 classified as?\n   **Answer:** It is classified as a carrier-based formulation with 1 × 10^8 cfu/g.\n\n9. **Question:** What is the shelf life of Bacillus firmus ICAR-CAZRI AZ-1 at 25-35°C?\n   **Answer:** The shelf life is 6 months at 25-35°C.\n\n10. **Question:** What is the patent number granted for the bio-pesticide Maru sena 1?\n    **Answer:** The patent number granted is 309385.",
    "1. **Question:** What is the microbial constituent of the biopesticide ICAR-CAZRI AZNF-5?  \n   **Answer:** The microbial constituent is Trichoderma harzianum.\n\n2. **Question:** What is the shelf life of the biopesticide Bacillus firmus ICAR-CAZRI AZ-1?  \n   **Answer:** The shelf life is 4 months at 55°C.\n\n3. **Question:** Which crops does the biopesticide targeting Macrophomina phaseolina affect?  \n   **Answer:** It targets legumes and oil seed crops.\n\n4. **Question:** What is the method of application for the biopesticide ICAR-CAZRI AZNF-5?  \n   **Answer:** The method of application is seed treatment (10 g/kg seed with jaggery) and soil application (1 kg/ha with 40 kg FYM) before sowing.\n\n5. **Question:** Where was the validation of ICAR-CAZRI AZNF-5 conducted?  \n   **Answer:** Validation was conducted at experimental farms at ICAR-CAZRI, Jodhpur, and farmers' fields at Pali and Jodhpur, Rajasthan for two years.\n\n6. **Question:** What is the target pest for the biopesticide Beauveria bassiana TF6?  \n   **Answer:** The target pest is the rice leaf folder (Cnaphalocrocis medinalis).\n\n7. **Question:** How long is the shelf life of Beauveria bassiana TF6?  \n   **Answer:** The shelf life is 8 months at 25-35°C.\n\n8. **Question:** What is the required water amount for the foliar spray application of Beauveria bassiana TF6?  \n   **Answer:** The required water amount is 500 L/ha.\n\n9. **Question:** What is the percentage of leaf folder mortality reported for Metarhizium anisopliae TF19?  \n   **Answer:** The reported leaf folder mortality is 77%.\n\n10. **Question:** In which states are the biopesticides ICAR-CAZRI AZNF-5 and Beauveria bassiana TF6 validated?  \n    **Answer:** ICAR-CAZRI AZNF-5 is validated in Rajasthan, while Beauveria bassiana TF6 is validated in Odisha.",
    "1. **Question:** What is the microbial constituent of the biopesticide Triguard Th4d?  \n   **Answer:** The microbial constituent is Trichoderma harzianum Th4d (NAIMCC-F-02188).\n\n2. **Question:** What are the target pests controlled by Triguard Th4d?  \n   **Answer:** The target pests include Phytophthora seedling blight, Macrophomina root rot, Fusarium wilt of safflower, gray mold of castor, Alternaria aster leaf blight, and powdery mildew of sunflower.\n\n3. **Question:** How should Triguard Th4d be applied for effective results?  \n   **Answer:** It can be applied as a seed treatment at 1 mL suspension concentrate/kg of seeds or as a foliar spray at 1-2 mL/L of water.\n\n4. **Question:** What is the shelf life of Triguard Th4d when stored at 25-35°C?  \n   **Answer:** The shelf life is 18 months.\n\n5. **Question:** In which Indian states is Triguard Th4d validated for use?  \n   **Answer:** It is validated for use in Telangana, Maharashtra, and Tamil Nadu.\n\n6. **Question:** When was Triguard Th-L commercialized?  \n   **Answer:** Triguard Th-L was commercialized in 2015.\n\n7. **Question:** What is the application method for the biopesticide Triguard Th-L?  \n   **Answer:** It should be applied as a seed treatment at 10 g/kg of seeds.\n\n8. **Question:** What benefits does Triguard Th-L provide to crops?  \n   **Answer:** It acts as a symbiotic colonizer, is effective against a wide range of diseases, and helps to achieve high yield.\n\n9. **Question:** Which company is licensed for the commercialization of Triguard Th-L?  \n   **Answer:** M/s M R Biologics Pvt Ltd., Hyderabad, Telangana is licensed for its commercialization.\n\n10. **Question:** What is the microbial constituent of Triguard Th-P?  \n   **Answer:** The microbial constituent is Trichoderma asperellum Ta DOR 7316 (MTCC 5623).",
    "1. **Question:** What is the method of application for seed treatment in safflower?  \n   **Answer:** The method of application is seed treatment at 10 g/kg of seeds.\n\n2. **Question:** Which states are targeted for the application of the safflower treatment?  \n   **Answer:** The targeted agroecological zones/states are Telangana, Maharashtra, and Tamil Nadu.\n\n3. **Question:** How much reduction in soil-borne disease incidences does the Triguard Ta-P provide?  \n   **Answer:** Triguard Ta-P provides a 60% reduction in soil-borne disease incidences.\n\n4. **Question:** What increase in yield is observed with the use of Triguard Ta-P?  \n   **Answer:** There is a 3-5% increase in yield when using Triguard Ta-P.\n\n5. **Question:** What is the microbial constituent of the biopesticide Bacillus thuringiensis var. kurstaki DOR Bt-127?  \n   **Answer:** The microbial constituent is Bacillus thuringiensis var. kurstaki DOR Bt-127 (MTCC 5976/NAIMCC-B-01463).\n\n6. **Question:** What is the method of application for Bacillus thuringiensis in soybean?  \n   **Answer:** The method of application is two foliar sprays at 3 mL/L of water at 10 days interval, requiring 1500 L/ha for each spray.\n\n7. **Question:** What is the shelf life of the biopesticide Bacillus thuringiensis var. kurstaki DOR Bt-127?  \n   **Answer:** The shelf life is 24 months at 25-35°C.\n\n8. **Question:** What percentage reduction in the larval population does the biopesticide Bioguard Bt-L achieve?  \n   **Answer:** Bioguard Bt-L achieves a 69-95% reduction in larval population.\n\n9. **Question:** What is the application method for the biopesticide Beauveria bassiana on pigeon pea?  \n   **Answer:** The application method is two to three foliar sprays at 0.3 mL/L of water at 10 days interval, requiring 700 to 1000 L/ha for each spray.\n\n10. **Question:** What benefits does the Mycoguard Bb-L formulation provide for pigeon pea?  \n    **Answer:** Mycoguard Bb-L provides a 24-45% reduction in pod damage and a 21-33% increase in yield.",
    "1. **Question:** What is the microbial constituent of ARKA Krishi Vriddhi?  \n   **Answer:** The microbial constituent is Trichoderma harzianum ICAR-IIHR Th-2 (NAIMCC- SF-0033/ITCC 6888).\n\n2. **Question:** What is the method of application for Trichoderma harzianum in crops?  \n   **Answer:** The method of application includes seed treatment at 20 g/kg seed, nursery bed treatment at 50 g/m² for transplantable crops, and soil application at 5 kg/ha after enrichment in 5 tons FYM before sowing or transplanting.\n\n3. **Question:** What is the shelf life of Trichoderma harzianum?  \n   **Answer:** The shelf life is 10 months at 25-35°C.\n\n4. **Question:** Which crops are targeted by Trichoderma harzianum?  \n   **Answer:** The targeted crops are brinjal, tomato, carrot, and okra.\n\n5. **Question:** What percentage of suppression in egg hatching of Meloidogyne incognita does Trichoderma harzianum provide?  \n   **Answer:** It provides 66-68% suppression in egg hatching of Meloidogyne incognita.\n\n6. **Question:** When was Trichoderma viride commercialized?  \n   **Answer:** Trichoderma viride was commercialized in 2014.\n\n7. **Question:** What is the commercial application method for Trichoderma viride?  \n   **Answer:** The application method includes seed treatment at 20 g/kg seed, nursery bed treatment at 50 g/m² for transplantable crops, and soil application at 5 kg/ha after enrichment in 5 tons FYM before transplanting or sowing.\n\n8. **Question:** What is the benefit of using Pseudomonas fluorescens in agriculture?  \n   **Answer:** Pseudomonas fluorescens provides benefits such as suppression of root knot nematodes and inhibition of bacterial pathogens.\n\n9. **Question:** How many companies have been licensed to use Trichoderma harzianum?  \n   **Answer:** Trichoderma harzianum has been licensed to 113 companies.\n\n10. **Question:** What was the increase in yield for crops treated with Trichoderma viride?  \n   **Answer:** The increase in yield for crops treated with Trichoderma viride is 12.8–16.2%.",
    "1. **Question:** What are the main fungal pathogens mentioned in the text?\n   **Answer:** The main fungal pathogens mentioned are Fusarium oxysporum f. sp. vasinfectum and Fusarium solani.\n\n2. **Question:** Which crops are targeted for the application of the biopesticides discussed in the text?\n   **Answer:** The targeted crops are brinjal, tomato, carrot, and okra.\n\n3. **Question:** What is the method of application for seed treatment using the biopesticides?\n   **Answer:** The method of application for seed treatment is at 20 g/kg seed.\n\n4. **Question:** What percentage of egg hatching suppression of Meloidogyne incognita is achieved with ARKA Krishi Samarakshak?\n   **Answer:** ARKA Krishi Samarakshak achieves 71-74% suppression in egg hatching of Meloidogyne incognita.\n\n5. **Question:** When was ARKA Krishi Rakshak commercialized?\n   **Answer:** ARKA Krishi Rakshak was commercialized in 2006.\n\n6. **Question:** What is the shelf life of the microbial constituent Pochonia chlamydosporia in ARKA Krishi Rakshak?\n   **Answer:** The shelf life of Pochonia chlamydosporia is 10 months at 25-35°C.\n\n7. **Question:** How much increase in yield can be expected for brinjal, tomato, carrot, and okra with ARKA Krishi Rakshak?\n   **Answer:** An increase in yield of 14.6-22.5% can be expected with ARKA Krishi Rakshak.\n\n8. **Question:** What is the target pest for the biopesticides mentioned in the text?\n   **Answer:** The target pest is the root knot nematode (Meloidogyne incognita).\n\n9. **Question:** How many companies have been licensed to commercialize ARKA Krishi Samarakshak?\n   **Answer:** A total of 171 companies have been licensed to commercialize ARKA Krishi Samarakshak.\n\n10. **Question:** What validation states were mentioned for the biopesticides and for which years?\n    **Answer:** The validation states mentioned are Karnataka, Odisha, and Tamil Nadu for the years 2007-2009.",
    "1. **Question:** What is the microbial constituent of ARKA Krishi Kawach?  \n   **Answer:** The microbial constituent of ARKA Krishi Kawach is P. lilacinum.\n\n2. **Question:** When was ARKA Krishi Kawach commercialized?  \n   **Answer:** ARKA Krishi Kawach was commercialized in 2006.\n\n3. **Question:** What percentage suppression in egg hatching of Meloidogyne incognita is achieved with ARKA Krishi Kawach?  \n   **Answer:** ARKA Krishi Kawach achieves a 51-61% suppression in egg hatching of Meloidogyne incognita.\n\n4. **Question:** What crops benefit from the application of ARKA Krishi Kawach?  \n   **Answer:** The crops that benefit include brinjal, tomato, carrot, and okra.\n\n5. **Question:** What is the shelf life of ARKA Plant Growth Booster?  \n   **Answer:** The shelf life of ARKA Plant Growth Booster is 10-12 months at 25-35°C.\n\n6. **Question:** Which nematode is targeted by ARKA Plant Growth Booster?  \n   **Answer:** ARKA Plant Growth Booster targets the root knot nematode (Meloidogyne incognita).\n\n7. **Question:** What is the method of application for ARKA Plant Growth Booster?  \n   **Answer:** The method of application includes seed treatment at 20 g or 20 mL/kg seed, substrate treatment with 10 mL or 10g/kg of cocopeat, and soil application at 5 kg or 5 L/ha after enrichment.\n\n8. **Question:** Which states are targeted for the application of Manjari Vineguard?  \n   **Answer:** Manjari Vineguard targets the states of Maharashtra, Karnataka, Tamil Nadu, Mizoram, and West Bengal.\n\n9. **Question:** What is the microbial constituent of Manjari Vineguard?  \n   **Answer:** The microbial constituent of Manjari Vineguard is Trichoderma asperelloides 5R.\n\n10. **Question:** What is the method of application for Manjari Vineguard?  \n   **Answer:** The method of application for Manjari Vineguard is soil drenching at 2 mL/L of water, requiring 1000 L/ha for soil drenching.",
    "1. **Question:** What is the microbial constituent of Manjari Vineguard used for controlling powdery mildew in grapes?\n   **Answer:** The microbial constituent of Manjari Vineguard is Trichoderma afroharzianum (NAIMCC-F-01938).\n\n2. **Question:** How is Manjari Vineguard applied to grapes?\n   **Answer:** Manjari Vineguard is applied as a foliar spray at a concentration of 2.0 ml/L of water.\n\n3. **Question:** What are the target states for the application of Manjari Vineguard?\n   **Answer:** The target states for the application of Manjari Vineguard are Maharashtra, Karnataka, Tamil Nadu, Mizoram, and West Bengal.\n\n4. **Question:** What is the shelf life of Manjari Vineguard?\n   **Answer:** The shelf life of Manjari Vineguard is 3 months at 25-35°C.\n\n5. **Question:** What significant benefits does Manjari Vineguard provide for grape cultivation?\n   **Answer:** Manjari Vineguard provides a significant reduction in powdery mildew incidence and a significant reduction in the number of fungicide applications.\n\n6. **Question:** What is the microbial constituent of Pusa 5SD?\n   **Answer:** The microbial constituent of Pusa 5SD is Trichoderma harzianum IARI P-4 (MTCC 5371).\n\n7. **Question:** What method of application is used for Pusa 5SD?\n   **Answer:** Pusa 5SD is applied as a seed treatment at a rate of 4g/kg of seed.\n\n8. **Question:** What diseases does Pusa 5SD target in chickpea?\n   **Answer:** Pusa 5SD targets Fusarium oxysporum f. sp. ciceris, Sclerotium rolfsii, and Sclerotinia sclerotiorum in chickpea.\n\n9. **Question:** How long is the shelf life of Pusa 5SD?\n   **Answer:** The shelf life of Pusa 5SD is 25 months at 25±8°C.\n\n10. **Question:** What are the benefits of using Pusa 5SD in agriculture?\n    **Answer:** The benefits of using Pusa 5SD include effectiveness against a wide range of soil and seed-borne diseases, enhanced plant growth, increased seed germination, and increased grain yield under field conditions.",
    "1. **Question:** What organization published the document on biofertilizers for sustainable crop production?\n   **Answer:** The document was published by the Indian Council of Agricultural Research (ICAR).\n\n2. **Question:** Who is the director of the ICAR-Indian Agricultural Research Institute mentioned in the document?\n   **Answer:** The director is not specifically named in the provided text but can be contacted via the provided email.\n\n3. **Question:** What is the primary benefit of using biofertilizers in agriculture?\n   **Answer:** Biofertilizers enhance plant growth and improve yield and quality of produce by supplying adequate nutrients.\n\n4. **Question:** What role do microorganisms play in soil health according to the document?\n   **Answer:** Microorganisms contribute to soil health by solubilizing minerals, recycling organic matter, bioremediating, and aiding in soil formation.\n\n5. **Question:** What are some examples of traditional biofertilizers mentioned in the text?\n   **Answer:** Traditional biofertilizers include nitrogen fixers, phosphorus solubilizers, and mobilizers.\n\n6. **Question:** What has been a consequence of the indiscriminate use of chemical fertilizers since the green revolution?\n   **Answer:** The indiscriminate use of chemical fertilizers has led to the deterioration of soil health.\n\n7. **Question:** What year did the Indian Council of Agricultural Research start the All India Coordinated Research Project (AICRP) on Biological Nitrogen Fixation?\n   **Answer:** The AICRP on Biological Nitrogen Fixation was started in 1976.\n\n8. **Question:** What new groups of biofertilizers have emerged with advancements in science?\n   **Answer:** New groups of biofertilizers include potassium solubilizers, zinc solubilizers, and consortia supplying different nutrients.\n\n9. **Question:** How do some microbes in biofertilizers help plants in addition to nutrient supply?\n   **Answer:** Many of these microbes help plants tolerate abiotic stresses.\n\n10. **Question:** What is the significance of sustainable agriculture as mentioned in the document?\n    **Answer:** Sustainable agriculture emphasizes the use of biofertilizers for nutrient management to maintain soil health and reduce reliance on chemical fertilizers.",
    "1. **Question:** What year did the Indian Council of Agricultural Research (ICAR) initiate the National Mission on Sustainable Agriculture (NMSA)?  \n   **Answer:** The National Mission on Sustainable Agriculture (NMSA) was initiated in 2014.\n\n2. **Question:** What is the main purpose of biofertilizers as mentioned in the text?  \n   **Answer:** The main purpose of biofertilizers is to improve soil health and enrich the nutrient quality of soil.\n\n3. **Question:** Which regions in India dominate the production and consumption of biofertilizers?  \n   **Answer:** The south zone of India dominates both in terms of production and consumption of biofertilizers.\n\n4. **Question:** What are the potential candidates for biofertilizers mentioned in the text?  \n   **Answer:** Bacteria, fungi, and cyanobacteria (blue-green algae) are considered potential candidates for biofertilizers.\n\n5. **Question:** What are the categories of biofertilizers as described in the document?  \n   **Answer:** The categories of biofertilizers include nitrogen fixing, phosphate, potash and zinc solubilizing and mobilizing, and plant growth promoting rhizobacteria.\n\n6. **Question:** What is a significant concern regarding the use of chemical fertilizers in agriculture?  \n   **Answer:** A significant concern is the effect of excessive fertilizers on soil quality and ground water, which compromises soil health over time.\n\n7. **Question:** How do biofertilizers compare to chemical fertilizers in terms of cost?  \n   **Answer:** Biofertilizers are considered economical and a cheaper source of nutrients compared to chemical fertilizers.\n\n8. **Question:** What additional benefits do biofertilizers provide besides nutrients?  \n   **Answer:** Biofertilizers provide growth promoting substances like hormones, vitamins, and amino acids that improve plant health and vigor.\n\n9. **Question:** What publication is mentioned in the text that compiles validated biofertilizers developed by ICAR institutes?  \n   **Answer:** The publication is titled “ICAR Technologies: Biofertilizers for Sustainable Crop Production.”\n\n10. **Question:** What has been the trend in agricultural production over the last few decades, according to the text?  \n    **Answer:** Agricultural production has increased significantly, leading to a sharp rise in the use of chemical fertilizers, which has raised concerns about soil health and biodiversity.",
    "1. **Question:** What is the main focus of the compendium “ICAR Technologies: Biofertilizers for Sustainable Crop Production”?  \n   **Answer:** The compendium focuses on biofertilizer technologies that have been validated under on-farm or multi-location trials, compiling efforts made by scientists to develop these technologies.\n\n2. **Question:** Who is the author of the foreword in the compendium?  \n   **Answer:** The foreword is written by Dr. T. Mohapatra, the Hon'ble Secretary, Department of Agricultural Research and Education (DARE) and Director General, ICAR.\n\n3. **Question:** What role do microorganisms play in agricultural practices according to the text?  \n   **Answer:** Microorganisms are key drivers of biogeochemical cycles, playing a crucial role in soil fertility and nutrient uptake by plants.\n\n4. **Question:** What types of microorganisms are classified as biofertilizers?  \n   **Answer:** Biofertilizers include nitrogen-fixing, phosphate, potassium, and zinc solubilizing microorganisms used for application to seeds or soil.\n\n5. **Question:** How do biofertilizers contribute to plant growth?  \n   **Answer:** Biofertilizers manipulate the rhizosphere of plants, increasing the number of beneficial microorganisms, which accelerates microbial processes and enhances the availability of nutrients that plants can assimilate.\n\n6. **Question:** What is integrated nutrient management (INM) and its relation to biofertilizers?  \n   **Answer:** Integrated nutrient management (INM) considers biofertilizers as an important component and advocates for the judicious application of fertilizers in conjunction with organic manures and biofertilizers to sustain crop production and soil health.\n\n7. **Question:** What are plant growth promoting rhizobacteria (PGPR)?  \n   **Answer:** PGPR are rhizosphere bacteria that favorably influence plant growth and yield of crops, helping plants overcome abiotic stress.\n\n8. **Question:** Name two specific biofertilizers mentioned in the content.  \n   **Answer:** Two specific biofertilizers mentioned are PUSA Azospirillum and PUSA Mycorrhiza.\n\n9. **Question:** Why are biofertilizers considered an economical and eco-friendly alternative to chemical fertilizers?  \n   **Answer:** Biofertilizers are deemed economical and eco-friendly because they enhance nutrient availability and soil health without the negative environmental impacts often associated with chemical fertilizers.\n\n10. **Question:** What is the significance of the compendium for Indian agriculture?  \n    **Answer:** The compendium is significant for Indian agriculture as it helps shape sustainable agricultural practices through the development and application of biofertilizer technologies.",
    "1. **Question:** What significant changes have occurred in the biofertilizer industry in India?  \n   **Answer:** The industry has shifted from carrier-based to liquid formulations, included microbial consortium in the Fertilizer Control Order (FCO), and increased the number of efficient strains, leading to a surge in production.\n\n2. **Question:** What organization is continuously striving to develop quality assured biofertilizers?  \n   **Answer:** The Indian Council of Agricultural Research (ICAR) is continuously working to develop quality assured biofertilizers using efficient and competitive strains.\n\n3. **Question:** How many biofertilizer technologies developed by ICAR are mentioned in the bulletin?  \n   **Answer:** The bulletin is a compilation of 41 biofertilizer technologies developed by ICAR.\n\n4. **Question:** What is the shelf life of the microbial constituents mentioned in the text?  \n   **Answer:** The shelf life of the microbial constituents is 12 months at temperatures between 25°C to 35°C.\n\n5. **Question:** What type of formulation is used for the microbial constituents Azotobacter chroococcum, Paenibacillus tylopili, and Bacillus decolorationis?  \n   **Answer:** They are used in liquid formulation at a concentration of 2 × 10^8 cfu/mL of each.\n\n6. **Question:** What target crops are mentioned for the application of the biofertilizers?  \n   **Answer:** The target crops include wheat, rice, maize, chickpea, soybean, papaya, fodder oat, and berseem.\n\n7. **Question:** What method is suggested for applying the biofertilizer formulation for seed treatment?  \n   **Answer:** For seed treatment, 100 mL of the formulation should be diluted in one litre of water for seeds to be sown in one acre.\n\n8. **Question:** What is the dilution ratio recommended for root dip application for seedlings?  \n   **Answer:** For root dip application, 500 mL of the formulation should be diluted in 2.5 litres of water for seedlings to be planted.\n\n9. **Question:** Which research institute is responsible for the development of the biotic stress management technologies?  \n   **Answer:** The National Institute of Abiotic Stress Management (NIASM) is mentioned in the context of agricultural research.\n\n10. **Question:** What abbreviation stands for the All India Coordinated Research Project?  \n    **Answer:** The abbreviation for the All India Coordinated Research Project is AICRP.",
    "1. **Question:** What is the recommended application volume of BioNPK for tree plants?  \n   **Answer:** The recommended application volume of BioNPK for tree plants is 10 mL per tree.\n\n2. **Question:** In which states is BioNPK targeted for use?  \n   **Answer:** BioNPK is targeted for use in Delhi, Punjab, Haryana, Uttar Pradesh, Gujarat, Bihar, and Manipur.\n\n3. **Question:** What percentage of chemical fertilizers can be saved per hectare using the product?  \n   **Answer:** The product can save up to 25-30 kg of nitrogen (N), 10-15 kg of phosphorus (P), and 2-5 kg of potassium (K) per hectare.\n\n4. **Question:** What was the year of commercialization for the BioNPK product?  \n   **Answer:** The BioNPK product was commercialized in 2017.\n\n5. **Question:** What is the cost of BioNPK per 100 mL?  \n   **Answer:** The cost of BioNPK is ₹50 per 100 mL.\n\n6. **Question:** Which crops are targeted for the microbial constituents in the biofertilizer described?  \n   **Answer:** The targeted crops include tomato, chilli, eggplant, marigold, and tuberose.\n\n7. **Question:** What is the shelf life of the liquid biofertilizer formulation at specified temperatures?  \n   **Answer:** The shelf life of the liquid biofertilizer formulation is 12 months when stored at 25°C to 35°C.\n\n8. **Question:** What increase in yield is reported for tomato when treated with the biofertilizer?  \n   **Answer:** The biofertilizer is reported to increase tomato yield by 25-30%.\n\n9. **Question:** Which specific variety of wheat was used to study the effect of BioNPK at ICAR-NBAIM?  \n   **Answer:** The variety of wheat used was HD2967.\n\n10. **Question:** Who can be contacted for more information regarding the biofertilizers developed by ICAR-NBAIM?  \n    **Answer:** For more information, one can contact the Director of ICAR-National Bureau of Agriculturally Important Microorganisms at Mau via email at director.nbaim@icar.gov.in.",
    "1. **Question:** What crops were targeted in the AIM project conducted in Mau?  \n   **Answer:** The AIM project targeted wheat, maize, rice, and mustard.\n\n2. **Question:** Which states in India were involved in the farmers' fields study for wheat and maize?  \n   **Answer:** The states involved were Uttar Pradesh, Bihar, and Punjab.\n\n3. **Question:** What is the shelf life of the Biofertilizers mentioned in the text?  \n   **Answer:** The shelf life of the Biofertilizers is 12 months at a temperature range of 25°C to 35°C.\n\n4. **Question:** What is the primary microbial constituent of the Bio Phos formulation?  \n   **Answer:** The primary microbial constituent of the Bio Phos formulation is Bacillus endophyticus (NAIMCC-B-01543).\n\n5. **Question:** How much chemical fertilizer can be saved per hectare using the Biofertilizers?  \n   **Answer:** The Biofertilizers can save chemical fertilizers up to 25-30 kg P/ha.\n\n6. **Question:** What percentage increase in grain yield can be expected from using the Biofertilizers on maize, wheat, rice, and mustard?  \n   **Answer:** A 7-11% increase in grain yield can be expected.\n\n7. **Question:** What is the method of application for the Biofertilizers when treating seeds?  \n   **Answer:** The method of application is to dilute 100 mL of the formulation in one liter of water for seeds to be sown in one acre.\n\n8. **Question:** What is the cost of the Biofertilizers mentioned in the document?  \n   **Answer:** The cost of the Biofertilizers is ₹50 per 100 mL.\n\n9. **Question:** Which crops does the Bio Zn formulation target?  \n   **Answer:** The Bio Zn formulation targets maize, wheat, mustard, and potato.\n\n10. **Question:** In which year were the Biofertilizers commercialized?  \n   **Answer:** The Biofertilizers were commercialized in 2017.",
    "1. **Question:** What is the microbial constituent used in the liquid formulation for wheat, rice, and maize?  \n   **Answer:** The microbial constituent is Azotobacter chroococcum (NAIMCC-B-00061/MTCC 25045).\n\n2. **Question:** What is the shelf life of the Azotobacter chroococcum formulation?  \n   **Answer:** The shelf life is 12 months at 25°C to 35°C.\n\n3. **Question:** How much nitrogen per hectare can be saved using the Azotobacter chroococcum formulation?  \n   **Answer:** It can save 20-25 kg N/ha.\n\n4. **Question:** What is the method of application for Azotobacter chroococcum on seeds?  \n   **Answer:** The method of application is seed treatment, where 100 mL of formulation is diluted to one litre with water for seeds to be sown in one acre.\n\n5. **Question:** In which states is the Azotobacter chroococcum formulation targeted?  \n   **Answer:** The target agroecological zones/states are Delhi, Punjab, and Uttar Pradesh.\n\n6. **Question:** What types of crops are addressed by the specific rhizobial strains mentioned in the text?  \n   **Answer:** The specific rhizobial strains target pulse crops such as chickpea, pigeon pea, green gram, pea, and lentil.\n\n7. **Question:** What is the cost of the liquid formulation for the rhizobial strains?  \n   **Answer:** The cost is ` 50/- per 100 mL.\n\n8. **Question:** How is the Anabaena variabilis formulation applied to rice?  \n   **Answer:** It is applied through soil application at a rate of 500 g/acre.\n\n9. **Question:** What is the shelf life of the Multani Mitti based formulation containing Anabaena variabilis?  \n   **Answer:** The shelf life is 03 months at 25°C to 35°C.\n\n10. **Question:** When was the Azotobacter chroococcum formulation commercialized?  \n    **Answer:** It was commercialized in 2017.",
    "1. **Question:** When was the PUSA Algal Biofertilizer commercialized?\n   **Answer:** The PUSA Algal Biofertilizer was commercialized in 2010.\n\n2. **Question:** What is the microbial constituent of the Icar Technologies biofertilizer mentioned?\n   **Answer:** The microbial constituent of the Icar Technologies biofertilizer is Azotobacter chroococcum W5 (NAIMCC-B-00061).\n\n3. **Question:** What crops are targeted by the Icar Technologies biofertilizer?\n   **Answer:** The target crops include cotton, wheat, maize, potato, brinjal, pearl millet, mustard, and onion.\n\n4. **Question:** What is the shelf life of the liquid formulation of the biofertilizer at 25°C to 35°C?\n   **Answer:** The shelf life of the liquid formulation is 36 months at 25°C to 35°C.\n\n5. **Question:** How much nitrogen does the Icar Technologies biofertilizer save per hectare?\n   **Answer:** The Icar Technologies biofertilizer saves 15-20 kg of nitrogen per hectare.\n\n6. **Question:** What is the method of application for the biofertilizer on seeds?\n   **Answer:** The method of application involves seed treatment, with 50 mL of formulation diluted to one liter with water for seeds to be sown in one acre, or 200 g for coating seeds for one acre.\n\n7. **Question:** What is the cost of the Icar Technologies biofertilizer per 200 g?\n   **Answer:** The cost of the Icar Technologies biofertilizer is ₹50 per 200 g.\n\n8. **Question:** Which companies have licensed the biofertilizers from ICAR-IARI?\n   **Answer:** The companies that have licensed the biofertilizers include Sai Bio Organics, Ecological Products Industries, Forex Fastners (P) Ltd., Eco Inputs, HBPL, and the Department of Horticulture, Hoshiarpur.\n\n9. **Question:** What increase in grain yield can be expected from using the Icar Technologies biofertilizer?\n   **Answer:** An increase in grain yield of 10-35% can be expected from using the Icar Technologies biofertilizer.\n\n10. **Question:** What is the method of application for the Azospirillum biofertilizer?\n    **Answer:** The method of application for the Azospirillum biofertilizer is seed treatment, with 200 g for coating seeds for one acre.",
    "1. **Question:** What are the specific rhizobial strains associated with chickpea crops?  \n   **Answer:** The rhizobial strain associated with chickpea crops is Mesorhizobium ciceri.\n\n2. **Question:** What is the shelf life of the microbial formulation mentioned for pulse crops?  \n   **Answer:** The shelf life is 3 months at 25°C to 35°C.\n\n3. **Question:** What method is used for applying the microbial formulation for pulse crops?  \n   **Answer:** The method of application is seed treatment, using 200 g for coating seeds for one acre.\n\n4. **Question:** Which crops are targeted by the microbial formulation described in the text?  \n   **Answer:** The target crops are chickpea, pigeon pea, black gram, pea, lentil, groundnut, cowpea, berseem, lucerne, dhaincha, and sunhemp.\n\n5. **Question:** How much nitrogen can be saved per hectare using the microbial formulation?  \n   **Answer:** The formulation can save 15-25 kg of nitrogen per hectare.\n\n6. **Question:** What is the estimated increase in yield for target crops when using the formulation?  \n   **Answer:** The estimated increase in yield is 30-60% in target crops.\n\n7. **Question:** What is the cost of the microbial formulation for pulse crops?  \n   **Answer:** The cost is ₹50 for 200 g.\n\n8. **Question:** Which institution has been involved in the validation of the microbial formulations for more than 30 years?  \n   **Answer:** The All India Coordinated Research Projects (AICRPs) on MULLaRP, Chickpea, and Soybean have been involved in the validation.\n\n9. **Question:** What is the microbial constituent of the PUSA biofertilizer for crops such as wheat and rice?  \n   **Answer:** The microbial constituent is Lactococcus lactis PHM5-37.\n\n10. **Question:** What is the shelf life of the liquid formulation of the PUSA biofertilizer?  \n    **Answer:** The shelf life of the liquid formulation is 12 months at 25°C to 35°C.",
    "1. **Question:** What is the target agroecological zone for the agricultural technologies mentioned in the text?  \n   **Answer:** The target agroecological zones/states include all states.\n\n2. **Question:** When was the commercialization of the mentioned agricultural technology initiated?  \n   **Answer:** The technology was commercialized in 1985.\n\n3. **Question:** How much does the biofertilizer cost per kilogram?  \n   **Answer:** The biofertilizer costs ` 50 per kg.\n\n4. **Question:** What is the yield improvement percentage provided by the technology mentioned in the text?  \n   **Answer:** The technology improves crop yield by 15-25%.\n\n5. **Question:** What is the microbial constituent of the biofertilizer developed by Icar Technologies?  \n   **Answer:** The microbial constituent is Bacillus sp.\n\n6. **Question:** What is the method of application for the biofertilizer?  \n   **Answer:** The method of application is seed treatment, where 50 mL of formulation is diluted to one liter with water for seeds to be sown in one acre.\n\n7. **Question:** Which crops are targeted for the biofertilizer mentioned in the text?  \n   **Answer:** The target crops include maize, wheat, rice, and pearl millet.\n\n8. **Question:** What is the shelf life of the biofertilizer at specified temperatures?  \n   **Answer:** The shelf life is 12 months at 25°C to 35°C.\n\n9. **Question:** Which company was licensed to commercialize the biofertilizer in Punjab?  \n   **Answer:** The biofertilizer was licensed to the Department of Horticulture, Hoshiarpur, Punjab.\n\n10. **Question:** What benefit does PUSA BIOPOTASH provide in terms of potassium augmentation?  \n    **Answer:** PUSA BIOPOTASH augments 10-15 kg K/ha.",
    "1. **Question:** What is the primary purpose of PUSA BioZinc as mentioned in the document?  \n   **Answer:** PUSA BioZinc is used as a biofertilizer to improve the growth and yield of crops such as wheat and rice.\n\n2. **Question:** What are the microbial constituents found in PUSA BioZinc?  \n   **Answer:** The microbial constituents in PUSA BioZinc include Azotobacter chroococcum, Burkholderia cepacia, and Bacillus decolorationis.\n\n3. **Question:** What is the shelf life of PUSA BioZinc?  \n   **Answer:** The shelf life of PUSA BioZinc is 12 months when stored at a temperature of 25°C to 35°C.\n\n4. **Question:** What method of application is recommended for PUSA BioZinc for seed treatment?  \n   **Answer:** For seed treatment, 100 mL of the formulation should be diluted to one litre with water for seeds to be sown in one acre.\n\n5. **Question:** In which states or agroecological zones is PUSA BioZinc targeted?  \n   **Answer:** PUSA BioZinc is targeted for use in Bihar, Jharkhand, West Bengal, Odisha, Chhattisgarh, Madhya Pradesh, Punjab, Rajasthan, Gujarat, Delhi, Uttarakhand, and Haryana.\n\n6. **Question:** What are the expected benefits of using PUSA BioZinc?  \n   **Answer:** The benefits of using PUSA BioZinc include saving 25-30 kg of nitrogen, 10-15 kg of phosphorus, and 2-5 kg of potassium per hectare, along with a 5-10% increase in grain yield in rice and wheat.\n\n7. **Question:** How much does PUSA BioZinc cost per 100 mL?  \n   **Answer:** PUSA BioZinc costs ₹125 per 100 mL.\n\n8. **Question:** What is the purpose of the NPK Biofertilizer as evaluated at ICAR-IARI?  \n   **Answer:** The NPK Biofertilizer is evaluated to enhance crop yield in rice and wheat while reducing the need for chemical fertilizers.\n\n9. **Question:** What is the commercial status of NPK Biofertilizer?  \n   **Answer:** NPK Biofertilizer is available for licensing through Agrinnovate India Ltd.\n\n10. **Question:** How does the application method for NPK Biofertilizer differ for seed treatment and root dip?  \n   **Answer:** For seed treatment, 100 mL of the formulation is diluted to one litre with water, while for root dip, 500 mL of the formulation is diluted to 2.5 litres with water for seedlings to be planted in one acre.",
    "1. **Question:** What are the microbial constituents of the Biofort (W) biofertilizer?  \n   **Answer:** The microbial constituents of Biofort (W) are Bacillus pumilus PW1, Providencia sp. PW5, and Brevundimonas diminuta PW7.\n\n2. **Question:** What is the shelf life of the biofertilizers mentioned in the text?  \n   **Answer:** The shelf life of the biofertilizers is 6 months at 25°C to 35°C.\n\n3. **Question:** Which crops are targeted by the Biofort (W) and Biofort (R) formulations?  \n   **Answer:** Biofort (W) targets wheat, while Biofort (R) targets rice.\n\n4. **Question:** What is the method of application for the biofertilizers?  \n   **Answer:** The methods of application include seed coating, soil application, or seedling dip at a rate of 500 g/acre.\n\n5. **Question:** In which states or agroecological zones is the Biofort (W) biofertilizer validated for use?  \n   **Answer:** Biofort (W) is validated for use in Delhi, Punjab, Haryana, and Andhra Pradesh.\n\n6. **Question:** What benefits does the Biofort biofertilizer provide to crops?  \n   **Answer:** Benefits include effective micronutrient mobilization to grains, saving chemical fertilizers (up to 30-50 kg N/ha), and a 10-15% increase in yield in target crops.\n\n7. **Question:** When was the Biofort biofertilizer commercialized?  \n   **Answer:** The Biofort biofertilizer was commercialized in 2015.\n\n8. **Question:** What are the microbial constituents of the second biofertilizer mentioned in the text?  \n   **Answer:** The microbial constituents of the second biofertilizer are Anabaena laxa and Calothrix elenkinii.\n\n9. **Question:** How is the second biofertilizer applied to crops?  \n   **Answer:** It can be applied via seed coating (1.25 kg/ha), soil application (1.25 kg suspended in 500 L of water for one ha), or seedling dip (1.25 kg suspended in 25 L of water for one ha).\n\n10. **Question:** What yield increase can be expected from the second biofertilizer application?  \n    **Answer:** The second biofertilizer can result in a 10-12% increase in yields.",
    "1. **Question:** What was the target crop for the application of Cyanobiocon at ICAR-IARI during 2013-14?\n   **Answer:** The target crop for Cyanobiocon application was chickpea var. Pusa 1103.\n\n2. **Question:** What are the microbial constituents included in the Cyanobiocon formulation?\n   **Answer:** The microbial constituents are Anabaena torulosa BF1, Nostoc carneum BF2, Nostoc piscinale BF3, and Anabaena doliolum BF4.\n\n3. **Question:** What is the shelf life of the Cyanobiocon biofertilizer?\n   **Answer:** The shelf life of Cyanobiocon is 6 months at 25°C to 35°C.\n\n4. **Question:** How is Cyanobiocon applied to the crops?\n   **Answer:** Cyanobiocon can be applied through seed coating (1.25 kg/ha), soil application (1.25 kg suspended in 500 L water for one ha), or seedling dip (1.25 kg suspended in 25 L water for one ha).\n\n5. **Question:** In which states or agroecological zones was the Cyanobiocon validated?\n   **Answer:** Cyanobiocon was validated in Delhi, Punjab, Haryana, Andhra Pradesh, Telangana, and Maharashtra.\n\n6. **Question:** What benefits does the application of Cyanobiocon provide to crops?\n   **Answer:** The benefits include a 10–20% increase in grain micronutrients, saving 30-50 kg N/ha, a 10-15% increase in yields, and enrichment of soil carbon.\n\n7. **Question:** Which crop was targeted for the Cyanonutricon application at ICAR-IARI in 2019?\n   **Answer:** The target crop for Cyanonutricon application was rice var. Pusa Basmati 1509.\n\n8. **Question:** What is the method of application for Cyanonutricon in maize and rabi sorghum?\n   **Answer:** The method of application includes seed treatment (30 g/kg seeds) and soil application (2.5 kg/ha mixed with 50 kg of well-decomposed FYM).\n\n9. **Question:** What is the expected yield increase from the application of Cyanonutricon on maize and rabi sorghum?\n   **Answer:** The expected yield increase from Cyanonutricon application is 20-30% for maize and rabi sorghum.\n\n10. **Question:** When was Cyanobiocon commercialized, and where is it registered?\n   **Answer:** Cyanobiocon was commercialized in 2015 and is registered at the Zonal Technology Management & Business Planning and Development Unit, ICAR-IARI, New Delhi.",
    "1. **Question:** What is the microbial constituent used in the carrier-based formulation for sorghum?  \n   **Answer:** Bacillus amyloliquefaciens B17 (NAIMCC-B-00921).\n\n2. **Question:** What is the shelf life of the biofertilizer formulated with Bacillus amyloliquefaciens B17?  \n   **Answer:** 6 months at 25°C to 35°C.\n\n3. **Question:** What method of application is recommended for the biofertilizer targeting sorghum?  \n   **Answer:** Seed treatment of 30 g/kg seeds and soil application of 2.5 kg/ha mixed with 50 kg of well decomposed FYM.\n\n4. **Question:** Which states are targeted for the application of the biofertilizer for sorghum?  \n   **Answer:** Maharashtra and Telangana.\n\n5. **Question:** What yield increase can be expected from the use of the biofertilizer on sorghum?  \n   **Answer:** A 15-20% increase in yield.\n\n6. **Question:** What is the target crop for the microbial capsules that can enhance root production and protect against soil-borne pathogens?  \n   **Answer:** All plantation and horticultural crops.\n\n7. **Question:** What is the shelf life of the microbial capsules used for soil drenching?  \n   **Answer:** 12 months at 25°C to 35°C.\n\n8. **Question:** How many capsules are recommended per acre for soil drenching application?  \n   **Answer:** 8-10 capsules per acre.\n\n9. **Question:** What are the target agroecological zones for the biofertilizers mentioned in the content?  \n   **Answer:** All agroecological zones/states.\n\n10. **Question:** What types of crops can benefit from the biofertilizer containing Azotobacter tropicalis, Bacillus aryabhattai, and Pseudomonas taiwanensis?  \n   **Answer:** All annual and perennial horticultural and plantation crops.",
    "1. **Question:** What is the main benefit of using the Arka Microbial Consortium in agriculture?  \n   **Answer:** It saves 25% of nitrogen (N) and phosphorus (P) fertilizers and enhances yield by 10 to 15% in target crops.\n\n2. **Question:** How much does Arka Microbial Consortium cost per kilogram?  \n   **Answer:** The cost of Arka Microbial Consortium is `147/- per kg.\n\n3. **Question:** Which crops are targeted by the Arka Microbial Consortium?  \n   **Answer:** The target crops include all annual and perennial horticultural and plantation crops.\n\n4. **Question:** What is the shelf life of the microbial constituents in the Arka Microbial Consortium?  \n   **Answer:** The shelf life is 6 months at temperatures between 25°C to 35°C.\n\n5. **Question:** In what year was the Arka Microbial Consortium commercialized?  \n   **Answer:** The Arka Microbial Consortium was commercialized in 2013.\n\n6. **Question:** Who are some of the entrepreneurs licensed to commercialize the Arka Microbial Consortium?  \n   **Answer:** Licensed entrepreneurs include M/s Bloom Biotech, M/s Gayatri Hasiru Uddime, and M/s Natura Crop Care.\n\n7. **Question:** What method of application is recommended for the Arka Microbial Consortium?  \n   **Answer:** It can be applied through seed treatment, soil drenching, or enrichment of FYM and cocopeat used for raising nurseries at a rate of 5 kg/acre.\n\n8. **Question:** How much net savings can be achieved per hectare when using the Arka Microbial Consortium?  \n   **Answer:** The net savings can range from `1000 to `3000 per hectare.\n\n9. **Question:** What is the cost of the other biofertilizer, Arka Actino Plus?  \n   **Answer:** The cost of Arka Actino Plus is `140 per kg.\n\n10. **Question:** Which microbial constituent is used in Arka Actino Plus?  \n    **Answer:** The microbial constituent used in Arka Actino Plus is Bacillus megaterium (NAIMCC-B-02718).",
    "1. **Question:** What is the shelf life of the Kera Probio treatment for coconut seedlings?  \n   **Answer:** The shelf life is 6 months at 25°C to 35°C.\n\n2. **Question:** What is the method of application for Kera Probio for coconut seedlings?  \n   **Answer:** The method of application includes seedling dip (mix 500 g in 5 L of water and dip the seedlings for 8-10 hours) and soil application (25 g per plant).\n\n3. **Question:** What are the target crops for the Kera Probio treatment?  \n   **Answer:** The target crops are coconut, tomato, brinjal, and chilli.\n\n4. **Question:** In which agroecological zone is Kera Probio primarily validated?  \n   **Answer:** Kera Probio is primarily validated in Kerala.\n\n5. **Question:** What are the expected benefits of using Kera Probio on coconut palms?  \n   **Answer:** The expected benefits include a yield enhancement of 10-12% nuts per palm per year and additional remuneration of ₹20,000/ha to ₹30,000-₹40,000/ha if vegetables are taken as intercrops.\n\n6. **Question:** What is the cost of Kera Probio per kg?  \n   **Answer:** The cost is ₹100 per kg.\n\n7. **Question:** What microbial constituent is used in the Cocoa Probio biofertilizer?  \n   **Answer:** The microbial constituent used is Pseudomonas putida (NAIMCC-B-02719).\n\n8. **Question:** What is the target crop for the biofertilizer that uses Claroideoglomus etunicatum?  \n   **Answer:** The target crop is coconut.\n\n9. **Question:** What is the method of application for the biofertilizer targeting cocoa and vegetable crops?  \n   **Answer:** The method of application is soil application (25 g per plant), with a booster dose of 100 g per plant for transplanted seedlings and 2 kg/acre for vegetable crops.\n\n10. **Question:** What increases in dry matter can be expected from using the Cocoa Probio treatment?  \n    **Answer:** A 50-60% increase in dry matter in seedlings can be expected.",
    "1. **Question:** What are the microbial constituents found in the Icar Technologies biofertilizers?  \n   **Answer:** The microbial constituents include Pseudomonas gessardii BHU1, Pseudomonas putida S1(6), Pseudomonas aeruginosa BM6, Enterobacter cloacae BM8, Bacillus sp., Sinorhizobium americanum NRCG4, and Rhizobium sp. NRCG9.\n\n2. **Question:** What is the shelf life of the biofertilizers mentioned in the text?  \n   **Answer:** The shelf life is 12 months at temperatures between 25°C to 35°C.\n\n3. **Question:** What is the method of application for the carrier-based formulation of the biofertilizers?  \n   **Answer:** For the carrier-based formulation, 4 g of the formulation is suspended in 50 mL of water along with 5 g of sugarcane jaggery and mixed with one kilogram of groundnut kernel.\n\n4. **Question:** Which crops are targeted by the biofertilizers discussed in the document?  \n   **Answer:** The target crop is groundnut.\n\n5. **Question:** In which states or agroecological zones is the biofertilizer intended to be used?  \n   **Answer:** The target agroecological zones/states include Gujarat, Andhra Pradesh, Karnataka, Maharashtra, Telangana, Tamil Nadu, Rajasthan, Odisha, West Bengal, NEH region, Madhya Pradesh, and Uttar Pradesh.\n\n6. **Question:** How much can pod yield be enhanced using these biofertilizers?  \n   **Answer:** Pod yield can be enhanced by up to 20%.\n\n7. **Question:** What cost savings can be achieved per hectare by using the biofertilizers?  \n   **Answer:** Input costs can be saved by ₹1000-3000 per hectare.\n\n8. **Question:** What is the form of the biofertilizers provided by Icar Technologies?  \n   **Answer:** The biofertilizers are available in carrier-based and liquid formulations.\n\n9. **Question:** Which organization validated the biofertilizers?  \n   **Answer:** The validation was done by ICAR-DGR, Junagadh, and farmers’ fields in Junagadh, along with AICRP on Groundnut centres.\n\n10. **Question:** Where can the biofertilizers be licensed from?  \n    **Answer:** The biofertilizers can be licensed through Agrinnovate India Ltd. (www.agrinnovateindia.co.in).",
    "1. **Question:** What is the microbial constituent used in the biofertilizer for groundnut mentioned in the text?  \n   **Answer:** The microbial constituents include Pseudomonas putida DAPG2, Pseudomonas putida DAPG4, Pseudomonas putida FP86, and Pseudomonas fluorescens FP98.\n\n2. **Question:** What is the shelf life of the biofertilizer formulated with Bacillus firmus J22?  \n   **Answer:** The shelf life is 24 months at temperatures between 25°C to 35°C.\n\n3. **Question:** How does the biofertilizer improve the pod yield of groundnut?  \n   **Answer:** It improves pod yield by 21%.\n\n4. **Question:** What is the method of application for the biofertilizer when using a carrier-based formulation?  \n   **Answer:** The method involves suspending 4 g of the formulation in 50 mL of water along with 5 g of sugarcane jaggery and then mixing it with one kilogram of groundnut kernel.\n\n5. **Question:** In which states or regions is the biofertilizer targeted for use?  \n   **Answer:** The targeted agroecological zones include Gujarat, Andhra Pradesh, Karnataka, Maharashtra, Telangana, Tamil Nadu, Rajasthan, Odisha, West Bengal, NEH region, Madhya Pradesh, and Uttar Pradesh.\n\n6. **Question:** What percentage reduction in the incidence of collar and stem rot does the biofertilizer achieve?  \n   **Answer:** It reduces the incidence of collar and stem rot by 60%.\n\n7. **Question:** What are the expected savings in input costs per hectare when using the biofertilizer?  \n   **Answer:** The expected savings in input costs are between ₹1500 to ₹2500 per hectare.\n\n8. **Question:** What additional benefits does the biofertilizer provide in terms of nutrient availability?  \n   **Answer:** It improves the availability of macro- and micro-nutrients (P, K, Mn, Fe, Zn, etc.) by 20-25%.\n\n9. **Question:** How much irrigation water can be saved when using the NutGrow biofertilizer?  \n   **Answer:** NutGrow can save 30-40% irrigation water.\n\n10. **Question:** Where can the biofertilizer technologies mentioned in the text be commercially available for licensing?  \n    **Answer:** The biofertilizer technologies are available for licensing through the ICAR-Directorate of Groundnut Research in Junagadh, Gujarat.",
    "1. **Question:** What is the pod yield of groundnut under protective irrigations in summer conditions?\n   **Answer:** The pod yield of groundnut under protective irrigations in summer conditions is 2200-2300 kg/ha.\n\n2. **Question:** How much does drought stress alleviation improve pod yield in groundnut under rainfed conditions?\n   **Answer:** Drought stress alleviation improves pod yield in groundnut under rainfed conditions by up to 32%.\n\n3. **Question:** What is the percentage improvement in yield for soybean and pigeon pea due to drought stress alleviation?\n   **Answer:** Drought stress alleviation improves yield in soybean and pigeon pea by up to 20%.\n\n4. **Question:** What is the shelf life of the biofertilizer containing Bacillus firmus J22N and Bacillus subtilis REN51N?\n   **Answer:** The shelf life of the biofertilizer is 24 months at 25°C to 35°C.\n\n5. **Question:** What method is used to apply the biofertilizer for groundnut?\n   **Answer:** The biofertilizer for groundnut can be applied using a carrier-based method (4 g of formulation suspended in 50 mL of water along with 5 g of sugarcane jaggery) or a liquid method (10 mL of bioformulation diluted with 40 mL of water along with 5 g of sugarcane jaggery).\n\n6. **Question:** Which districts of Gujarat are targeted for the application of the biofertilizer for groundnut?\n   **Answer:** The targeted districts in Gujarat for the application of the biofertilizer for groundnut are Kachchh, Porbandar, Junagadh, Dwarka, Gir-Somnath, and Surendranagar.\n\n7. **Question:** What is the yield improvement for pod and haulm due to salinity stress alleviation with SalGuard?\n   **Answer:** Salinity stress alleviation with SalGuard improves pod yield by up to 18% and haulm yield by up to 6%.\n\n8. **Question:** What type of crops can benefit from the biofertilizer containing the metabolic product of Rhizobium sp. (NCIM 5599)?\n   **Answer:** The biofertilizer can benefit sorghum, soybean, maize, brinjal, onion, and fenugreek.\n\n9. **Question:** How can the biofertilizer containing Rhizobium sp. be applied?\n   **Answer:** It can be applied through foliar spray (50 mL/m²), drip-irrigation system (5-10 kg/ha), seed-treatment/seed-coating (10 g/kg), or soil drenching (5-10 kg/ha).\n\n10. **Question:** What benefit does the biofertilizer provide for soybean?\n    **Answer:** The biofertilizer promotes nodulation in soybean.",
    "1. **Question:** What is the shelf life of the product mentioned in the agricultural content?  \n   **Answer:** The shelf life is 24 months at 25°C to 35°C.\n\n2. **Question:** Which crops are targeted for the application of the mentioned agricultural products?  \n   **Answer:** The target crops include rice, black pepper, fruits, and plantation crop nurseries.\n\n3. **Question:** What is the method of application for rice using the product?  \n   **Answer:** For rice, the method of application is seed treatment at 40 g/kg seed and nursery application at 50 g/m² by pouring the water suspension at 7 and 14 days after sowing.\n\n4. **Question:** Which states or agroecological zones are targeted for the agricultural applications?  \n   **Answer:** The target agroecological zones/states include Goa, Coastal Maharashtra, Coastal Karnataka, and Kerala.\n\n5. **Question:** What year was the product commercialized?  \n   **Answer:** The product was commercialized in 2019.\n\n6. **Question:** What is the cost per kilogram of the biofertilizer mentioned in the content?  \n   **Answer:** The cost is ₹300 per kg.\n\n7. **Question:** What benefits does the product provide for rice crops?  \n   **Answer:** The benefits include a 12% increase in grain yield in rice and reduced incidence of soil-borne diseases in vegetable crops (40-60%) and foot rot in black pepper (70-80%).\n\n8. **Question:** What is the microbial constituent of the GoaBio-1 biofertilizer?  \n   **Answer:** The microbial constituent of GoaBio-1 is Bacillus methylotrophicus RCh6-2b (NAIMCC-B-01889).\n\n9. **Question:** How was the effectiveness of GoaBio-2 validated?  \n   **Answer:** The effectiveness of GoaBio-2 was validated on brinjal, tomato, chilli, and black pepper at ICAR-CCARI, Goa, and under farmers’ fields for three years.\n\n10. **Question:** What are the reported reductions in soil-borne disease incidences for brinjal and chilli when using the biofertilizer?  \n    **Answer:** The reductions in soil-borne disease incidences are 70-80% for bacterial wilt in brinjal and 40-60% for wilt and root rot in chilli.",
    "1. **Question:** What is the type of formulation for vi2 (MCC 3432)?  \n   **Answer:** Liquid formulation.\n\n2. **Question:** What is the recommended shelf life for vi2 (MCC 3432) at 25°C to 35°C?  \n   **Answer:** 12 months.\n\n3. **Question:** What is the target crop for the biofertilizer vi2 (MCC 3432)?  \n   **Answer:** Rice.\n\n4. **Question:** How should vi2 (MCC 3432) be applied during cultivation?  \n   **Answer:** Seedling root dip treatment at 500 mL/ha.\n\n5. **Question:** In which state has the vi2 (MCC 3432) been validated for use?  \n   **Answer:** Odisha.\n\n6. **Question:** What percentage of chemical N-fertilizers can be saved using NRRI-EndoN?  \n   **Answer:** 25%.\n\n7. **Question:** What is the microbial constituent of the biofertilizer NRRI-RhizoN?  \n   **Answer:** Bacillus megaterium NBAII EXB53.\n\n8. **Question:** What type of crops can benefit from the biofertilizer that uses Bacillus megaterium?  \n   **Answer:** Chilli, capsicum, tomato, brinjal, cauliflower, and cabbage.\n\n9. **Question:** What is the method of application for the biofertilizer containing Bacillus amyloliquefaciens?  \n   **Answer:** Soil application as bio-enriched FYM, mixed with matured FYM.\n\n10. **Question:** How long should the bio-enriched FYM be allowed to multiply under shaded field conditions?  \n   **Answer:** For one week with intermittent mixing every two days.",
    "1. **Question:** What is the target agroecological zone for the CIARI-Bioconsortia technology?  \n   **Answer:** The target agroecological zone for the CIARI-Bioconsortia technology is the Andaman and Nicobar Islands.\n\n2. **Question:** Which crops were validated for the CIARI-Bioconsortia technology?  \n   **Answer:** The CIARI-Bioconsortia technology was validated on brinjal and flower crops.\n\n3. **Question:** How long was the validation period for the CIARI-Bioconsortia technology?  \n   **Answer:** The validation period for the CIARI-Bioconsortia technology was three years.\n\n4. **Question:** What is the shelf life of the biofertilizers developed by ICAR?  \n   **Answer:** The shelf life of the biofertilizers developed by ICAR is 12 months at temperatures ranging from 25°C to 35°C.\n\n5. **Question:** What method of application is recommended for the biofertilizers on vegetable crops?  \n   **Answer:** The recommended method of application for the biofertilizers on vegetable crops includes seed treatment at 10 ml/kg seeds and foliar spray at 5 L/ha at 20-30 days interval.\n\n6. **Question:** What are the microbial constituents used in the ICAR biofertilizers?  \n   **Answer:** The microbial constituents used in the ICAR biofertilizers include Bacillus amyloliquefaciens, Lysinibacillus sphaericus, and Bacillus subtilis.\n\n7. **Question:** What benefits do the ICAR biofertilizers provide to plants?  \n   **Answer:** The ICAR biofertilizers enhance plant growth by promoting uniform seed germination, high seedling vigor, and uniform plant growth; they also act as an effective biocontrol agent against major foliar diseases.\n\n8. **Question:** Where can the CIARI-Bioconsortia technology be commercialized?  \n   **Answer:** The CIARI-Bioconsortia technology is available for licensing.\n\n9. **Question:** Who should be contacted for more information about the CIARI technologies?  \n   **Answer:** For more information about the CIARI technologies, contact the Director at ICAR-Central Island Agricultural Research Institute, Port Blair, Andaman and Nicobar Islands.\n\n10. **Question:** In which year was the effect of CIARI-GroPro on brinjal evaluated?  \n    **Answer:** The effect of CIARI-GroPro on brinjal was evaluated during the year 2015-16.",
    "1. **Question:** What is the primary responsibility of the Indian Council of Agricultural Research (ICAR)?  \n   **Answer:** The ICAR is responsible for the organization and management of research, education, and extension in the field of agriculture, animal sciences, and fisheries.\n\n2. **Question:** What types of institutions does ICAR operate as part of its national research and training network?  \n   **Answer:** ICAR operates Central Research Institutes (CRIs), National Research Centers (NRCs), Project Directorates (PDs), and Project Coordinating Units (PCUs), among others.\n\n3. **Question:** How does ICAR receive budgetary support from the Government?  \n   **Answer:** ICAR receives budgetary support through Government of India grants, proceeds from the Agricultural Produce Cess Act, and other sources including internal resource generation.\n\n4. **Question:** What significant change occurred in the ICAR budget classification starting from the year 2017-18?  \n   **Answer:** The merger of Plan and Non-Plan Budget occurred, and the Government’s classification will now be done on Revenue and Capital.\n\n5. **Question:** How is the total expenditure from Government of India grants divided?  \n   **Answer:** The total expenditure is divided into three components: Grant for Creation of Capital Assets, Grant-in-Aid-Salary, and Grant-in-Aid General including Pension.\n\n6. **Question:** What was the gross budget for ICAR in the year 2019-2020?  \n   **Answer:** The gross budget for ICAR in the year 2019-2020 was 8078.76 crore.\n\n7. **Question:** What was the net budget for ICAR in 2018-2019?  \n   **Answer:** The net budget for ICAR in 2018-2019 was 7952.73 crore.\n\n8. **Question:** What was the budget allocation for the Agricultural Extension sector in 2019-2020?  \n   **Answer:** The budget allocation for the Agricultural Extension sector in 2019-2020 was 208.67 crore.\n\n9. **Question:** What does the ICAR budget book include regarding the cadre strength of scientists and other categories?  \n   **Answer:** Part-VIII of the ICAR budget book provides a summary of the cadre strength of scientists and other categories.\n\n10. **Question:** What is the total establishment expenditure of the ICAR Secretariat for the year 2019-2020?  \n    **Answer:** The total establishment expenditure of the ICAR Secretariat for the year 2019-2020 was 14.80 crore.",
    "1. **Question:** What is the total budget allocated for Agricultural Engineering according to the provided data?\n   **Answer:** The total budget allocated for Agricultural Engineering is 42.68.\n\n2. **Question:** What is the budget for Crop Science in the year indicated in the document?\n   **Answer:** The budget for Crop Science is 399.66.\n\n3. **Question:** Which initiative is associated with a budget of 50.00?\n   **Answer:** The Climate Resilient Agriculture Initiative is associated with a budget of 50.00.\n\n4. **Question:** How much funding is allocated to Horticultural Science?\n   **Answer:** The funding allocated to Horticultural Science is 154.90.\n\n5. **Question:** What is the total budget for Animal Science?\n   **Answer:** The total budget for Animal Science is 271.97.\n\n6. **Question:** What is the budget for Fisheries Science in the provided content?\n   **Answer:** The budget for Fisheries Science is 115.85.\n\n7. **Question:** How much funding is allocated to Agricultural Universities and Institutions?\n   **Answer:** The funding allocated to Agricultural Universities and Institutions is 658.37.\n\n8. **Question:** What amount is designated for the National Agricultural Higher Education Project?\n   **Answer:** The amount designated for the National Agricultural Higher Education Project is 5.00.\n\n9. **Question:** What is the budget total for Natural Resource Management?\n   **Answer:** The total budget for Natural Resource Management is 167.68.\n\n10. **Question:** According to the document, what is the total budget for Central Sector Schemes/Projects?\n    **Answer:** The total budget for Central Sector Schemes/Projects is 2166.46.",
    "1. **Question:** What was the total budget for the year 2019-2020 according to the agricultural content?  \n   **Answer:** The total budget for the year 2019-2020 was 8078.76 lakh.\n\n2. **Question:** How much was allocated for Agricultural Research and Education in the budget for 2018-2019?  \n   **Answer:** The allocation for Agricultural Research and Education in the budget for 2018-2019 was 7485.17 lakh.\n\n3. **Question:** What was the amount of the actual government grant for ICAR in the budget for 2019-2020?  \n   **Answer:** The actual government grant for ICAR in the budget for 2019-2020 was 756780.00 lakh.\n\n4. **Question:** What were the actual revenue receipts for the year 2018-19?  \n   **Answer:** The actual revenue receipts for the year 2018-19 were 23978.10 lakh.\n\n5. **Question:** How much was the allocation for DARE in the budget for 2019-2020?  \n   **Answer:** The allocation for DARE in the budget for 2019-2020 was 51096.00 lakh.\n\n6. **Question:** What was the total for Economic Services in the budget for 2019-2020?  \n   **Answer:** The total for Economic Services in the budget for 2019-2020 was 7592.32 lakh.\n\n7. **Question:** How much was allocated for the Secretariat-Economic Services in the budget for 2018-2019?  \n   **Answer:** The allocation for the Secretariat-Economic Services in the budget for 2018-2019 was 7.60 lakh.\n\n8. **Question:** What is the estimated revenue receipt for the year 2017-18?  \n   **Answer:** The estimated revenue receipt for the year 2017-18 was 20013.90 lakh.\n\n9. **Question:** What was the total budget for the year 2018-2019 as per the revised estimates?  \n   **Answer:** The total budget for the year 2018-2019 as per the revised estimates was 7952.73 lakh.\n\n10. **Question:** How much was the total for \"North Eastern Areas\" in the budget for 2019-2020?  \n    **Answer:** The total for \"North Eastern Areas\" in the budget for 2019-2020 was 486.44 lakh.",
    "1. **Question:** What was the total revenue receipt target for the year 2019-20?  \n   **Answer:** The total revenue receipt target for the year 2019-20 was 9167.50 lakh.\n\n2. **Question:** Which division achieved the highest revenue receipts in the year 2019-20?  \n   **Answer:** The Animal Science division achieved the highest revenue receipts in the year 2019-20 with 2845.29 lakh.\n\n3. **Question:** How much revenue was generated by the Crop Science division in 2019-20?  \n   **Answer:** The Crop Science division generated 1697.63 lakh in 2019-20.\n\n4. **Question:** What was the revenue achievement for Agricultural Extension in 2019-20?  \n   **Answer:** The revenue achievement for Agricultural Extension in 2019-20 was 0.00 lakh.\n\n5. **Question:** What was the revenue receipt from the Fisheries Science division in 2019-20?  \n   **Answer:** The Fisheries Science division had revenue receipts of 516.48 lakh in 2019-20.\n\n6. **Question:** How much revenue was generated by Agricultural Engineering in 2019-20?  \n   **Answer:** Agricultural Engineering generated revenue of 370.51 lakh in 2019-20.\n\n7. **Question:** What was the total revenue receipts for the year 2018-19?  \n   **Answer:** The total revenue receipts for the year 2018-19 were 7314.79 lakh.\n\n8. **Question:** Which division had no revenue targets set from 2019-20 onwards?  \n   **Answer:** The Agricultural Scientists’ Recruitment Board (ASRB) had no revenue targets set from 2019-20 onwards.\n\n9. **Question:** What was the revenue generated by the Dte. of Groundnut Research in 2018-19?  \n   **Answer:** The Dte. of Groundnut Research generated revenue of 8.74 lakh in 2018-19.\n\n10. **Question:** How much revenue was achieved by the Indian Institute of Millet Research in 2018-19?  \n    **Answer:** The Indian Institute of Millet Research achieved a revenue of 41.80 lakh in 2018-19.",
    "1. **Question:** What was the total revenue generation for Crop Sciences in 2018-19?\n   **Answer:** The total revenue generation for Crop Sciences in 2018-19 was ₹1329.77 lakh.\n\n2. **Question:** Which institute had the highest revenue achievement in Horticultural Sciences during 2018-19?\n   **Answer:** The Central Plantation Crops Research Institute (CPCRI) in Kasaragod had the highest revenue achievement in Horticultural Sciences with ₹349.93 lakh.\n\n3. **Question:** How much revenue did the Indian Institute of Maize Research achieve in 2018-19?\n   **Answer:** The Indian Institute of Maize Research achieved ₹29.48 lakh in 2018-19.\n\n4. **Question:** What was the revenue target for the Indian Institute of Oilseed Research for the year 2019-2020?\n   **Answer:** The revenue target for the Indian Institute of Oilseed Research for the year 2019-2020 was ₹115.15 lakh.\n\n5. **Question:** Which institute generated ₹118.17 lakh in total revenue during 2018-19?\n   **Answer:** The Directorate of Cashew Research in Puttur generated ₹118.17 lakh in total revenue during 2018-19.\n\n6. **Question:** How much revenue did the NRC Grapes in Pune achieve in 2018-19?\n   **Answer:** The NRC Grapes in Pune achieved ₹97.63 lakh in revenue in 2018-19.\n\n7. **Question:** What was the actual achievement of the Indian Institute of Seed Sciences, Mau in 2018-19?\n   **Answer:** The Indian Institute of Seed Sciences, Mau had an actual achievement of ₹33.14 lakh in 2018-19.\n\n8. **Question:** How much did the Directorate of Mushroom Research in Solan earn from its activities in 2018-19?\n   **Answer:** The Directorate of Mushroom Research in Solan earned ₹79.14 lakh from its activities in 2018-19.\n\n9. **Question:** What was the total revenue generated by the Horticultural Sciences institutes in 2018-19?\n   **Answer:** The total revenue generated by the Horticultural Sciences institutes in 2018-19 was ₹1458.41 lakh.\n\n10. **Question:** Which institute reported zero revenue from sales/services in 2018-19?\n    **Answer:** The NRC Orchids in Sikkim reported zero revenue from sales/services in 2018-19, achieving only ₹0.22 lakh in total revenue.",
    "1. **Question:** What was the total revenue generated by ICAR Research Complex NEH Region, Barapani in 2018-19?  \n   **Answer:** The total revenue generated was 376.34 lakh.\n\n2. **Question:** How much revenue did the Indian Institute of Soil & Water Conservation, Dehradun generate from Schedule 8 in 2018-19?  \n   **Answer:** The revenue from Schedule 8 was 94.32 lakh.\n\n3. **Question:** What is the revenue generation target for the Central Institute of Agricultural Engineering, Bhopal for the year 2019-2020?  \n   **Answer:** The revenue generation target is 60.32 lakh.\n\n4. **Question:** How much income did the National Dairy Research Institute, Karnal generate in total during 2018-19?  \n   **Answer:** The total income generated was 482.93 lakh.\n\n5. **Question:** Which institute achieved a total revenue of 66.87 lakh in 2018-19?  \n   **Answer:** The institute is CCARI, Goa.\n\n6. **Question:** What was the actual revenue generated by the Indian Institute of Farming System Research, Modipuram from Schedule 12?  \n   **Answer:** The actual revenue from Schedule 12 was 0.72 lakh.\n\n7. **Question:** In 2018-19, what was the total revenue generated by the Central Institute of Research on Buffaloes, Hisar?  \n   **Answer:** The total revenue generated was 368.40 lakh.\n\n8. **Question:** How much did the Mahatma Gandhi Integrated Farming Research Institute, Motihari earn from Schedule 10 in 2018-19?  \n   **Answer:** They earned 0.26 lakh from Schedule 10.\n\n9. **Question:** What was the total revenue generated by the Indian Institute of Water Management, Bhubaneswar in 2018-19?  \n   **Answer:** The total revenue generated was 102.72 lakh.\n\n10. **Question:** How much income did the Dte. of Weed Science Research, Jabalpur generate from Schedule 8 in 2018-19?  \n    **Answer:** The income from Schedule 8 was 56.15 lakh.",
    "1. **Question:** What was the actual achievement in revenue for NRC Camel, Bikaner during the year 2018-19?  \n   **Answer:** The actual achievement in revenue for NRC Camel, Bikaner was 11.33 lakh.\n\n2. **Question:** How much revenue did the Directorate on Poultry Research, Hyderabad generate in total during 2018-19?  \n   **Answer:** The Directorate on Poultry Research, Hyderabad generated a total of 186.33 lakh in revenue during 2018-19.\n\n3. **Question:** What was the total revenue generated by CIBA, Chennai in the year 2018-19?  \n   **Answer:** CIBA, Chennai generated a total revenue of 64.36 lakh in the year 2018-19.\n\n4. **Question:** Which institute had the highest revenue achievement in the Fisheries category during 2018-19?  \n   **Answer:** CIFE, Mumbai had the highest revenue achievement in the Fisheries category with a total of 105.34 lakh.\n\n5. **Question:** What was the total revenue for Agricultural Economics & Statistics for the year 2018-19?  \n   **Answer:** The total revenue for Agricultural Economics & Statistics for the year 2018-19 was 20.77 lakh.\n\n6. **Question:** How much revenue did NAARM, Hyderabad achieve under Agricultural Education in 2018-19?  \n   **Answer:** NAARM, Hyderabad achieved a revenue of 191.62 lakh under Agricultural Education in 2018-19.\n\n7. **Question:** What is the revenue target for NRC PIG, Guwahati for the year 2019-2020?  \n   **Answer:** The revenue target for NRC PIG, Guwahati for the year 2019-2020 is 83.54 lakh.\n\n8. **Question:** Which institute generated the least revenue in the Fisheries category during 2018-19?  \n   **Answer:** The Directorate of Cold Water Fisheries Research, Bhimtal generated the least revenue in the Fisheries category, with a total of 4.14 lakh.\n\n9. **Question:** What total revenue did the Central Institute for Women in Agriculture, Bhubaneswar generate in 2018-19?  \n   **Answer:** The Central Institute for Women in Agriculture, Bhubaneswar generated a total revenue of 4.83 lakh in 2018-19.\n\n10. **Question:** How much did the total revenue from Animal Sciences amount to during the year 2018-19?  \n   **Answer:** The total revenue from Animal Sciences during the year 2018-19 amounted to 2287.70 lakh.",
    "1. **Question:** What is the total achievement for agricultural extension during the year mentioned in the document?  \n   **Answer:** The total achievement for agricultural extension is 22.44 lakh.\n\n2. **Question:** How many ATARI centers are listed in the document?  \n   **Answer:** There are eleven ATARI centers listed in the document.\n\n3. **Question:** What was the actual achievement of A.S.R.B., New Delhi under Schedule 10?  \n   **Answer:** The actual achievement of A.S.R.B., New Delhi under Schedule 10 was 191.88 lakh.\n\n4. **Question:** What is the revenue generation target for the year 2019-2020 mentioned for the institutes?  \n   **Answer:** The revenue generation target for the year 2019-2020 is stated but not specifically quantified in the provided text.\n\n5. **Question:** What was the income from services for the year 2018-19?  \n   **Answer:** The income from services for the year 2018-19 was 1363.50 lakh.\n\n6. **Question:** What type of income does Schedule 8 refer to in the document?  \n   **Answer:** Schedule 8 refers to income from sales/services.\n\n7. **Question:** How much was earned in interest on short-term deposits according to the document?  \n   **Answer:** The interest earned on short-term deposits was 4108.84 lakh.\n\n8. **Question:** What was the total revenue receipts realized as per the document?  \n   **Answer:** The total revenue receipts realized were 21464.01 lakh.\n\n9. **Question:** How much income was generated from license fees from quarters/guest houses?  \n   **Answer:** The income generated from license fees from quarters/guest houses was 1148.50 lakh.\n\n10. **Question:** What is the total income from miscellaneous sources as mentioned in the document?  \n    **Answer:** The total income from miscellaneous sources was 6256.80 lakh.",
    "1. **Question:** What is the total expenditure for Crop Sciences in the financial year 2018-19?  \n   **Answer:** The total expenditure for Crop Sciences in the financial year 2018-19 is ₹200,116.53 lakh.\n\n2. **Question:** How much revenue was received from Horticultural Sciences in the financial year 2017-18?  \n   **Answer:** The revenue received from Horticultural Sciences in the financial year 2017-18 was ₹60,536.90 lakh.\n\n3. **Question:** What was the total amount allocated for Agricultural Extension in the budget estimates for 2018-19?  \n   **Answer:** The total amount allocated for Agricultural Extension in the budget estimates for 2018-19 was ₹82,789.38 lakh.\n\n4. **Question:** In the financial year 2016-17, how much capital expenditure was recorded for Natural Resource Management?  \n   **Answer:** The capital expenditure recorded for Natural Resource Management in the financial year 2016-17 was ₹3,374.04 lakh.\n\n5. **Question:** What were the actual receipts for Animal Sciences in the financial year 2015-16?  \n   **Answer:** The actual receipts for Animal Sciences in the financial year 2015-16 were ₹88,209.93 lakh.\n\n6. **Question:** What is the total revenue expenditure for Fisheries in the financial year 2018-19?  \n   **Answer:** The total revenue expenditure for Fisheries in the financial year 2018-19 is ₹52,509.35 lakh.\n\n7. **Question:** How much was the total expenditure for Agricultural Engineering in the financial year 2017-18?  \n   **Answer:** The total expenditure for Agricultural Engineering in the financial year 2017-18 was ₹21,494.74 lakh.\n\n8. **Question:** What is the amount of loans and advances received by Horticultural Sciences in the financial year 2018-19?  \n   **Answer:** The amount of loans and advances received by Horticultural Sciences in the financial year 2018-19 was ₹231.65 lakh.\n\n9. **Question:** How much was the total expenditure for ICAR HQRS. (including ASRB, DKMA, IPR) in the financial year 2016-17?  \n   **Answer:** The total expenditure for ICAR HQRS. (including ASRB, DKMA, IPR) in the financial year 2016-17 was ₹82,894.44 lakh.\n\n10. **Question:** What were the actual revenue receipts for the year 2017-18?  \n    **Answer:** The actual revenue receipts for the year 2017-18 were ₹25,998.04 lakh.",
    "1. **Question:** What was the total budget allocation for Crop Sciences in the revised estimates for 2018-19?  \n   **Answer:** The total budget allocation for Crop Sciences was 186,461.77 lakh.\n\n2. **Question:** How much funding was allocated to Agricultural Education in the revised estimates for 2018-19?  \n   **Answer:** Agricultural Education received a funding allocation of 69,947.00 lakh.\n\n3. **Question:** What is the budget allocation for Fisheries in the revised estimates for 2018-19?  \n   **Answer:** The budget allocation for Fisheries was 54,602.00 lakh.\n\n4. **Question:** What was the total budget for Agricultural Extension according to the revised estimates?  \n   **Answer:** The total budget for Agricultural Extension was 95,353.00 lakh.\n\n5. **Question:** How much was allocated to Agricultural Engineering in the revised estimates for 2018-19?  \n   **Answer:** Agricultural Engineering received an allocation of 25,661.00 lakh.\n\n6. **Question:** What is the total funding for the National Agricultural Higher Education Project (NAHEP) as per the revised estimates?  \n   **Answer:** The total funding for NAHEP was 789.00 lakh.\n\n7. **Question:** How much funding was allocated to the National Agricultural Research Fund (NASF) in the revised estimates?  \n   **Answer:** The NASF received a funding allocation of 5,215.00 lakh.\n\n8. **Question:** What was the total budget allocation for Horticultural Sciences in the revised estimates for 2018-19?  \n   **Answer:** The total budget allocation for Horticultural Sciences was 64,680.49 lakh.\n\n9. **Question:** How much was allocated for Natural Resource Management (NRM) in the revised estimates?  \n   **Answer:** The allocation for Natural Resource Management (NRM) was 71,368.25 lakh.\n\n10. **Question:** What was the overall grand total of the budget allocation in the revised estimates for 2018-19?  \n    **Answer:** The overall grand total of the budget allocation was 751,414.00 lakh.",
    "1. **Question:** What is the total budget allocation for Crop Sciences in the 2019-20 budget estimates?\n   **Answer:** The total budget allocation for Crop Sciences in the 2019-20 budget estimates is 198140.85 lakh.\n\n2. **Question:** How much funding is allocated to Horticultural Sciences in the 2019-20 budget estimates?\n   **Answer:** The funding allocated to Horticultural Sciences in the 2019-20 budget estimates is 64072.37 lakh.\n\n3. **Question:** What is the budget allocation for Animal Sciences for the year 2019-20?\n   **Answer:** The budget allocation for Animal Sciences for the year 2019-20 is 98277.28 lakh.\n\n4. **Question:** What does SCSP stand for in the context of the budget document?\n   **Answer:** SCSP stands for Scheduled Caste Sub Plan.\n\n5. **Question:** In the budget estimates for 2019-20, which division has the lowest funding allocation?\n   **Answer:** The division with the lowest funding allocation in the budget estimates for 2019-20 is Agricultural Engineering, with 23266.77 lakh.\n\n6. **Question:** How much is allocated to Fisheries in the 2019-20 budget estimates?\n   **Answer:** The allocation to Fisheries in the 2019-20 budget estimates is 55238.41 lakh.\n\n7. **Question:** What is the total budget allocated for Agricultural Extension in the 2019-20 budget estimates?\n   **Answer:** The total budget allocated for Agricultural Extension in the 2019-20 budget estimates is 98786.83 lakh.\n\n8. **Question:** What is the combined total of the budget allocations for NICRA and Natural Resource Management (NRM) for the year 2019-20?\n   **Answer:** The combined total of the budget allocations for NICRA (4756.00 lakh) and NRM (71505.66 lakh) for the year 2019-20 is 76261.66 lakh.\n\n9. **Question:** How much is allocated for Agricultural Education in the 2019-20 budget estimates?\n   **Answer:** The allocation for Agricultural Education in the 2019-20 budget estimates is 64545.39 lakh.\n\n10. **Question:** What is the grand total of all budget allocations listed in the document for the year 2019-20?\n    **Answer:** The grand total of all budget allocations listed in the document for the year 2019-20 is 756780.00 lakh.",
    "1. **Question:** What was the budget for the IIPR, Kanpur in the financial year BE 2019-20?\n   **Answer:** The budget for IIPR, Kanpur in BE 2019-20 was 6224.25 lakh.\n\n2. **Question:** Which institute received the highest budget allocation in the Crop Sciences category for the year BE 2019-20?\n   **Answer:** NBPGR, New Delhi received the highest budget allocation in the Crop Sciences category with 3723.34 lakh for BE 2019-20.\n\n3. **Question:** What is the budget allocated to IIHR, Bangalore for the financial year RE 2018-19?\n   **Answer:** IIHR, Bangalore had a budget allocation of 15986.24 lakh for RE 2018-19.\n\n4. **Question:** In the Horticultural Sciences category, which institute had a budget of 7300.22 lakh for BE 2019-20?\n   **Answer:** The CPRI, Simla had a budget of 7300.22 lakh for BE 2019-20 in the Horticultural Sciences category.\n\n5. **Question:** What was the total budget for Crop Sciences in the financial year BE 2019-20?\n   **Answer:** The total budget for Crop Sciences in BE 2019-20 was 194283.00 lakh.\n\n6. **Question:** How much budget was allocated to DTE on Groundnut, Junagadh for the financial year BE 2019-20?\n   **Answer:** DTE on Groundnut, Junagadh was allocated a budget of 1971.81 lakh for BE 2019-20.\n\n7. **Question:** What was the budget for NRC Banana, Tiruchirapalli during the RE 2018-19?\n   **Answer:** NRC Banana, Tiruchirapalli had a budget of 1378.37 lakh during RE 2018-19.\n\n8. **Question:** Which institute had a budget of 2561.49 lakh for the financial year BE 2019-20 in Horticultural Sciences?\n   **Answer:** CIARI (CARI), Port Blair had a budget of 2561.49 lakh for BE 2019-20 in Horticultural Sciences.\n\n9. **Question:** What was the budget allocated to the DTE of Mushroom Research, Solan for BE 2019-20?\n   **Answer:** The budget allocated to the DTE of Mushroom Research, Solan for BE 2019-20 was 1319.11 lakh.\n\n10. **Question:** Which institute in the Animal Sciences category had a budget of 4628.80 lakh for RE 2018-19?\n    **Answer:** CIRG, Makhdoom had a budget of 4628.80 lakh for RE 2018-19 in the Animal Sciences category."
]