[
    "{ Q: What is the name of the shrimp feed processing and production company?\n                            A: Westlandmarine Pvt. Ltd.\n                            Q: Who is the founder of Agricxlab Pvt. Ltd.?\n                            A: Mr. Saurabh Kumar\n                            Q: What technology does Agati Healthcare Pvt. Ltd. use?\n                            A: Colostrum powder-based tablets\n                            Q: When did production start at AVS Agro Life Products?\n                            A: Not provided in the text\n                            Q: What is the technology description of Ayegrow Business Solutions?\n                            A: Preparation of Value Added Meat Products\n                            Q: How many employees does Ascend Exports and Imports have?\n                            A: Not provided in the text\n                            Q: What is the turnover of Westlandmarine Pvt. Ltd.?\n                            A: > 200 Lakhs\n                            Q: What is the licensing term for the technology used by CPCRI, Kasaragod?\n                            A: Non-exclusive\n                            Q: How does Agricxlab Pvt. Ltd. assess agri produce parameters?\n                            A: Using a technology platform that analyzes images\n                            Q: How does Ascend Exports and Imports distribute its products?\n                            A: Direct Marketing/Distributors}",
    "{ Q: What is the technology description of CocoWings Enterprise?\n                            A: The technology description is the production of virgin coconut oil from coconut milk by fermentation and hot process method.\n                            Q: How much virgin coconut oil does CocoWings Enterprise produce daily?\n                            A: CocoWings Enterprise produces 50 liters of virgin coconut oil per day.\n                            Q: What is the name of the institute that licensed the rapid paper-based strip test technology?\n                            A: The technology was licensed by Delmos Research Pvt. Ltd., and the name of the institute is NDRI, Karnal.\n                            Q: What is the detection limit of the maltodextrin test strip?\n                            A: The test strip can detect the presence of maltodextrin in milk at a level of 0.05%.\n                            Q: What are the osmotically dehydrated fruits produced by Devataru Homes & Foods Pvt. Ltd.?\n                            A: Devataru Homes & Foods Pvt. Ltd. produces osmotically dehydrated Amla, Papaya, and Mango fruits.\n                            Q: What is the main raw material used by Ecoventures Pvt. Ltd. for cosmetic product manufacturing?\n                            A: Ecoventures Pvt. Ltd. utilizes waste mango kernel for the extraction of rich mango butter and oil.\n                            Q: What is the technology description of Ganpati Desi Products Pvt. Ltd.?\n                            A: The technology description is not provided in the given text.\n                            Q: How much instant pongal mix does Fountain Head Foods produce monthly?\n                            A: Fountain Head Foods produces 25 tonnes of instant pongal mix per month.\n                            Q: What is the licensing term for the technology used by Ganpati Desi Products Pvt. Ltd.?\n                            A: The licensing term for Ganpati Desi Products Pvt. Ltd. is incubation support.}",
    "{\n  Q: What is the name of the dairy company and its founder?\n  A: The dairy company is Ganpati Dairy, and its founder is Mr. Ajay Kumar.\n\n  Q: Which technology is licensed from CPCRI, Kasaragod for virgin coconut oil production?\n  A: The technology licensed for virgin coconut oil production is the production of virgin coconut oil from coconut milk by fermentation and hot process method.\n\n  Q: What is the turnover of the company that produces bajra lassi and bajra biscuits?\n  A: The turnover of the company that produces bajra lassi and bajra biscuits is 100 Lakhs.\n\n  Q: Which institute provided support for the processing technology of meat using spices and herb mixture?\n  A: NRC on Meat, Hyderabad provided support for the processing technology of meat using spices and herb mixture.\n\n  Q: What is the distribution channel for multigrain atta and biscuits produced by Mr. Philip Ratnam?\n  A: The distribution channel for multigrain atta and biscuits produced by Mr. Philip Ratnam is Distributors.\n\n  Q: How many technologies are licensed from NAARM, Hyderabad by Inner Being Wellness Pvt. Ltd.?\n  A: Eight technologies are licensed from NAARM, Hyderabad by Inner Being Wellness Pvt. Ltd.\n\n  Q: What is the turnover of the company that produces processing technology on millets?\n  A: The turnover of the company that produces processing technology on millets is 217 Lakhs.\n\n  Q: Who is the founder of Intello Labs Pvt. Ltd., and what support did they receive from NAARM, Hyderabad?\n  A: The founder of Intello Labs Pvt. Ltd. is not mentioned in the given text. However, they received acceleration support for their own technology from NAARM, Hyderabad.\n\n  Q: What is the production capacity of the company that produces chicken-based products with longer shelf life?\n  A: The production capacity of the company that produces chicken-based products with longer shelf life is 0.5 to 1 Tonne/Day.\n\n  Q: Which institute provided technology for the production of highly nutritious multigrain atta and biscuits from millets?\n  A: IIMR, Hyderabad provided technology for the production of highly nutritious multigrain atta and biscuits from millets.\n}",
    "{ Q: What is the technology description of Intellolabs?\n                            A: The technology description of Intellolabs is reading images, identifying grains, and counting approximate weight and other parameters as per Indian standards 2016.\n                            Q: What is the name of the institute where Jayani Natural Farm licensed their technology?\n                            A: The name of the institute is CIPHET, Ludhiana.\n                            Q: What is the technology description of Jharkhand Milk Products Pvt. Ltd.?\n                            A: The technology description is milk processing.\n                            Q: What is the distribution channel used by Jivabhumi Agri-Tech Pvt. Ltd.?\n                            A: Jivabhumi Agri-Tech Pvt. Ltd. uses direct/internet marketing as their distribution channel.\n                            Q: What is the turnover of Tradifo in 2013?\n                            A: The turnover of Tradifo in 2013 was 35 Lakhs.\n                            Q: Who is the founder of KDS Kunjpura Dairy Farm & Milk Products?\n                            A: The founder of KDS Kunjpura Dairy Farm & Milk Products is not provided in the given text.\n                            Q: What is the licensing term for KAD Bioresources Pvt. Ltd.?\n                            A: The licensing term for KAD Bioresources Pvt. Ltd. is non-exclusive.\n                            Q: What is the technology description of CIPHET, Ludhiana?\n                            A: The technology description of CIPHET, Ludhiana is modern methods for preparing different Aonla products that are hygienic, consume lesser time, and provide maximum retention of nutrients.\n                            Q: What is the industry of Jivabhumi Agri-Tech Pvt. Ltd.?\n                            A: The industry of Jivabhumi Agri-Tech Pvt. Ltd. is Food Products and Processes.}",
    "{\n  Q: What is the name of the technology licensed by Mr. Ashwani for processing milk and milk products?\n  A: The technology licensed by Mr. Ashwani for processing milk and milk products is the use of processed plant-based gel for making low-fat meat emulsion.\n\n  Q: What is the turnover of Kunigal Thaluk Coconut Producers Co. Ltd. in 2015?\n  A: The turnover of Kunigal Thaluk Coconut Producers Co. Ltd. in 2015 was 22 Lakhs.\n\n  Q: Which institute provided the technology for coconut chips production to Magicco Life Care Products?\n  A: CPCRI, Kasaragod provided the technology for coconut chips production to Magicco Life Care Products.\n\n  Q: What is the production capacity of Mayvhav Foods Pvt. Ltd. for chemical-free ice creams?\n  A: Mayvhav Foods Pvt. Ltd. has a production capacity of 200 to 300 liters per day for chemical-free ice creams.\n\n  Q: What is the distribution channel used by Mr. Siby Mathew for coconut chips manufacturing?\n  A: Mr. Siby Mathew uses marketing through dealers as a distribution channel for coconut chips manufacturing.\n\n  Q: What is the name of the founder of Millark Food Factory?\n  A: The name of the founder of Millark Food Factory is Mr. Anshul Gupta.\n\n  Q: How many technologies were licensed by the company from PJTSA at NAARM, Hyderabad?\n  A: The company licensed three technologies from PJTSA at NAARM, Hyderabad.\n\n  Q: What is the contact information of Mr. Gagan Khanna, the founder of Khanna Food Products?\n  A: Mr. Gagan Khanna can be contacted at 9888900900 or khannafoodproducts@gmail.com.\n\n  Q: What is the industry of the technology licensed by CIPHET, Ludhiana for Mr. Ashwani?\n  A: The industry of the technology licensed by CIPHET, Ludhiana for Mr. Ashwani is Food Products and Processes.\n\n  Q: What is the production capacity of Magicco Life Care Products for coconut chips?\n  A: Magicco Life Care Products has a production capacity of 2 tonnes per month for coconut chips.\n}",
    "{ Q: What is the technology description of Millet Bowl Food Products Pvt. Ltd.?\n                            A: The technology description is producing high-quality and innovative millet-based food products.\n                            Q: What is the licensing term for Muddy Puddle Foods Pvt. Ltd.?\n                            A: The licensing term is acceleration support.\n                            Q: How many technologies are licensed by Phalada Agro Research Foundation Pvt. Ltd.?\n                            A: Phalada Agro Research Foundation Pvt. Ltd. has licensed one technology.\n                            Q: Who is the founder of Rani Food Products?\n                            A: The founder of Rani Food Products is Dr. Swaroop V. R.\n                            Q: What is the distribution channel for Sakthi Coco Products?\n                            A: The distribution channel for Sakthi Coco Products is marketing through dealers.\n                            Q: In which year did production start for Millet Bowl Food Products Pvt. Ltd.?\n                            A: Production started in 2016 for Millet Bowl Food Products Pvt. Ltd.\n                            Q: What is the turnover of Muddy Puddle Foods Pvt. Ltd.?\n                            A: The turnover of Muddy Puddle Foods Pvt. Ltd. is 100 Lakhs.\n                            Q: What is the technology description of Mishti Farmer Producer Co. Ltd.?\n                            A: The technology description is the development of whey-based functional beverages and milk-millet composite-based fermented dairy drinks.\n                            Q: How many employees does CPCRI, Kasaragod licensed technology holder, Sakthi Coco Products, have?\n                            A: Sakthi Coco Products has 80 employees.\n                            Q: What products does Phalada Agro Research Foundation Pvt. Ltd. produce using the licensed technology?\n                            A: Phalada Agro Research Foundation Pvt. Ltd. produces virgin coconut oil using the licensed technology.}",
    "{ Q: What is the name of the company that licensed technology for A2 grade milk production?\n                            A: Saro Agri and Dairy Pvt. Ltd.\n                            Q: Which institute provided technology support for Sayuri Farms?\n                            A: NRC on Pig, Guwahati\n                            Q: What is the technology description for Shreekalpa Industries?\n                            A: Production of virgin coconut oil from coconut milk by fermentation and hot process method\n                            Q: How many variants of biscuits were developed by Society for Farmers Development?\n                            A: Six variants were developed, and four were launched in the market\n                            Q: What is the licensing term for Somras Nutri Pvt. Ltd.?\n                            A: Non-exclusive\n                            Q: What is the technology description for Yukti Harvest Pvt. Ltd.?\n                            A: An ICT solution for rural distribution of perishable agriculture produce\n                            Q: When did production start for Sayuri Farms?\n                            A: Production started in 2015\n                            Q: What is the name of the founder of Saro Agri and Dairy Pvt. Ltd.?\n                            A: Mr. Srikanth Mannem\n                            Q: What is the distribution channel for Shreekalpa Industries?\n                            A: Distributors\n                            Q: What is the daily production capacity of Somras Nutri Pvt. Ltd.?\n                            A: 3 to 3.2 Tonnes/Day}",
    "{\n  Q: What is the name of the seed company that licensed 35 technologies from IARI, New Delhi?\n  A: Ananya Seed Pvt. Ltd.\n\n  Q: In which year did Arpan Seeds Pvt. Ltd. start production of Zero Erucic Acid Mustard?\n  A: 2014\n\n  Q: What is the technology description of Bhavani Biochemicals?\n  A: A carrier-based product containing N fixing, P, Zn solubilizing, and plant growth-promoting microbes as a single formulation.\n\n  Q: Who is the founder of Cheripurathu Nursery?\n  A: Mr. Tom C. Antony\n\n  Q: How many vegetable/oilseed varieties were licensed by Ananya Seed Pvt. Ltd.?\n  A: 35 varieties\n\n  Q: What is the licensing term for the technology used by Enzys Govindji Bio Labs Pvt. Ltd.?\n  A: Incubation support\n\n  Q: Which institute did Cheripurathu Nursery license technology from?\n  A: IISR, Calicut\n\n  Q: What is the turnover of Ananya Seed Pvt. Ltd.?\n  A: 1400 Lakhs\n\n  Q: What is the distribution channel used by Arpan Seeds Pvt. Ltd.?\n  A: Direct Marketing\n\n  Q: What is the technology description of Enzys Govindji Bio Labs Pvt. Ltd.?\n  A: Production of various ornamental plants through tissue culture\n}",
    "{\n  Q: What is the name of the institute that licensed the technology for Arka Microbial Consortium?\n  A: IIHR, Bengaluru\n\n  Q: How many technologies were licensed by Greenovate Agro Pvt. Ltd. from IIHR, Bengaluru?\n  A: Two technologies\n\n  Q: What is the process of growing plants described in the technology licensed by Handa Bio Agritech Potato Seeds?\n  A: The process involves growing plants in an air-mist environment without soil or an aggregate medium\n\n  Q: Which turmeric varieties were developed by IISR, Calicut and licensed to Jigar Deepak Bhai Patel?\n  A: IISR Pratibha and IISR-Alleppey Supreme\n\n  Q: What is the licensing term for the Aeroponic System Technology licensed by JPG BPC Ltd.?\n  A: Non-exclusive\n\n  Q: Who is the founder of Leaf Box and what is their contact information?\n  A: The founder's name and contact information are not provided in the given text.\n\n  Q: What is the industry of the technology licensed by Ganpath Products?\n  A: Seed and Planting Material\n\n  Q: How many employees does Handa Bio Agritech Potato Seeds have?\n  A: The number of employees is not mentioned in the given text.\n\n  Q: What is the turnover of Jigar Deepak Bhai Patel's turmeric varieties technology?\n  A: 20 to 25 Lakhs\n\n  Q: What is the distribution channel used by Ganpath Products for their Arka Microbial Consortium technology?\n  A: Direct Marketing\n}",
    "{\nQ: What is the technology description of AirLeafBox?\nA: AirLeafBox provides ready-to-fruit bags for oyster mushrooms for easy cultivation at home.\n\nQ: What is the yield increase of IISR-Pragati turmeric variety over national and local varieties?\nA: IISR-Pragati turmeric variety has a 30% and 34% yield increase over national and local turmeric varieties.\n\nQ: Which institute licensed the technology for Natura Nursery & Agro Products?\nA: IISR, Calicut\n\nQ: What is the production capacity of Pluck Fresh per day?\nA: Pluck Fresh has a production capacity of 300 boxes per day.\n\nQ: What is the contact information for the founder of Fullia Women & Youth Welfare Society?\nA: The contact information is not provided in the given text.\n\nQ: What is the licensing term for the technology used by Nature Agro Producers?\nA: Non-exclusive\n\nQ: Which variety of black pepper is commercially produced by Naturanursery?\nA: Black pepper variety-IISR Thevam\n\nQ: What is the industry of the technology licensed by AirLeafBox?\nA: Seed and Planting Material\n\nQ: What is the distribution channel used by Lean Crop Technology Solutions Pvt. Ltd.?\nA: Direct Marketing\n\nQ: What is the technology description of Fullia Women & Youth Welfare Society?\nA: A handloom with jacquard\n}",
    "{ Q: What is the name of the technology licensed by CIRCOT, Mumbai for antibacterial bed linens production?\n                            A: The technology licensed is for treating textiles to have antibacterial properties.\n                            Q: Who is the founder of the antibacterial treatment of textile technology developed in 2017?\n                            A: Mrs. Pratima Uke is the founder.\n                            Q: What is the annual production capacity of jute-based decorative handloom fabric by RBM Industries Ltd.?\n                            A: The annual production capacity is 3000 meters.\n                            Q: Which institute provided the technology for jute-based decorative handloom fabric production?\n                            A: NIRJAFT, Kolkata\n                            Q: How many technologies are licensed by Milltex Ecofibres Pvt. Ltd.?\n                            A: Four technologies are licensed.\n                            Q: What is the distribution channel used by Greyy for their antibacterial and anti-odor textile treatment technology?\n                            A: Direct Marketing\n                            Q: In which year did the founder of Green Globe start production using the licensed technology?\n                            A: Production started in 2017.\n                            Q: What is the objective of compiling the profiles of 100 Agripreneurs in the given compendium?\n                            A: The objective is to encourage more professionals to join the entrepreneurial journey in agriculture.\n                            Q: Which sectors of agriculture are represented by the Agristartups in the compendium?\n                            A: The sectors include Bio Fertilizers and Pesticides, Food processing, Crop Production, Fisheries, Biotechnology, Textiles, and Farm Machinery.\n                            Q: What is the name of the founder and their contact information for the jute-based decorative handloom fabric technology licensed by RBM Industries Ltd.?\n                            A: The founder is Mr. Sudip Dasgupta, and his contact number is 9831462934.}",
    "{\n  Q: How are entrepreneurs increasing their stakes in the agricultural supply chain?\n  A: Entrepreneurs are using technologies developed by the ICAR and taking support from the ABIs to increase their stakes in the overall value creation in the supply chain, ultimately benefiting farmers.\n\n  Q: What is the role of Technology Business Incubators in agriculture?\n  A: Technology Business Incubators provide enhanced opportunities for nurturing and building new platforms for agri-business and agri-entrepreneurship in the country.\n\n  Q: How can partnerships help in advancing early initiatives in agriculture?\n  A: Forging formal links and developing partnerships with other agencies, successful NGOs, professional bodies, and associations can help take forward early initiatives and success gained in agriculture.\n\n  Q: How can accelerating technology transfer trigger more agri-based start-ups?\n  A: Accelerating technology transfer can trigger more agri-based start-ups and attract more entrepreneurs across the country.\n\n  Q: What is the publication about?\n  A: The publication is a glimpse of the startup ecosystem emerging in the Agriculture sector with immense opportunities for leveraging future investment supporting innovation in agri-business.\n\n  Q: Who is the Directorate of Knowledge Management in Agriculture?\n  A: The Directorate of Knowledge Management in Agriculture is a unit located in Krishi Anusandhan Bhawan-I, New Delhi.\n\n  Q: What is the contact information for the Intellectual Property & Technology Management Unit?\n  A: The contact information for the Intellectual Property & Technology Management Unit is iptm.icar@gmail.com and phone number 91-11-25843926.\n\n  Q: Who published the Handbook of Technical Services?\n  A: The Handbook of Technical Services was published by the Directorate of Information and Publications of Agriculture, Indian Council of Agricultural Research.\n\n  Q: What is the ISBN of the Handbook of Technical Services?\n  A: The ISBN of the Handbook of Technical Services is 978-81-933781-2-0.\n\n  Q: Who is the Chief Editor of the fourth edition of the Handbook of Technical Services?\n  A: The Chief Editor of the fourth edition of the Handbook of Technical Services is Dr. Suomir Pradhan.}",
    "{ Q: What is the principal mandate of the Indian Council of Agricultural Research (ICAR)?\n                            A: The principal mandate of the ICAR is to promote agricultural research, education, extension, and other allied disciplines of agriculture.\n                            Q: When were the Technical Services launched by the ICAR?\n                            A: The Technical Services were launched by the ICAR in 1975.\n                            Q: What is the purpose of the Technical Service Rules in the ICAR?\n                            A: The Technical Service Rules aim to manage the Technical Services and attract the best talents for recruitment.\n                            Q: How many editions of the Handbook of Technical Services have been published by the ICAR?\n                            A: Three editions of the Handbook of Technical Services have been published by the ICAR.\n                            Q: What led to the revision of Technical Service Rules in the ICAR?\n                            A: Certain anomalies in the operation of the technical services, such as overlapping pay scales, necessitated the revision of the Technical Service Rules.\n                            Q: How does the revision of Technical Service Rules benefit the ICAR?\n                            A: The revision provides better prospects for existing technical personnel and enables the ICAR to attract qualified and experienced personnel through direct recruitment.\n                            Q: Who compiled and updated the Compendium of Technical Services in a record time?\n                            A: Shri A S Sethi, Under-Secretary (Tech.), compiled and updated the Compendium of Technical Services.\n                            Q: What role do technical personnel play in the ICAR?\n                            A: Technical personnel provide crucial support to scientists and serve as an important link between researchers and end-users.\n                            Q: How does the ICAR create a healthy work environment for its employees?\n                            A: The ICAR creates a healthy work environment by formulating suitable personnel policies through well-planned technical service rules.}",
    "{ Q: What is the purpose of the Handbook of Technical Services?\n                            A: The Handbook of Technical Services provides information on the rules and procedures relating to the recruitment, assessment, and promotion of technical staff.\n                            Q: Who published the Handbook of Technical Services?\n                            A: The Indian Council of Agricultural Research (ICAR) published the Handbook of Technical Services.\n                            Q: When was the Agricultural Research Service (ARS) introduced by ICAR?\n                            A: The Agricultural Research Service (ARS) was introduced by ICAR on 1 October 1975.\n                            Q: What is the role of technical personnel in ICAR?\n                            A: Technical personnel assist scientists, enhance their output, disseminate research results, and help organize field and laboratory facilities efficiently.\n                            Q: Who wrote the preface to the second edition of the Handbook of Technical Services?\n                            A: The preface to the second edition of the Handbook of Technical Services was written by RS Paroda, Director-General of ICAR.\n                            Q: What changes were incorporated in the second edition of the Handbook of Technical Services?\n                            A: The second edition of the Handbook of Technical Services incorporated changes made due to the introduction of new Personnel Policies.\n                            Q: Who were the contributors to updating the second edition of the Handbook of Technical Services?\n                            A: Shri Rajiv Mangotra, Shri Sodhi Singh, and Shri K K Bajpai contributed to updating the second edition of the Handbook of Technical Services.\n                            Q: What is the principal mandate of the Indian Council of Agricultural Research (ICAR)?\n                            A: The principal mandate of ICAR is to promote research and education in all fields relevant to agricultural progress in India.\n                            Q: When were new personnel policies introduced for the Technical Services of ICAR?\n                            A: New personnel policies for the Technical Services of ICAR were introduced on 1 October 1975.}",
    "{ Q: What is the focus of the ICAR's staff conditions of service?\n                            A: The ICAR focuses on creating conditions that allow staff to concentrate on their work and practice the concept that \"all rights accrue from a duty well done.\"\n                            Q: What is the date of coming into force of the service rules?\n                            A: The date of coming into force of the service rules is not provided in the given text.\n                            Q: How are technical posts classified in the ICAR?\n                            A: Technical posts are classified into various groups, as detailed in Appendix II.\n                            Q: What is the purpose of the annual assessment in the ICAR?\n                            A: The annual assessment helps in evaluating the performance of technical personnel for granting merit promotions or advance increments.\n                            Q: Who is the appointing authority for direct recruitment in the ICAR?\n                            A: The appointing authority for direct recruitment is not specified in the provided text.\n                            Q: What is the function of the technical services in the ICAR?\n                            A: Technical services in the ICAR support research and education in areas like laboratories, workshops, libraries, documentation, publications, and agricultural communication.\n                            Q: What is the importance of the human body analogy in the ICAR's organizational structure?\n                            A: The human body analogy emphasizes the importance of each section of the staff performing specific functions while working in a coordinated manner.\n                            Q: What are the model qualifications for different functional groups in the ICAR?\n                            A: Model qualifications for different functional groups are provided in Appendix IV.\n                            Q: What is the purpose of the proforma for supplementary information in the ICAR?\n                            A: The proforma for supplementary information is used for the subsequent assessment of technical personnel for granting merit promotions.}",
    "{ Q: When did the Technical Service Rules come into force?\n                            A: The Technical Service Rules came into force on 1st October 1975.\n                            Q: What modifications were made to the Technical Service Rules on 3rd February 2000?\n                            A: The modifications addressed anomalies in the implementation of the existing rules and were notified with prospective effect.\n                            Q: How many categories are there in the Technical Services?\n                            A: There are three categories in the Technical Services.\n                            Q: What are the grades in Category I with their respective pre-revised pay scales?\n                            A: The grades in Category I with pre-revised pay scales are T-1 (Rs 975-25-1, 1840) and T-2 (Rs 1200-30-1, 560-EB-40-2,040).\n                            Q: What are the revised pay scales for the T-6 grade?\n                            A: The revised pay scale for the T-6 grade is Rs 8,000-275-13,500.\n                            Q: What happened to the overlapping grades T-1-3 and T-11-3?\n                            A: The overlapping grades T-1-3 and T-11-3 were merged into one grade, i.e., T-3.\n                            Q: What is the functional classification of Group II posts?\n                            A: The functional classification of Group II posts includes Laboratory Technicians.\n                            Q: Can existing technical employees choose to be governed by the existing technical service rules after the 3rd February 2000 notification?\n                            A: Yes, existing technical employees can choose to be governed by the existing technical service rules by exercising an individual option in writing within 30 days from the date of issue of the notification.\n                            Q: Where can one find the details of the functional classification of existing posts in the Council?\n                            A: The details of the functional classification of existing posts in the Council can be found in Appendix II.}",
    "{\n  Q: What is the purpose of the committee constituted by the CAR?\n  A: The purpose of the committee is not explicitly mentioned in the provided text. However, it is mentioned that the committee made recommendations regarding technical posts under the Council.\n\n  Q: How will technical posts under the Council be known?\n  A: Technical posts under the Council will be known by their grade numbers. However, the duties performed by different functionaries will be distinguished by appropriately naming the grades.\n\n  Q: What was the basis for fitting existing employees into the specified grades?\n  A: Existing employees were fitted into the specified grades on a point-to-point basis without any further screening, irrespective of their qualifications.\n\n  Q: What was the exception for employees in the merged grade of Rs 425-700?\n  A: Employees in the merged grade of Rs 425-700 who possessed qualifications prescribed for Category-II were fitted into grade T-11-3 (Rs 425-700).\n\n  Q: How were existing employees in grade T-5 considered for appointment to grade T-6?\n  A: Existing employees in grade T-5 were considered for appointment to grade T-6 if they possessed the minimum qualifications prescribed for Category III. They were adjusted against the then existing vacancies in the respective fields.\n\n  Q: What happened to the upgraded posts in case of no vacancies in Grade T-6?\n  A: If no vacancies existed in Grade T-6, the existing posts in Grade T-5 held by the approved incumbents were upgraded to Grade T-6 until regular vacancies in the latter grade became available.\n\n  Q: Were government servants on notional foreign service eligible for appointment to technical services?\n  A: Government servants on notional foreign service were not eligible for appointment to technical services until they opted and were absorbed in the Council's service on a regular basis.\n\n  Q: To whom are these rules applicable?\n  A: These rules are applicable to the Council's employees and government servants who held posts on notional foreign service with the Council and exercised their options for Council's service by the specified dates.\n\n  Q: What was the treatment for technical personnel who exercised options for Council's service before the prescribed date?\n  A: Technical personnel who exercised options for Council's service before the prescribed date were treated at par with those who exercised options before 31 December 1975.\n}",
    "{ Q: How is merit promotion done in the technical personnel categories?\n                            A: Merit promotion is done from one grade to the next higher grade based on performance assessment, regardless of vacancies in the higher grade.\n                            Q: What is the eligibility criteria for promotion or advance increments?\n                            A: Personnel are eligible for consideration after the prescribed number of years of service in the grade.\n                            Q: How have the grade structures in Categories I and II been modified?\n                            A: The overlapping grades of T-1-2 and T-1-3 have been removed, and new pay scales have been introduced.\n                            Q: What is the revised pay scale for T-1 grade in Category I?\n                            A: The revised pay scale for T-1 grade in Category I is Rs 3,200-85-4,900.\n                            Q: How long do entrants of Category I at T-1 grade need to serve before assessment for promotion?\n                            A: Entrants of Category I at T-1 grade need to serve for five years before assessment for promotion to T-2 grade.\n                            Q: What are the eligibility criteria for T-2 grade personnel to be promoted to T-3 grade?\n                            A: T-2 grade personnel with prescribed qualifications are eligible for promotion to T-3 grade after five years of service, while others need to serve for 10 years.\n                            Q: How often are assessment promotions regulated from T-3 to T-4 and T-4 to T-5?\n                            A: Assessment promotions from T-3 to T-4 and T-4 to T-5 are regulated at five-year intervals.\n                            Q: What are the eligibility criteria for T-5 grade personnel to be promoted to T-6 grade in Category III?\n                            A: T-5 grade personnel with essential qualifications for Category III direct recruitment are eligible for promotion to T-6 grade after five years of service, while others need to serve for 10 years with specific qualifications.\n                            Q: What qualifications are required for technical personnel in T-5 grade without Category III qualifications to be promoted to T-6 grade?\n                            A: They need to possess qualifications prescribed under the Notification dated 3 February 2000 for direct recruitment to Category II (T-3).}",
    "{ Q: What is the eligibility condition for further assessment promotion to Category III of Technical Services?\n                            A: Those appointed to Category II (T-3) on or before 3 February 2000 are not eligible for further assessment promotion to Category III.\n                            Q: How have the technical grades T-7 and T-8 been redesignated?\n                            A: Technical grades T-7 and T-8 have been redesignated as a uniform and single grade T(7-8) with a pay scale of Rs 10,000-15,200.\n                            Q: What is the eligibility criterion for assessment to T-9 grade from T-7 grade?\n                            A: Technical personnel in T-7 grade who have not been assessed for T-8 grade are eligible for assessment to T-9 grade after completing 7 years of service in T-7 grade.\n                            Q: When are direct recruitments made in grades T-1, T-3, and T-6?\n                            A: Direct recruitments in these grades are made as per the Technical Service Rules 1975, as amended from time to time.\n                            Q: When was the first screening of eligible persons for promotion conducted?\n                            A: The first screening was conducted within one year of the introduction of Technical Service Rules, i.e., on 1 October 1975.\n                            Q: How is the eligibility period for merit promotion or advance increments calculated?\n                            A: The entire period of service in the grade, including service rendered in the pre-revised scale of pay, is counted for eligibility.\n                            Q: Is the service rendered in another Institute considered for computing eligibility?\n                            A: Yes, the service rendered in another Institute on transfer for compassionate grounds is considered for computing eligibility.\n                            Q: Are periods of ad-hoc service, leave, and deputation counted for eligibility calculation?\n                            A: Yes, periods of ad-hoc service in the same grade, leave, and deputation are counted for eligibility calculation.\n                            Q: Which periods are not counted for computing the prescribed period of eligibility for assessment/promotion?\n                            A: Periods of suspension, extra-ordinary leave, and time spent on earned leave not due are not counted for eligibility calculation.}",
    "{ Q: What is the period of suspension considered as dies-non for all purposes under Technical Service Rules?\n                            A: The period of suspension is considered as dies-non for all purposes, including assessment, under Technical Service Rules.\n                            Q: What is the measure of penalty for reduction to a lower grade?\n                            A: The measure of penalty for reduction to a lower grade is specified in ICAR letter No.7-34/80-Per.III dated 19 May 1982.\n                            Q: Who assesses eligible persons for merit promotion/grant of advance increments in Categories I and II?\n                            A: A Selection Committee, constituted by the Appointing Authority, assesses eligible persons for merit promotion/grant of advance increments in Categories I and II.\n                            Q: How is the Chairman of the Selection Committee chosen for Categories I and II?\n                            A: The Chairman of the Selection Committee for Categories I and II is a person from outside the Institute/Headquarters, nominated by the Chairman of the Agricultural Scientists' Recruitment Board.\n                            Q: Who assesses persons in Category III for merit promotion?\n                            A: An Assessment Committee, constituted in consultation with the Chairman, Agricultural Scientists' Recruitment Board, assesses persons in Category III.\n                            Q: What happens if a person is not found fit for merit promotion or advance increments?\n                            A: They may be considered again at a subsequent stage or stages until they are adjudged suitable for promotion to the next higher grade.\n                            Q: What is the procedure for promotion under the Technical Service Rules?\n                            A: Promotions are made on the basis of selection(s), and the 33.3% promotion quota is operative only in Category I at the level of T-1.\n                            Q: What happens to the vacancy in the event of retirement/death/resignation of technical personnel?\n                            A: The vacancy occurs only in the initial grade of his appointment under the service.\n                            Q: Who makes recommendations for promotions under the Technical Service Rules?\n                            A: Promotions are made on the recommendation of the Selection Committee(s) constituted as per the Revised Composition of Selection Committees/Departmental Promotion Committees for various grades under different categories under the Council.}",
    "{\n  Q: What does Appendix V of ICAR letter No.1-2/81-Per.IV dated 10 September 1987 contain?\n  A: Appendix V contains details about promotions, completion of probationary period, confirmation, and crossing of efficiency bar.\n\n  Q: What are the alternative qualifications applicable for Council's employees for promotion?\n  A: The alternative qualifications are mentioned in the Council's letter No. 7(10)/78-Per.JII dated 27.1.1979 and are applicable for 33.3% vacancies reserved for departmental promotions.\n\n  Q: Under what conditions can direct recruitment be done in other grades in the three categories?\n  A: Direct recruitment to other grades can be done to correct imbalances in the staff composition in those grades.\n\n  Q: What is the maximum age limit for direct recruitment in Category I, Grade T-6?\n  A: The maximum age limit for direct recruitment in Category I, Grade T-6 is 30 years.\n\n  Q: Are there any age limits for the employees of the Council for direct recruitment to posts in the three categories?\n  A: There will be no age limit for the employees of the Council for direct recruitment to posts in the three categories.\n\n  Q: What is the crucial date for determining the age limit in each case?\n  A: The crucial date for determining the age limit in each case is the closing date for receipt of applications from candidates in India (other than Andaman and Nicobar Islands and Lakshadweep).\n\n  Q: What is the maximum age limit for direct recruitment in Category II, Grade T-3?\n  A: There is no specific information provided about the maximum age limit for direct recruitment in Category II, Grade T-3.\n\n  Q: What is the role of the Agricultural Scientist Recruitment Board in modifying the minimum educational/trade qualifications?\n  A: Any modifications to the minimum educational/trade qualifications will be made in consultation with the Agricultural Scientist Recruitment Board.\n\n  Q: How are the qualifications of ex-servicemen decided for equivalence with those prescribed in Appendix IV?\n  A: The equivalence for ex-servicemen's qualifications with those prescribed in Appendix IV will be decided in consultation with the Director-General of the Resettlement, Ministry of Defence.\n\n  Q: What is the upper age limit for in-service candidates in the ARS Examination?\n  A: The upper age limit for in-service candidates in the ARS Examination has been increased to 45 years w.e.f. 1 January 1995.\n}",
    "{ Q: What does 'in-service candidates' refer to in the context of ICAR?\n                            A: 'In-service candidates' refers to employees currently working in ICAR, not those from State Agricultural Universities, Government, or Public Undertakings.\n                            Q: What is the composition of the Selection Committee for direct recruitment in ICAR?\n                            A: The composition of the Selection Committee is detailed in Appendix V, as per ICAR letter No.1(2)/81-Per.IV dated 10 September 1987.\n                            Q: Under what conditions can persons be appointed on deputation basis in ICAR?\n                            A: Eligible persons can be appointed on deputation basis if suitable candidates are not available for technical posts, as per ICAR Notification No.8-5/90-Estt IV dated 19 November 1992.\n                            Q: Who are the Appointing Authorities for different grades in ICAR?\n                            A: Appointing Authorities include the Director-General, ICAR, Directors of Institutes, Secretary, ICAR, and Deputy Secretary, ICAR.\n                            Q: How is the pay fixed for a person appointed to any grade in ICAR?\n                            A: The pay is fixed in accordance with orders applicable to ICAR employees from time to time.\n                            Q: What is the probation period for persons appointed in ICAR by direct recruitment or promotion?\n                            A: The probation period is 2 years, which may be extended by the Appointing Authority.\n                            Q: Are technical personnel put on probation when promoted to the next higher grade in ICAR?\n                            A: No, technical personnel promoted on the basis of five-yearly assessment of performance are not put on probation.\n                            Q: Is there inter-se seniority amongst the personnel of the service for promotion in ICAR?\n                            A: No, there is no inter-se seniority amongst the personnel of the service for the purpose of promotion.\n                            Q: What is the maximum duration of study leave admissible for undertaking a Ph.D. programme in ICAR?\n                            A: The maximum duration of study leave admissible for undertaking a Ph.D. programme in ICAR is 3 years, effective from 1 January 1995.}",
    "{\nQ: What is the purpose of the Committee under Dr Kirti Singh's chairmanship?\nA: The Committee's purpose is to reclassify posts in agricultural institutes and redassify left-over posts.\n\nQ: What is the ICAR Handbook of Technical Services?\nA: The ICAR Handbook of Technical Services provides information on pay scales and classification of technical posts.\n\nQ: What are the pay scales as recommended by the 4th and 5th Pay Commissions for Category I?\nA: The pay scales for Category I as recommended by the 4th Pay Commission are Rs 975-25-11,540 and by the 5th Pay Commission are Rs 1,400-40-1,800-EB-50-2,300.\n\nQ: What is the classification of the post 'Farm Superintendent'?\nA: The post 'Farm Superintendent' is classified under Group I, Field/Farm Technicians.\n\nQ: Which posts are included in Group II of the technical services?\nA: Group II includes posts such as Junior Manager, Junior Superintendent, and Extension Assistant.\n\nQ: What is the pay scale of the post 'Technical Assistant'?\nA: The pay scale of the post 'Technical Assistant' is Rs 2,200-75-2,800-EB-100-4,000.\n\nQ: What is the purpose of redassifying left-over posts?\nA: The purpose of redassifying left-over posts is to reclassify them into appropriate categories.\n\nQ: What is the pay scale of the post 'Assistant Farm Management'?\nA: The pay scale of the post 'Assistant Farm Management' is Rs 3,700-125-4,700-150-5,000.\n\nQ: What is the role of the post 'Entomological Assistant'?\nA: The role of the post 'Entomological Assistant' is not explicitly mentioned in the provided text, but it can be inferred that it involves assisting in entomology-related activities.\n\nQ: Which post is classified under both Category II and Category III?\nA: The post 'Technical Assistant' is classified under both Category II and Category III, as it has been regrouped into a single grade with T-7 and T-8.}",
    "{ Q: What is the role of a Junior Field Assistant in agriculture?\n                            A: A Junior Field Assistant assists in various agricultural activities and field operations.\n                            Q: What is the responsibility of a Senior Soil Assistant?\n                            A: A Senior Soil Assistant assists in soil-related activities and investigations.\n                            Q: What position is responsible for curing in agriculture?\n                            A: The Junior Field Assistant-cum-Curer is responsible for curing agricultural products.\n                            Q: What is the role of a Stock Assistant in agriculture?\n                            A: A Stock Assistant manages and maintains agricultural stock and supplies.\n                            Q: What is the position of a Meteorological Observer in agriculture?\n                            A: A Meteorological Observer collects and records weather data for agricultural purposes.\n                            Q: What is the role of a Herbarium Assistant in agriculture?\n                            A: A Herbarium Assistant helps in maintaining and preserving plant specimens for research.\n                            Q: What position is responsible for animal husbandry in agriculture?\n                            A: The Senior Cattle Supervisor and Stockman are responsible for animal husbandry.\n                            Q: What is the role of a Veterinary Officer in agriculture?\n                            A: A Veterinary Officer provides medical care and treatment to farm animals.\n                            Q: What position is responsible for conducting agricultural surveys?\n                            A: A Junior Soil Surveyor and Land Surveyor are responsible for conducting agricultural surveys.\n                            Q: What is the role of a Laboratory Technician in agriculture?\n                            A: A Laboratory Technician assists in conducting laboratory tests and analyses related to agriculture.}",
    "{ Q: What is the role of a Museum Curator?\n                            A: A Museum Curator is responsible for managing and interpreting collections of artifacts and other objects.\n                            Q: What is a Mechanical Tabulating Officer?\n                            A: A Mechanical Tabulating Officer operates mechanical equipment to process and tabulate data.\n                            Q: Which engineering role involves working with spinning and weaving mills?\n                            A: A Mechanic Spinning and Weaving Mill is an engineering role that works in textile mills.\n                            Q: What is the role of a Senior Engineer (Electronics)?\n                            A: A Senior Engineer (Electronics) designs, develops, and tests electronic equipment and systems.\n                            Q: What is a Refrigerator Engineer responsible for?\n                            A: A Refrigerator Engineer maintains and repairs refrigeration equipment and systems.\n                            Q: What is an Agricultural Mechanic?\n                            A: An Agricultural Mechanic repairs and maintains farm machinery and equipment.\n                            Q: What is the role of an Instrument Physicist?\n                            A: An Instrument Physicist designs, develops, and tests scientific instruments and equipment.\n                            Q: What is a Superintendent (Electrical and Mechanical) responsible for?\n                            A: A Superintendent (Electrical and Mechanical) oversees the maintenance and repair of electrical and mechanical systems in a facility.\n                            Q: What is a Glass Blower's job?\n                            A: A Glass Blower creates glass objects by shaping and blowing molten glass.\n                            Q: What is the role of a Transport Officer?\n                            A: A Transport Officer manages and coordinates transportation services for an organization.}",
    "{ Q: What are the different groups of staff mentioned in the ICAR Handbook?\n                            A: The ICAR Handbook mentions staff groups such as Technical Services, Photography, Art, Press and Editorial, Medical and Paramedical, and House-keeping.\n                            Q: What positions are included in Group V - Photography Staff?\n                            A: Positions include Senior Photo-Officer, Junior Artist-cum-Photographer, Photographer-cum-Artist, and others.\n                            Q: What is the role of a Chief Artist in Group VI?\n                            A: The Chief Artist is responsible for leading the art team and overseeing artistic projects.\n                            Q: Who is the Director (P&I) in Group VII - Press and Editorial Staff?\n                            A: The Director (P&I) is the head of the Press and Editorial Staff, responsible for publications and information.\n                            Q: What positions are available in Group VIII - Medical and Paramedical Posts?\n                            A: Positions include Senior Medical Officer, Medical Officer, Pharmacist, and Staff Nurse.\n                            Q: What is the role of a Manager in Group IX - House-keeping Posts?\n                            A: The Manager is responsible for overseeing hostel services and catering.\n                            Q: What is the ICAR Handbook of Technical Services?\n                            A: The ICAR Handbook of Technical Services provides information on various staff positions and assessment procedures in the Indian Council of Agricultural Research.\n                            Q: What is the assessment procedure for granting merit promotion or advance increments to technical personnel?\n                            A: The assessment procedure involves adopting certain criteria for evaluating the technical personnel of the Indian Council of Agricultural Research.\n                            Q: What are some positions in Group VII - Press and Editorial Staff?\n                            A: Positions in this group include Director (P&I), Chief Editor, Production Officer, and Editor.\n                            Q: What is the role of a Midwife in Group VIII - Medical and Paramedical Posts?\n                            A: A Midwife provides care and assistance to women during childbirth.}",
    "{ Q: What are the key aspects considered in the assessment of technical personnel?\n                            A: The assessment considers professional performance, cooperation, teamwork, and contributions to scientific work.\n                            Q: How long is the CCR history considered for assessment?\n                            A: The CCR history for the last 5/10 years is considered for assessment.\n                            Q: Who are the reviewers in the assessment process?\n                            A: The immediate supervisors of the technical personnel being assessed are the reviewers.\n                            Q: What happens if the reviewer has supervised the reviewee for a short period?\n                            A: If the reviewer has supervised the reviewee for less than six months, they must consult other scientists/technical personnel who have worked with the reviewee for longer periods.\n                            Q: What is the role of the Head of Division/Research Station/Project in the assessment process?\n                            A: The Head of Division/Research Station/Project provides remarks on the completed proforma and may disagree with the assessment of the reviewer and reviewee.\n                            Q: Who constitutes the Assessment Committees?\n                            A: The Assessment Committees are constituted by the Appointing Authority and include experts in the particular professional group/discipline, as well as the Head of Division/Research Station/Project.\n                            Q: How many members are there in the Assessment Committees?\n                            A: The Assessment Committees have between 3 and 5 members, including the Chairman.\n                            Q: Who is the Chairman of the Assessment Committee?\n                            A: The Chairman of the Assessment Committee is a person from outside the Institute, nominated by the Chairman of the ASRB.\n                            Q: What is the purpose of the Assessment Committees?\n                            A: The Assessment Committees decide on the grant of promotion or advance increment(s) for the technical personnel.}",
    "{ Q: What is the purpose of the assessment form for technical personnel in ICAR?\n                            A: The assessment form is used to evaluate the performance of technical personnel in ICAR for merit promotion or advance increments.\n                            Q: How many advance increments can be given to technical personnel?\n                            A: The number of advance increments given to technical personnel should not exceed three.\n                            Q: What does one advance increment mean in ICAR?\n                            A: One advance increment means one increment over and above the normal annual increment.\n                            Q: What information should the reviewee provide in the assessment form?\n                            A: The reviewee should provide information about their educational career, additional qualifications, and employment record.\n                            Q: What is the reviewer expected to comment on in the assessment form?\n                            A: The reviewer should comment on the reviewee's amenability to discipline, punctuality, and integrity.\n                            Q: Who can provide remarks in Part III of the assessment form?\n                            A: The Head of Division/Research Station/Project can provide remarks in Part III.\n                            Q: Who makes the final recommendations in the assessment process?\n                            A: The Director makes the final recommendations in the assessment process.\n                            Q: What are the criteria used for the five/ten-yearly assessment of technical personnel in ICAR?\n                            A: The criteria include professional performance, spirit of cooperation, personal behavior, and organizational abilities.\n                            Q: What emphasis is given in the assessment of technical personnel in ICAR?\n                            A: Emphasis is given to the contributions made by the technical personnel during their service.}",
    "{  Q: What is the purpose of the assessment procedure for technical personnel in Category II?\n          A: The purpose is to evaluate their performance based on the five/ten-yearly assessment proforma and their activities in the past five/ten years.\n\n Q: Who should fill in the assessment proforma for technical personnel?\n          A: The technical personnel being assessed (reviewees) should fill in the enclosed proforma mentioning their activities in the past five/ten years.\n\n Q: Who is responsible for reviewing the completed proforma?\n          A: The immediate supervisor of the technical personnel concerned will review the completed proforma.\n\n Q: What happens if the reviewer has supervised the work of the reviewee for a short period?\n          A: In such cases, the reviewer should consult other scientists who have supervised or worked with the reviewee for a longer period.\n\n Q: Where does the completed proforma go after being reviewed by the immediate supervisor?\n          A: It is sent to the Head of Division/Research Station/Project for his/her remarks.\n\n Q: What is the role of the Director in the assessment process?\n          A: The Director places the proformae before the Assessment Committee and obtains its recommendations for promotion or advance increment(s).\n\n Q: How are the Assessment Committees constituted?\n          A: The Appointing Authority constitutes the Assessment Committees, which include not less than 3 and not more than 5 members, including the Chairman.\n\n Q: Who nominates the Chairman of the Assessment Committee?\n          A: The Chairman of the ASRB nominates the Chairman of the Assessment Committee.\n\n Q: What factors do the Assessment Committees consider while deciding on the performance of technical personnel?\n          A: They consider the documents mentioned in para 3, which include the material furnished in the five/ten-yearly assessment proforma and CCRs for the past five/ten years.\n\n Q: How many advance increments can be given to technical personnel based on their performance?\n          A: The number of advance increments given will not exceed three, with one advance increment meaning one increment over and above the normal annual increment.\n}",
    "{ Q: What is the ICAR Assessment Form for Technical Personnel (Category II)?\n                            A: It is a form used to evaluate the performance and career progression of technical personnel in ICAR.\n                            Q: What information is required in the ICAR Assessment Form?\n                            A: Information such as reported period, name, date of birth, field of specialization, and educational background is required.\n                            Q: What is the purpose of the 'Duties assigned' section in the form?\n                            A: It lists the responsibilities of the employee in their current position.\n                            Q: What details are needed for the 'Employment record' section?\n                            A: Details such as name of the organization, designation, salary, and nature of duties are required.\n                            Q: What additional qualifications should be mentioned in the form?\n                            A: Any additional qualifications or training acquired in India or abroad should be listed.\n                            Q: What honors or awards should be included in the form?\n                            A: Any honors, awards, or special assignments covered during the review period should be mentioned.\n                            Q: What is the purpose of the 'Productivity statement' section?\n                            A: It reflects the actual performance of the employee during the review period.\n                            Q: What is the ICAR Handbook of Technical Services Part I?\n                            A: It is a document that provides guidelines for filling in the ICAR Assessment Form.\n                            Q: What educational details are required in the form?\n                            A: Details such as degrees, diplomas, certificates, subjects of specialization, and institutions attended are required.\n                            Q: What is the 'Date of continuous appointment to the present grade' in the form?\n                            A: It is the date when the employee was permanently appointed to their current position.}",
    "{ Q: What are the categories of technical support work mentioned in the statement?\n                            A: The categories include number of animals managed, area of land/fish ponds managed, number of projects served, and others.\n                            Q: What are the examples of training work provided?\n                            A: Examples of training work include courses taught, special lectures/talks given, and being a member of Chairman/student advisory committees.\n                            Q: What is extension education work in the context of agriculture?\n                            A: Extension education work includes radio/television talks, field trips, exhibitions, and contacting farmers/cultivators.\n                            Q: How does the statement define teamwork and cooperation?\n                            A: Teamwork and cooperation are defined as inter-disciplinary, inter-institutional, and intra-institutional activities in which the individual was involved.\n                            Q: What are the institution-building activities mentioned?\n                            A: Institution-building activities include membership in special committees, organizing seminars/symposia, and any other relevant activities.\n                            Q: What is the reviewer asked to comment on in Part II?\n                            A: The reviewer is asked to comment on the reviewee's amenability to discipline, punctuality, and integrity.\n                            Q: What is the purpose of the five/seven-yearly assessment mentioned in the statement?\n                            A: The purpose of the five/seven-yearly assessment is to evaluate the performance of the employee using specific criteria.\n                            Q: Who provides the final recommendations in Part IV?\n                            A: The Director or DG, ICAR or Secretary, ICAR provides the final recommendations in Part IV.\n                            Q: What is the significance of the ICAR Handbook of Technical Services?\n                            A: The ICAR Handbook of Technical Services provides guidelines for evaluating the performance of employees in agricultural research and extension organizations.}",
    "{ Q: What is the focus of the assessment for technical personnel in the Indian Council of Agricultural Research?\n                            A: The assessment focuses on the individual's contribution and achievements in relation to the job requirements and duties assigned.\n                            Q: Who are the reviewers for technical personnel in different grades?\n                            A: The reviewers are the Head of Division/Research Station/Project for Grades T-6, T-7, and T-8. For Grade T-9 personnel, the Director of the Institute is the reviewer.\n                            Q: What documents are considered during the assessment of technical personnel?\n                            A: The material furnished in the five/seven-yearly assessment proforma, performance record files, biodata, CCRs for the past 5 years, and the enclosed proforma filled by the technical personnel are considered.\n                            Q: What is the role of the Director in the assessment process?\n                            A: The Director reviews the completed proforma, provides comments on discrepancies, and countersigns the proforma with recommendations.\n                            Q: How are discrepancies between the reviewer and reviewee's evaluation handled?\n                            A: The Director provides comments on the discrepancies and may disagree with the assessment, giving reasons for disagreement.\n                            Q: What is the purpose of the enclosed proforma in the assessment process?\n                            A: The enclosed proforma is used by the technical personnel to mention their activities in the past 5-7 years.\n                            Q: Who devises the suitable proforma for performance record files?\n                            A: The Director/Secretary, ICAR devises the suitable proforma for performance record files.\n                            Q: What is the procedure for selecting a reviewer when the Head of Division/Research Station/Project is in a lower grade?\n                            A: The Director of the Institute specifies the reviewer for the technical personnel working under him/her.\n                            Q: What is the role of the Assessment Committee in the process?\n                            A: The Director places the proforma before the Assessment Committee to obtain their recommendations for granting promotions.}",
    "{ Q: What is the maximum number of members in an Assessment Committee?\n                            A: The maximum number of members in an Assessment Committee is five, excluding the Chairman.\n                            Q: Who constitutes the Assessment Committees?\n                            A: The Assessment Committees are constituted by the concerned Directors in consultation with the Chairman, ASRB.\n                            Q: What is the purpose of the Assessment Committees?\n                            A: The Assessment Committees decide on the performance of technical personnel and recommend merit promotions or advance increments.\n                            Q: What documents are considered for assessing technical personnel?\n                            A: The documents mentioned in para 3 of the ICAR Handbook of Technical Services are considered for assessment.\n                            Q: Can an assessed person request a personal discussion with the Committee?\n                            A: Yes, an assessed person can request a personal discussion with the Committee in writing.\n                            Q: What is the maximum number of advance increments that can be given?\n                            A: The maximum number of advance increments that can be given is three.\n                            Q: What information should be provided in the Assessment Form for Technical Personnel?\n                            A: The Assessment Form requires information such as name, date of birth, field of specialization, duties assigned, and employment history.\n                            Q: What educational information should be provided in the ICAR Handbook of Technical Services?\n                            A: Educational information such as degrees, diplomas, certificates, subjects of specialization, and institutions attended should be provided.\n                            Q: What is required in the employment record section of the ICAR Handbook of Technical Services?\n                            A: The employment record section requires information on designation, employing organization, salary/pay, dates of joining and leaving, and duties performed for the last five/seven years.\n                            Q: What are the priority areas of work for technical personnel in the past five/seven years?\n                            A: The priority areas of work for technical personnel in the past five/seven years should be listed in the employment record section of the ICAR Handbook of Technical Services.}",
    "{ Q: What are the priority areas in the technical services handbook?\n                            A: The priority areas are technical support for scientific work, teaching/guiding, extension management/coordination, and administration.\n                            Q: How should the time allocation be assigned to each priority area?\n                            A: Time allocation should be assigned to each priority area, with no area taking more than 75% of the working time.\n                            Q: What are the examples of honors and awards mentioned in the handbook?\n                            A: Examples of honors and awards include membership of professional societies, offices held in professional societies, and special invitations to present papers or conduct seminars.\n                            Q: How should the overall performance in each priority area be rated?\n                            A: Overall performance in each priority area should be rated on a 0-5 scale, with 0 being poor and 5 being outstanding.\n                            Q: What information should be included in the productivity and projection table?\n                            A: The productivity and projection table should include information on technical support for scientific work, training and teaching work, extension education work, and teamwork and cooperation.\n                            Q: What are some examples of technical support for scientific work?\n                            A: Examples of technical support for scientific work include managing animals, managing land or fish ponds, and serving projects.\n                            Q: What are some examples of training and teaching work?\n                            A: Examples of training and teaching work include teaching courses, giving special lectures or talks, and serving as a member or chairman of student advisory committees.\n                            Q: What are some examples of extension education work?\n                            A: Examples of extension education work include giving radio or television talks, conducting field trips, organizing exhibitions, and contacting farmers or cultivators.\n                            Q: What should be included in the section on special assignments?\n                            A: The section on special assignments should include a brief description of each assignment, including dates and work done.\n                            Q: Is it possible to indicate a preference for a different type of work in the handbook?\n                            A: Yes, it is possible to indicate a preference for a different type of work in the handbook, if applicable. }",
    "{ Q: What are the inter-disciplinary, inter-institutional, and intra-institutional activities mentioned in the text?\n                            A: The activities include membership in institutional committees, special committees/task-force, and organizing seminars/symposia in the institution.\n                            Q: What types of unpublished reports or papers are mentioned in the text?\n                            A: The text mentions unpublished reports, papers, etc. as a type of work that can be included.\n                            Q: What are the examples of published work listed in the text?\n                            A: Examples of published work include books/monographs, professional papers/articles, popular articles, book reviews, professional communication to journals/magazines, professional abstracts, and technical reports.\n                            Q: What is the purpose of furnishing the most salient features of work done in the top 3 priority areas?\n                            A: The purpose is to provide a summary statement of the most significant aspects of the overall professional performance with supporting evidence.\n                            Q: What is the ICAR Handbook of Technical Services?\n                            A: The ICAR Handbook of Technical Services is a document that provides guidelines for assessing the professional work of employees.\n                            Q: What is the minimum qualification required for Category I of technical services in the ICAR?\n                            A: The minimum qualification required for Category I of technical services in the ICAR is matriculation with at least one year certificate from a recognized institution.\n                            Q: What is the purpose of the Director's recommendation in the ICAR Handbook of Technical Services?\n                            A: The purpose of the Director's recommendation is to provide an assessment of the employee's work and to make a recommendation for their future employment.\n                            Q: What is the role of the reviewer in the ICAR Handbook of Technical Services?\n                            A: The reviewer is responsible for evaluating the information provided by the employee and giving a critical appraisal of their work and projections.\n                            Q: What is the significance of membership in institutional committees for an employee's professional development?\n                            A: Membership in institutional committees can provide opportunities for professional growth, networking, and contributing to the institution's decision-making processes.\n                            Q: What is the importance of organizing seminars/symposia in the institution?\n                            A: Organizing seminars/symposia can help promote knowledge sharing, collaboration, and innovation within the institution and the wider professional community.\n}",
    "{ Q: What are the minimum essential qualifications for Category I posts in the relevant field?\n                            A: The minimum essential qualification for Category I posts is a Bachelor's degree in the relevant field from a recognized university.\n                            Q: What is required for direct recruitment in consultation with the concerned subject-matter divisions?\n                            A: Specific qualifications covering the relevant fields, location-specific requirements, and desirable specialization should be finalized for direct recruitment.\n                            Q: Who conducts the all-India basis direct recruitment for T-7 to T-9 posts?\n                            A: The ASRB conducts the all-India basis direct recruitment for T-7 to T-9 posts.\n                            Q: What is the composition of the Selection Committee for T-1 to T-3 posts at ICAR Headquarters?\n                            A: The Selection Committee for T-1 to T-3 posts at ICAR Headquarters includes the Secretary, ICAR or his nominee, one senior officer, an officer not lower in status than Under-Secretary, and an outside expert.\n                            Q: Who nominates the member belonging to SC/ST community for T-1 to T-6 posts at ICAR Headquarters?\n                            A: The Secretary, ICAR nominates the member belonging to SC/ST community for T-1 to T-6 posts at ICAR Headquarters.\n                            Q: What is the minimum essential qualification for T-6 posts?\n                            A: The minimum essential qualification for T-6 posts is a Master's degree in the relevant field or equivalent qualifications from a recognized university.\n                            Q: Who is the Chairman of the Selection Committee for T-4 to T-6 posts at ICAR research institutes?\n                            A: The Director is the Chairman of the Selection Committee for T-4 to T-6 posts at ICAR research institutes.\n                            Q: Who nominates the outside expert member for the Selection Committee at ICAR research institutes?\n                            A: The Secretary, ICAR nominates the outside expert member for the Selection Committee at ICAR research institutes.\n                            Q: What is the role of the Deputy-Secretary (A)/Member-Secretary in the Selection Committee for T-1 to T-6 posts at ICAR research institutes?\n                            A: The Deputy-Secretary (A)/Member-Secretary acts as the Member-Secretary in the Selection Committee for T-1 to T-6 posts at ICAR research institutes.}",
    "{\nQ: What is the composition of the committee for promotion in Grade T-1 of Category I at ICAR headquarters?\nA: The committee includes a Sr Officer not lower in status than Under-Secretary, an officer not lower in status than Under-Secretary belonging to SC/ST community, an outside expert, and an Under-Secretary (Tech).\n\nQ: Who nominates the Sr Officer for the committee in the absence of CAO/SAO at ICAR research institutes?\nA: The Director nominates the Sr Officer for the committee in the absence of CAO/SAO at ICAR research institutes.\n\nQ: Who is responsible for absorption/probationary period/efficiency bar/confirmation for posts in T-4 to T-6 grades at ICAR headquarters?\nA: The Director(P)/Director(F) as Chairman, a Sr Officer not lower in status than Deputy-Secretary to Govt of India/ Dy Secretary, ICAR, an outside expert, and an officer not lower in status than officers under consideration belonging to SC/ST community are responsible.\n\nQ: Who is the Chairman for the committee related to absorption/probationary period/efficiency bar/confirmation for grades T-7, T-8, and T-9 at ICAR headquarters?\nA: The Secretary, ICAR, or his nominee serves as the Chairman for the committee.\n\nQ: Who nominates the outside expert for the committee at ICAR research institutes for grades T-7, T-8, and T-9?\nA: The Director nominates the outside expert for the committee at ICAR research institutes for grades T-7, T-8, and T-9.\n\nQ: Which officer not lower in status than S-3 is nominated by the Director for the committee at ICAR research institutes?\nA: The Joint Director/Head of Division/Senior Officer not lower in status than S-3 is nominated by the Director for the committee at ICAR research institutes.\n\nQ: Who is responsible for filling up 33.3% vacancies in Grade T-1 of Category I at ICAR headquarters?\nA: Promotion is responsible for filling up 33.3% vacancies in Grade T-1 of Category I at ICAR headquarters.\n\nQ: Who nominates the officer belonging to SC/ST community for the committee at ICAR headquarters for filling up vacancies in Grade T-1 of Category I?\nA: The Deputy Secretary(A) nominates the officer belonging to SC/ST community for the committee at ICAR headquarters.\n\nQ: Who is the Member-Secretary for the committee related to absorption/probationary period/efficiency bar/confirmation for posts in T-1 to T-3 grades at ICAR headquarters?\nA: The Under-Secretary (Tech) serves as the Member-Secretary for the committee.\n\nQ: Who nominates the outside expert for the committee at ICAR headquarters for filling up vacancies in Grade T-1 of Category I?\nA: The Director nominates the outside expert for the committee at ICAR headquarters for filling up vacancies in Grade T-1 of Category I.\n}",
    "{ Q: What is the ICAR Handbook of Technical Services?\n                            A: The ICAR Handbook of Technical Services is a document that provides guidelines for annual assessment reports for technical personnel.\n                            Q: Who nominates the members for the committee in the ICAR?\n                            A: The Secretary of ICAR nominates the members for the committee.\n                            Q: What is the purpose of Form III in the ICAR Handbook of Technical Services?\n                            A: Form III is used for the annual assessment report of Category I technical personnel.\n                            Q: What information is required in Part I of Form III?\n                            A: Part I of Form III requires personal information such as name, date of birth, designation, and qualifications.\n                            Q: What is the maximum word limit for the performance resume in Part II of Form III?\n                            A: The maximum word limit for the performance resume in Part II of Form III is 100 words.\n                            Q: What is the role of the reporting officer in Part III of Form III?\n                            A: The reporting officer assesses the officer's performance, technical competence, sense of responsibility, and other aspects.\n                            Q: What are the areas of assessment for the officer in Part III of Form III?\n                            A: The areas of assessment include initiative, industry, physical capacity for duty, promptness, punctuality, and relations with colleagues and subordinates.\n                            Q: What is the purpose of the overall grading in Part III of Form III?\n                            A: The overall grading provides an evaluation of the officer's performance during the review period.\n                            Q: What are the possible overall grading options in Part III of Form III?\n                            A: The possible overall grading options are outstanding, very good, good, average, and below average.\n                            Q: What is the significance of the ICAR letter No.1(2)/81-Per.IV dated 10 September 1987 in the context of the committee?\n                            A: The letter provides the proforma for the committee's composition and nomination process.}"
]