[
    "```json\n{\n  \"Q1\": \"What forms can neem urea coating be found in?\",\n  \"A1\": \"Neem urea coating can be found in either liquid form or powdered form.\",\n  \"Q2\": \"What are the properties of neem urea coating?\",\n  \"A2\": \"Neem urea coating has anti-feedant and pest growth regulator properties.\",\n  \"Q3\": \"What is neem cake used for in agriculture?\",\n  \"A3\": \"Neem cake is used as an organic fertilizer in agriculture to improve soil fertility and promote plant growth.\",\n  \"Q4\": \"What are the benefits of using neem as manure?\",\n  \"A4\": \"Neem manure is environmental friendly and helps increase the nitrogen and phosphorous content in the soil.\",\n  \"Q5\": \"What is neem soil conditioner used for?\",\n  \"A5\": \"Neem soil conditioner is used to improve soil's physical condition, usually its fertility, and enhance soil quality parameters.\",\n  \"Q6\": \"How is neem soil conditioner applied?\",\n  \"A6\": \"Neem soil conditioner can be applied during sowing of seeds or spread and raked over the field, followed by proper irrigation.\",\n  \"Q7\": \"What is the advantage of using neem-based pesticides?\",\n  \"A7\": \"Neem-based pesticides do not leave any toxic residue on plants and do not destroy natural predators and parasites of pests.\",\n  \"Q8\": \"How does neem oil reduce pest population?\",\n  \"A8\": \"Neem oil reduces pest population by not allowing the female to deposit eggs on stored grains or feed on them, acting as an oviposition deterrent.\",\n  \"Q9\": \"What is the effect of neem products on earthworms?\",\n  \"A9\": \"Neem products have a positive and significant effect on mortality, growth, and reproduction of earthworms.\",\n  \"Q10\": \"What are the benefits of using neem-based products in agriculture?\",\n  \"A10\": \"Neem-based products are eco-friendly, superior in quality, and help overcome ecological and health threats imposed by chemical pesticides, making them a boon for organic agriculture.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"How can gunny bags be treated to store grains?\",\n  \"A1\": \"Gunny bags should be dipped in 10% neem kernel solution for 15 min, dried in shade, and used for storing grains.\",\n  \n  \"Q2\": \"What is the advantage of using neem oil for stored grain pests?\",\n  \"A2\": \"Neem oil is easier to use than leaves and can be used at a concentration of 1% by weight of the grains.\",\n  \n  \"Q3\": \"What is the active ingredient of the neem plant?\",\n  \"A3\": \"The active ingredient of the neem plant is more in seed and kernel, specifically azadirachtin.\",\n  \n  \"Q4\": \"What are the benefits of neem fumigation?\",\n  \"A4\": \"Neem fumigation is non-toxic, eco-friendly, does not contaminate the environment, and pests do not develop resistance to it.\",\n  \n  \"Q5\": \"How can neem products be used to store grains and pulses?\",\n  \"A5\": \"Grains and pulses can be stored by mixing them with neem products like dried leaf powder, kernel powder, or neem oil.\",\n  \n  \"Q6\": \"What is the main ingredient of neem plant used to manufacture biopesticides?\",\n  \"A6\": \"Azadirachtin is the main ingredient of the neem plant used to manufacture biopesticides.\",\n  \n  \"Q7\": \"What are the properties of neem oil and seed extracts?\",\n  \"A7\": \"Neem oil and seed extracts possess germicidal and anti-bacterial properties.\",\n  \n  \"Q8\": \"How can new gunny bags be treated for storing grains?\",\n  \"A8\": \"New gunny bags should be soaked in 10% neem kernel solution for half an hour before use.\",\n  \n  \"Q9\": \"What is the role of neem in Integrated Pest Management (IPM)?\",\n  \"A9\": \"Neem is a potential biopesticide for organic agriculture and is widely used in IPM, either singly or in conjunction with chemical pesticides.\",\n  \n  \"Q10\": \"Where can experiences with Indian farming be shared?\",\n  \"A10\": \"Experiences with Indian farming can be shared by writing to the Editor, Indian Farming, at indfarm@icar.org.in.\"\n}\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"What is the main objective of ICAR?\",\n    \"A\": \"To undertake research, education, and extension in agriculture and allied areas.\"\n  },\n  {\n    \"Q\": \"What is the mandate of ICAR?\",\n    \"A\": \"To plan, undertake, coordinate, and promote research and technology development for sustainable agriculture, aid and impart agricultural education, undertake frontline extension, and formulate policy, cooperation, and consultancy in agricultural research, education, and extension.\"\n  },\n  {\n    \"Q\": \"What is Corporate Social Responsibility (CSR)?\",\n    \"A\": \"A corporate initiative to assess and take responsibility for the company's effects on the environment and impact on social welfare.\"\n  },\n  {\n    \"Q\": \"What is the purpose of CSR Rules, 2014?\",\n    \"A\": \"To make it mandatory for certain companies to comply with the provision relevant to Corporate Social Responsibility and spend 2% of average net profits on CSR activities.\"\n  },\n  {\n    \"Q\": \"What are the activities that CSR can involve?\",\n    \"A\": \"Incurring short-term costs that do not provide an immediate financial benefit to the company, but instead promote positive social and environmental change.\"\n  },\n  {\n    \"Q\": \"What is the soul of CSR?\",\n    \"A\": \"To utilize CSR funds for activities that have larger public benefits and especially to those who need the corporate hand holdings the most.\"\n  },\n  {\n    \"Q\": \"Why is agriculture a priority area for CSR?\",\n    \"A\": \"Because it is a primary source of livelihood to about 60% of the Indian households and enjoys the privilege of being broad-based and mass activity.\"\n  },\n  {\n    \"Q\": \"What is the purpose of ICAR Guidelines for utilization of CSR Funds 2020?\",\n    \"A\": \"To identify research activities for attracting CSR funds and facilitate the effective utilization of the obtained funds from public and private companies/enterprises/industry/organizations having no conflicts of interest.\"\n  },\n  {\n    \"Q\": \"What percentage of average net profits should companies spend on CSR activities?\",\n    \"A\": \"2% of average net profits of the last 3 years.\"\n  },\n  {\n    \"Q\": \"When did the CSR Rules, 2014 come into effect?\",\n    \"A\": \"1st April, 2014.\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"What is the purpose of the contributions received from donors?\",\n  \"A1\": \"The contributions will be utilized to carry out/enhance/augment various research and farmers outreach activities as per the provisions of MoU/MoA/LoI of ICAR and the Contributor(s); and Government of India guidelines.\",\n  \n  \"Q2\": \"What are the eligible areas for CSR funding as per the Ministry of Corporate Affairs?\",\n  \"A2\": \"Contribution to incubators funded by Central Government or State Government, and contributions to public funded Universities, Indian Institute of Technology (IITs), National Laboratories and Autonomous Bodies are eligible for CSR funding.\",\n  \n  \"Q3\": \"What are the guidelines that ICAR shall follow for CSR?\",\n  \"A3\": \"ICAR shall follow the provisions of the CSR Rules laid down by the Ministry of Corporate Affairs, Government of India from time to time under the Companies Act, 2013 and its amendments.\",\n  \n  \"Q4\": \"Can contributors prescribe specific deliverables or impose their area of interest in exchange for contributions?\",\n  \"A4\": \"No, contributions under CSR reflect voluntary contribution and contributor(s) cannot prescribe any particular deliverable benefit or item or impose their area of interest in exchange from ICAR for contributions.\",\n  \n  \"Q5\": \"What are the admissible activities under CSR as per Schedule VII of the Companies Act, 2013?\",\n  \"A5\": \"The Schedule provides an umbrella of activities that can be taken up through CSR, including Scientific Research and agricultural extension.\",\n  \n  \"Q6\": \"Are there any tax exemptions for CSR activities related to Scientific Research and agricultural extension?\",\n  \"A6\": \"Yes, these activities enjoy exemptions under the Income Tax rules.\",\n  \n  \"Q7\": \"What are some examples of R&D activities that can be supported under CSR?\",\n  \"A7\": \"Examples include research and agricultural extension/education funding, capacity building and income augmentation through skilling of farmers and scientists, seed and planting materials research, and R&D for diversification of farm activities.\",\n  \n  \"Q8\": \"Can CSR activities focus on livelihood improvement and poverty eradication?\",\n  \"A8\": \"Yes, CSR activities can focus on livelihood improvement and poverty eradication, such as research and agricultural extension/education funding that helps in enhancing availability, access, and affordability of food items.\",\n  \n  \"Q9\": \"Are there any specific areas that ICAR can consider under CSR activities?\",\n  \"A9\": \"Yes, ICAR can consider areas such as eradicating extreme hunger and poverty, capacity building and income augmentation, seed and planting materials research, and livelihood projects creating rainwater harvesting structures and maintenance of water.\",\n  \n  \"Q10\": \"What is the overall goal of CSR activities in the context of ICAR?\",\n  \"A10\": \"The overall goal is to promote Sustainable Development Goals (SDGs) through research and development activities in science, technology, engineering, and medicine, with a focus on agricultural extension and livelihood improvement.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What are millets and why are they important?\",\n  \"A1\": \"Millets are a group of small-seeded grasses that are highly tolerant to environmental stresses and have high physiological efficiency, making them an important food security crop in many parts of the world.\",\n  \n  \"Q2\": \"What are the key adaptive traits of millets that make them climate-resilient?\",\n  \"A2\": \"Millets have a short growing season, deep root system, and ability to tolerate high temperatures and drought conditions, making them well-suited for climate resilience.\",\n  \n  \"Q3\": \"What is the significance of millets in terms of their physiological and anatomical makeup?\",\n  \"A3\": \"The physiological and anatomical makeup of millets makes them superior to other crops in terms of their ability to harness available resources like light, water, and other inputs, and they have evolved to be more drought-tolerant and sustainable.\",\n  \n  \"Q4\": \"What are some examples of millet crops?\",\n  \"A4\": \"Examples of millet crops include sorghum (jowar), pearl millet (bajra), finger millet (ragi), foxtail millet (kangani), barnyard millet (sanwa), proso millet (chenna), little millet (kutki), and kodo millet (kodo).\",\n  \n  \"Q5\": \"What are the nutritional benefits of millets?\",\n  \"A5\": \"Millets are considered as nutri-cereals due to their abundant nutritional benefits, including food and fodder value, ecological benefits, and reduced reliance on chemical fertilizers.\",\n  \n  \"Q6\": \"How do millets compare to other cereals in terms of water usage?\",\n  \"A6\": \"Millets have a low water footprint and can grow under drought conditions, even in very low rainfall regimes, making them more water-efficient than other cereals like wheat, rice, or corn.\",\n  \n  \"Q7\": \"What makes millets 'climate-smart' crops?\",\n  \"A7\": \"Millets are considered climate-smart crops due to their ability to cope with changing climate, sustain productivity, and exhibit resilience to abiotic stresses, making them a promising solution for farmers in the face of climate vulnerabilities.\",\n  \n  \"Q8\": \"How do millets handle drought and high temperatures?\",\n  \"A8\": \"Millets are known for their hardiness and can withstand prolonged periods of drought and high temperatures, still yielding grains and fodder.\",\n  \n  \"Q9\": \"What is the C4 photosynthetic system and how does it benefit millets?\",\n  \"A9\": \"The C4 photosynthetic system operating in millet crops allows them to harness available resources more efficiently and makes them less affected by increasing atmospheric carbon dioxide levels, with no or negligible greenhouse gas emissions.\",\n  \n  \"Q10\": \"Why is it important to understand the physiological traits and anatomical makeup of millets?\",\n  \"A10\": \"Understanding the physiological traits and anatomical makeup of millets is necessary to unlock their full potential and to develop superior and high-yielding varieties that can compete with other major cereals.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What are the main areas of focus for CSR activities in agriculture?\",\n  \"A1\": \"The main areas of focus include promotion of education, promoting gender equality and empowering women, reducing child mortality and improving maternal health, and ensuring environmental sustainability.\",\n  \n  \"Q2\": \"What kind of infrastructure is supported under CSR for higher agricultural education?\",\n  \"A2\": \"Infrastructure like classrooms, buildings, sports complexes, libraries, hostels, and modernization of classrooms are supported under CSR.\",\n  \n  \"Q3\": \"How does CSR support women farmers?\",\n  \"A3\": \"CSR supports women farmers through R&D for farm tools, capacity building, and development of gender-friendly farm equipment, as well as training and hostels in KVKs.\",\n  \n  \"Q4\": \"What kind of R&D projects are supported under CSR for reducing child mortality and improving maternal health?\",\n  \"A4\": \"R&D projects on health foods, biofortification of food crops, and awareness and capacity building of women farmers for homestead food are supported under CSR.\",\n  \n  \"Q5\": \"How does CSR contribute to combating diseases like HIV, AIDS, and malaria?\",\n  \"A5\": \"CSR contributes to combating diseases through development of vaccines against viral diseases in livestock, Swachchata Initiatives, and development of nutraceuticals from sea wastes/fish wastes.\",\n  \n  \"Q6\": \"What kind of activities are supported under CSR for ensuring environmental sustainability?\",\n  \"A6\": \"Activities like R&D projects on NRM, biodiversity, sustainability, climate change management, and preservation and protection of flora and fauna are supported under CSR.\",\n  \n  \"Q7\": \"How does CSR support employment-enhancing vocational skills?\",\n  \"A7\": \"CSR supports employment-enhancing vocational skills through training of trainers and farmers, projects under Student READY, Farmers First, ARYA, and support to technical/vocational institutions.\",\n  \n  \"Q8\": \"What kind of social business projects are supported under CSR?\",\n  \"A8\": \"Rural and agriculture development projects, development of jobs related to agro products, and funding to Agri-Business Incubation (ABI) Centers are supported under CSR.\",\n  \n  \"Q9\": \"How does CSR support technology incubators and Agri-Business Incubation Centers?\",\n  \"A9\": \"CSR provides funding to technology incubators located within Central Universities and Agri-Business Incubation (ABI) Centers located in different deemed Universities and Central Agricultural Universities.\",\n  \n  \"Q10\": \"What other areas can CSR support in agriculture?\",\n  \"A10\": \"CSR can support income augmentation research, development of new products and protocols, training of rural youth for self-employment, and assistance to villagers having small patches of land to develop agricultural farming.\"\n}\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```\n[\n  {\n    \"Q\": \"What is the purpose of the ICAR-CSR Fund Steering Committee?\",\n    \"A\": \"The committee is set up to monitor and ensure transparency for proper utilization of funds as per Ministry of Corporate Affairs Guideline.\"\n  },\n  {\n    \"Q\": \"Who will be the chairman of the ICAR-CSR Fund Steering Committee?\",\n    \"A\": \"The AS (DARE) & Secretary, ICAR will be the chairman of the committee.\"\n  },\n  {\n    \"Q\": \"What is the tenure of the ICAR-CSR Fund Steering Committee?\",\n    \"A\": \"The tenure of the committee will be for two years.\"\n  },\n  {\n    \"Q\": \"What are the responsibilities of the ICAR-CSR Fund Steering Committee?\",\n    \"A\": \"The committee will be responsible for the administration of the fund, policy decisions, finance, and administration, and ensuring efficient execution of the objectives of the fund.\"\n  },\n  {\n    \"Q\": \"How will the committee review CSR proposals?\",\n    \"A\": \"The committee will examine the CSR proposals to ensure that there is no conflict of interest with the donor organization, with a quorum of minimum 5 members.\"\n  },\n  {\n    \"Q\": \"When will the committee call for proposals?\",\n    \"A\": \"The committee will call for proposals annually in the beginning of the financial year.\"\n  },\n  {\n    \"Q\": \"How will the committee identify thematic areas for call for proposals?\",\n    \"A\": \"The committee will identify thematic areas for call for proposals and can also decide and recommend certain activities for utilization of funds received under CSR.\"\n  },\n  {\n    \"Q\": \"How will the progress of schemes/activities undertaken under CSR be monitored?\",\n    \"A\": \"The committee will monitor the physical as well as financial progress of various schemes/activities undertaken under CSR by having periodic review.\"\n  },\n  {\n    \"Q\": \"Where will the projects and activities to be carried out from the CSR funds be uploaded?\",\n    \"A\": \"The projects and activities will be uploaded on the ICAR website with complete details and updated regularly.\"\n  },\n  {\n    \"Q\": \"Who will service the ICAR-CSR Fund Steering Committee for secretarial works and management of funds?\",\n    \"A\": \"The NASF Unit will service the committee for secretarial works and management of funds.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"How should ICAR Institutes maintain projects funded by the ICAR CSR Fund?\",\n    \"A\": \"Projects shall be maintained in a separate bank account as per GFR rules.\"\n  },\n  {\n    \"Q\": \"What happens to the earnings from the ICAR CSR Fund?\",\n    \"A\": \"Earnings, such as interest or revenue, will be ploughed back into the fund.\"\n  },\n  {\n    \"Q\": \"Who decides on the expenditure of the ICAR CSR Fund?\",\n    \"A\": \"The expenditure will be based on the process laid by the ICAR CSR Steering Committee.\"\n  },\n  {\n    \"Q\": \"What are the guidelines for receipts and payments under CSR?\",\n    \"A\": \"All receipts and payments will be done strictly as per provisions of GFR, 2017, and will be subject to internal audit, CAG audit, or audit by a recognized Chartered Accountant.\"\n  },\n  {\n    \"Q\": \"How will ICAR ensure proper utilization of CSR funds?\",\n    \"A\": \"A subcommittee of 3 members will be formed to avoid mis-utilization of funds and explore investment avenues as per GoI rules and regulations.\"\n  },\n  {\n    \"Q\": \"What are the criteria for accepting CSR contributions from companies?\",\n    \"A\": \"ICAR will accept CSR contributions from companies that comply with CSR norms/guidelines of the Ministry of Corporate Affairs, GoI.\"\n  },\n  {\n    \"Q\": \"How will ICAR prevent conflict of interest with donor organizations?\",\n    \"A\": \"ICAR will ensure that there is no conflict of interest with the donor organization, and no person or organization should be in a position to derive personal benefit from actions or decisions made in their official capacity.\"\n  },\n  {\n    \"Q\": \"What is the basis of accounting for CSR contributions?\",\n    \"A\": \"The usual basis of accounting will be followed, where revenue, expenses, assets, and liabilities are reflected in the accounts in the period in which they accrue.\"\n  },\n  {\n    \"Q\": \"Who is responsible for approving CSR-funded projects?\",\n    \"A\": \"The Convener, CSR Secretariat, will finalize, approve, and award projects up to Rs. 25.0 lakhs, while projects with a budget of more than Rs. 25.0 lakhs will be finalized and approved by the ICAR-CSR Fund Committee.\"\n  },\n  {\n    \"Q\": \"How will ICAR review and implement CSR-funded research projects?\",\n    \"A\": \"Project approvals and review will be in line with established ICAR norms, and an expert committee will review proposals with appropriate authority for approval. The investment from the ICAR CSR Fund will be project-based, and project activities will be implemented by ICAR-institutes or specialized agencies found fit by the Expert Committees/ICAR CSR Steering Committee.\"\n  }\n]\n```",
    "{\n  \"Q1\": \"What is the estimated food grain production in India during 2021-22?\",\n  \"A1\": \"314 million tons, 1% higher than 2020-21\",\n  \"Q2\": \"What are the climate resilient technologies that can help address climate change challenges?\",\n  \"A2\": \"Direct seeded rice (DSR), staggered nursery transplanting, promotion of hybrids, bio-fortified varieties, focused approach on pulses and oilseeds, and crop diversification\",\n  \"Q3\": \"What is the prediction for Southwest Monsoon 2022 by the India Meteorological Department (IMD)?\",\n  \"A3\": \"Normal seasonal rainfall over the country, likely to be 96-104% of the Long Period Average (LPA) of 880 mm\",\n  \"Q4\": \"What percentage of the country's net sown area is occupied by rainfed agriculture?\",\n  \"A4\": \"Almost half\",\n  \"Q5\": \"What is the contribution of rainfed agriculture to the country's agriculture production?\",\n  \"A5\": \"Nearly 40 percent\",\n  \"Q6\": \"Who is the Secretary (DARE) & DG (ICAR) of the Indian Council of Agricultural Research?\",\n  \"A6\": \"Dr Trilochan Mohapatra\",\n  \"Q7\": \"What is the purpose of the ICAR agro-advisory for KHARIF 2022?\",\n  \"A7\": \"To provide guidance and recommendations for agriculture production during the KHARIF season\",\n  \"Q8\": \"What are the different zones covered in the ICAR agro-advisory for KHARIF 2022?\",\n  \"A8\": \"11 zones, from Zone 1 to Zone 11\",\n  \"Q9\": \"Who is the Project Director Incharge (DKMA) of the ICAR, New Delhi?\",\n  \"A9\": \"Dr. S.K. Malhotra\",\n  \"Q10\": \"What is the name of the printer that printed the ICAR agro-advisory for KHARIF 2022?\",\n  \"A10\": \"M/s. Royal Offset Printers\"\n}",
    "[\n  {\n    \"Q\": \"What are the major field crops cultivated in Kharif?\",\n    \"A\": \"Cereals (paddy, maize, millets), oilseeds (groundnut, soybean, sesame), pulses (blackgram, greengram, pigeonpea, moth bean, cluster bean and horsegram), commercial crops like cotton, sugarcane, spices, vegetables and fruit crops.\"\n  },\n  {\n    \"Q\": \"Why is it necessary to introduce inter-cropping of pulses with oilseeds and other crops?\",\n    \"A\": \"To sustain and enhance pulse production, and to control insects, pests, and diseases.\"\n  },\n  {\n    \"Q\": \"What techniques can be adopted to improve oilseed production?\",\n    \"A\": \"Broad Bed Furrow (BBF) and Ridge furrow system, availability of seeds of improved varieties, replacement of upland/low yielding paddy area with oilseeds.\"\n  },\n  {\n    \"Q\": \"What is the focus for improving edible oil production in North Eastern states?\",\n    \"A\": \"Impetus to horizontal coverage to oil palm.\"\n  },\n  {\n    \"Q\": \"What is required for sustaining and enhancing production and productivity of pulses, oilseeds, and coarse cereals?\",\n    \"A\": \"Holistic planning, prioritization of resources, operationalization of district contingency plans, and a comprehensive strategy.\"\n  },\n  {\n    \"Q\": \"What is ICAR's initiative to address malnutrition?\",\n    \"A\": \"Improving the nutritional quality of high yielding varieties of cereals, pulses, oilseeds, vegetables, and fruits, and popularizing bio-fortified varieties among masses.\"\n  },\n  {\n    \"Q\": \"What are some examples of bio-fortified varieties of crops?\",\n    \"A\": \"Rice (CR Dhan 310, DRR Dhan 45), Wheat (WB 02, HPBW 01), Maize (Vivek QPM 9), Pearl Millet (HHB 299), Finger Millet (VR 929), Lentil (PusaAgeti Masoor), Groundnut (Girnar 4), Linseed (TL 99), Mustard (Pusa Mustard 30), Soybean (NRC 127).\"\n  },\n  {\n    \"Q\": \"What is the role of Extension Division of ICAR in promoting bio-fortified varieties?\",\n    \"A\": \"To promote and up-scaling the bio-fortified varieties.\"\n  },\n  {\n    \"Q\": \"Why is micro-level planning and its implementation at grass root level necessary?\",\n    \"A\": \"To ensure the set targets for production and productivity of pulses, oilseeds, and coarse cereals.\"\n  },\n  {\n    \"Q\": \"What is the importance of supplemental irrigation and critical inputs in production scenario?\",\n    \"A\": \"To add value to the production scenario and ensure the set targets.\"\n  }\n]",
    "```json\n[\n  {\n    \"Q\": \"What is the purpose of the ICAR's agro-advisories for farmers?\",\n    \"A\": \"The agro-advisories provide best practices for farmers to adopt during the Kharif season, covering major crops, livestock, poultry, and fisheries.\"\n  },\n  {\n    \"Q\": \"What are the technical aspects covered in the ICAR's agro-advisories?\",\n    \"A\": \"The advisories cover seed, soil, water, nutrient, and health management in crops and livestock enterprises.\"\n  },\n  {\n    \"Q\": \"Why is it important to select suitable crop cultivars and adhere to optimum sowing times?\",\n    \"A\": \"Selecting suitable crop cultivars and adhering to optimum sowing times helps achieve higher productivity and better crop yields.\"\n  },\n  {\n    \"Q\": \"What is the significance of Direct Seeded Rice (DSR) in Indian agriculture?\",\n    \"A\": \"DSR has been successfully implemented in over five lakh hectares in the last two years, and there is a need to popularize it in newer areas by demonstrating good weed management practices.\"\n  },\n  {\n    \"Q\": \"Why is seed treatment with recommended chemicals/bio-pesticides/bio-inoculants important?\",\n    \"A\": \"Seed treatment improves seed germination, crop stand, and productivity, and helps reduce pest and disease incidence.\"\n  },\n  {\n    \"Q\": \"How can nutrient management and fertilizer application be optimized?\",\n    \"A\": \"Nutrient management and fertilizer application should be based on soil tests to save on input use and reduce the cost of cultivation.\"\n  },\n  {\n    \"Q\": \"What is the importance of correcting micro-nutrient deficiencies in crops?\",\n    \"A\": \"Correcting micro-nutrient deficiencies, such as zinc or iron, can improve crop yields and reduce the risk of diseases.\"\n  },\n  {\n    \"Q\": \"What are the cost-effective integrated pest management options for various crops?\",\n    \"A\": \"Cost-effective integrated pest management options include using tolerant varieties, foliar applications, and basal applications to control pests and diseases in various crops.\"\n  },\n  {\n    \"Q\": \"Why is integrated crop and pest management important in crop expansion?\",\n    \"A\": \"Integrated crop and pest management is crucial in crop expansion to non-traditional areas, such as oilseed crops, to minimize the risk of pests and diseases.\"\n  },\n  {\n    \"Q\": \"What is the role of Krishi Vigyan Kendras (KVKs) in disseminating agro-advisories to farmers?\",\n    \"A\": \"KVKs play a vital role in disseminating agro-advisories to farmers at the district level, providing them with the necessary information and guidance to improve their agricultural practices.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What are the best practices for drought-proofing in rainfed areas?\",\n    \"A\": \"Tolerant short duration varieties, in situ soil moisture conservation practices, and planting methods, and increase in-field crop diversity through intercropping and crop combinations depending on agro-ecology.\"\n  },\n  {\n    \"Q\": \"What are the recommended best practices for livestock, poultry, small ruminants, and fisheries?\",\n    \"A\": \"Selection of disease-free and tolerant breeds, feed and health management.\"\n  },\n  {\n    \"Q\": \"What is the importance of scientific techniques for farmers in Himachal Pradesh?\",\n    \"A\": \"To make farmers aware of the latest developed techniques so that they can take full advantage of them.\"\n  },\n  {\n    \"Q\": \"What are the suitable varieties of maize for high altitude areas in Himachal Pradesh?\",\n    \"A\": \"Composite variety Girija for timely sowing and Bajaura Makka, Bajaura Popcorn, Bajaura sweet corn for late sowing.\"\n  },\n  {\n    \"Q\": \"What is the recommended spacing for maize in Himachal Pradesh?\",\n    \"A\": \"60x20 cm to maintain an optimum plant population of 75000-83000 plants.\"\n  },\n  {\n    \"Q\": \"What is the recommended fertilizer application for hybrid maize varieties in areas with high rainfall?\",\n    \"A\": \"NPK @ 120:60:40 kg per hectare using FYM and NPK.\"\n  },\n  {\n    \"Q\": \"What are the recommended herbicides for weed control in maize?\",\n    \"A\": \"Pre-emergence herbicide Atrazine @ 1.5-2.0 kg a.i/ha for sole crops and Alachlor @ 1.5 kg/ha for mixed cropping systems.\"\n  },\n  {\n    \"Q\": \"How can cutworm and white grubs be controlled in maize?\",\n    \"A\": \"Chlorpyriphos @ 2.0 litre per ha mixed in 60-70 kg sandy soil may be used for soil amendment before sowing or Cypermethrin 10EC @ 1ml per litre may be used for foliar application.\"\n  },\n  {\n    \"Q\": \"What are the recommended insecticides for managing the fall army worm pest in maize?\",\n    \"A\": \"Flubendamide (Feme) or Emamectin Benzoate or Chlorantraniliprol @ 0.5 ml/L.\"\n  },\n  {\n    \"Q\": \"When should insecticides be applied to control the fall army worm pest in maize?\",\n    \"A\": \"As and when infestation of the pest is observed in the entire field, and if the leaves are damaged or insect faeces are seen.\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"What is the recommended time for nursery sowing of rice?\",\n  \"A1\": \"Nursery sowing of rice may be completed from 20th May to first week of June.\",\n  \n  \"Q2\": \"What are the recommended varieties of rice for timely sown rice?\",\n  \"A2\": \"High yielding varieties HPR 1068, HPR 2143, RP 2421, HPR 2720, HPR 2880, and university recommended/tested rice hybrids like Arize 6129, Arize Swift, Arize Swift Gold, BS 10008 etc.\",\n  \n  \"Q3\": \"What is the recommended fertilizer dose for transplanted rice crop?\",\n  \"A3\": \"NPK @ 90:40:40 with 50% N and entire dose of P & K at the time of transplanting and remaining N in two equal doses at 3 and 6 weeks after transplanting.\",\n  \n  \"Q4\": \"How can zinc deficiency be managed in rice crop?\",\n  \"A4\": \"Apply 60 kg of zinc sulphate heptahydrate (21%) or 40 kg zinc sulphate monohydrate (33%) per hectare at puddling.\",\n  \n  \"Q5\": \"What is the recommended herbicide for weed management in transplanted rice?\",\n  \"A5\": \"Butachlor 5 G @ 30 kg/ha or broadcast Butachlor 50EC @ 3L after mixing within 72 hrs of transplanting, or post emergence herbicide Bispyribac sodium @ 250 ml/ ha can also be sprayed at 20-25 days after transplanting.\",\n  \n  \"Q6\": \"What are the recommended varieties of direct seeded rice?\",\n  \"A6\": \"High yielding varieties HPR 1156 (Sukara Dhan), HPR 2656, and HPR 2795.\",\n  \n  \"Q7\": \"When should the first irrigation be applied in direct seeded rice?\",\n  \"A7\": \"Apply first irrigation at 25 days after sowing and schedule succeeding irrigations as per monsoon rains.\",\n  \n  \"Q8\": \"How can stem borer be managed in rice crop?\",\n  \"A8\": \"Apply Carbofuran granules (Furadan 3G) @ 33 kg/ ha in standing water after 10 days of transplanting.\",\n  \n  \"Q9\": \"What are the recommended varieties of black gram?\",\n  \"A9\": \"High yielding varieties UG 218, Him Mash 1, and PB 114 in low and mid hills, and Palampur 93 in high hills (>1500 m amsl).\",\n  \n  \"Q10\": \"What is the recommended herbicide for weed control in kidney bean?\",\n  \"A10\": \"Pre emergence herbicide Pendimethalin @ 1.5 kg /ha.\"\n}\n```",
    "```json\n[\n  {\n    \"Q\": \"What are the recommended varieties for yielding soya?\",\n    \"A\": \"Palam Soya, Harit Soya or Palam Hara Soya 1\"\n  },\n  {\n    \"Q\": \"When should earthing up and staking in summer tomato be completed?\",\n    \"A\": \"By end April\"\n  },\n  {\n    \"Q\": \"How can early blight, buckey-rot and fruit rot diseases be managed in tomato?\",\n    \"A\": \"Apply copper oxychloride @ 3g/ L, ridomil MZ @ 2.5 g/L and Mancozeb 45 @ 2.5 g or Moximate @ 2.5g/ L respectively as and when symptoms appear\"\n  },\n  {\n    \"Q\": \"What is the recommended method for managing bacterial wilt in tomato?\",\n    \"A\": \"Follow crop rotation and plant resistant varieties, and treat seedlings with a solution of 2 gm streptocycline and 30 gm blitox per 10 liters of water before transplanting\"\n  },\n  {\n    \"Q\": \"How can fruit borer be managed in tomato?\",\n    \"A\": \"Apply Flubendamide (Feme) or Indoxacarb @0.5 ml /L of water\"\n  },\n  {\n    \"Q\": \"What is the recommended fertilizer dose for transplanting capsicum?\",\n    \"A\": \"NPK @ 100:75:55 before sowing with Nitrogen in 3 splits (30, 60 90DAT)\"\n  },\n  {\n    \"Q\": \"How can powdery mildew and fruit rot diseases be managed in capsicum?\",\n    \"A\": \"Use Hexaconazole or cantaf @ 0.5 ml/ L and Mancozeb 45 or Ridomil MZ @ 2.5 g/ L as and when symptoms appear\"\n  },\n  {\n    \"Q\": \"What is the recommended method for managing fruit fly in cucurbits?\",\n    \"A\": \"Install Palam Fruit Fly traps @ 25 traps per ha in May and use Malathion 30 ml + Gur 150 g per 15 L water at 15 days interval\"\n  },\n  {\n    \"Q\": \"How can fungal diseases be managed in cucurbits?\",\n    \"A\": \"Use bavistin 1g + Mancozeb 45 2g per litre of water\"\n  },\n  {\n    \"Q\": \"What is the recommended fertilizer dose for transplanting cole crops?\",\n    \"A\": \"NPK @ 125:75:70 at the time of sowing with Nitrogen in 3 splits (30, 60 90DAT)\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the recommended fertilizer dose for Luxmi crop at the time of sowing?\",\n    \"A\": \"NPK @ 25:65:65\"\n  },\n  {\n    \"Q\": \"How can weed management be achieved in Luxmi crop?\",\n    \"A\": \"Use preemergence herbicide Pendimethalin @ 1.5 kg/ha\"\n  },\n  {\n    \"Q\": \"What is the recommended treatment for Anthracnose and angular leaf spot diseases in Luxmi crop?\",\n    \"A\": \"Apply bavisitn @ 1g/L as and when symptoms appear in end May\"\n  },\n  {\n    \"Q\": \"What is the recommended fertilizer dose for ginger crop?\",\n    \"A\": \"NPK @ 100:50:50 before sowing, nitrogen in 3 splits (30,60,90 DAS)\"\n  },\n  {\n    \"Q\": \"How can powdery mildew be controlled in apple crop?\",\n    \"A\": \"Spray Hexaconazole @ 0.5 ml per litre of water at petal fall stage\"\n  },\n  {\n    \"Q\": \"What is the recommended treatment for scab disease in apple crop?\",\n    \"A\": \"Spray Difenoconazole @ 40 ml per 200 litres of water\"\n  },\n  {\n    \"Q\": \"How can fruit drop be controlled in mango crop?\",\n    \"A\": \"Spray Planofix @ 20 ml per 100 litres of water at pea stage of fruits\"\n  },\n  {\n    \"Q\": \"What is the recommended treatment for die back of branches in guava crop?\",\n    \"A\": \"Spray Zinc sulphate 2 Kg + Lime 1 Kg in 200 litres of water\"\n  },\n  {\n    \"Q\": \"How can fruit fly be controlled in guava crop?\",\n    \"A\": \"Spray Melathion 2 ml + 10 gm Jaggery per litre of water during last week of June\"\n  },\n  {\n    \"Q\": \"What is the recommended treatment for gummosis, canker and die back problem in citrus crop?\",\n    \"A\": \"Spray Blitox @ 600 gm per 200 litres of water during June-July\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"What is unique about the anatomy of millet crops?\",\n  \"A1\": \"Millet crops have a characteristic Kranz anatomy with C4 pathway that is photosynthetically efficient in utilizing light, water, and CO2.\",\n  \n  \"Q2\": \"What are the advantages of millet crops in terms of growth cycle and stress tolerance?\",\n  \"A2\": \"Millet crops have a short life cycle, short stature, smaller leaf area, and deeper root systems, making them hardy to stress conditions and able to escape unpredictable late summer droughts.\",\n  \n  \"Q3\": \"How do millet crops tolerate drought stress?\",\n  \"A3\": \"Millet crops express a set of unique dehydration pathways that can survive under severe drought stress, typically specific to seed desiccation, and have enzymes such as carbonic anhydrase, malate dehydrogenase, and pyruvate orthophosphate dikinase that contribute to their drought tolerance.\",\n  \n  \"Q4\": \"What is the significance of the C4 pathway in millet crops?\",\n  \"A4\": \"The C4 pathway in millet crops is photosynthetically efficient, resulting in higher biomass and yield, and allows them to operate all C4 subtype pathways, making them powerful model systems for dissecting C4 photosynthesis.\",\n  \n  \"Q5\": \"How do millet crops respond to abiotic stress conditions?\",\n  \"A5\": \"Millet crops have morpho-physiological and molecular traits such as earliness, small leaf area, waxy leaves, and better leaf venation that contribute to their abiotic stress tolerance, including drought, temperature, and water stress.\",\n  \n  \"Q6\": \"What are the key enzymes involved in the C4 pathway of millet crops?\",\n  \"A6\": \"The key enzymes involved in the C4 pathway of millet crops include carbonic anhydrase, malate dehydrogenase, malic enzyme, phosphoenolpyruvate carboxylase, phosphoenolpyruvate carboxylase kinase, and pyruvate orthophosphate dikinase.\",\n  \n  \"Q7\": \"How do millet crops use water efficiently?\",\n  \"A7\": \"Millet crops have a high water use efficiency due to their C4 cycle and Kranz anatomy, which allows them to operate efficiently under warm temperatures and drought conditions.\",\n  \n  \"Q8\": \"What are the benefits of the short growing season of millet crops?\",\n  \"A8\": \"The short growing season of millet crops enables them to escape unpredictable late summer droughts and serve as a rescue crop if another grain crop fails.\",\n  \n  \"Q9\": \"What are the functional genes expressed in millet crops under abiotic stress conditions?\",\n  \"A9\": \"Millet crops express functional genes such as LEA, ARDP, DREB, NAC transcription factor, and others that contribute to their abiotic stress tolerance.\",\n  \n  \"Q10\": \"Why are millet crops considered a model system for studying C4 photosynthesis?\",\n  \"A10\": \"Millet crops are considered a model system for studying C4 photosynthesis due to their characteristic Kranz anatomy, C4 pathway, and ability to operate all C4 subtype pathways, making them an ideal system for dissecting the mechanisms of C4 photosynthesis.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"When should Cypermethrin 10 EC be sprayed for Anar butterfly control?\",\n  \"A1\": \"During the first week of May\",\n  \n  \"Q2\": \"What is the recommended dosage of Quinalphos for pest control?\",\n  \"A2\": \"200 ml per 100 litres of water, applied 15-20 days after the first spray\",\n  \n  \"Q3\": \"How can micronutrient deficiency be controlled in pomegranate cultivation?\",\n  \"A3\": \"By spraying Multiplex @ 250 gm in 200 litres of water during May\",\n  \n  \"Q4\": \"What are the recommended varieties of parmal rice for Punjab?\",\n  \"A4\": \"PR 131, PR 130, PR 113, PR 114, PR 121, PR 122, PR 123, PR 124, PR 126, PR 127, PR 129, HKR 47\",\n  \n  \"Q5\": \"Why should long duration varieties of rice be avoided?\",\n  \"A5\": \"They consume 15-20% more water and are susceptible to most prevalent pathotypes of bacterial blight, requiring extra sprays of pesticides\",\n  \n  \"Q6\": \"What is the recommended schedule for timely sowing and transplanting of nursery in rice cultivation?\",\n  \"A6\": \"Sowing: 20 May-5 June, Transplanting: 20 June-5 July\",\n  \n  \"Q7\": \"How can soil health and rice yield be improved?\",\n  \"A7\": \"By continuous incorporation/retention of rice straw and applying fertilizers as per soil test\",\n  \n  \"Q8\": \"What are the benefits of adopting Direct Seeded Rice (DSR) technique?\",\n  \"A8\": \"10-20% saving in irrigation water, 10-12% higher ground water recharge, saves labor, less prone to diseases, and 100 kg/acre higher yield of succeeding wheat\",\n  \n  \"Q9\": \"When should zinc sulphate be applied to control zinc deficiency in rice?\",\n  \"A9\": \"At puddling, if previous crop showed symptoms of zinc deficiency, or as soon as possible if deficiency is noticed in the growing crop\",\n  \n  \"Q10\": \"What is the recommended dosage of zinc sulphate for controlling zinc deficiency in rice?\",\n  \"A10\": \"60 kg of zinc sulphate heptahydrate (21%) or 40 kg zinc sulphate monohydrate (33%) per hectare\"\n}\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the suitable time for sowing rice in light textured soils?\",\n    \"A\": \"The first fortnight of June\"\n  },\n  {\n    \"Q\": \"What are the suitable varieties of rice for sowing in light textured soils?\",\n    \"A\": \"PR 126, PR 114, PR 121, PR 122, PR 127\"\n  },\n  {\n    \"Q\": \"How should the field be prepared before sowing rice?\",\n    \"A\": \"Divide the field into kiyaras (plot) of desirable size after laser land levelling, apply pre-sowing irrigation, and prepare the field when it comes to tar-wattar (good soil moisture) condition\"\n  },\n  {\n    \"Q\": \"What is the recommended depth for placing rice seeds?\",\n    \"A\": \"2-3 cm\"\n  },\n  {\n    \"Q\": \"How should rice seeds be treated before sowing?\",\n    \"A\": \"Treat rice seeds with 3 g Sprint 75 WS (mencozeb + carbendazim) by dissolving in 10-12 ml water per kg seed\"\n  },\n  {\n    \"Q\": \"What is the recommended method for controlling weeds in rice fields?\",\n    \"A\": \"Spray 2.5 litre per hectare pendimethalin 30 EC in 500 litres of water in moist soil within two days of sowing\"\n  },\n  {\n    \"Q\": \"How should nitrogen fertilizer be applied to rice fields?\",\n    \"A\": \"Apply 130 kg urea/acre in three equal splits at 4, 6, and 9 weeks after sowing\"\n  },\n  {\n    \"Q\": \"What is the recommended time for applying the first irrigation to rice fields?\",\n    \"A\": \"21 days after sowing\"\n  },\n  {\n    \"Q\": \"How should iron deficiency (chlorosis) in rice fields be addressed?\",\n    \"A\": \"Apply 2 or 3 sprays of one per cent ferrous sulphate solution at weekly intervals (2.5 kg of ferrous sulphate in 250 litres of water per hectare)\"\n  },\n  {\n    \"Q\": \"What are the suitable varieties of Basmati rice for Direct Seeded Rice (DSR)?\",\n    \"A\": \"Pusa Basmati 1121, Pusa Basmati 1509, Punjab Basmati 7, and Pusa Basmati 1718\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"What is the recommended method for treating seeds to prevent foot rot?\",\n  \"A1\": \"Smear the seeds with talc formulation of Trichoderma harzianum @ 15 g per kg of seed immediately before sowing\",\n  \n  \"Q2\": \"When are seedlings of Basmati varieties ready for transplanting?\",\n  \"A2\": \"When they attain 5 to 6 leaf stage or are 25-30 days old\",\n  \n  \"Q3\": \"What is the recommended spacing for transplanting Basmati seedlings?\",\n  \"A3\": \"20 x 15 cm (33 hills/sq. metre), but can be reduced to 15x15 cm (44 hills/sq. metre) for late transplanted crop\",\n  \n  \"Q4\": \"Is green manure recommended before planting Basmati?\",\n  \"A4\": \"Yes, practice green manure before Basmati, and do not apply urea if the field has been green manured with 45-55 days old sunnhemp/dhaincha or summer moong straw\",\n  \n  \"Q5\": \"How should fertilizers be applied for Basmati?\",\n  \"A5\": \"Apply fertilizers on soil test and crop rotation basis, and skip phosphorus application if the recommended dose of phosphorus has been applied to the preceding wheat crop\",\n  \n  \"Q6\": \"What is the recommended dose of urea for different Basmati varieties?\",\n  \"A6\": \"45 kg/ha urea for CSR 30, Basamti 386 and Basmati 370, 90 kg/ha urea for varieties like Punjab Basmati 5, 4, 3 & 2 and Pusa Basmati 1121, 1637 & 1718, and 135kg/ha for Pusa Basmati 1509\",\n  \n  \"Q7\": \"How can lodging be checked in Basmati 386 and Basmati 370?\",\n  \"A7\": \"By lopping of the upper half of crop canopy after 45 days of transplanting, which also reduces stem borer damage\",\n  \n  \"Q8\": \"What is the recommended method for controlling stem borers and leaf folder in Basmati?\",\n  \"A8\": \"Use 50 g per acre Takumi 20 WG (flubendiamide) for control of stem borers and leaf folder\",\n  \n  \"Q9\": \"What are the recommended Bt cotton varieties for higher yield?\",\n  \"A9\": \"PAU Bt 3, PAU Bt 2, PAU Bt 1 and other Bt hybrids recommended by PAU, Ludhiana\",\n  \n  \"Q10\": \"What is the recommended method for reducing the adverse effect of salinity in cotton?\",\n  \"A10\": \"Apply rice-residue biochar 40 q/ha to reduce the adverse effect of salinity and increase yield\"\n}\n```",
    "[\n  {\n    \"Q\": \"When should cotton sowing start and be completed?\",\n    \"A\": \"Cotton sowing should start from early April and be completed by mid of May.\"\n  },\n  {\n    \"Q\": \"What is the recommended basal dose for higher yield in cotton?\",\n    \"A\": \"Apply 25 kg magnesium sulphate as basal dose at the time of sowing.\"\n  },\n  {\n    \"Q\": \"How should cotton seeds be treated for good crop establishment and early growth?\",\n    \"A\": \"Soak the cotton seed in a solution of 0.5 g succinic acid in 5 litres of water for 2-4 hours for acid delinted seed or 6-8 hours for non-delinted seed.\"\n  },\n  {\n    \"Q\": \"What is the recommended method for sowing cotton seeds?\",\n    \"A\": \"Sow the seeds with cotton sowing drill or cotton planter with line to line spacing of 67.5 cm.\"\n  },\n  {\n    \"Q\": \"What is the recommended plant to plant distance for different cotton varieties?\",\n    \"A\": \"Maintain plant to plant distance of 45 cm for variety PAU Bt 1 and desi cotton varieties, 60 cm for all other varieties, 75 cm for Bt and non Bt hybrids and 15 cm for variety F 2383.\"\n  },\n  {\n    \"Q\": \"How can inter row spacing of cotton be utilized?\",\n    \"A\": \"Grow one row of maize or cowpea in between two rows of cotton and take one harvest of maize/cowpea fodder at 45-55 days after sowing.\"\n  },\n  {\n    \"Q\": \"What is the recommended method for controlling weeds in cotton?\",\n    \"A\": \"Give need based 2-3 hoeing with tractor mounted cultivator/ tractor operated rotary weeder/triphali or wheel hand hoe, but avoid their use after fruiting.\"\n  },\n  {\n    \"Q\": \"What is the recommended fertilizer application for cotton?\",\n    \"A\": \"Apply urea, DAP or SSP, muriate of potash, and zinc sulphate heptahydrate as per the recommended doses for different cotton varieties.\"\n  },\n  {\n    \"Q\": \"When should the first irrigation be given to cotton?\",\n    \"A\": \"Give the first irrigation at 4 to 6 weeks after sowing and subsequently at two- or three-weeks interval depending upon soil type and weather conditions.\"\n  },\n  {\n    \"Q\": \"What is the recommended irrigation method for higher yield and water saving in cotton?\",\n    \"A\": \"Adopt drip irrigation for higher yield and water saving.\"\n  }\n]",
    "```json\n[\n  {\n    \"Q\": \"What is the recommended time for sowing maize?\",\n    \"A\": \"The recommended time for sowing maize is between the last week of May to the end of June.\"\n  },\n  {\n    \"Q\": \"What is the optimal plant population for maize?\",\n    \"A\": \"The optimal plant population for maize is 83333 plants/ha, achieved by sowing at a spacing of 60 × 20 cm.\"\n  },\n  {\n    \"Q\": \"How can maize be sown to avoid lodging and economize water use?\",\n    \"A\": \"Maize can be sown in trenches from end-May to mid-June to avoid lodging and economize water use during dry and hot weather conditions.\"\n  },\n  {\n    \"Q\": \"What is the recommended method for weed management in maize?\",\n    \"A\": \"Weed management in maize can be done through two hoeing at 15-30 days after sowing, or by spraying atrazine or tembotrione within ten days of sowing.\"\n  },\n  {\n    \"Q\": \"How can green manuring or farm yard manure be used to improve soil health and maize yield?\",\n    \"A\": \"Practising green manuring or applying farm yard manure (FYM) or compost before maize planting can improve soil health and increase maize yield.\"\n  },\n  {\n    \"Q\": \"What is the recommended dose of urea, DAP, and other fertilizers for maize?\",\n    \"A\": \"The recommended dose is 275 kg urea and 137.5 kg DAP, with additional recommendations for phosphorus, potassium, zinc, and nitrogen as basal dose.\"\n  },\n  {\n    \"Q\": \"Can farm yard manure be substituted with paddy straw compost?\",\n    \"A\": \"Yes, farm yard manure can be substituted with paddy straw compost 4.5 q/ha along with the recommended dose of fertilizers.\"\n  },\n  {\n    \"Q\": \"What is the purpose of inoculating maize seeds with consortium bio-fertilizer?\",\n    \"A\": \"Inoculating maize seeds with 1.25 kg consortium bio-fertilizer with 2.5 litres of water can improve maize yield and soil health.\"\n  },\n  {\n    \"Q\": \"How can maize be protected from pests and diseases?\",\n    \"A\": \"Maize can be protected from pests and diseases by using integrated pest management strategies, including the use of pesticides and biological control methods.\"\n  },\n  {\n    \"Q\": \"What is the recommended seed rate for maize varieties?\",\n    \"A\": \"The recommended seed rate for maize varieties is 20 kg/ha, except for Pearl Popcorn which is 17.5 kg/ha.\"\n  }\n]\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"What is the recommended dose of MoP for maize varieties PMH 1, PMH 11, JC 12, Prabhat, and Punjab Sweet Corn 1?\",\n    \"A\": \"50 kg MoP/ha\"\n  },\n  {\n    \"Q\": \"When should potassium be applied to maize crops?\",\n    \"A\": \"Only if the soils are deficit in potash\"\n  },\n  {\n    \"Q\": \"What is the recommended dose of urea, DAP, and MoP for maize varieties PMH 2, Kesri, and Pear Popcorn?\",\n    \"A\": \"187.5 kg urea, 67.5 kg DAP, and 37.5 kg MoP/ha\"\n  },\n  {\n    \"Q\": \"How should nitrogen be applied to maize crops?\",\n    \"A\": \"One-third at the time of sowing, one-third at the knee-high stage, and the remaining one-third at the pre-tasselling stage\"\n  },\n  {\n    \"Q\": \"What is the purpose of using the PAU-Leaf Colour Chart (PAU-LCC) in maize cultivation?\",\n    \"A\": \"For need-based nitrogen application\"\n  },\n  {\n    \"Q\": \"How can zinc deficiency be addressed in maize crops?\",\n    \"A\": \"By applying 25 kg of zinc sulphate heptahydrate (21%) or 16.25 kg zinc sulphate monohydrate (33%) per ha at sowing\"\n  },\n  {\n    \"Q\": \"What are the critical stages for irrigation in maize cultivation?\",\n    \"A\": \"Pre-tasselling, silking, and grain filling\"\n  },\n  {\n    \"Q\": \"How can fall armyworm be controlled in maize crops?\",\n    \"A\": \"By spraying Coragen 18.5 SC, Delegate 11.7 SC, or Missile 5 SG, and regularly monitoring the field to collect and destroy egg masses\"\n  },\n  {\n    \"Q\": \"What is the recommended dose of nitrogen for spring sowing of sugarcane?\",\n    \"A\": \"225 kg/ha\"\n  },\n  {\n    \"Q\": \"What is the recommended seed rate for sugarcane varieties Co 118 and CoJ 85?\",\n    \"A\": \"10% higher than the standard seed rate due to thick canes\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the recommended nitrogen application for planted and ratoon sugarcane crops?\",\n    \"A\": \"225 kg N/ha for planted crop and 225 kg N/ha for ratoon crop\"\n  },\n  {\n    \"Q\": \"When should phosphorus be applied to sugarcane crops?\",\n    \"A\": \"Apply 30 kg phosphorus/ha if the soils are low in phosphorus, at the time of first cultivation in February\"\n  },\n  {\n    \"Q\": \"What is the recommended method for intercropping in autumn sugarcane?\",\n    \"A\": \"Intercropping of broccoli/cauliflower is recommended in autumn\"\n  },\n  {\n    \"Q\": \"How can iron deficiency in sugarcane be addressed?\",\n    \"A\": \"Apply copious amount of water and spray the crop 2 or 3 times with 1% solution of ferrous sulphate at weekly intervals\"\n  },\n  {\n    \"Q\": \"What is the recommended method for weed control in spring planted sugarcane?\",\n    \"A\": \"Pre-emergence application of 1000 g per acre Authority NXT (sulfentrazone+clomazone) is recommended\"\n  },\n  {\n    \"Q\": \"What is the critical period for sugarcane growth and how often should irrigation be applied?\",\n    \"A\": \"Hot and dry period of April to June is critical, apply irrigation at 7 to 12 days interval\"\n  },\n  {\n    \"Q\": \"How can lodging of sugarcane be prevented?\",\n    \"A\": \"Do earthing up in flat-planted as well as the trench-planted crop at the end of June and propping by using the trash in August or September\"\n  },\n  {\n    \"Q\": \"What are some recommended tomato varieties and when should they be transplanted?\",\n    \"A\": \"Arka Rakshak, Pant T-3, Himsona, Naveen 2000, Naveen 2000+, Abhinav, Samrat, Rakshita Gold, transplanting time is April to June (Hills) and June-July (Plains)\"\n  },\n  {\n    \"Q\": \"What are some recommended brinjal varieties and when should they be transplanted?\",\n    \"A\": \"Shaymali, Pant Samrat, Pant Rituraj, Pusa purple long, Pusa Anmol, Pusakranti, Chaya, PPL 74, transplanting time is April to June (Hills) and June-July (Plains)\"\n  },\n  {\n    \"Q\": \"What are some recommended capsicum varieties for Uttarakhad and when should they be transplanted?\",\n    \"A\": \"California wonder, Arka Gaurav, Arkamohini, Indra, Swarna, Ashwarya, Asha, Indum Bharat, transplanting time is April to June (Hills) and June-July (Plains)\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the recommended treatment for seeds and seedlings before sowing and transplanting in the main field?\",\n    \"A\": \"Treat seeds and seedlings with recommended fungicides before sowing and transplanting in the main field.\"\n  },\n  {\n    \"Q\": \"What is the expected outbreak in hilly areas and high mountain ranges in vegetable crops like Pea and Beans?\",\n    \"A\": \"Powdery mildew is expected to outbreak in hilly areas and high mountain ranges in vegetable crops like Pea and Beans, reaching its maximum intensity at the time of pod formation.\"\n  },\n  {\n    \"Q\": \"What is the recommended solution to prevent infestation and crop damage due to cabbage butterfly (Pieris brassicae) on cabbage?\",\n    \"A\": \"Spray 5% solution of Neem seed and Batein/ Dainkan solution @ 5% and 10% solution, respectively on cabbage to prevent infestation and crop damage due to cabbage butterfly (Pieris brassicae).\"\n  },\n  {\n    \"Q\": \"What is the recommended management practice for vegetable nursery (of tomato, capsicum, and brinjal) against wetting disease?\",\n    \"A\": \"Spray and thoroughly saturate the soil with 75 WS Thiaram or 50 WP Caftan @ 2 gm per liter to prevent in nursery vegetables.\"\n  },\n  {\n    \"Q\": \"What is the recommended time for harvesting wheat crop in Jammu region?\",\n    \"A\": \"Harvest the wheat crop by maintaining purity of seeds while threshing, cleaning, and storing to keep seed for next year.\"\n  },\n  {\n    \"Q\": \"What are the recommended varieties of paddy for the elevation zone of Jammu (up to 800 m)?\",\n    \"A\": \"Recommended varieties are IET 1410, China-1039, K-39, Ratna, PC-19, Jaya, RR-8585 (Ajay) Basmati 370, Ranbir Basmati, Saanwal Basmati, and hybrids KRH-2 and PHB-71.\"\n  },\n  {\n    \"Q\": \"What is the optimum time for nursery raising of paddy varieties such as Ratna and SJR-5?\",\n    \"A\": \"The optimum time for nursery raising of paddy varieties such as Ratna and SJR-5 is 2nd to 3rd week of May.\"\n  },\n  {\n    \"Q\": \"What is the recommended seed rate for coarse varieties of paddy?\",\n    \"A\": \"Use 40-45 kg/ha seed for coarse varieties.\"\n  },\n  {\n    \"Q\": \"What is the recommended fertilizer application for maize in intermediate and temperate zones?\",\n    \"A\": \"Apply Urea, DAP, MOP, and ZnSO4 @ 38, 35, 13, and 10 kg/acre, respectively.\"\n  },\n  {\n    \"Q\": \"What is the recommended weed control measure for paddy?\",\n    \"A\": \"Apply Butachlor granules 5 G @ 12 kg/acre in standing water within 2-3 DAT for effective weed control.\"\n  }\n]\n```",
    "[\n  {\n    \"Q\": \"What is the recommended treatment for maize seeds to control smuts, blights, and seed/seedlings rots?\",\n    \"A\": \"Treat seed with Thiram/Captan 0.3% (3g/kg of seed) or carbendazim @ 2g/kg of seed\"\n  },\n  {\n    \"Q\": \"What is the recommended seed rate and spacing for sowing Bhindi (Okra) varieties in sub-tropical zone?\",\n    \"A\": \"Seed rate of 12-15 kg/ha and spacing of 60x30 cm\"\n  },\n  {\n    \"Q\": \"How can cracking problem in litchi, citrus, and grape fruits be controlled in Jammu district?\",\n    \"A\": \"Frequent irrigations, spraying of zinc sulphate (1.5%) at weekly intervals or spraying of GA3 @ 40 ppm\"\n  },\n  {\n    \"Q\": \"What is the recommended shading for runner production in strawberry for different cultivars?\",\n    \"A\": \"50% shade for Chandler, Gorella, and Oso Grand cultivars, and 75% shading for Belrubi cultivars\"\n  },\n  {\n    \"Q\": \"What is the recommended fertilizer application for sowing Bhindi (Okra) varieties?\",\n    \"A\": \"10 t/acre FYM, N @ 24 kg (48 kg urea), P2O5 @ 12 kg (26.4 kg DAP), and K2O @ 12 kg (20.4 kg MOP) for one acre\"\n  },\n  {\n    \"Q\": \"How can leaf spot/blight and downy mildew of cucurbits be controlled?\",\n    \"A\": \"Spray mancozeb 0.2% or copper oxychloride @ 0.3%\"\n  },\n  {\n    \"Q\": \"What is the recommended management practice for fruit borer in brinjal, tomato, and bhindi crop?\",\n    \"A\": \"Spray endosulfan (0.07%) or carbaryl (0.1%) or Dichlorvos (76EC) (0.03%)\"\n  },\n  {\n    \"Q\": \"What is the recommended practice for controlling fruitfly infestation in cucurbits?\",\n    \"A\": \"Spray bait mixture (Malathion 1 ml + 10g sugar in one litre of water) @ 500l/ha\"\n  },\n  {\n    \"Q\": \"Why is it important to regularly rogue out virus/mycoplasma infected plants?\",\n    \"A\": \"To prevent the spread of disease and reduce yield loss\"\n  },\n  {\n    \"Q\": \"What is the recommended management practice for downy mildew of cucumber?\",\n    \"A\": \"Spraying of metalaxyl 8%+\"\n  }\n]",
    "```json\n[\n  {\n    \"Q\": \"What is the recommended dosage of mancozeb for managing early blight of tomato?\",\n    \"A\": \"Mancozeb 64% @ 0.25% (2.5 gram/litre of water)\"\n  },\n  {\n    \"Q\": \"What are the recommended varieties of Jowar for sowing in July?\",\n    \"A\": \"Ujjain, Swarna-413, Type 4, and MP Char\"\n  },\n  {\n    \"Q\": \"What is the recommended basal dose of fertilizers for Jowar?\",\n    \"A\": \"20 kg urea and 34 kg DAP/acre, in addition to 3-6 tonnes/acre of well-rotten FYM\"\n  },\n  {\n    \"Q\": \"How can downy mildew, grain smut, and ergot be controlled in Jowar?\",\n    \"A\": \"By spraying mancozeb (0.25%) or copper oxychloride (0.3%) at advance boot stage, repeated at 5-7 day intervals if necessary\"\n  },\n  {\n    \"Q\": \"What is the recommended time for sowing Berseem?\",\n    \"A\": \"Mid-September to end of October\"\n  },\n  {\n    \"Q\": \"What is the recommended seed rate for sowing Berseem?\",\n    \"A\": \"10-12 kg seed per acre, mixed with 500g of mustard seed\"\n  },\n  {\n    \"Q\": \"What is the recommended time for sowing marigold nursery?\",\n    \"A\": \"July\"\n  },\n  {\n    \"Q\": \"What is the recommended substrate for growing Calocybe indica (milky mushroom)?\",\n    \"A\": \"Forest or agro-industrial by-products rich in cellulose, lignin, and hemicellulose, such as paddy, wheat, or maize straw\"\n  },\n  {\n    \"Q\": \"What is the recommended ratio of soil, sand, and FYM for the casing mixture of Calocybe indica?\",\n    \"A\": \"Soil + sand in the ratio of 3:1 or 2-3 years old FYM + Soil + sand in the ratio of 3:2:1\"\n  },\n  {\n    \"Q\": \"What is the recommended time for starting compost preparation for mushroom cultivation?\",\n    \"A\": \"So that spawning for the first (early) crop can be done in the last week of September\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"What are some of the enzymes associated with photosynthetic efficiency in millet crops?\",\n  \"A1\": \"β-carbonic anhydrase, Glutathione reductase, Dehydroascorbate reductase\",\n  \"Q2\": \"What is the main difference between C4 and C3 plants in terms of chloroplast structure?\",\n  \"A2\": \"C4 plants have dimorphic chloroplasts with Kranz anatomy, while C3 plants have monomorphic chloroplasts without Kranz anatomy\",\n  \"Q3\": \"What are the two types of cells that contain chloroplasts in C4 plants?\",\n  \"A3\": \"Mesophyll and Bundle Sheath cells\",\n  \"Q4\": \"What is the CO2 compensation point for C4 plants?\",\n  \"A4\": \"0-10 ppm\",\n  \"Q5\": \"What is the temperature optimum for photosynthesis and growth in C4 plants?\",\n  \"A5\": \"30-45°C\",\n  \"Q6\": \"How does the Kranz anatomy in C4 plants increase photosynthetic efficiency?\",\n  \"A6\": \"It increases the concentration of CO2 in the bundle sheath, suppresses photo-respirative loss, and increases the carboxylase activity of RuBisCO\",\n  \"Q7\": \"What are some of the benefits of C4 photosynthesis over C3 photosynthesis?\",\n  \"A7\": \"Higher water use efficiency, higher nitrogen use efficiency, improved growth, higher biomass allocation and partitioning, and lower hydraulic conductivity per unit leaf area\",\n  \"Q8\": \"Why are millets considered a promising option for developing climate-resilient crop species?\",\n  \"A8\": \"Due to their stress tolerance potential and adaptability to climate change\",\n  \"Q9\": \"What is needed to fully harness the genetic potential of millet crops?\",\n  \"A9\": \"High-throughput phenotypic screening, conventional/molecular breeding/transgenic approaches, and technologies\",\n  \"Q10\": \"What is the potential of millets in terms of sustainable food and nutritional security?\",\n  \"A10\": \"Millets hold enormous potential for sustainable food and nutritional security due to their underlying physiological characteristics\"\n}\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the required nursery area for one-hectare land?\",\n    \"A\": \"One kanal (500 m2) is required for a nursery area\"\n  },\n  {\n    \"Q\": \"How should the nursery area be prepared?\",\n    \"A\": \"Plough the nursery area 2-3 times and puddle it in 2-3cm of water\"\n  },\n  {\n    \"Q\": \"What is the recommended width and length of nursery beds?\",\n    \"A\": \"The nursery beds should be 1.0-1.5 meters in width and of any convenient length\"\n  },\n  {\n    \"Q\": \"How should pre-germinated seeds be sown in the nursery?\",\n    \"A\": \"Broadcast pre-germinated seeds uniformly in seed bed and maintain 2-3cm of water till pre-germinated seeds are established in the bed\"\n  },\n  {\n    \"Q\": \"What is the recommended seed rate for transplanted rice in lower belts?\",\n    \"A\": \"3 kg per kanal\"\n  },\n  {\n    \"Q\": \"What is the recommended seed treatment for rice seeds?\",\n    \"A\": \"Pre-sowing treatment by overnight soaking of seeds in 0.06% suspension of Tricyclazole 75 WP or 0.1% Carbendazim 50WP\"\n  },\n  {\n    \"Q\": \"What is the recommended manure and fertilizer application for the nursery?\",\n    \"A\": \"Apply 1.5-2 kg well decomposed farmyard manure plus 0.5 kg of ash/m2 of nursery area and 275g Urea, 450g DAP and 200g MOP per marla (25 m2) of nursery as basal dose\"\n  },\n  {\n    \"Q\": \"When should transplanting be completed for rice seedlings?\",\n    \"A\": \"Between last week of May to 2nd week of June when the rice seedling is 28-30 days old\"\n  },\n  {\n    \"Q\": \"What are the recommended maize varieties for altitude below 1850 meters?\",\n    \"A\": \"Shalimar Maize Composite-4, Shalimar Maize Hybrid-2, Shalimar Maize Composite-7, VMH-45, Pusa Vivek QPM-9, LQMH-1, Vivek - 53, 57, 59, DMRH-1530 and DMRH-1305\"\n  },\n  {\n    \"Q\": \"What is the recommended sowing time for maize?\",\n    \"A\": \"Mid-April to mid-May\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the recommended basal dose of Urea for Hybrid and Composite varieties under rainfed conditions?\",\n    \"A\": \"3 kg per kanal and 2.4 kg per kanal, respectively\"\n  },\n  {\n    \"Q\": \"What is the recommended seed rate and spacing for Composites?\",\n    \"A\": \"1.5 kg per kanal with a spacing of 60x20 cm\"\n  },\n  {\n    \"Q\": \"What is the recommended pre-emergence herbicide and its application rate?\",\n    \"A\": \"Atrazine 50 WP @ 2 kg per hectare, 2-3 days after sowing\"\n  },\n  {\n    \"Q\": \"When should earthing up/hoeing be done in maize cultivation?\",\n    \"A\": \"At Knee high stage, i.e. 30 days after sowing\"\n  },\n  {\n    \"Q\": \"What is the recommended fungicide for Pea Size stage in apple orchards?\",\n    \"A\": \"Zineb 68% + Hexaconazole 4% 72 WP (100 g) or Avtar (72WP)\"\n  },\n  {\n    \"Q\": \"What is the recommended need-based insecticide for apple orchards?\",\n    \"A\": \"Chlorpyriphos 20EC (100ml) or Coroban (20EC)\"\n  },\n  {\n    \"Q\": \"What is the recommended need-based acaricide for Mites in apple orchards?\",\n    \"A\": \"Hexythiazox 5.45 EC (40 ml) or Maiden (5 EC)\"\n  },\n  {\n    \"Q\": \"When should the second dose of fertilizers be applied in apple orchards?\",\n    \"A\": \"During Fruit Development-I, 12-15 days after V Spray\"\n  },\n  {\n    \"Q\": \"What is the recommended cultural management practice during Fruit Development-I in apple orchards?\",\n    \"A\": \"Repeat foliar spray of calcium chloride (3 g/litre), irrigate orchards as per requirement, de-weeding and mowing in orchards and nursery\"\n  },\n  {\n    \"Q\": \"What is the recommended irrigation schedule for maize cultivation?\",\n    \"A\": \"Irrigate at critical stages of growth, i.e. Knee high, silking and grain filling\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the brand name of Mancozeb 75WP fungicide by Indofil Industries Ltd?\",\n    \"A\": \"Indofil M-45\"\n  },\n  {\n    \"Q\": \"What is the company name for the fungicide brand 'Dithane M-45'?\",\n    \"A\": \"Dow Agro Science Mumbai Ltd\"\n  },\n  {\n    \"Q\": \"What is the recommended dosage of Chlorpyriphos 20EC insecticide per 100 liters of water?\",\n    \"A\": \"100ml\"\n  },\n  {\n    \"Q\": \"What is the brand name of Hexythiazox 5.45 EC acaricide by Biostadt India Ltd?\",\n    \"A\": \"Maiden\"\n  },\n  {\n    \"Q\": \"When should transplanting of vegetable seedlings be done in open conditions in Ladakh?\",\n    \"A\": \"1st-2nd week of May\"\n  },\n  {\n    \"Q\": \"What is the purpose of using shade nets after transplanting seedlings?\",\n    \"A\": \"To give the transplants a better stand in the initial days\"\n  },\n  {\n    \"Q\": \"What is the recommended time for sowing potatoes in Ladakh?\",\n    \"A\": \"By the time of transplanting other vegetables\"\n  },\n  {\n    \"Q\": \"Why is mulching done in nurseries?\",\n    \"A\": \"To promote growth, conserve moisture, and avoid weeds\"\n  },\n  {\n    \"Q\": \"What is the importance of proper hardening of seedlings?\",\n    \"A\": \"To ensure healthy growth and development\"\n  },\n  {\n    \"Q\": \"What is the recommended action in case of heavy rains within 12 hours of spraying insecticides or acaricides?\",\n    \"A\": \"Repeat the spray as soon as the weather improves\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is essential to ensure before transplantation?\",\n    \"A\": \"Adequate quantity of organic matter in the form of compost or FYM must be added for better crop performance and soil health.\"\n  },\n  {\n    \"Q\": \"How can soil moisture be maintained for better fruit set and plant growth?\",\n    \"A\": \"Frequent irrigations with little water to keep the soil just moist, and avoiding flooding and ploughing.\"\n  },\n  {\n    \"Q\": \"What is the recommended spray for enhanced fruit set?\",\n    \"A\": \"Sprays of boron (@1g/l) may benefit for enhanced fruit set.\"\n  },\n  {\n    \"Q\": \"What are the important varieties of paddy for Tarai, Bhabhar, and Plain areas?\",\n    \"A\": \"Narendra 359, HKR 47, PR 113 & 114, Pant Dhan 10,12, 19, 24, 26 & 28, Pant Sugandha Dhan-15,17, 25 & 27, Pusa Basmati 1121, 2511 & 1509, Pant Bansmati 1 and 2.\"\n  },\n  {\n    \"Q\": \"When is the time of nursery sowing and transplanting for irrigated hills?\",\n    \"A\": \"Nursery sowing time is 2nd fortnight of May to 1st week of June and Transplanting Time is June end to 1st week of July.\"\n  },\n  {\n    \"Q\": \"What are the varieties of Jethi rice and Chetaki rice?\",\n    \"A\": \"VL Dhan 154 & VL Dhan 157 for Jethi rice, and VL Dhan 207, 208 & 209 for Chetaki rice.\"\n  },\n  {\n    \"Q\": \"How can organic pest management be done in paddy fields?\",\n    \"A\": \"Application of Trichoderma enriched FYM, seed treatment with Pseudomonas fluorescens, and spray of Azadirachtin 0.03% EC min. Neem oil based.\"\n  },\n  {\n    \"Q\": \"What is the recommended seed treatment for management of leaf and neck blast?\",\n    \"A\": \"Seed treatment with Pseudomonas fluorescens 1.5% LF@4.5 ml/kg seed.\"\n  },\n  {\n    \"Q\": \"How can bacterial leaf blight be managed in paddy fields?\",\n    \"A\": \"Seedling treatment with Pseudomonas fluorescens 1.5%LF @10 ml/liter of water dip seedlings for 30 minutes.\"\n  },\n  {\n    \"Q\": \"What is the recommended spray for management of leaf roller, stem borer, and brown plant hopper?\",\n    \"A\": \"Application of spray of Azadirachtin 0.03% EC min. Neem oil based @200 ml/ha, dissolved in 1000 liter of water.\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"What is the recommended dosage for managing stem borer and leaf folder in Paddy using 5 rustaki?\",\n  \"A1\": \"2.5% @1.5 kg in 500-750 liter of water\",\n  \n  \"Q2\": \"What is the recommended chemical for managing stem borer, BPH, green leaf hopper, rice gall midge, wheat maggot and white backed plant hopper in Paddy?\",\n  \"A2\": \"Fipronil 5% SC @1000-1500 ml/ha in 500 liter water\",\n  \n  \"Q3\": \"What are the recommended varieties of maize for Tarai, Bhabhar & Plain area?\",\n  \"A3\": \"Pant Sankul Makka 3, Sweta, Bajora Makka 1, Vivek Sankul 11\",\n  \n  \"Q4\": \"What is the recommended time for sowing maize?\",\n  \"A4\": \"Mid June to mid July\",\n  \n  \"Q5\": \"What is the recommended chemical for managing spodoptera litura and Maruca spp. in pulses?\",\n  \"A5\": \"Flubendiamide 20% WG @ 300 gm per ha in 500 liter water\",\n  \n  \"Q6\": \"What are the recommended varieties of black gram for Tarai, Babhar and lower hills?\",\n  \"A6\": \"Pant Urd 19, 31, 35, 40, Pant Urd 10, Pant Urd 7, Pant Urd 8 & Pant Urd 9\",\n  \n  \"Q7\": \"What is the recommended time for sowing black gram in plain areas?\",\n  \"A7\": \"3rd week of July to 1st week of August\",\n  \n  \"Q8\": \"What is the recommended chemical for managing pod borers in pulses?\",\n  \"A8\": \"Chlorantraniliprole 18.5% SC @ 100 ml/ha in 500 liter water\",\n  \n  \"Q9\": \"What are the recommended varieties of finger millet?\",\n  \"A9\": \"VL Mandua 376, VL Mandua 379, VL Mandua 380\",\n  \n  \"Q10\": \"Why should maize be avoided as a main and intercrop in kharif season?\",\n  \"A10\": \"It attracts fall armyworm and other feeding insects which may move to other crops and become polyphagous\"\n}\n```",
    "```json\n[\n  {\n    \"Q\": \"What are the recommended tomato varieties for Uttarakhad?\",\n    \"A\": \"Arka Rakshak, Pant Tomato-3, Himsona, Naveen 2000, Naveen 2000+, Abhinav, Samrat, Rakshita Gold\"\n  },\n  {\n    \"Q\": \"When is the recommended time for transplanting tomato saplings in hills and plains?\",\n    \"A\": \"April to June (Hills) and June-July (Plains)\"\n  },\n  {\n    \"Q\": \"What are the recommended brinjal varieties for Uttarakhad?\",\n    \"A\": \"Shaymali, Pant Samrat, Pant Rituraj, Pusa purple long, Pusa Anmol, Pusa Kranti, Pusa Anupam, Chaya, Pusa Sankar Brinjal-1, Pusa Hybrid 5, 6 and 9\"\n  },\n  {\n    \"Q\": \"What are the recommended capsicum varieties for Uttarakhad?\",\n    \"A\": \"California wonder, Arka Gaurav, Arka Mohini, Arka Vasant, Indra, Swarna, Ashwarya, Asha, Indum Bharat\"\n  },\n  {\n    \"Q\": \"What are the recommended cucumber varieties for Uttarakhand plains and hilly areas?\",\n    \"A\": \"Pointset strait, japanease long green, pant kheera 1 and pusa uday\"\n  },\n  {\n    \"Q\": \"How can powdery mildew in vegetable crops be prevented?\",\n    \"A\": \"Using 0.2% of sulfax or sulfur or 0.05% solution of Dinocap\"\n  },\n  {\n    \"Q\": \"How can root rot and damping off disease in vegetable nursery be managed?\",\n    \"A\": \"Spraying 75 WS Thiaram or 50 WP Captan @ 2 gm per liter\"\n  },\n  {\n    \"Q\": \"What is the recommended distance for planting tomato to control early and late blight disease?\",\n    \"A\": \"45 cm plant to plant and 90cm line to line distance\"\n  },\n  {\n    \"Q\": \"How can fruit borer infestation in tomato/brinjal be prevented?\",\n    \"A\": \"Spraying NPV, 250 LE/ha or Bacillus Thurangisis 0.75 kg/ha\"\n  },\n  {\n    \"Q\": \"What is the recommended supplementation of mineral mixture for adult dairy animals and small ruminants?\",\n    \"A\": \"50-60 g/day for adult dairy animals and 20-30 gm for small ruminants\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What can farmers do with their milk if they cannot dispose of it?\",\n    \"A\": \"They can process it into ghee, khoa, curd, or paneer to sell locally.\"\n  },\n  {\n    \"Q\": \"What is recommended for pig farmers to supplement their adult sows?\",\n    \"A\": \"Regular supplementation of mineral mixture @ 50-60g/day and calcium @ 60-80 ml/day/sow to maintain productivity.\"\n  },\n  {\n    \"Q\": \"How can farmers produce their own feed for piggery?\",\n    \"A\": \"By cooking maize/rice grain, seasonal vegetables, fruits, kitchen waste, etc.\"\n  },\n  {\n    \"Q\": \"What is recommended for poultry birds' feed?\",\n    \"A\": \"Green leaves along with grinded maize/rice.\"\n  },\n  {\n    \"Q\": \"How can poultry farmers prevent coccidiosis infestation?\",\n    \"A\": \"By changing the litter materials in poultry sheds regularly and administering anti-coccidial drugs if red diarrhea symptoms are noticed.\"\n  },\n  {\n    \"Q\": \"What is the recommended disinfectant for poultry houses?\",\n    \"A\": \"1% sodium hypochlorite.\"\n  },\n  {\n    \"Q\": \"How can farmers clean the floor of animal housing?\",\n    \"A\": \"With phenol @ 1 ml per liter of water and white washing of the feeding and watering trough.\"\n  },\n  {\n    \"Q\": \"What is the recommended footbath solution for animal sheds?\",\n    \"A\": \"Phenol mixed or KMNO4 (potassium permanganate) solution with water.\"\n  },\n  {\n    \"Q\": \"What vaccination is recommended for pregnant Ewe/Doe?\",\n    \"A\": \"Enterotoxaemia vaccination @ 2 ml s/c before one month of expected date of lambing/kidding.\"\n  },\n  {\n    \"Q\": \"What is the recommended feeding schedule for lambs/kids?\",\n    \"A\": \"300 ml milk for first seven days, 350 ml milk and creep mixture from 8th-30th day, 400 ml milk and 100-150 g creep feed from 31st-60th day, and 200 ml milk and 200-250 g creep feed beyond 60 days of age.\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"What should be done with the saw dust before using it as bedding material?\",\n  \"A1\": \"The saw dust should be dried completely before using it as bedding material.\",\n  \"Q2\": \"How often should the adult birds be allowed to move out in the open yards?\",\n  \"A2\": \"The adult birds should be allowed to move out in the open yards during daytime.\",\n  \"Q3\": \"What is the recommended vaccination schedule for chicks against Ranikhet disease?\",\n  \"A3\": \"Ensure vaccination of chicks against Ranikhet disease on 5th day.\",\n  \"Q4\": \"What is the recommended temperature for the shed during the first week of brooding?\",\n  \"A4\": \"Maintain proper shed temperature (35 0C) during the first week of brooding.\",\n  \"Q5\": \"How many hours of light should be provided for adult birds?\",\n  \"A5\": \"Provide a minimum light of 16 hours for adult birds.\",\n  \"Q6\": \"What is the recommended dose of piperazine hydrochloride for deworming birds?\",\n  \"A6\": \"Deworm the birds using piperazine hydrochloride @ 5ml per 10 birds.\",\n  \"Q7\": \"What is the recommended practice for handling raw or undercooked animal products?\",\n  \"A7\": \"The consumption of raw or undercooked animal products should be avoided, and raw meat, milk or animal organ should be handled with care to avoid cross contamination with uncooked food.\",\n  \"Q8\": \"What is the recommended disinfectant for the outer premises of poultry houses?\",\n  \"A8\": \"Disinfect the outer premises of poultry houses with 1% sodium hypochlorite.\",\n  \"Q9\": \"What is the recommended practice for grazing small ruminants in areas with limited resources?\",\n  \"A9\": \"Arrangements for stall feeding and supply of complete feed blocks should be ensured.\",\n  \"Q10\": \"What is the recommended practice for controlling fluke infection in Ladakh?\",\n  \"A10\": \"Proper drainage, sprinkling of copper sulphate near water bodies will help to control fluke infection.\"\n}\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the recommended ratio of concentrate mix to local grain for poultry feed?\",\n    \"A\": \"2:1\"\n  },\n  {\n    \"Q\": \"How can poultry farmers disinfect the outer premises of poultry houses?\",\n    \"A\": \"With 1% sodium hypochlorite\"\n  },\n  {\n    \"Q\": \"What is the objective of Agro-advisory for farmers?\",\n    \"A\": \"To promote best scientifically proven agricultural practices for enhancing farm production and income\"\n  },\n  {\n    \"Q\": \"Why is it important to collect soil samples for analysis?\",\n    \"A\": \"To plan scientific nutrient management for different crops and improve soil health\"\n  },\n  {\n    \"Q\": \"What is the benefit of using recommended dose of fertilizers as per soil testing report?\",\n    \"A\": \"Increased production and economic profit\"\n  },\n  {\n    \"Q\": \"What is the purpose of applying gypsum in fields?\",\n    \"A\": \"To maintain soil pH at optimum level and increase availability of plant nutrients\"\n  },\n  {\n    \"Q\": \"What is the benefit of summer deep ploughing after gypsum application?\",\n    \"A\": \"Mixing of gypsum in soil, ploughing down of crop residues, weeds, and unwanted plants\"\n  },\n  {\n    \"Q\": \"How does summer deep ploughing improve soil properties?\",\n    \"A\": \"Improves physical, chemical, and biological properties of the soil\"\n  },\n  {\n    \"Q\": \"What crops are to be sown in the kharif season in Rajasthan?\",\n    \"A\": \"Paddy, Cotton, Bajra, Green gram, Cowpea, Guar, Moth bean, sesame, and Groundnut\"\n  },\n  {\n    \"Q\": \"Why is Agro-advisory important for farmers during the kharif season?\",\n    \"A\": \"To guide farmers on timely agricultural activities and operations, increasing income and contributing to economic progress\"\n  }\n]\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```\n[\n  {\n    \"Q\": \"What is the benefit of summer deep ploughing in agriculture?\",\n    \"A\": \"Summer deep ploughing helps control harmful insects, their eggs, larvae, and pupae, as well as soil-borne disease pathogens.\"\n  },\n  {\n    \"Q\": \"What is Dhaincha green manuring and its benefits?\",\n    \"A\": \"Dhaincha green manuring is a low-cost practice to improve soil fertility in a short period, and it helps sustain soil fertility with low cost.\"\n  },\n  {\n    \"Q\": \"When can Dhaincha green manure crop be sown?\",\n    \"A\": \"Dhaincha green manure crop can be sown in April-May under assured irrigation facilities, and in rainfed areas, it can be grown with the onset of monsoon.\"\n  },\n  {\n    \"Q\": \"How should Dhaincha crop be ploughed down in the soil?\",\n    \"A\": \"Dhaincha crop must be ploughed down in the soil with the help of a Rotavator implement at the optimum stage (before flowering stage) with optimum moisture conditions.\"\n  },\n  {\n    \"Q\": \"What is the importance of quality seed in crop production?\",\n    \"A\": \"Seed is the most important critical input in crop production, and availability of quality hybrid/improved variety certified seed at the right time at the local level and at a genuine rate is essential.\"\n  },\n  {\n    \"Q\": \"How can farmers obtain quality seeds?\",\n    \"A\": \"Farmers can contact and purchase quality seeds from nearby KVKs, Agricultural Research Stations, SAUs, different ICAR Institutes, and cooperative societies.\"\n  },\n  {\n    \"Q\": \"What is the recommended time for levelling land with a Laser Land Leveller?\",\n    \"A\": \"The recommended time for levelling land with a Laser Land Leveller is before the onset of monsoon to increase water use efficiency (WUE) in canal areas.\"\n  },\n  {\n    \"Q\": \"What is the benefit of constructing a Water Farm Pond or Plastic-based water pond?\",\n    \"A\": \"Constructing a Water Farm Pond or Plastic-based water pond helps collect and harvest excessive rainwater during the rainy season, which can be used for life-saving irrigation during deficit rainfall conditions.\"\n  },\n  {\n    \"Q\": \"What is the recommended sowing time for cotton?\",\n    \"A\": \"The recommended sowing time for cotton is between the first week of May to the third week of May, as per irrigation water availability.\"\n  },\n  {\n    \"Q\": \"What is the recommended seed rate and spacing for Desi Cotton, American Cotton, and Bt Cotton?\",\n    \"A\": \"The recommended seed rate and spacing are: Desi Cotton-15-16 kg/ha (60x25 Cm), American Cotton- 12-16 kg/ha (67.5x30 Cm), and Bt Cotton-1.5 Kg/ha (108x60 Cm).\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"Why are millets considered a good crop choice under the threat of climate change?\",\n  \"A1\": \"Millets are considered a good crop choice under the threat of climate change because they are climate-smart crops that can achieve an assured yield of around 8-10 quintal per acre with low input costs.\",\n  \n  \"Q2\": \"What are the benefits of choosing millets over rice and wheat?\",\n  \"A2\": \"Choosing millets over rice and wheat can help accomplish the sustainable development goals (SDGs), mainly SDG 2 (zero hunger), SDG 3 (good health and well-being), SDG 12 (sustainable consumption and production), and SDG 13 (climate action).\",\n  \n  \"Q3\": \"What is physiological seed priming and its benefits?\",\n  \"A3\": \"Physiological seed priming is a technique that fastens the germination time, enhances uniform emergence, seedling vigour, and yields in millets, particularly under rainfed or less fertile soils.\",\n  \n  \"Q4\": \"What are the different types of physiological seed priming techniques?\",\n  \"A4\": \"The different types of physiological seed priming techniques include hydro-priming, osmo-priming, hormonal priming, nutrient priming, and nano-priming.\",\n  \n  \"Q5\": \"Why are small millets considered nutritionally superior to rice and wheat?\",\n  \"A5\": \"Small millets are rich in proteins, minerals, and vitamins, making them nutritionally superior to rice and wheat.\",\n  \n  \"Q6\": \"What are the characteristics of small millets that make them resilient to environmental stresses?\",\n  \"A6\": \"Small millets are inherently resilient to moisture and temperature stress, and can withstand certain degrees of soil acidity and alkalinity.\",\n  \n  \"Q7\": \"Why is uniform and rapid germination important for successful crop establishment?\",\n  \"A7\": \"Uniform and rapid germination is essential for successful crop establishment, as it optimizes field production of crop plants in arid and semi-arid regions.\",\n  \n  \"Q8\": \"What is the role of seed priming in improving crop production in regions with less rainfall?\",\n  \"A8\": \"Seed priming can play an important role in improving crop production in regions with less rainfall by enhancing seed germination and seedling emergence.\",\n  \n  \"Q9\": \"What are the critical stages in the plant life cycle where seed priming can make a difference?\",\n  \"A9\": \"The critical stages in the plant life cycle where seed priming can make a difference are germination and seedling emergence.\",\n  \n  \"Q10\": \"Why is it important for seed producers to maintain seed quality and deliver seeds to farmers at the right time?\",\n  \"A10\": \"It is important for seed producers to maintain seed quality and deliver seeds to farmers at the right time, as farmers require high-quality seeds with excellent germination and seed health for successful crop establishment.\"\n}\n```",
    "{\n  \"Q1\": \"What is the recommended time for sowing groundnut in Rajasthan?\",\n  \"A1\": \"Sowing of groundnut can be done in the month of May under assured irrigation conditions.\",\n  \"Q2\": \"What are the two types of varieties in Groundnut?\",\n  \"A2\": \"There are two types of varieties in Groundnut- Bunch type and spreading type.\",\n  \"Q3\": \"What is the recommended seed rate for spreading varieties of groundnut?\",\n  \"A3\": \"For Spreading Varieties-80-100 kg/ha (45x10 cm)\",\n  \"Q4\": \"How can termite control be done in groundnut?\",\n  \"A4\": \"Seed should be treated with 4 ml Chloropyriphos 20 EC/ kg seed kernel before sowing.\",\n  \"Q5\": \"What is the recommended method for controlling White Grub in groundnut?\",\n  \"A5\": \"Seed should be treated with 3 ml Imidachloprid 17.8 % SL/ kg seed kernel before sowing.\",\n  \"Q6\": \"How can Collar Rot & Root Rot be controlled in groundnut?\",\n  \"A6\": \"Use 4 kg Trichoderma harzianum mixed with 50-60 kg well decomposed FYM, kept in shady place with optimum moisture level for its multiplication and mix in soil in 1 ha area at the time of sowing.\",\n  \"Q7\": \"What is the recommended time for raising paddy nursery in Rajasthan?\",\n  \"A7\": \"Paddy nursery can be raised in second fortnight of May\",\n  \"Q8\": \"How much seed is required for transplanting in one ha area of paddy?\",\n  \"A8\": \"24-25 kg seed is sufficient for transplanting in one ha area.\",\n  \"Q9\": \"What is the recommended width for paddy nursery beds?\",\n  \"A9\": \"1.0-1.5 m wide nursery beds\",\n  \"Q10\": \"How can leaf sucking pest & Leaf Curl Virus disease be controlled in cotton?\",\n  \"A10\": \"Seed should be treated with 4 g Thiomethaxom 70 WS/kg seed before sowing.\"\n}",
    "[\n  {\n    \"Q\": \"What are the suitable varieties of Basmati rice?\",\n    \"A\": \"Important varieties are PR-106, PR-1121, BK-190, PB-1, Pusa Sugandha-1, Sugandha-4, Improved Pusa Basmati-1, Basmati-1059 etc.\"\n  },\n  {\n    \"Q\": \"When should Ashok-20 & Bagad Dhan be directly seeded in the field?\",\n    \"A\": \"It should be completed in the last fortnight of June, as per irrigation water availability.\"\n  },\n  {\n    \"Q\": \"What is the sowing time for Pearl millet (Bajra)?\",\n    \"A\": \"Its sowing is started with the onset of monsoon.\"\n  },\n  {\n    \"Q\": \"What are the types of varieties in Bajra crop?\",\n    \"A\": \"There are two types: Composite and Hybrid, with a large variation in maturity period (from 60 days to 100 days maturity period).\"\n  },\n  {\n    \"Q\": \"What is the seed rate for Pearl millet?\",\n    \"A\": \"Pearl millet requires 4-5 kg of seed per ha for getting optimum plant population.\"\n  },\n  {\n    \"Q\": \"What are the serious pests in Bajra crop?\",\n    \"A\": \"Termite & White grub are serious pests in Bajra crop.\"\n  },\n  {\n    \"Q\": \"What is the seed rate for Green gram?\",\n    \"A\": \"Improved varieties seed of 12-15 kg is recommended for one ha area.\"\n  },\n  {\n    \"Q\": \"What are the improved varieties of Cowpea?\",\n    \"A\": \"There are very limited improved varieties available, including RC-19 (Brown seeded) & RC-101 (White seeded).\"\n  },\n  {\n    \"Q\": \"What is the seed rate for Moth bean?\",\n    \"A\": \"To get the optimum plant stand, 10-12 kg seed per ha is sufficient.\"\n  },\n  {\n    \"Q\": \"What are the types of varieties in Guar crop?\",\n    \"A\": \"There are two types: (i) Tall and single stem without branching, and (ii) Dwarf & branching type.\"\n  }\n]",
    "```json\n{\n  \"Q1\": \"What is the ideal time for sowing sesame (Til) in the kharif season?\",\n  \"A1\": \"Sowing should be started with the onset of monsoon and must be completed before mid-July.\",\n  \n  \"Q2\": \"What are the improved varieties of maize for the kharif season?\",\n  \"A2\": \"Improved varieties of maize include Composite varieties (Pratap Maize-9, Madhuri-1) and Hybrids (Pratap Raj Hybrid maize-1095, Arawali Maize-1, etc.).\",\n  \n  \"Q3\": \"What is the seed rate for black gram (Urd) in the kharif season?\",\n  \"A3\": \"The seed rate for black gram is 10-12 kg per ha with row to row 45 cm and plant to plant 15 cm spacing.\",\n  \n  \"Q4\": \"What are the improved varieties of soybean for the kharif season?\",\n  \"A4\": \"Improved varieties of soybean include J S20-116, JS 2034, JS 2098, N R C -86, and other recommended varieties.\",\n  \n  \"Q5\": \"What is the ideal sowing geometry for soybean in clay and clay loam soils?\",\n  \"A5\": \"The ideal sowing geometry for soybean in clay and clay loam soils is row to row 45 cm and plant to plant 15 cm.\",\n  \n  \"Q6\": \"What are the improved varieties of sorghum for the kharif season?\",\n  \"A6\": \"Improved varieties of sorghum include Hybrids (CSH 1,5,6,9,10,11) and Varieties (SPV 96, 245, 462, 475, CSV 15, 17, 23, etc.).\",\n  \n  \"Q7\": \"What is the seed rate for sorghum for grain production?\",\n  \"A7\": \"The seed rate for sorghum for grain production is 9-10 kg/ha at 45 cm line spacing.\",\n  \n  \"Q8\": \"What is the recommended practice for early kharif season in fallow land?\",\n  \"A8\": \"Deep ploughing in early kharif season in fallow land is recommended for better crop in kharif season.\",\n  \n  \"Q9\": \"What is the recommended spacing for papaya nursery raising and planting?\",\n  \"A9\": \"The recommended spacing for papaya nursery raising and planting is RxR 2.5 m and PxP 1.6 m.\",\n  \n  \"Q10\": \"What is the importance of proper drainage facilities for sesame (Til) crop?\",\n  \"A10\": \"Proper drainage facilities are essential for higher productivity of sesame (Til) crop as it is highly sensitive to water logging conditions.\"\n}\n```",
    "```json\n{\n  \"Q1\": \"What are the necessary measures for old orchards?\",\n  \"A1\": \"Regular irrigation, weeding, and plant protection measures for canker and dieback disease are necessary for old orchards.\",\n  \n  \"Q2\": \"How can canker and dieback disease be prevented and managed?\",\n  \"A2\": \"Pruning of dried twigs followed by immediate spray of copper oxychloride and two sprays of streptocycline + copper oxychloride at monthly intervals can prevent and manage canker and dieback disease.\",\n  \n  \"Q3\": \"What is the recommended fertilizer application for guava crops?\",\n  \"A3\": \"For guava crops, 60-70 kg of FYM, 180g of phosphorus, 175g of potassium, and half of the nitrogen (180g) should be applied in June-July, with the remaining nitrogen applied in October and November.\",\n  \n  \"Q4\": \"What are the fertilizer requirements for pomegranate crops in dry areas?\",\n  \"A4\": \"For pomegranate crops in dry areas, full doses of FYM (40-50 kg), phosphorus (225g), and potassium (200-250g), and half doses of nitrogen (300-350g) should be applied in June, with the second half dose of nitrogen applied after three weeks.\",\n  \n  \"Q5\": \"What are the training and pruning requirements for ber crops?\",\n  \"A5\": \"For ber crops, training and pruning should be done in early May, followed by application of full dose of organic manure (50-55kg), phosphorus (200g), and potassium (300g), and half dose of nitrogen (250g) in June-July.\",\n  \n  \"Q6\": \"What is the recommended fertilizer application for sapota crops?\",\n  \"A6\": \"For sapota crops, the full quantity of organic manure (FYM 60 kg) and half doses of chemical fertilizer N:P:K (500: 250: 250 g) should be applied at the beginning of the monsoon, with the second half doses applied in October.\",\n  \n  \"Q7\": \"What are the fertilizer requirements for aonla crops?\",\n  \"A7\": \"For aonla crops, the whole amount of organic manure (FYM 55-60 kg), phosphatic (P2O5 750g), nitrogen (1500g), and potassium (K2O @ 1000g) should be applied in two split doses, once after fruit set and again during fruit growth and development.\",\n  \n  \"Q8\": \"What is the recommended fertilizer application for date palm crops?\",\n  \"A8\": \"For date palm crops, FYM @ 10-15 kg should be applied to young plants and 30-40 kg per tree to mature plants in July to September, with urea @ 2.0 kg applied before flowering.\",\n  \n  \"Q9\": \"When should vegetables like early cauliflower and cucurbits be sown?\",\n  \"A9\": \"The sowing of early cauliflower and cucurbits crops like bottle gourd should be done in the month of June-July.\",\n  \n  \"Q10\": \"What is the importance of monsoon rain in fertilizer application for various crops?\",\n  \"A10\": \"Monsoon rain plays a crucial role in fertilizer application for various crops, as it helps in the absorption of nutrients by the plants, and many crops require fertilizer application coinciding with monsoon rain.\"\n}\n```",
    "```json\n[\n  {\n    \"Q\": \"When should the sowing of seeds for crops like Bitter gourd, Ridge gourd, and Tomato start?\",\n    \"A\": \"At the end of May month.\"\n  },\n  {\n    \"Q\": \"What is the recommended seed treatment to improve germination percentage and reduce cultivation time and cost?\",\n    \"A\": \"Thiamethoxam 30 FS 8g or Trichoderma 10g per kg of seed.\"\n  },\n  {\n    \"Q\": \"How can the major leaf curl virus problem in chilli, Brinjal, Tomato, and Potato be reduced?\",\n    \"A\": \"By adopting crop rotation, selecting healthy and resistant variety, and deep ploughing of the field.\"\n  },\n  {\n    \"Q\": \"What is the recommended management practice for fungal diseases like leaf spot, powdery mildew, and fruit rot in standing crops?\",\n    \"A\": \"Regular spray of fungicides like Diathen M-45, Carbendazim, and Hexaconazole @ 1g per liter of water.\"\n  },\n  {\n    \"Q\": \"How can sap-sucking pests like Aphid, Jassid, Red spider mite, and White fly be managed?\",\n    \"A\": \"By spraying Neem oil 3000 ppm (3ml/liter water) or Thiamethoxam 25 WG 7-8g per 15 liter water or Imidacloprid @ 1ml/ 3 liter of water.\"\n  },\n  {\n    \"Q\": \"What measures should be taken to protect cattle and buffalo from excessive temperature and heat stress during the month of May?\",\n    \"A\": \"Provide balanced ration, increase the portion of barley and bran in the concentrate mixture, and feed enough green fodder to animals.\"\n  },\n  {\n    \"Q\": \"How often should animals be fed during hot weather?\",\n    \"A\": \"In the morning, evening, and night time, as animals remain under stress due to high temperature in the afternoon.\"\n  },\n  {\n    \"Q\": \"What is the recommended amount of salt and mineral mixture to be provided to cattle and buffalo daily?\",\n    \"A\": \"At least 50 grams of mineral mixture and 30 grams of salt should be provided daily in the concentrate mixture.\"\n  },\n  {\n    \"Q\": \"What health measures should be taken for cattle and buffalo during the month of May?\",\n    \"A\": \"Vaccinate against Haemorrhagic Septicemia and Black Quarter, deworming, and protect from external parasites like ticks and mites.\"\n  },\n  {\n    \"Q\": \"What should be done if animals become ill due to heat stroke, dehydration, or loss of appetite?\",\n    \"A\": \"Consult a veterinarian for proper treatment and care.\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"What should be done to sheep and goats during hot months?\",\n  \"A1\": \"Sheep and goats should be taken for grazing in the morning and evening, and given rest in a shady place in the afternoon.\",\n  \n  \"Q2\": \"Why is it important to provide sufficient drinking water to sheep and goats?\",\n  \"A2\": \"To prevent dehydration and ensure the animals have enough water to drink, especially in hot temperatures.\",\n  \n  \"Q3\": \"What should be added to the feed of sheep and goats to avoid mineral loss?\",\n  \"A3\": \"An appropriate amount of common salt should be added to their feed to avoid the loss of essential minerals due to excessive temperature.\",\n  \n  \"Q4\": \"What health measure should be taken for sheep and goats in hot months?\",\n  \"A4\": \"Deworming of sheep and goats should be carried out, and they should be vaccinated against enterotoxaemia.\",\n  \n  \"Q5\": \"How can heat stress be reduced in poultry?\",\n  \"A5\": \"By supplementing Vitamin 'C' in their diet, providing proper drinking water, and maintaining proper ventilation in the poultry house.\",\n  \n  \"Q6\": \"What should be done to protect chickens from hot winds?\",\n  \"A6\": \"Gunny bags/sacks should be planted around the farm and wetted by spraying water through sprinklers to reduce the heat.\",\n  \n  \"Q7\": \"How can cattle and buffalo be protected from high temperatures?\",\n  \"A7\": \"By grazing them in pastures during early morning or evening hours, keeping them in the shade, and providing fresh, cool, and clean water.\",\n  \n  \"Q8\": \"What should be given to cattle and buffalo to maintain their milk production?\",\n  \"A8\": \"A balanced ration should be provided to maintain their milk production, and enough green fodder or nutritious feed should be given.\",\n  \n  \"Q9\": \"Why is it important to vaccinate cattle and buffalo against certain diseases?\",\n  \"A9\": \"To protect them from diseases such as HS and BQ, and to prevent the spread of disease in the herd.\",\n  \n  \"Q10\": \"What should be done to sheep and goats that have not been vaccinated against enterotoxaemia?\",\n  \"A10\": \"They should be vaccinated against enterotoxaemia as soon as possible to prevent the disease.\"\n}\n```",
    "```json\n[\n  {\n    \"Q\": \"What should be done to protect sheep from dehydration?\",\n    \"A\": \"Give them proper common salt and mineral mixture with feed and water.\"\n  },\n  {\n    \"Q\": \"When should sheep be sheared and what should be done 21 days after shearing?\",\n    \"A\": \"Sheep should be sheared during this month and 21 days after shearing, their bodies should be drenched with disinfectants to protect them against ectoparasite.\"\n  },\n  {\n    \"Q\": \"How can chicks be protected from heat?\",\n    \"A\": \"Prevent overcrowding and direct environmental heat, and provide fresh, cool, and clean water.\"\n  },\n  {\n    \"Q\": \"What is the recommended time for sowing cotton in the Kharif season?\",\n    \"A\": \"The time of sowing of cotton spreads over a period of April to the first fortnight of June, with the optimum time for American cotton being May.\"\n  },\n  {\n    \"Q\": \"What are the recommended varieties and hybrids of cotton?\",\n    \"A\": \"Improved American cotton varieties include H-1117, H-1126, H-1098, and H-1226, while recommended hybrids include HHH-223 and HHH-287.\"\n  },\n  {\n    \"Q\": \"What is the seed treatment recommended for cotton before sowing?\",\n    \"A\": \"The seed should be dipped in water for 5-6 hours, treated with 5 gm Emisan, 1 gm streptocyclin, and 1 gm succinic acid in 10 litres of water, and treated with carbendazim or Imidacloprid as needed.\"\n  },\n  {\n    \"Q\": \"What is the recommended seed rate for cotton?\",\n    \"A\": \"The seed rate varies by variety, with 15-20 kg delinted seed per ha for improved American cotton varieties, 12.5 kg/ha for Desi cotton varieties, and 2.125 kg/ha for BT Cotton hybrids.\"\n  },\n  {\n    \"Q\": \"What is the recommended method of sowing cotton?\",\n    \"A\": \"Sow the crop in lines 67.5 cm apart with a cotton sowing drill or cotton planter, with plant to plant spacing of 60 cm or row to row spacing of 100cm and plant to plant spacing of 45 cm, at a depth of 4-5 cm.\"\n  },\n  {\n    \"Q\": \"What is the recommended fertilizer application for cotton?\",\n    \"A\": \"Apply 80-100 Kg N per ha for American Cotton, 50 kg N for desi cotton, and 150 kg N, 60 kg P2O5, 60 kg K2O, and 25 kg ZnSO4 per ha for hybrid cotton, with 1/3 dose of N, full dose of P2O5, full dose of potash, and full dose of ZnSO4.\"\n  },\n  {\n    \"Q\": \"Why is deworming of chicks necessary?\",\n    \"A\": \"Deworming of chicks should be carried out with piprazine mixed in drinking water to protect them from internal parasites.\"\n  }\n]\n```",
    "```json\n{\n  \"Q1\": \"What is the recommended fertilizer application for cotton?\",\n  \"A1\": \"Apply ZnSo4 at time of sowing and split the remaining N dose in two equal parts at square formation and flowering stage.\",\n  \n  \"Q2\": \"How should nitrogenous fertilizer be applied for hybrid cotton?\",\n  \"A2\": \"Split the N dose in three parts: at sowing, square formation, and flowering stage.\",\n  \n  \"Q3\": \"What is the recommended fertilizer application for sandy soils?\",\n  \"A3\": \"Apply 90% of nitrogenous fertilizers through soil application and 10% through foliar spray at the boll development stage.\",\n  \n  \"Q4\": \"How should Summer Moong be harvested?\",\n  \"A4\": \"Harvest the crop at ripening of 70-80% pods to allow timely sowing of the kharif crop.\",\n  \n  \"Q5\": \"What are the improved varieties of Sorghum for fodder?\",\n  \"A5\": \"SSG-59-3, HC-136, HC-171, HC-308, HG-541, and HJ-513.\",\n  \n  \"Q6\": \"What is the optimum time of sowing for Sorghum?\",\n  \"A6\": \"Mid-June to mid-July.\",\n  \n  \"Q7\": \"What is the recommended fertilizer application for Arhar?\",\n  \"A7\": \"Apply 20 kg N and 40 kg P2O5 per hectare at the time of sowing.\",\n  \n  \"Q8\": \"What is the recommended seed treatment for Arhar?\",\n  \"A8\": \"Inoculation of Arhar seed with Rhizobium and PSB biofertilizers.\",\n  \n  \"Q9\": \"What is the optimum time of sowing for Groundnut?\",\n  \"A9\": \"Entire month of June, with sowing completed by the second fortnight of June under irrigated conditions.\",\n  \n  \"Q10\": \"What is the recommended seed rate for Groundnut?\",\n  \"A10\": \"80 kg per hectare for medium-sized kernel varieties.\"\n}\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the recommended treatment for seed and soil borne diseases in rice?\",\n    \"A\": \"Treat the seed with 15 ml Chloropyriphos 20 EC/kg seed for management of termites and white grub.\"\n  },\n  {\n    \"Q\": \"What is the recommended fertilizer application for obtaining good crop yield in rice?\",\n    \"A\": \"Application of 15 kg N, 50 kg P2O5, 25 kg K2O and 25 kg Zinc sulphate per hectare is required.\"\n  },\n  {\n    \"Q\": \"What are the improved varieties of rice for medium duration?\",\n    \"A\": \"HKR-127, HKR-126, HKR-120, HSD-1, Jaya, PR-106.\"\n  },\n  {\n    \"Q\": \"What is the recommended time for nursery sowing for early duration varieties of rice?\",\n    \"A\": \"15 May to 31 June.\"\n  },\n  {\n    \"Q\": \"How should seeds be selected for better results in rice cultivation?\",\n    \"A\": \"Select bold and disease-free seed for better results.\"\n  },\n  {\n    \"Q\": \"What is the recommended seed treatment for rice?\",\n    \"A\": \"Soaking of 1 ha seed (20-30 kg seed) in 25 litre water solution with 25 g bavistin and 2.5 g streptocycline is done for 24 hrs.\"\n  },\n  {\n    \"Q\": \"What is the recommended fertilizer application for raising the nursery in rice?\",\n    \"A\": \"Apply 15 to 20 tonnes of FYM per hectare in the nursery field before sowing of the nursery and 25 kg N, 25 kg P2O5 and 25 kg ZnSO4 per hectare.\"\n  },\n  {\n    \"Q\": \"What is the recommended method for transplanting paddy?\",\n    \"A\": \"Transplanting of paddy is done by manual as well as mechanical method.\"\n  },\n  {\n    \"Q\": \"What is the recommended fertilizer application for medium, mid-early duration and hybrid varieties of rice?\",\n    \"A\": \"Apply 150 kg N, 60 kg P2O5, 60 kg K2O and 25 kg ZnSO4 per hectare.\"\n  },\n  {\n    \"Q\": \"What is the recommended weed management strategy for paddy crop?\",\n    \"A\": \"Puddling though helpful in management of many weeds, several grassy weeds, broad leaf weeds and sedges infest paddy crop, apply 1.5 kg Pretilachlore 30 EC or 3 litre Butachlore or Thiobencarb at 1-3 days after sowing of the nursery.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the recommended method for managing weeds in rice crops?\",\n    \"A\": \"Weeds can be managed effectively by chemical methods, including the application of butachlore, thiobencarb, butachlor, and other chemicals at specific stages after transplanting.\"\n  },\n  {\n    \"Q\": \"How can broad leaf weeds be managed in rice crops?\",\n    \"A\": \"Broad leaf weeds can be managed by application of ready mix of metsulphuron and chlorimuron, ethoxysulphuron, or 2,4-D ester at 20-25 days after transplanting.\"\n  },\n  {\n    \"Q\": \"What is the recommended time for transplanting rice crops using the direct seeding method?\",\n    \"A\": \"The first fortnight of June is the optimum time for sowing direct seeded rice crops, but very short duration varieties can be sown in the second fortnight of June.\"\n  },\n  {\n    \"Q\": \"What type of soil is not suitable for direct seeding of rice crops?\",\n    \"A\": \"Light textured soils are not suitable for direct seeding of rice crops.\"\n  },\n  {\n    \"Q\": \"What are the essential steps for successful cultivation of direct seeded rice crops?\",\n    \"A\": \"The essential steps include selecting the right type of soil, selecting short duration varieties, sowing at the right time, using the right seed rate, and proper field preparation.\"\n  },\n  {\n    \"Q\": \"What is the recommended seed rate for direct seeding of rice crops?\",\n    \"A\": \"The recommended seed rate is 20-25 kg/ha, with soaking of seed before 8-12 hours of sowing and seed treatment with carbendazim.\"\n  },\n  {\n    \"Q\": \"What is the benefit of using the direct seeding method for rice crops?\",\n    \"A\": \"The direct seeding method helps in recharging the underground water table, reduces water usage, and allows for earlier ripening of the crop.\"\n  },\n  {\n    \"Q\": \"What are the recommended rice varieties for direct seeding method?\",\n    \"A\": \"Recommended varieties include PB-1509, PB-1121, Punjab Basmati-7, PR-126, PR-122, PR-127, PR-128, and PR-129.\"\n  },\n  {\n    \"Q\": \"How can mix weeds flora be managed in rice crops?\",\n    \"A\": \"Mix weeds flora can be managed by application of bispyribac sodium at 15-25 days after transplanting.\"\n  },\n  {\n    \"Q\": \"What is the recommended method of sowing for direct seeded rice crops?\",\n    \"A\": \"The recommended method of sowing is using a lucky seed drill or press wheel seed drill, with row-row spacing of 20 cm, and avoiding preparation of the field and sowing during noon hours.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the main purpose of using seed priming technology in agriculture?\",\n    \"A\": \"To enhance rapid and uniform emergence, achieve high seedling vigour, and improve stand establishment and yield under adverse climatic conditions.\"\n  },\n  {\n    \"Q\": \"What are the different types of seed priming techniques?\",\n    \"A\": \"Hydro-priming, osmo-priming, halopriming, hormonal priming, and biopriming.\"\n  },\n  {\n    \"Q\": \"What is hydro-priming and how does it benefit crops?\",\n    \"A\": \"Hydro-priming is a controlled hydration process of seeds in simple water without chemicals, which produces healthy seedlings, uniform crop stand, and helps crops escape drought and hasten maturity.\"\n  },\n  {\n    \"Q\": \"What is osmo-priming and what are its benefits?\",\n    \"A\": \"Osmo-priming involves seed hydration in an osmotic solution, which induces rapid and uniform germination, decreases mean germination time, and provides nitrogen to the germinating seed for protein synthesis.\"\n  },\n  {\n    \"Q\": \"What role do cytokinins play in plant growth and development?\",\n    \"A\": \"Cytokinins play a vital role in all phases of plant growth and development, starting from seed germination to senescence, and priming with optimum concentration of cytokinins can increase germination, growth, and yield of many crop species.\"\n  },\n  {\n    \"Q\": \"What is the effect of gibberellic acid (GA3) on seed germination and growth?\",\n    \"A\": \"GA3 breaks seed dormancy, enhances germination, hypocotyl growth, internodal length, cell division in the cambial zone, and increases leaf size, and has a stimulatory effect on hydrolytic enzymes, which speed up germination and promote seedling elongation.\"\n  },\n  {\n    \"Q\": \"What is nutrient priming and what are its benefits?\",\n    \"A\": \"Nutrient priming involves priming seeds with micronutrients, which improves stand establishment, growth, and yield, and also enriches grain with micronutrients.\"\n  },\n  {\n    \"Q\": \"Which crops have shown potential for nutrient priming?\",\n    \"A\": \"Wheat, rice, and forage legumes have shown potential for nutrient priming.\"\n  },\n  {\n    \"Q\": \"What are the environmental stresses that seed priming techniques can help crops deal with?\",\n    \"A\": \"Drought, heat stress, salinity, nutrient stress, and several other environmental stresses.\"\n  },\n  {\n    \"Q\": \"What is the overall benefit of using seed priming techniques in agriculture?\",\n    \"A\": \"Seed priming techniques can help crops deal with detrimental conditions, improve stand establishment, growth, and yield, and ultimately lead to better crop performance and productivity.\"\n  }\n]\n```"
]