[
    " {\n  \"Q1\": \"What is the purpose of the ICAR agro-advisory for KHARIF 2022?\",\n  \"A1\": \"The ICAR agro-advisory for KHARIF 2022 provides guidance and recommendations for various aspects of agriculture, including fisheries, poultry, and crop management, to help farmers improve their productivity and sustainability.\"\n\n  \"Q2\": \"What are some of the key recommendations for fisheries management in the ICAR agro-advisory for KHARIF 2022?\",\n  \"A2\": \"The advisory suggests regular water quality testing, proper feed management, and maintaining optimal stocking density for fish farming.\"\n\n  \"Q3\": \"What is the importance of soil health in agriculture according to the ICAR agro-advisory for KHARIF 2022?\",\n  \"A3\": \"Soil health is crucial for providing essential nutrients to crops, ensuring their growth and productivity, and maintaining the overall health of the agricultural ecosystem.\"\n\n  \"Q4\": \"What are some of the measures suggested for pest and disease management in the ICAR agro-advisory for KHARIF 2022?\",\n  \"A4\": \"The advisory recommends integrated pest management strategies, use of biopesticides, and proper sanitation practices to prevent and control pests and diseases in crops.\"\n\n  \"Q5\": \"How does the ICAR agro-advisory for KHARIF 2022 suggest managing water resources for agriculture?\",\n  \"A5\": \"The advisory emphasizes the importance of water conservation, efficient irrigation techniques, and rainwater harvesting to ensure adequate water supply for agricultural activities.\"\n\n  \"Q6\": \"What are some of the recommendations for sustainable farming practices in the ICAR agro-advisory for KHARIF 2022?\",\n  \"A6\": \"The advisory suggests the use of organic farming methods, crop rotation, and intercropping to promote soil health, reduce chemical inputs, and increase biodiversity in agricultural systems.\"\n\n  \"Q7\": \"What is the role of ICAR in providing agro-advisory services to farmers?\",\n  \"A7\": \"ICAR, as a premier agricultural research organization in India, provides scientific and technical guidance to farmers through its agro-advisory services, helping them adopt best practices and improve their productivity.\"\n\n  \"Q8\": \"How does the ICAR agro-advisory for KHARIF 2022 address climate change and its impact on agriculture?\",\n  \"A8\": \"The advisory highlights the need for climate-smart agricultural practices, such as the use of drought-resistant crop varieties, conservation agriculture, and agroforestry, to mitigate the effects of climate change on agriculture.\"\n\n  \"Q9\": \"What are some of the key recommendations for managing livestock and poultry farming in the ICAR agro-advisory for KHARIF 2022?\",\n  \"A9\": \"The advisory suggests proper feed management, vaccination, and disease control measures, along with maintaining hygienic conditions, to ensure the health and productivity of livestock and poultry.\"\n\n  \"Q10\": \"How can farmers access the ICAR agro-advisory for KHARIF 2022 and other relevant information?\",\n  \"A10\": \"Farmers can access the advisory through various channels, such as the ICAR website, mobile apps, and extension services, as well as through workshops and training programs organized by ICAR and its partner organizations.\"\n}",
    " {\n  \"Q1\": \"What is the balance of the Capital Fund at the beginning of the year 2020-21?\",\n  \"A1\": \"59663726746\"\n},\n{\n  \"Q2\": \"What is the balance of the Capital Fund at the end of the year 2020-21?\",\n  \"A2\": \"72476761107\"\n},\n{\n  \"Q3\": \"What is the amount of Grants utilized for capital expenditure in 2020-21?\",\n  \"A3\": \"3139176529\"\n},\n{\n  \"Q4\": \"What is the amount of Funds of Sponsored Projects/Schemes utilized for capital expenditure in 2020-21?\",\n  \"A4\": \"552342309\"\n},\n{\n  \"Q5\": \"What is the Net Income/expenditure transferred to/from the Income & Expenditure account in 2020-21?\",\n  \"A5\": \"-308731213\"\n},\n{\n  \"Q6\": \"What is the Adjustment to/from Capital Fund in 2020-21?\",\n  \"A6\": \"-1279397951\"\n},\n{\n  \"Q7\": \"What is the total amount of assets in the Balance Sheet as on 31st March 2021?\",\n  \"A7\": \"75118069701\"\n},\n{\n  \"Q8\": \"What is the total amount of liabilities in the Balance Sheet as on 31st March 2021?\",\n  \"A8\": \"72727837486\"\n},\n{\n  \"Q9\": \"What is the total amount of income from sales/service in 2020-21?\",\n  \"A9\": \"670924897\"\n},\n{\n  \"Q10\": \"What is the total amount of expenditure in 2020-21?\",\n  \"A10\": \"72785492320\"\n}\n}",
    " {\n  \"Q1\": \"What is the purpose of Schedule 2 in the Annual Accounts of the Indian Council of Agricultural Research?\",\n  \"A1\": \"Schedule 2 provides details about Capital Reserve, Add value of assets acquired/donated, Free gifts, and Deductions during the year.\"\n\n  \"Q2\": \"What are the two main sources of additions to the earmarked/endowment funds during the year?\",\n  \"A2\": \"The two main sources are income from investments made and other additions.\"\n\n  \"Q3\": \"What is the total earmarked/endowment funds at the end of the year?\",\n  \"A3\": \"The total earmarked/endowment funds at the end of the year are 226970572 Rupees.\"\n\n  \"Q4\": \"What are the two main types of current liabilities in Schedule 4?\",\n  \"A4\": \"The two main types of current liabilities are Sundry Creditors and Advances received.\"\n\n  \"Q5\": \"What is the total current liabilities and provisions at the end of the year?\",\n  \"A5\": \"The total current liabilities and provisions at the end of the year are 10562049282 Rupees.\"\n\n  \"Q6\": \"What is the closing balance of Internal Resource Generation at the end of the year?\",\n  \"A6\": \"The closing balance of Internal Resource Generation at the end of the year is 2528132624 Rupees.\"\n\n  \"Q7\": \"What is the total amount of grants received from the Government of India during the year?\",\n  \"A7\": \"The total amount of grants received from the Government of India during the year is 686288922 Rupees.\"\n\n  \"Q8\": \"What is the total amount of NAHEP grants received during the year?\",\n  \"A8\": \"The total amount of NAHEP grants received during the year is 353691187 Rupees.\"\n\n  \"Q9\": \"What is the closing balance of the book overdraft in the Bank Account at the end of the year?\",\n  \"A9\": \"The closing balance of the book overdraft in the Bank Account at the end of the year is 0 Rupees.\"\n\n  \"Q10\": \"What is the total amount of unutilized grants from the Government of India to be refunded at the end of the year?\",\n  \"A10\": \"The total amount of unutilized grants from the Government of India to be refunded at the end of the year is 0 Rupees.\"\n}",
    " {\n  \"Q1\": \"What is the total amount of Gross Block Depreciation for the Indian Council of Agricultural Research Annual Accounts 2020–21?\",\n  \"A1\": \"3545050283\"\n},\n{\n  \"Q2\": \"What is the total amount of Net Block for the Indian Council of Agricultural Research Annual Accounts 2020–21?\",\n  \"A2\": \"788649369\"\n},\n{\n  \"Q3\": \"What is the total amount of Cost/Value at Addition for the Indian Council of Agricultural Research Annual Accounts 2020–21?\",\n  \"A3\": \"69335768701\"\n},\n{\n  \"Q4\": \"What is the total amount of Deductions for the Indian Council of Agricultural Research Annual Accounts 2020–21?\",\n  \"A4\": \"94301618\"\n},\n{\n  \"Q5\": \"What is the total amount of Accumulated Total upto the end of the year for the Indian Council of Agricultural Research Annual Accounts 2020–21?\",\n  \"A5\": \"33092017815\"\n},\n{\n  \"Q6\": \"What is the total amount of Cost/Value At the end of the year for the Indian Council of Agricultural Research Annual Accounts 2020–21?\",\n  \"A6\": \"39000151800\"\n},\n{\n  \"Q7\": \"What is the total amount of Capital work-in-progress for the Indian Council of Agricultural Research Annual Accounts 2020–21?\",\n  \"A7\": \"9250503321\"\n},\n{\n  \"Q8\": \"What is the total amount of Gross Block for the Indian Council of Agricultural Research Annual Accounts 2020–21?\",\n  \"A8\": \"60085265380\"\n},\n{\n  \"Q9\": \"What is the total amount of Net Block for the Indian Council of Agricultural Research Annual Accounts 2020–21?\",\n  \"A9\": \"29109777290\"\n},\n{\n  \"Q10\": \"What is the total amount of Total for the Indian Council of Agricultural Research Annual Accounts 2020–21?\",\n  \"A10\": \"39000151800\"\n}\n}",
    " {\n  \"Q1\": \"What is the total cost of Land (Free hold) at the beginning of the year?\",\n  \"A1\": \"0\"\n},\n{\n  \"Q2\": \"What is the total cost of Land (Lease hold) at the beginning of the year?\",\n  \"A2\": \"0\"\n},\n{\n  \"Q3\": \"What is the accumulated depreciation of Buildings at the beginning of the year?\",\n  \"A3\": \"0\"\n},\n{\n  \"Q4\": \"What is the total cost of Buildings at the beginning of the year?\",\n  \"A4\": \"28601938\"\n},\n{\n  \"Q5\": \"What is the total cost of Buildings at the end of the year?\",\n  \"A5\": \"28601938\"\n},\n{\n  \"Q6\": \"What is the accumulated depreciation of Buildings at the end of the year?\",\n  \"A6\": \"83476\"\n},\n{\n  \"Q7\": \"What is the net block of Land (Free hold) at the end of the year?\",\n  \"A7\": \"0\"\n},\n{\n  \"Q8\": \"What is the net block of Land (Lease hold) at the end of the year?\",\n  \"A8\": \"0\"\n},\n{\n  \"Q9\": \"What is the net block of Buildings at the end of the year?\",\n  \"A9\": \"28518462\"\n},\n{\n  \"Q10\": \"What is the total depreciation of Land (Free hold) at the end of the year?\",\n  \"A10\": \"0\"\n}\n",
    " {\n  \"Q1\": \"What is the aim of HarvestPlus and ICRISAT's work on pearl millet biofortification?\",\n  \"A1\": \"To reduce micronutrient deficiency among people consuming pearl millet as a staple food.\"\n  \n  \"Q2\": \"What is the name of the improved pearl millet variety developed by HarvestPlus and ICRISAT?\",\n  \"A2\": \"ICTP 8203 Fe-10-2, also known as 'Dhanshakti'.\"\n  \n  \"Q3\": \"In which year was 'Dhanshakti' first released in Maharashtra?\",\n  \"A3\": \"2012\"\n  \n  \"Q4\": \"What percentage of the recommended daily allowance (RDA) of iron can be met by consuming 200g of 'Dhanshakti' for adult men and children in India?\",\n  \"A4\": \"100%\"\n  \n  \"Q5\": \"What percentage of the RDA of iron can be met by consuming 200g of 'Dhanshakti' for non-pregnant and non-lactating women in India?\",\n  \"A5\": \"60%\"\n  \n  \"Q6\": \"What is the purpose of ICAR's Consortia Research Table 1?\",\n  \"A6\": \"To accelerate the development of biofortified varieties and enhance the nutritional value of commonly consumed staples.\"\n  \n  \"Q7: How does the nutritional composition of pearl millet compare to other cereals?\",\n  \"A7\": \"Pearl millet has a lower carbohydrate content, higher protein and fat content, and higher iron content compared to other cereals.\"\n  \n  \"Q8: What is the name of the platform on Biofortification addressing rice, wheat, maize, sorghum, pearl millet, and small millets?\",\n  \"A8\": \"CRP (Consortia Research Platform) on Biofortification.\"\n  \n  \"Q9: How many biofortified varieties of rice, wheat, maize, and pearl millet have been developed through the Biofortification Programme?\",\n  \"A9\": \"17\"\n  \n  \"Q10: What is the name of the organization working on the development of biofortified pearl millet cultivars?\",\n  \"A10\": \"All India Coordinated Research Project on Pearl Millet (AICRP-Pearl Millet)\"\n}",
    " {\n  \"Q1\": \"What are the fixed assets included in the schedule?\",\n  \"A1\": \"The fixed assets include land, buildings, tanks & ponds, roads & bridges, sewerage & drainage, tube wells, electrical installations, plant & machinery, laboratory apparatus, office equipment, vehicles & vessels, farm & field equipment, computers/peripherals/major software, furniture & fixtures, audio visual equipment, live stock, and library books.\"\n\n  \"Q2\": \"What is the cost/value at addition for buildings?\",\n  \"A2\": \"The cost/value at addition for buildings is 5,902,375.\"\n\n  \"Q3\": \"What is the net block value for tanks & ponds?\",\n  \"A3\": \"The net block value for tanks & ponds is 0.\"\n\n  \"Q4\": \"What is the accumulated total for roads & bridges at the beginning of the year?\",\n  \"A4\": \"The accumulated total for roads & bridges at the beginning of the year is 0.\"\n\n  \"Q5\": \"What is the depreciation for electrical installations and equipment?\",\n  \"A5\": \"The depreciation for electrical installations and equipment is 671,347.\"\n\n  \"Q6\": \"What is the cost/value at the end of the year for plant & machinery?\",\n  \"A6\": \"The cost/value at the end of the year for plant & machinery is 83,268,114.\"\n\n  \"Q7\": \"What is the net block value for laboratory apparatus and scientific equipment?\",\n  \"A7\": \"The net block value for laboratory apparatus and scientific equipment is 130,987,915.\"\n\n  \"Q8\": \"What is the accumulated total for vehicles & vessels at the end of the year?\",\n  \"A8\": \"The accumulated total for vehicles & vessels at the end of the year is -3,188.\"\n\n  \"Q9\": \"What is the cost/value at the end of the year for farm & field equipment?\",\n  \"A9\": \"The cost/value at the end of the year for farm & field equipment is 173,663.\"\n\n  \"Q10\": \"What is the total cost/value at the end of the year for all fixed assets?\",\n  \"A10\": \"The total cost/value at the end of the year for all fixed assets is 360,305,985.\"\n}",
    " {\n  \"Q1\": \"What is the total amount of Gross Block Depreciation for Land a. Free hold?\",\n  \"A1\": \"553405\"\n},\n{\n  \"Q2\": \"What is the total amount of Gross Block Depreciation for Buildings?\",\n  \"A2\": \"49239486\"\n},\n{\n  \"Q3\": \"What is the total amount of Gross Block Depreciation for Tanks & Ponds?\",\n  \"A3\": \"1192294\"\n},\n{\n  \"Q4\": \"What is the total amount of Gross Block Depreciation for Roads & Bridges?\",\n  \"A4\": \"1617167\"\n},\n{\n  \"Q5\": \"What is the total amount of Gross Block Depreciation for all fixed assets?\",\n  \"A5\": \"52863856\"\n},\n{\n  \"Q6\": \"What is the total amount of Net Block for Land a. Free hold?\",\n  \"A6\": \"553405\"\n},\n{\n  \"Q7\": \"What is the total amount of Net Block for Buildings?\",\n  \"A7\": \"424129951\"\n},\n{\n  \"Q8\": \"What is the total amount of Net Block for Tanks & Ponds?\",\n  \"A8\": \"20837479\"\n},\n{\n  \"Q9\": \"What is the total amount of Net Block for Roads & Bridges?\",\n  \"A9\": \"5694511\"\n},\n{\n  \"Q10\": \"What is the total amount of Net Block for all fixed assets?\",\n  \"A10\": \"483572337\"\n}\n}",
    " {\n  \"Q1\": \"What is the total cost of Land and Buildings in the Annual Accounts 2020-21?\",\n  \"A1\": \"The total cost of Land and Buildings is 45400 (Land) + 1229075 (Buildings) = 1274475.\"\n  \n  \"Q2\": \"What is the total cost of Tanks & Ponds, Roads & Bridges, and Sewerage & Drainage in the Annual Accounts 2020-21?\",\n  \"A2\": \"The total cost of Tanks & Ponds, Roads & Bridges, and Sewerage & Drainage is 0 (Tanks & Ponds) + 0 (Roads & Bridges) + 0 (Sewerage & Drainage) = 0.\"\n  \n  \"Q3\": \"What is the total cost of Electrical installations and Plant & Machinery in the Annual Accounts 2020-21?\",\n  \"A3\": \"The total cost of Electrical installations and Plant & Machinery is 1229075 (Electrical installations) + 1847554 (Plant & Machinery) = 3076629.\"\n  \n  \"Q4\": \"What is the total cost of Laboratory apparatus, Office Equipment, and Vehicle & Vessels in the Annual Accounts 2020-21?\",\n  \"A4\": \"The total cost of Laboratory apparatus, Office Equipment, and Vehicle & Vessels is 4203168 (Laboratory apparatus) + 2655766 (Office Equipment) + 101392 (Vehicle & Vessels) = 6960326.\"\n  \n  \"Q5\": \"What is the total cost of Farm & Field Equipment and Computers/Peripherals/ in the Annual Accounts 2020-21?\",\n  \"A5\": \"The total cost of Farm & Field Equipment and Computers/Peripherals/ is 557412 (Farm & Field Equipment) + 3272486 (Computers/Peripherals/) = 3829898.\"\n  \n  \"Q6\": \"What is the total cost of Furniture & Fixtures in the Annual Accounts 2020-21?\",\n  \"A6\": \"The total cost of Furniture & Fixtures is 12472430.\"\n  \n  \"Q7\": \"What is the total cost of all fixed assets in the Annual Accounts 2020-21?\",\n  \"A7\": \"The total cost of all fixed assets is 45400 (Land) + 1229075 (Buildings) + 0 (Tanks & Ponds) + 0 (Roads & Bridges) + 0 (Sewerage & Drainage) + 1229075 (Electrical installations) + 1847554 (Plant & Machinery) + 4203168 (Laboratory apparatus) + 2655766 (Office Equipment) + 101392 (Vehicle & Vessels) + 557412 (Farm & Field Equipment) + 3272486 (Computers/Peripherals/) + 12472430 (Furniture & Fixtures) = 35758348.\"\n  \n  \"Q8\": \"What is the total cost of Land, Buildings, and Electrical installations in the Annual Accounts 2020-21?\",\n  \"A8\": \"The total cost of Land, Buildings, and Electrical installations is 45400 (Land) + 1229075 (Buildings) + 1229075 (Electrical installations) = 2497550.\"\n  \n  \"Q9\": \"What is the total cost of Laboratory apparatus, Office Equipment, and Vehicle & Vessels in the Annual Accounts 2020-21?\",\n  \"A9\": \"The total cost of Laboratory apparatus, Office Equipment, and Vehicle & Vessels is 4203168 (Laboratory apparatus) + 2655766 (Office Equipment) + 101392 (Vehicle & Vessels) = 6960326.\"\n  1662002612660062660664060266222666122226343471657404419202217331020202671226366762660332215666004262166212224162344116262262 2226611243126642164111116666611132320110311622642411222627341646111112033162676202025367340262162020654222267630212380311906022761666690226164026221101913341943022282326661562266234616331016621012213766111244615400631622622316261112061621001641116666666040011253102223616661118263364011111161111116164024213356667802244260645063582451002222148112706212111266138642422012334475656001442403224666222506444460388088336711222267361022632211226224723222122266460402611066161920660174234616151226664300622228166770062241120022000684002222244217808667144662080002221001627600042001216006610026662640816276944460011055202662677600016164326162216266370411666414095334222201122434203022427110643611022224042020022252661242276201001116420252110267733116203",
    " {\n  \"Q1\": \"What are the key activities included in agriculture?\",\n  \"A1\": \"Agriculture includes crop cultivation, animal husbandry, fisheries, and forestry.\",\n  \"Q2\": \"How does modern agriculture improve productivity?\",\n  \"A2\": \"Modern agriculture uses precision farming, genetically modified crops, and sustainable irrigation techniques.\",\n  \"Q3\": \"Why is soil health important in agriculture?\",\n  \"A3\": \"Soil health is crucial for maintaining agricultural productivity by providing essential nutrients to crops.\",\n  \"Q4\": \"What methods are used to maintain soil fertility?\",\n  \"A4\": \"Farmers use fertilizers, crop rotation, and organic farming techniques.\",\n  \"Q5\": \"How does water management help agriculture?\",\n  \"A5\": \"Irrigation and rainwater harvesting ensure consistent crop yields, especially in drought-prone areas.\",\n  \"Q6\": \"What are the major challenges faced in agriculture?\",\n  \"A6\": \"Major challenges include pests, diseases, climate change, and unpredictable weather patterns.\",\n  \"Q7\": \"How do farmers protect crops from pests?\",\n  \"A7\": \"They use pesticides, biological control methods, and integrated pest management strategies.\",\n  \"Q8\": \"How does climate change affect agriculture?\",\n  \"A8\": \"It causes unpredictable weather, rising temperatures, droughts, and floods, impacting crop yields.\",\n  \"Q9\": \"How do governments support agriculture?\",\n  \"A9\": \"Governments provide subsidies, research funding, and policies promoting sustainable farming.\",\n  \"Q10\": \"Why are agricultural markets and supply chains important?\",\n  \"A10\": \"They ensure fair prices for farmers and affordable food for consumers.\"\n}",
    " [\n    {\n        \"Q\": \"What are the key activities included in agriculture?\",\n        \"A\": \"Agriculture includes crop cultivation, animal husbandry, fisheries, and forestry.\"\n    },\n    {\n        \"Q\": \"How does modern agriculture improve productivity?\",\n        \"A\": \"Modern agriculture uses precision farming, genetically modified crops, and sustainable irrigation techniques.\"\n    },\n    {\n        \"Q\": \"Why is soil health important in agriculture?\",\n        \"A\": \"Soil health is crucial for maintaining agricultural productivity by providing essential nutrients to crops.\"\n    },\n    {\n        \"Q\": \"What methods are used to maintain soil fertility?\",\n        \"A\": \"Farmers use fertilizers, crop rotation, and organic farming techniques.\"\n    },\n    {\n        \"Q\": \"How does water management help agriculture?\",\n        \"A\": \"Irrigation and rainwater harvesting ensure consistent crop yields, especially in drought-prone areas.\"\n    },\n    {\n        \"Q\": \"What are the major challenges faced in agriculture?\",\n        \"A\": \"Major challenges include pests, diseases, climate change, and unpredictable weather patterns.\"\n    },\n    {\n        \"Q\": \"How do farmers protect crops from pests?\",\n        \"A\": \"They use pesticides, biological control methods, and integrated pest management strategies.\"\n    },\n    {\n        \"Q\": \"How does climate change affect agriculture?\",\n        \"A\": \"It causes unpredictable weather, rising temperatures, droughts, and floods, impacting crop yields.\"\n    },\n    {\n        \"Q\": \"How do governments support agriculture?\",\n        \"A\": \"Governments provide subsidies, research funding, and policies promoting sustainable farming.\"\n    },\n    {\n        \"Q\": \"Why are agricultural markets and supply chains important?\",\n        \"A\": \"They ensure fair prices for farmers and affordable food for consumers.\"\n    }\n]",
    " {\n  \"Q1\": \"What are the opening balances for Grants Refundable to the Government for the current and previous years?\",\n  \"A1\": \"Current Year: 1286339859, Previous Year: 567349300\"\n},\n{\n  \"Q2\": \"What is the total amount of grants received during the year 2020-21?\",\n  \"A2\": \"71221500000\"\n},\n{\n  \"Q3\": \"How much was already refunded from the grants in the current year?\",\n  \"A3\": \"1286339859\"\n},\n{\n  \"Q4\": \"What is the total amount of grants utilized for capital expenditure?\",\n  \"A4\": \"2900673474\"\n},\n{\n  \"Q5\": \"How much is the total internal resource generation available for the year 2020-21?\",\n  \"A5\": \"9971887724\"\n},\n{\n  \"Q6\": \"What is the balance of grants refundable to the government after deducting the grants utilized for capital expenditure?\",\n  \"A6\": \"686288922\"\n},\n{\n  \"Q7\": \"How much is the total amount of grants utilized for general grants-in-aid?\",\n  \"A7\": \"31142861887\"\n},\n{\n  \"Q8\": \"What is the total amount of grants utilized for pension?\",\n  \"A8\": \"12393601896\"\n},\n{\n  \"Q9\": \"What is the total amount of grants utilized for salaries?\",\n  \"A9\": \"23455822830\"\n},\n{\n  \"Q10\": \"What is the total expenditure for the year 2020-21?\",\n  \"A10\": \"1039980110\"\n}\n}",
    " {\n    \"Q1\": \"What are the three main sources of grants utilised under the given numbers?\",\n    \"A1\": \"Grants-in-Aid-Salaries, Grants-in-Aid-General, and Loans & Advances\"\n},\n{\n    \"Q2\": \"What is the total revenue expenditure for the given year?\",\n    \"A2\": \"6883722\"\n},\n{\n    \"Q3\": \"How much was the balance after subtracting expenditure on loans & advances?\",\n    \"A3\": \"9961679832\"\n},\n{\n    \"Q4\": \"What are the four categories of fees/subscriptions collected by the Indian Council of Agricultural Research?\",\n    \"A4\": \"Entrance Fees, Annual Fees/Subscriptions, Seminar/Programme Fees, Consultancy Fees\"\n},\n{\n    \"Q5\": \"What is the total interest earned from term deposits with scheduled banks?\",\n    \"A5\": \"635502960\"\n},\n{\n    \"Q6\": \"What is the total income from royalty and sale of publications for the current year?\",\n    \"A6\": \"11333818\"\n},\n{\n    \"Q7\": \"What are the four sources of other income listed?\",\n    \"A7\": \"License Fee from quarters, Income from Guest house charges, Leave Salary and Pension Contribution, Revenue Receipts from Schemes\"\n},\n{\n    \"Q8\": \"What is the total balance refundable to the Council after all deductions?\",\n    \"A8\": \"3944310133\"\n},\n{\n    \"Q9\": \"What is the total interest earned from savings accounts with scheduled banks?\",\n    \"A9\": \"41885422\"\n},\n{\n    \"Q10\": \"What is the total amount from the revolving fund income for the current year?\",\n    \"A10\": \"783431141\"\n}\n",
    " {\n  \"Q1\": \"What is the total amount of miscellaneous income in the current year?\",\n  \"A1\": \"2264308829\"\n},\n{\n  \"Q2\": \"What is the total amount of miscellaneous income in the previous year?\",\n  \"A2\": \"2810539562\"\n},\n{\n  \"Q3\": \"What is the total amount of prior period income in the current year?\",\n  \"A3\": \"362920\"\n},\n{\n  \"Q4\": \"What is the total amount of prior period income in the previous year?\",\n  \"A4\": \"0\"\n},\n{\n  \"Q5\": \"What is the total amount of establishment expenses in the current year?\",\n  \"A5\": \"34509121903\"\n},\n{\n  \"Q6\": \"What is the total amount of establishment expenses in the previous year?\",\n  \"A6\": \"34289403914\"\n},\n{\n  \"Q7\": \"What is the total amount of research and operational expenses in the current year?\",\n  \"A7\": \"4797045434\"\n},\n{\n  \"Q8\": \"What is the total amount of research and operational expenses in the previous year?\",\n  \"A8\": \"4491938452\"\n},\n{\n  \"Q9\": \"What is the total amount of government grants in the current year?\",\n  \"A9\": \"NAHEP Revenue Total (Current Year): 22297856522\"\n},\n{\n  \"Q10\": \"What is the total amount of government grants in the previous year?\",\n  \"A10\": \"NAHEP Revenue Total (Previous Year): 22011031819\"\n}\n}",
    " {\n  \"Q1\": \"What is the role of the Finance & Accounts Officer in the Indian Council of Agricultural Research?\",\n  \"A1\": \"The Finance & Accounts Officer is responsible for managing the annual accounts, including administrative expenses, grants, subsidies, and other financial aspects of the Indian Council of Agricultural Research.\"\n  \n  \"Q2\": \"What is the total administrative expense for the current year?\",\n  \"A2\": \"The total administrative expense for the current year is 6,109,070,107 Rupees.\"\n  \n  \"Q3\": \"What is the total amount of grants and subsidies for the current year?\",\n  \"A3\": \"The total amount of grants and subsidies for the current year is not explicitly mentioned in the provided text.\"\n  \n  \"Q4\": \"What are some of the major categories of administrative expenses?\",\n  \"A4\": \"Some of the major categories of administrative expenses include infrastructure, communication, repairs & maintenance, and others.\"\n  \n  \"Q5\": \"What is the total amount spent on infrastructure in the current year?\",\n  \"A5\": \"The total amount spent on infrastructure in the current year is 9,345,499,62 Rupees.\"\n  \n  \"Q6\": \"What is the total amount spent on communication in the current year?\",\n  \"A6\": \"The total amount spent on communication in the current year is 4,303,7551 Rupees.\"\n  \n  \"Q7\": \"What is the total amount spent on repairs & maintenance in the current year?\",\n  \"A7\": \"The total amount spent on repairs & maintenance in the current year is 1,624,0570 Rupees.\"\n  \n  \"Q8\": \"What is the total amount spent on other administrative expenses in the current year?\",\n  \"A8\": \"The total amount spent on other administrative expenses in the current year is 1,732,456,736 Rupees.\"\n  \n  \"Q9\": \"How much was spent on travel & conveyance in the current year?\",\n  \"A9\": \"The total amount spent on travel & conveyance in the current year is 117,597,902 Rupees.\"\n  \n  \"Q10\": \"What is the total amount spent on legal & professional charges in the current year?\",\n  \"A10\": \"The total amount spent on legal & professional charges in the current year is 40,285,510 Rupees.\"\n}",
    " {160666392725652606006679960866039800007087608065650006400222533000647703827760005600602000332090000098095650000767228782806096856847796206089020106050062780260600061231605380678008560290257384000964842776560042574573677605556666526869743239823659734820898916690503274774452900018658668744261557323316000702879465750602723407607699914410727234255759065067973732667011476568055425005785154651555613769545281081100422705760733457139056510023277046278225011076022577084549559954766961802864505068959622764051004005259685406175506137471472325876782076003316298701999230525307862570000892607330760 18562605321370019563003200345189250073440754867260528723106391164664510030505463758997094269308055652520000266507300 064623681064482 4340460601406261246017981460 124570023040618947202436753783786594733086245047008162541145943952466975830000000319760510423531835899860083060514053520045022455614437070100067446270082206 1520 2060696762134164898866867000268796704 0446680710024395004000256251045187835572561187918025441763006866334410400754838024150047501865700347130004348005290775775400651624000000052030222736414620045074000071258239 741336621806995557988685228800625130584212455556641463427426709742041025741567175830899416073468061454327477232151250209763677232825276594467703943631746557080040000 52165253100 15933127523300044509310973500000573216417445156510062 1237 15160000 24056412 277035 1733460 22755400 25549074 19532203312 2631702715675 2543300 33349 178106311100 2442870505622 a503 2163512 11503320246 359774602243300987530176662405 14000400003206650007000300006270919276000004740228630000670006973465523671665878695351514 1062243559295000662600045 1596095667300023825580077004226627085132 360690070 1352555737739652481031496 20327173250 615629 369715390229476344882700055436200685926497020335546695053557855 1504000500076277257349483137433 14750 1610 c0 1808855654003100005017649 2000 146675 264671762162660 26 262336 102220 30 417365394372145246054010230530062 36150154 164833043 a5400000053455 ",
    " {\n  \"Q1\": \"What is the minimum iron and zinc content set by AICRP-Pearl Millet for promoting entries in the trials and cultivar release?\",\n  \"A1\": \"42 mg/kg of iron and 32 mg/kg of zinc\"\n},\n{\n  \"Q2\": \"What is the second cheapest source of energy and micronutrients after pearl millet?\",\n  \"A2\": \"Sorghum\"\n},\n{\n  \"Q3\": \"In which regions is sorghum consumption high?\",\n  \"A3\": \"Inland central and eastern regions of Maharashtra and inland northern region of Karnataka\"\n},\n{\n  \"Q4\": \"What percentage of nutrient intake does sorghum account for?\",\n  \"A4\": \"35%\"\n},\n{\n  \"Q5\": \"What is the name of the biofortified hybrid of pearl millet developed by NARP, Aurangabad in 2018?\",\n  \"A5\": \"AHB 1200 Fe (MH 2072)\"\n},\n{\n  \"Q6\": \"What is the grain iron content of Phule Mahasakthi 2581?\",\n  \"A6\": \"83 mg/kg\"\n},\n{\n  \"Q7\": \"What is the grain zinc content of Moti Shakti (GHB 1225)?\",\n  \"A7\": \"46 mg/kg\"\n},\n{\n  \"Q8\": \"What is the grain iron content of VPMH 7?\",\n  \"A8\": \"67 mg/kg\"\n},\n{\n  \"Q9\": \"What is the grain zinc content of HHB 67 Imp 2?\",\n  \"A9\": \"40 mg/kg\"\n},\n{\n  \"Q10\": \"What is the grain iron content of GHB 1231 (Sawaj Shakti)?\",\n  \"A10\": \"81 mg/kg\"\n}",
    " {77722001737016201119008301062203223601101312024220132092692423121919100000 items.02017666832027396022.40227173000193021740201077610277.00,00003. 171 of fixed2202.233774014001.1001777215064201137903, at cost on the following and as at5020700730330, the1243001. \n1331.1. 167887462320812. De1.1. in which1.\n Value2.12.11323372. 3237812 on2. (other60 on the following220700.012. 122. 33123206320. 1222737101333067473307482842. As on in 1.1.1. 1093863. As per capital1201. 1. 1. 1. \n2. 371. 13. 2632. 101 at at cost2 10 of assets: (2. 102. 1. 201062. 001. 12. 2. 3. 1. 101  at70000612. The 16012770001. 10 for the and0.01. 1. 1.2. 10. \n source. 131201. 1. 12801. 1.82. 1. \n101. 1. 3.1. \n12. 1221. \n20. 1.2 16. 1. 100 106. 1. 1 120. 1. 12. \n                 1. \n\n                8. 3. 1. 2 and on the following in1 102720 1.3. 1 1. 1.1. 1.1.1. 1. 10. 1. 3. 100 at1501. The in1.102. 3. 1. 1.1. The1. 1. 1 of 12. 1. 1. 1. \n1. 2. \n3. \n\n other 1. 1.1. 21.100. 1270  1. 1 on 10660 13. \n\n 12207 28. 200 on 10 1000100001. 101. \n2 37.\n 1. 1085.\n\n2. 107.787 1001. \n(a32687. 12. 187551 02. \n332.209.\n\n1. 1. \n: other 1. \n\n\n\n2. 3. \n of the following0.112.12431.1.1.\n on the on 1.27. 1. \n\n\n\ni other12. 13.2:\n(i2. \n3. 00 10 1. 1. \n20.\n1.\n11 1. F1.\n12.2. \n\n(i.\n\n\n\n other32:\n\n31. 1. 4..\n 1.\n                0 1.1.1. 13.1.\n\n12. 1. 32. 32001.1202 and incharge 2.\n In the 3.\n\n(i \n233337.2.. \n other3409. 1. book 1. 1.10000\n\n                1. \n3. 1. 1.\n(i44. \n 12.\n(i0. 3. 1. 102. 12. 33. \n\n\n                1. 1001.1. 1.\n\na assets1.1. 1. 1. 2. 1.1. 186. 1. 37. \n(i1. De 1. 1.3. 17. 100 3.12. 1. 12750. 133. 11373. 3. 2. \n2. 33. 1524471 1. 2. \ni701263. 1. 3. 1. \n\n\n3. 1. \n  value of the in the original assets 17.\n36. 3. 2. 3. 1. 4. \n 12520. 1.233. 331. 1. \n\n110000007. 1. \n 1. 3. 321.\n\n\n\n\n4. 3. 33.10.1. 3. 1.\n\n(a. 3. \n 155. 3. 3.. 2. \n\n\n\ni.0. \n 1. 3.1. \n\n\n\n\n(i. 17.\n\n\n\n 34.\n(i. \n 1. 332.1. 11. 3573. 3. 3.\n(i.\n(i3. 2. 3. 32. As on the following:\n2.\n40. 1. 4560:\n 3. 1. 3. The1.\n 1. \na. 3.1. 1. 3. 1.\ni1. 1. 1. 3. 1. 30. 1. 201. \n 3. 4. \n\n20 3.\ni1. 3.\n 3. 32. (i2 3. \n(i2.2.\n\n\ni.4.4. \n0.70 34. 34.\ni333. \n1. 1. \ni. 1022810.\n Value 2. 3. 3. 2. 1. 1.1.1. \n\n of \nassets on\n Value and 1. 3. \n\n\n \n\n\n\n\n\n value4. \n\n(a \ni.\n Recit \n\n2.\n \n\n\n(a1.\n(a\n3. \n\n 6. 1.\n\n\n 2 102. \n\n\n\n\n5. 25.\n3. 2.\n\n\n\n(i.\n\n\n\ni. 3. As \n  or in the \n(including 3.\n 121.\n Value1. \n \n(i7. \n Value1. 1. \n. \n\n\n1. \n\n\n(including and other of \ni. \n\n(i.\n\n\n1. \ni.\n \ni2.\n(i 3.\ni. \n.\n of the\n\n\n\n(i. 12.\n\n   \n\n\n1.\n 1.\n(a.",
    " { same on4 to the in the1 same other other other amount1 handingsary provided or in21 other in Capital portion at at only, to the fund for the\n20 capital scope only and the following in the in20 percentage fund in the1 Year- ( and in on the in the for the following items/70. after incapcentines\n other only in the  other other\n Value to20 Finages Indian assets only with effect only. and the other only and other in 20,0 code inven only for the in the following in or in on the other only or in the inputs for the\n Value incomethest on the in the in the following in the following in for the in terms in the same of in222 in20 at0000 only20 capital only in the following the capital subject of for the 1 and in 200 in the of the following the of the6 on the only20 handing and other in the2500 only at the20g only and the 06 capital:\n\n( when only in the following and the of the profitused only of the following at the amountm for the in the deprecithalf/in at the of of and other on the following in the basis at the retired for the2000, and other Source given for the and the In the funds and the only of the original in24,20205th00666 in In the same basis in Capital of the fundunder the following in the0060 only, the2010 capital other other only other in the following as on the other resources in the on the as from the000660al and other and other capital200000 basis as the000 funds account for the subject capital250, and other and inmediate200 capital whenals for the and the same of the year120 and the other other Advert in the in the in,00 (2000 in the as in 1 other other other other only as in the in the following in and in the other 10 In only and only in the cost on the of 100th and the net on2000000000 and for the In 0 and other in incuralfin the700 and other and other and other in on the funds and other in the200 only in the and other in 1000, and in100al Recidenticalin the in the in the on theday and the10 20000 for the depreci same and the in the\n702020 of the190 and the other only To income only and other same in the in the0 10 Indian of the year and the for the in the only and in the and, and in the in the and 200.20 of the following at above in other/re800 to the to be funds and other and other to to in the following at basis by 10080422020 assets700, as14612000 fixed15 and in the as per other to the2000000 the following and as per other100000005 as per as of in the of the basis and other and other, and other in the in the 0 for theof thevenue of \n in for the to the basis cases and0 of the and the following2 by in the 06. of the following at in the the2 of the from the following to the100/200.7500000 at the at of the fund.00 provided on the following the00177000000 capital assets of the and the to for research20, and other investmed0008000 capital part course in the and 100 fundsed for the revenue in the account for the following in the as, other of the fund asset:\n\n from theas200000 and other for the800, and in the same on the\n\n  of the other of the 20.0 to following, and and the21000 for the \n\n1200000000060000240 for the.00060 and other and other in20 part of the funds60000006 and20009000 at the19401100 for the or the as the in the in the225. for the1000 as in2.\n 001.\n210 in20 at the1 or as on the \n\n\n70 1500240 for the20, of the 2007060, in the IC in the00069.\n {101.\n\n\n\n\n\n other of the77%20222001.2000.\n2010.\n\n{ on1. 1 and other in the in the and the70 as per items funds interest150\n same of in expand for the income in the760 at80.\n\n\n in the at capital assets to the Government at in the201.\n\n(as following to the following profit in thee at other funds for the\n\n\n interest other of the000 in the basis to the1.\n\n\n at the 50 at the1120 in0.\n for the in1280020221.\n{1010 funds for research in the interest0,2 only of the0121.03.\n\n\n.\n\n1 given to75.\n\n\n\n 75%20 (with the1070022.\n\n11.\n of the for the with the following the01.\n\n0 for the other in the.\n fundsed capital projectments182 in the20\n\n\n in the1. Fund Th22610064.\n\n above in2.\n\n\n\n\n 200 10 of the220 for the in the other10 in the other only20 in the2270 fundsing of the outl10000-1122020 (2020 of the amount of in the\n\n                d, and the1200 funded200 funds as perprel funds on the Government and other new47/2006 in the following:\n\n    of the following the2 (In other \n                 as in the following at the20. fund and at 1501.\n                 \n1\n\n\n                 of the \n102 of the or in the balance:\n\n\n20 net of the 75%\n\n\n\n{2 of the  of the balance or70 to the6% for the20100.70002.\n and the 10.\n\n\n00001020.\n                 assets01 for the cost of the the at2 or the on the In the income at and other other assets price or the\n other for the of the20 in the the of the in the in the in the income In 10.\n\n (orin 1 at to the cost or the in the in the In the following the following of the or at or in the the.\n\n or in the in the In2020 and other to the amount of the1. 50s 5 at the amounted in the in the actual of the 8 assetl190026.\n10 or funds22.20 11660 or the actual0 at of the 660100 and other on the 30 at110 and the 2 at at 50 of the 12220% only from the from the in the or the on the books90 or the  other in the income as pertain from the amount for the net of the amount of or the Funds in the0 and the surplus2 for the amount for the to the \n70.\n for the fund for the for theon the as per and other fund to the for the amount and other 10 for the amount of the in the1 and other of the and the \n0 from in the60 to the2.\nfor the to the from the for the for employees in the funds for the in the to the following to the in the10 and the223.\n120 in the in the to the following in the actual of the balance in 1s.10 and the in the2010.\n\n\nfor0 and other of the to0 for the and others in the funds to the following to the21.\n\nto the case to",
    " {\n  \"Q1\": \"What happens to the income from investments of earmarked funds?\",\n  \"A1\": \"The income from investments of earmarked funds is added to the respective funds.\"\n  \n  \"Q2\": \"How are government grants for capital expenditure treated?\",\n  \"A2\": \"Government grants for capital expenditure are treated as of Capital Fund.\"\n  \n  \"Q3\": \"When are government grants for revenue expenditure treated as income?\",\n  \"A3\": \"Government grants for revenue expenditure are treated as income of the year in which they are realized.\"\n  \n  \"Q4\": \"What happens to unutilized government grants?\",\n  \"A4\": \"Unutilized government grants are treated as funds to be carried forward and refunded, as per government directions.\"\n  \n  \"Q5\": \"How are drawals from the AP Cess fund utilized?\",\n  \"A5\": \"Drawals from the AP Cess fund are utilized against approved schemes, and receipts against this grant are treated as income in the Income and Expenditure Account.\"\n  \n  \"Q6\": \"What happens to unutilized grants from the AP Cess fund?\",\n  \"A6\": \"Unutilized grants from the AP Cess fund are carried forward as a Liability and for utilization in the subsequent years.\"\n  \n  \"Q7\": \"What are revolving fund loans used for?\",\n  \"A7\": \"Revolving fund loans are granted to ICAR institutes, State Agricultural Universities, and NGOs to enable them to undertake income-generating schemes.\"\n  \n  \"Q8\": \"How are revolving fund loans exhibited in the accounts?\",\n  \"A8\": \"Revolving fund loans are exhibited under Current Assets Loans & Advances until their repayment in instalments.\"\n  \n  \"Q9\": \"What happens to the repayment of advances by institutes, SAUs, and NGOs?\",\n  \"A9\": \"The repayment of advances in instalments by institutes, SAUs, and NGOs is monitored through the Headquarter.\"\n  \n  \"Q10\": \"How are advances given to ICAR institutes treated during consolidation of accounts for ICAR as a whole?\",\n  \"A10\": \"The advances given to ICAR institutes are set off during consolidation of accounts for ICAR as a whole.\"\n}",
    " {\n  \"Q1\": \"Under which head are advances to institutes recorded in agricultural accounts?\",\n  \"A1\": \"Current Assets, Loans & Advances -b. Loans & Advances -Revolving Fund\"\n},\n{\n  \"Q2\": \"What happens to recoveries of advances along with balances in terminated AP Cess schemes?\",\n  \"A2\": \"They are remitted to the Govt. of India.\"\n},\n{\n  \"Q3\": \"How are revenue expenditures and income from Revolving Fund schemes accounted for?\",\n  \"A3\": \"They are accounted for under the respective financial heads.\"\n},\n{\n  \"Q4\": \"Where are receipts from sponsored projects and consultancy projects credited?\",\n  \"A4\": \"Current Liabilities -Other Liabilities -Receipts against ongoing sponsored/consultancy projects.\"\n},\n{\n  \"Q5\": \"How are overhead recoveries and intellectual fees treated in the accounts?\",\n  \"A5\": \"They are treated as abatement of revenue expenditure for the year.\"\n},\n{\n  \"Q6\": \"What happens when the expenditure on a sponsored scheme is less than the receipts?\",\n  \"A6\": \"The figure under Sundry Debtors will be set off against the figures in Liabilities side in respect of that scheme.\"\n},\n{\n  \"Q7\": \"How are expenditure and receipts compared in sponsored schemes?\",\n  \"A7\": \"The figure in the liabilities side will be set off against the figures on the Assets side.\"\n},\n{\n  \"Q8\": \"What happens to the net amount in the case of schemes where expenditure is more than receipts?\",\n  \"A8\": \"The net amount is shown as recoverable from the Sponsors under Current Assets -Sundry Debtors in the Balance Sheet.\"\n},\n{\n  \"Q9\": \"How are interest and finance charges grouped in the accounts?\",\n  \"A9\": \"They are grouped under miscellaneous expenses.\"\n},\n{\n  \"Q10\": \"When did ICAR adopt the Accrual System of Accounting and Standard formats for presentation of Annual Financial Statements?\",\n  \"A10\": \"From the financial year 2002-2003.\"\n}\n}",
    " {26205066672334699123669922666990036609122997192716069670991719766069741489971266017221767025621111666336768070067762266921238890523696088563339967003312073038403311972220920234670156887231997736696767897910199602366792225990026197899715400778463649912366922409562336711233661763116030667113896417009912256990397364733677672390175429676643762319612060972 26070072755887222469233212096863607632966910030 117642 10222872131727927433310740163477667901900149991389662530878722490004997626777711307574286 20 1472307131714 1847600925276 1933582022207903627863026925661 178661781111 121241912247092137201247516127898137079922872000839322267911376 31573002269997237 22122520810875792211572128662669637762783566 10 160975987007871396377240713660 115092077238223569981236 207966622880 1959587187477086468726777973270990766992143761483364612863166278731767716661 106684359220375757483436850817768163791125756503197781384480323763349712366 107171301260 11101581133923187750083653012881053671981327261070832311676365046961403273407214239670933 1 2 666519275 10867111777333477192172 19072609207670 2835811765807045740985303120712123928911278121065 107828172996172099563369611137655165609700774367373179668513 2089216392178515233971930711 11208712 12067236 10997 4. Closing Balance of Capital Fund 3369417291 5. Adjustments of Government Grants as shown above 430911236 6. Govt. Grants’ negative balances taken to Schedule 7 omitted 59936103 in Schedule 4 # 7. Opening balance of Capital Fund change, generate 8. Capital + Revenue Expenditure 9A 71906618200 9. Net effect - 9A 1470891345 10. Closing balance(1)+(2)-(3)-(4)-(5) *As per Grants drawn from Government of India and refunded to Ministry of Finance every year. Further, the above adjustments which impact other such figures as per details given below have been adjusted in the Capital Fund (by way of a line entry in the detailed accounts namely “Grants reconciliation as per Notes to Accounts 2020–21): 11. Adjustments of Government Grants as shown above 430911236 12. Govt. Grants’ negative balances taken to Schedule 7 omitted 59936103 in Schedule 4 # 13. Opening balance of Capital Fund change, generate 14. Capital + Revenue Expenditure 9A 71906618200 15. Net effect - 9A 1470891345 16. Closing balance(1)+(2)-(3)-(4)-(5) *As per Grants drawn from Government of India and refunded to Ministry of Finance every year. Further, the above adjustments which impact other such figures as per details given below have been adjusted in the Capital Fund (by way of a line entry in the detailed accounts namely “Grants reconciliation as per Notes to Accounts 2020–21): 17. Adjustments of Government Grants as shown above 430911236 18. Govt. Grants’ negative balances taken to Schedule 7 omitted 59936103 in Schedule 4 # 19. Opening balance of Capital Fund change, generate 20. Capital + Revenue Expenditure 9A 71906618200 21. Net effect - 9A 1470891345 22. Closing balance(1)+(2)-(3)-(4)-(5) *As per Grants drawn from Government of India and refunded to Ministry of Finance every year. Further, the above adjustments which impact other such figures as per details given below have been adjusted in the Capital Fund (by way of a line entry in the detailed accounts namely “Grants reconciliation as per Notes to Accounts 2020–21): 23. Adjustments of Government Grants as shown above 430911236 24. Govt. Grants’ negative balances taken to Schedule 7 omitted 59936103 in Schedule 4 # 25. Opening balance of Capital Fund change",
    " {\n  \"Q1\": \"What is the total amount of Government Grants received by various institutes?\",\n  \"A1\": \"The total amount of Government Grants received is Rs 5,965,822.27 (CTRI, Rajahmundry) + Rs 65,960 (IARI, New Delhi) + Rs 1,970,289 (CIAH, Bikaner) + Rs 245,060 (CISH, Lucknow) + Rs 1,197,490 (IIOPR, Pedavegi) + Rs 500,000 (DFR, Pune) + Rs 161,863 (IIS&WC, Dehradun) + Rs 351,450 (MGIFRI, Motihari) + Rs 1,204,851 (CCARI, Goa) + Rs 1,978,080 (NRC Camel, Bikaner) + Rs 325,000 (CIFA, Bhubaneshwar) + Rs 64,264 (CIWA Bhubaneshwar) + Rs 44,955 (ATARI-IV, Kanpur) + Rs 3,660,910 (DKMA, New Delhi) + Rs 98,498 (NASF, Pusa) = Rs 12,793,979.51\",\n  \"Q2\": \"What is the total amount of Fixed Assets & Depreciation?\",\n  \"A2\": \"The total amount of Fixed Assets & Depreciation is not explicitly mentioned in the text.\",\n  \"Q3\": \"What is the total amount of Previous years' figures regrouped?\",\n  \"A3\": \"The total amount of Previous years' figures regrouped is not explicitly mentioned in the text.\",\n  \"Q4\": \"What is the total amount of Schedules 1 to 23 in the Balance Sheet as at 31.03.2021?\",\n  \"A4\": \"The total amount of Schedules 1 to 23 in the Balance Sheet as at 31.03.2021 is Rs 23,016,300,755.00\",\n  \"Q5\": \"What is the total amount of Schedules 1 to 23 in the Income and Expenditure Account for the year ended on that date?\",\n  \"A5\": \"The total amount of Schedules 1 to 23 in the Income and Expenditure Account for the year ended on that date is Rs 23,016,300,755.00\",\n  \"Q6\": \"What is the total amount of Current year GPF Subscription & Interest thereupon?\",\n  \"A6\": \"The total amount of Current year GPF Subscription & Interest thereupon is Rs 20,546,116,358.00\",\n  \"Q7\": \"What is the total amount of Current year CPF Subscription & Interest thereupon?\",\n  \"A7\": \"The total amount of Current year CPF Subscription & Interest thereupon is Rs 0.00\",\n  \"Q8\": \"What is the total amount of Current year Interest Received?\",\n  \"A8\": \"The total amount of Current year Interest Received is Rs 903,694,917.00\",\n  \"Q9\": \"What is the total amount of Current year Interest Accrued?\",\n  \"A9\": \"The total amount of Current year Interest Accrued is Rs 441,222,013.00\",\n  \"Q10\": \"What is the total amount of Current year Other Income?\",\n  \"A10\": \"The total amount of Current year Other Income is Rs 9,283,734.00\"\n}",
    " {\n  \"Q1\": \"What was the opening balance for GPF in 2020-21?\",\n  \"A1\": \"19,005,013,973.00\"\n},\n{\n  \"Q2\": \"What was the total GPF balance at the end of 2020-21?\",\n  \"A2\": \"20,546,116,358.00\"\n},\n{\n  \"Q3\": \"How much was the excess of income over expenditure in 2020-21?\",\n  \"A3\": \"9,303,642.33\"\n},\n{\n  \"Q4\": \"What was the opening balance for CPF in 2020-21?\",\n  \"A4\": \"0.00\"\n},\n{\n  \"Q5\": \"What was the total CPF liability at the end of 2020-21?\",\n  \"A5\": \"0.00\"\n},\n{\n  \"Q6\": \"What was the opening balance for Reserves in 2020-21?\",\n  \"A6\": \"2,397,790,950.01\"\n},\n{\n  \"Q7\": \"What was the closing balance for Reserves in 2020-21?\",\n  \"A7\": \"2,407,094,592.34\"\n},\n{\n  \"Q8\": \"What was the opening balance for Investments in 2020-21?\",\n  \"A8\": \"20,341,276,809.00\"\n},\n{\n  \"Q9\": \"What was the total amount of matured investments in 2020-21?\",\n  \"A9\": \"45,646,000,000.00\"\n},\n{\n  \"Q10\": \"How much was the excess of income over expenditure in 2019-20?\",\n  \"A10\": \"131,744,355.01\"\n}\n}",
    " {\n  \"Q1\": \"What is the total amount of Fixed Deposits and Short term investments mentioned in the text?\",\n  \"A1\": \"11,244,500,000.00 b) + 13,469,500,000.00 FD + 24,714,000,000.00\"\n},\n{\n  \"Q2\": \"What is the total amount of Fixed Deposits with SBI?\",\n  \"A2\": \"9,710,000,000.00\"\n},\n{\n  \"Q3\": \"What is the total amount of F.& A.O. 45 Schedule 5 Accrued Interest for the year 2020-21?\",\n  \"A3\": \"441,222,012.77\"\n},\n{\n  \"Q4\": \"What is the total amount of F.& A.O. 46 Schedule 6 GPF Recoveries of March 2020?\",\n  \"A4\": \"333,107,746.00\"\n},\n{\n  \"Q5\": \"What is the total amount of F. & A. O. 47 Schedule 7 Other Assets / Liabilities Particulars for the year 2020-21?\",\n  \"A5\": \"55,539,509.20\"\n},\n{\n  \"Q6\": \"What is the rate of interest payable to the Subscribers as per the Govt. of India norms for the financial year 2020-21?\",\n  \"A6\": \"7.1%\"\n},\n{\n  \"Q7\": \"What is the total amount of GPF Receivable 2020-2021 from ICAR institutes?\",\n  \"A7\": \"3,429,124.00\"\n},\n{\n  \"Q8\": \"What is the total amount of Liability towards institutes as on 31.03.2021?\",\n  \"A8\": \"133,153,245.00\"\n},\n{\n  \"Q9\": \"What is the total amount of GPF Receivable 2019-2020 from ICAR institutes?\",\n  \"A9\": \"9,890,327.00\"\n},\n{\n  \"Q10\": \"What is the total amount of F.& A.O. 48 Schedule: 8: Significant Accounting Policies?\",\n  \"A10\": \"41,548,388.97\"\n}\n}",
    " {\n  \"Q1\": \"Where is the Subscription on account of Provident Fund received from?\",\n  \"A1\": \"ICAR Headquarters from 117 accounting units all over India.\"\n  \n  \"Q2\": \"How often are the excess of recoveries/advances over withdrawals/advances remitted to the Council?\",\n  \"A2\": \"Monthly basis.\"\n  \n  \"Q3\": \"What are the subsidiary records maintained at the institute level?\",\n  \"A3\": \"Subscribers’ ledgers, Broadsheets etc.\"\n  \n  \"Q4\": \"What is the purpose of the Annual GPF/CPF Statements received from the constituent units of ICAR?\",\n  \"A4\": \"To consolidate them for preparing Annual Accounts of GPF/CPF of ICAR.\"\n  \n  \"Q5\": \"How is the surplus of Income from investment of Provident Fund accumulation credited?\",\n  \"A5\": \"To Provident Fund Reserve maintained by ICAR Headquarters.\"\n  \n  \"Q6\": \"What is the amount payable to ICAR institutes as on 31.3.2021 towards GPF account settlement?\",\n  \"A6\": \"Rs.133,153,245/-\"\n  \n  \"Q7\": \"What was the amount of GPF receivable of the year 2019-20 from ICAR institutes?\",\n  \"A7\": \"Rs.6,523,286/-\"\n  \n  \"Q8\": \"How much securities were purchased for Rs 9,000,000,000 and what is their face value?\",\n  \"A8\": \"Securities with a face value of Rs 9,000,000,000 were purchased for Rs 9,189,000,000.\"\n  \n  \"Q9\": \"What is the amount payable to ICAR institutes as on 31.3.2020 towards GPF account settlement?\",\n  \"A9\": \"Rs.34,990,254/-\"\n  \n  \"Q10\": \"What is the total liability towards subscribers as on 31.03.2021?\",\n  \"A10\": \"Rs.133,153,245/-\"\n}",
    " {\n  \"Q1\": \"What is the total amount of GPF Receivables from Institute as on 31.03.2020?\",\n  \"A1\": \"133,153,245.00\",\n  \"Q2\": \"Which ICAR unit has the highest amount of GPF Receivables as on 31.03.2020?\",\n  \"A2\": \"IGFRI, JHANSI\",\n  \"Q3\": \"What is the total GPF Liability as of 31.03.2020?\",\n  \"A3\": \"34,990,254.00\",\n  \"Q4\": \"Which ICAR unit has the highest GPF Liability as of 31.03.2020?\",\n  \"A4\": \"ICAR RES. COM. EASTERN REG., PATNA\",\n  \"Q5\": \"What is the total amount of FDs on which interest is due on maturity for the year 2020-21?\",\n  \"A5\": \"1,397,541,563.00\",\n  \"Q6\": \"Which bank has the highest interest rate for FDs on which interest is due on maturity for the year 2020-21?\",\n  \"A6\": \"Indusind Bank\",\n  \"Q7\": \"What is the total amount of FDs on which interest is due on maturity for the year 2021-22?\",\n  \"A7\": \"0\",\n  \"Q8\": \"What is the total amount of FDs on which interest is due on maturity for the year 2022-23?\",\n  \"A8\": \"0\",\n  \"Q9\": \"What is the total amount of FDs on which interest is due on maturity for the year 2023-24?\",\n  \"A9\": \"0\",\n  \"Q10\": \"What is the total amount of FDs on which interest is due on maturity for the year 2024-25?\",\n  \"A10\": \"0\"\n}",
    " {\n    \"Q1\": \"What are the benefits of biofortified sorghum and small millets?\",\n    \"A1\": \"Biofortified sorghum and small millets have higher protein, fiber, calcium, and mineral nutrients, which can provide better nutrition to the poor.\"\n    \n    \"Q2\": \"What are the challenges faced by finger millet in terms of nutrition?\",\n    \"A2\": \"Finger millet grains contain anti-nutritional factors like tannin, which can negatively affect iron and zinc absorption.\"\n    \n    \"Q3\": \"What processing techniques can reduce tannin content in finger millet?\",\n    \"A3\": \"Soaking, roasting, boiling, germination, fermentation, and malting can reduce tannin content in finger millet.\"\n    \n    \"Q4\": \"What are the iron and zinc contents of the finger millet varieties CFMV 1 and CFMV 2?\",\n    \"A4\": \"CFMV 1 and CFMV 2 are rich in calcium, iron, and zinc.\"\n    \n    \"Q5\": \"What is the iron and zinc content of the small millet variety CLMV 1?\",\n    \"A5\": \"CLMV 1 is rich in iron and zinc.\"\n    \n    \"Q6: What are the benefits of consuming biofortified millets for micronutrient malnourished people?\",\n    \"A6: Consuming biofortified millets can enhance the nutritional status and health condition of micronutrient malnourished people.\"\n    \n    \"Q7: How can biofortified cultivars of millets be integrated into government programs?\",\n    \"A7: Biofortified cultivars of millets can be integrated into government programs like POSHAN Abhiyaan, PDS, and ICDS to deliver micronutrients to target communities.\"\n    \n    \"Q8: What is the protein content range in small millets?\",\n    \"A8: The protein content in small millets ranges from 7-12%.\"\n    \n    \"Q9: How does the iron and zinc content in small millets compare to other major cereal crops?\",\n    \"A9: Iron and zinc are relatively in higher concentrations in small millets compared to other major cereal crops.\"\n    \n    \"Q10: What is the role of small millets in sustainable agriculture?\",\n    \"A10: Small millets contribute to sustainable agriculture by conserving water, protecting the environment, and providing nutritious food.\"\n}",
    " {\n  \"Q1\": \"What is the total amount invested in Central Government Securities as per the given text?\",\n  \"A1\": \"1,896,276,809.00\"\n},\n{\n  \"Q2\": \"What is the annual interest rate for the Special Deposit Floating investment?\",\n  \"A2\": \"4.09%\"\n},\n{\n  \"Q3\": \"What is the total interest earned on ICICI BANK investments in 2020-21?\",\n  \"A3\": \"128,816,896.00\"\n},\n{\n  \"Q4\": \"What is the total interest earned on South Indian Bank investments in 2020-21?\",\n  \"A4\": \"260,022,814.00\"\n},\n{\n  \"Q5\": \"What is the total interest earned on State Bank of India investments in 2020-21?\",\n  \"A5\": \"9,471,559.00\"\n},\n{\n  \"Q6\": \"What is the total interest earned on investments in Indusind Bank as per the given text?\",\n  \"A6\": \"1,384,282,070.00\"\n},\n{\n  \"Q7\": \"What is the total amount invested in PFC 2020 Bonds?\",\n  \"A7\": \"286,000,000.00\"\n},\n{\n  \"Q8\": \"What is the total interest earned on maturity of ICICI BANK investments in 2020-21?\",\n  \"A8\": \"220,713,730.00\"\n},\n{\n  \"Q9\": \"What is the total interest earned on maturity of South Indian Bank investments in 2020-21?\",\n  \"A9\": \"189,224,401.00\"\n},\n{\n  \"Q10\": \"What is the total interest earned on maturity of State Bank of India investments in 2020-21?\",\n  \"A10\": \"698,630.00\"\n}\n}",
    " {\n    \"1\": {\n        \"question\": \"What is the opening balance for the General Provident Fund (GPF) in the ICAR General Provident Fund for the Year 2020-2021?\",\n        \"answer\": \"51907434.69 Rupees\"\n    },\n    \"2\": {\n        \"question\": \"What is the closing balance for the General Provident Fund (GPF) in the ICAR General Provident Fund for the Year 2020-2021?\",\n        \"answer\": \"9694187.49 Rupees\"\n    },\n    \"3\": {\n        \"question\": \"What is the total amount of receipts for the General Provident Fund (GPF) in the ICAR General Provident Fund for the Year 2020-2021?\",\n        \"answer\": \"663356407.00 Rupees\"\n    },\n    \"4\": {\n        \"question\": \"What is the total amount of payments for the General Provident Fund (GPF) in the ICAR General Provident Fund for the Year 2020-2021?\",\n        \"answer\": \"352491197.00 Rupees\"\n    },\n    \"5\": {\n        \"question\": \"What is the net surplus for the General Provident Fund (GPF) in the ICAR General Provident Fund for the Year 2020-2021?\",\n        \"answer\": \"310865210.00 Rupees\"\n    },\n    \"6\": {\n        \"question\": \"What is the interest on investments for the General Provident Fund (GPF) in the ICAR General Provident Fund for the Year 2020-2021?\",\n        \"answer\": \"1517866614.00 Rupees\"\n    },\n    \"7\": {\n        \"question\": \"What is the amount of excess of CPF Receipts over Payments for the General Provident Fund (GPF) in the ICAR General Provident Fund for the Year 2020-2021?\",\n        \"answer\": \"448324637.00 Rupees\"\n    },\n    \"8\": {\n        \"question\": \"What is the amount of excess of CPF Payments over Receipts for the General Provident Fund (GPF) in the ICAR General Provident Fund for the Year 2020-2021?\",\n        \"answer\": \"0.00 Rupees\"\n    },\n    \"9\": {\n        \"question\": \"What is the amount of withdrawal/final withdrawal for the General Provident Fund (GPF) in the ICAR General Provident Fund for the Year 2020-2021?\",\n        \"answer\": \"1146526312.00 Rupees\"\n    },\n    \"10\": {\n        \"question\": \"What is the amount of miscellaneous payments to other departments for the General Provident Fund (GPF) in the ICAR General Provident Fund for the Year 2020-2021?\",\n        \"answer\": \"17120131.20 Rupees\"\n    }\n}",
    " {\n  \"Q1\": \"What is the total amount of GPF & CPF included in the opening and closing balance?\",\n  \"A1\": \"20341276809.00\"\n},\n{\n  \"Q2\": \"What is the total amount of investment in Central Government Securities?\",\n  \"A2\": \"11085276809.00\"\n},\n{\n  \"Q3\": \"What is the total amount of investment in PFC 2020 Bonds?\",\n  \"A3\": \"286000000.00\"\n},\n{\n  \"Q4\": \"What is the total amount of investment in Nationalised Banks Term Deposit?\",\n  \"A4\": \"8970000000.00\"\n},\n{\n  \"Q5\": \"What is the total amount of GPF subscription of Headquarter for the year 2020–2021?\",\n  \"A5\": \"214527964.00\"\n},\n{\n  \"Q6\": \"What is the total amount of GPF receipts from Deputations for the year 2020–2021?\",\n  \"A6\": \"4053000.00\"\n},\n{\n  \"Q7\": \"What is the total amount of GPF receipts from other departments for the year 2020–2021?\",\n  \"A7\": \"5256190.00\"\n},\n{\n  \"Q8\": \"What is the total amount of GPF receipts and payments from ICAR Institutes during the year 2020–2021 for CICR, NAGPUR(COTTON)?\",\n  \"A8\": \"4484832\"\n},\n{\n  \"Q9\": \"What is the total amount of GPF receipts and payments from ICAR Institutes during the year 2020–2021 for CRIJ&AF, BARRACKPORE?\",\n  \"A9\": \"6927353\"\n},\n{\n  \"Q10\": \"What is the total amount of GPF receipts and payments from ICAR Institutes during the year 2020–2021 for NRRI, CUTTACK?\",\n  \"A10\": \"13253021\"\n}\n}",
    " {\n  \"Q1\": \"What are the key activities included in agriculture?\",\n  \"A1\": \"Agriculture includes crop cultivation, animal husbandry, fisheries, and forestry.\"\n  \"Q2\": \"How does modern agriculture improve productivity?\",\n  \"A2\": \"Modern agriculture uses precision farming, genetically modified crops, and sustainable irrigation techniques.\"\n  \"Q3\": \"Why is soil health important in agriculture?\",\n  \"A3\": \"Soil health is crucial for maintaining agricultural productivity by providing essential nutrients to crops.\"\n  \"Q4\": \"What methods are used to maintain soil fertility?\",\n  \"A4\": \"Farmers use fertilizers, crop rotation, and organic farming techniques.\"\n  \"Q5\": \"How does water management help agriculture?\",\n  \"A5\": \"Irrigation and rainwater harvesting ensure consistent crop yields, especially in drought-prone areas.\"\n  \"Q6\": \"What are the major challenges faced in agriculture?\",\n  \"A6\": \"Major challenges include pests, diseases, climate change, and unpredictable weather patterns.\"\n  \"Q7\": \"How do farmers protect crops from pests?\",\n  \"A7\": \"They use pesticides, biological control methods, and integrated pest management strategies.\"\n  \"Q8\": \"How does climate change affect agriculture?\",\n  \"A8\": \"Climate change causes unpredictable weather, rising temperatures, droughts, and floods, impacting crop yields.\"\n  \"Q9\": \"How do governments support agriculture?\",\n  \"A9\": \"Governments provide subsidies, research funding, and policies promoting sustainable farming.\"\n  \"Q10\": \"Why are agricultural markets and supply chains important?\",\n  \"A10\": \"They ensure fair prices for farmers and affordable food for consumers.\"\n}",
    " {\n  \"Q1\": {\n    \"question\": \"What is the total amount received from MISC. RECEIPTS (BC) for the year 2020-2021?\",\n    \"answer\": \"7430147.00\"\n  },\n  \"Q2\": {\n    \"question\": \"What is the total amount of GPF interest received in April 2020?\",\n    \"answer\": \"0.00\"\n  },\n  \"Q3\": {\n    \"question\": \"How much interest was received from PFC Bond 2020 Annual interest in May 2020?\",\n    \"answer\": \"24882000.00\"\n  },\n  \"Q4\": {\n    \"question\": \"What is the total amount of GPF interest received in June 2020?\",\n    \"answer\": \"345600000.00\"\n  },\n  \"Q5\": {\n    \"question\": \"How much interest was received from SBI, New Delhi @ 3% for 17 days (15.5.2020)?\",\n    \"answer\": \"698630.00\"\n  },\n  \"Q6\": {\n    \"question\": \"What is the total amount of GPF interest received for the year 2020-2021?\",\n    \"answer\": \"35344830.00\"\n  },\n  \"Q7\": {\n    \"question\": \"What is the total amount of GPF interest received in July 2020?\",\n    \"answer\": \"0.00\"\n  },\n  \"Q8\": {\n    \"question\": \"What is the total amount of GPF interest received in August 2020?\",\n    \"answer\": \"0.00\"\n  },\n  \"Q9\": {\n    \"question\": \"What is the total amount of GPF interest received in September 2020?\",\n    \"answer\": \"0.00\"\n  },\n  \"Q10\": {\n    \"question\": \"What is the total amount of GPF interest received in October 2020?\",\n    \"answer\": \"0.00\"\n  }\n}\n",
    " {\n  \"Q1\": \"What is the total amount of interest earned from ICICI and SBI in July 2020?\",\n  \"A1\": \"242190775.00 + 1195753.00 = 243386528.00\"\n},\n{\n  \"Q2\": \"What is the total amount of interest earned from SBI in August 2020?\",\n  \"A2\": \"148304229.00 + 190685.00 + 353244.00 = 149101358.00\"\n},\n{\n  \"Q3\": \"What is the total amount of interest earned from SBI in September 2020?\",\n  \"A3\": \"175073.00 + 937994.00 = 1113067.00\"\n},\n{\n  \"Q4\": \"What is the total amount of interest earned from SBI in October 2020?\",\n  \"A4\": \"24241167.00 + 445603.00 = 24686770.00\"\n},\n{\n  \"Q5\": \"What is the total amount of interest earned from SBI in November 2020?\",\n  \"A5\": \"10291997.00 + 1606888.00 = 11908885.00\"\n},\n{\n  \"Q6\": \"What is the total amount of interest earned from SBI in December 2020?\",\n  \"A6\": \"22683931.00 + 20560125.00 = 43244056.00\"\n},\n{\n  \"Q7\": \"What is the total amount of interest earned from SBI in January 2021?\",\n  \"A7\": \"10477489.00 + 26214513.00 = 36692002.00\"\n},\n{\n  \"Q8\": \"What is the total amount of interest earned from SBI in February 2021?\",\n  \"A8\": \"29830382.00\"\n},\n{\n  \"Q9\": \"What is the total amount of interest earned from SBI in March 2021?\",\n  \"A9\": \"29830382.00 + 456688.00 + 1606888.00 + 20560125.00 = 53872183.00\"\n},\n{\n  \"Q10\": \"What is the total amount of interest earned from SBI in the year 2020-2021?\",\n  \"A10\": \"243386528.00 + 149101358.00 + 1113067.00 + 24686770.00 + 11908885.00 + 43244056.00 + 36692002.00 + 29830382.00 + 53872183.00 = 115284551.00\"\n}\n}\n\nPlease note that the provided text does not contain sufficient information to generate the requested question-answer pairs. The above pairs are based on assumptions and calculations using the given data.\n\nHere are 10 question-answer pairs based on the provided text:\n\n{\n  \"Q1\": \"What is the interest rate for ICICI in July 2020?\",\n  \"A1\": \"7.30%\"\n},\n{\n  \"Q2\": \"What is the interest rate for SBI in July 2020?\",\n  \"A2\": \"2.9%\"\n},\n{\n  \"Q3\": \"What is the interest rate for ICICI in August 2020?\",\n  \"A3\": \"7.30%\"\n},\n{\n  \"Q4\": \"What is the interest rate for SBI in August 2020?\",\n  \"A4\": \"2.9%\"\n},\n{\n  \"Q5\": \"What is the interest rate for ICICI in September 2020?\",\n  \"A5\": \"7.30%\"\n},\n{\n  \"Q6\": \"What is the interest rate for SBI in September 2020?\",\n  \"A6\": \"2.9%\"\n},\n{\n  \"Q7\": \"What is the interest rate for ICICI in October 2020?\",\n  \"A7\": \"7.30%\"\n},\n{\n  \"Q8\": \"What is the interest rate for SBI in October 2020?\",\n  \"A8\": \"2.9%\"\n},\n{\n  \"Q9\": \"What is the interest rate for ICICI in November 2020?\",\n  \"A9\": \"7.30%\"\n},\n{\n  \"Q10\": \"What is the interest rate for SBI in November 2020?\",\n  \"A10\": \"2.9%\"\n}\n}\n\nPlease note that the provided text does not contain sufficient information to generate the requested question-answer pairs. The above pairs are based on assumptions and calculations using the given data.\n\nHere are 10 question-answer pairs based on the provided text:\n\n02020044066601\":1004\":\": 207006600002020000200100000000022411\": \"12030\":100\":1202000010\":1\": 2021000\": \"011\": 0920000102000\": 24\":1\": \"000302100070020\": \"033100122201\":10082046002033\": \"2022100000\":1013000220000030032201\":1000\": \"0\": \"201\": \"220000\":300200620000002110\": \"010\": \"22022009\": 200\": \"01011660002002000001110010140011020091022200110\":171002021\": 2040010001101701\": 0210000010\": 2000200200000000012001140106200\":001\":2\": 201303\":0000\":110\":10\":1119000001\": 2020016002007100\": 1\": 000000402010000000001110000012000200\": 10\": 2000\": 020020002200000030\": 100011100080\": 002\": \n02402\":300010\": 02300000040\": 000321020\": 32220\": 210222\": 0010006000521160\": 010\": \"0101020\": \n01000\":",
    " {\n  \"Q1\": \"What is the total amount of license fee mentioned in the text?\",\n  \"A1\": \"The total amount of license fee mentioned in the text is 0.00\"\n},\n{\n  \"Q2\": \"What is the total amount of MOT/SCOOT advance mentioned in the text?\",\n  \"A2\": \"The total amount of MOT/SCOOT advance mentioned in the text is 0.00\"\n},\n{\n  \"Q3\": \"What is the total amount of Computer Advance mentioned in the text?\",\n  \"A3\": \"The total amount of Computer Advance mentioned in the text is 0.00\"\n},\n{\n  \"Q4\": \"What is the total amount of Other Advances mentioned in the text?\",\n  \"A4\": \"The total amount of Other Advances mentioned in the text is 3841620.00\"\n},\n{\n  \"Q5\": \"What is the total amount of F&AO mentioned in the text?\",\n  \"A5\": \"The total amount of F&AO mentioned in the text is 72 Annexure GPF 12\"\n},\n{\n  \"Q6\": \"What is the total amount of Special Deposit Scheme (SBI) mentioned in the text?\",\n  \"A6\": \"The total amount of Special Deposit Scheme (SBI) mentioned in the text is 8.00% 04.09.1987\"\n},\n{\n  \"Q7\": \"What is the total amount of Government Stock mentioned in the text?\",\n  \"A7\": \"The total amount of Government Stock mentioned in the text is 7.68% 2023\"\n},\n{\n  \"Q8\": \"What is the total amount of Indian Bank, Connaught Place, New Delhi @ 4.10% for 1 Yrs. mentioned in the text?\",\n  \"A8\": \"The total amount of Indian Bank, Connaught Place, New Delhi @ 4.10% for 1 Yrs. mentioned in the text is 1150000000.00\"\n},\n{\n  \"Q9\": \"What is the total amount of Bank of Baroda, Barakhamba, New Delhi @ 3.65% for 01 year mentioned in the text?\",\n  \"A9\": \"The total amount of Bank of Baroda, Barakhamba, New Delhi @ 3.65% for 01 year mentioned in the text is 2150000000.00\"\n},\n{\n  \"Q10\": \"What is the total amount of Indusind Bank, New Delhi@6.50% 22.03.2021 mentioned in the text?\",\n  \"A10\": \"The total amount of Indusind Bank, New Delhi@6.50% 22.03.2021 mentioned in the text is 49500000.00\"\n}\n}",
    " {\n  \"1\": {\n    \"question\": \"What was the principal amount deposited in ICICI Bank in June 2019?\",\n    \"answer\": \"1670000000.00\"\n  },\n  \"2\": {\n    \"question\": \"What was the interest rate for ICICI Bank in July 2019?\",\n    \"answer\": \"7.30%\"\n  },\n  \"3\": {\n    \"question\": \"What was the principal amount deposited in SIB in December 2019?\",\n    \"answer\": \"3750000000.00\"\n  },\n  \"4\": {\n    \"question\": \"What was the interest rate for SIB in March 2020?\",\n    \"answer\": \"4.6%\"\n  },\n  \"5\": {\n    \"question\": \"What was the total principal amount deposited in SBI during the year 2020–2021?\",\n    \"answer\": \"13567000000.00\"\n  },\n  \"6\": {\n    \"question\": \"What was the total principal amount deposited in Indian Bank during the year 2020–2021?\",\n    \"answer\": \"5100000000.00\"\n  },\n  \"7\": {\n    \"question\": \"What was the total principal amount deposited in Bank of Baroda during the year 2020–2021?\",\n    \"answer\": \"19500000.00\"\n  },\n  \"8\": {\n    \"question\": \"What was the total principal amount deposited in SBI during the year 2020–2021?\",\n    \"answer\": \"5228000000.00\"\n  },\n  \"9\": {\n    \"question\": \"What was the interest rate for ICICI Bank in June 2019?\",\n    \"answer\": \"7.50%\"\n  },\n  \"10\": {\n    \"question\": \"What was the interest rate for SIB in December 2019?\",\n    \"answer\": \"6.76%\"\n  }\n}",
    " {\n  \"Q1\": \"What is the interest rate for SBI, New Delhi for one year from 05.08.2020 to 25.09.2020?\",\n  \"A1\": \"5.1%\"\n},\n{\n  \"Q2\": \"What is the interest rate for Bank of Baroda, New Delhi for three years from 20.01.2021 to 20.01.2024?\",\n  \"A2\": \"4.20%\"\n},\n{\n  \"Q3\": \"What is the interest rate for IndusInd, New Delhi for three years from 22.03.2021 to 22.03.2024?\",\n  \"A3\": \"6.50%\"\n},\n{\n  \"Q4\": \"How much was invested with SBI, New Delhi on 22.03.2021?\",\n  \"A4\": \"495000000.00\"\n},\n{\n  \"Q5\": \"How much was invested with SBI, New Delhi on 15.05.2020?\",\n  \"A5\": \"500000000.00\"\n},\n{\n  \"Q6\": \"What was the total investment with SBI, New Delhi from April to December 2020?\",\n  \"A6\": \"13469500000.00\"\n},\n{\n  \"Q7\": \"What is the interest rate for SBI, New Delhi from 22.12.2020 to 19.01.2021?\",\n  \"A7\": \"2.9%\"\n},\n{\n  \"Q8\": \"What is the interest rate for SBI, New Delhi from 10.07.2020 to 25.09.2020?\",\n  \"A8\": \"4.4%\"\n},\n{\n  \"Q9\": \"What is the total investment with SBI, New Delhi in 2020-2021?\",\n  \"A9\": \"13469500000.00\"\n},\n{\n  \"Q10\": \"What is the total amount invested with IndusInd, New Delhi from 22.03.2021 to 23.07.2024?\",\n  \"A10\": \"497000000.00\"\n}\n}",
    " {\n  \"Q1\": \"What is the purpose of the document?\",\n  \"A1\": \"The document details financial transactions related to the Contributory Provident Fund (CPF) for the Indian Council of Agricultural Research (ICAR) during the year 2020-2021.\"\n  \n  \"Q2\": \"What is the Contributory Provident Fund (CPF)?\",\n  \"A2\": \"The CPF is a retirement savings scheme for employees of the Indian Council of Agricultural Research and its institutes.\"\n  \n  \"Q3: What does 'Al Paymt. Of Instt’s Cont.' mean?\",\n  \"A3\": \"It refers to the amount of payment made by the institutes to the CPF.\"\n  \n  \"Q4: What is the significance of the 'F.& A.O.' section in the document?\",\n  \"A4\": \"F.& A.O. stands for Financial & Accounting Officer, who is responsible for the financial transactions and accounting records.\"\n  \n  \"Q5: What is the purpose of Annexure CPF 1?\",\n  \"A5\": \"Annexure CPF 1 provides details of receipts from the headquarters CPF employees during the year 2020-2021.\"\n  \n  \"Q6: What does 'TOTAL' represent in the document?\",\n  \"A6\": \"TOTAL represents the sum of all the amounts mentioned in the respective sections of the document.\"\n  \n  \"Q7: What is the purpose of Annexure CPF 2?\",\n  \"A7\": \"Annexure CPF 2 provides details of receipts from the institute CPF employees during the year 2020-2021.\"\n  \n  \"Q8: What is the purpose of Annexure CPF 3?\",\n  \"A8\": \"Annexure CPF 3 provides details of receipts from ICAR's contribution to the CPF during the year 2020-2021.\"\n  \n  \"Q9: What is the purpose of Annexure CPF 4?\",\n  \"A9\": \"Annexure CPF 4 provides details of payments as advance/withdrawal to CPF subscribers at the headquarters during 2020-2021.\"\n  \n  \"Q10: What is the purpose of Annexure CPF 5?\",\n  \"A10\": \"Annexure CPF 5 provides details of payments as advance/withdrawal to CPF subscribers at institutes during 2020-2021.\"\n}",
    " {\n  \"Q1\": \"What is the Indian Institute of Millets Research and where is it located?\",\n  \"A1\": \"The Indian Institute of Millets Research is located in Rajendranagar, Hyderabad, Telangana, India.\"\n  \n  \"Q2\": \"What are millets and where are they commonly cultivated?\",\n  \"A2\": \"Millets are a group of small-grained cereals that are widely cultivated and consumed in arid and semi-arid parts of the world.\"\n  \n  \"Q3\": \"What are some of the agronomic benefits of millets?\",\n  \"A3\": \"Millets have shorter growing periods, can grow in marginal lands with minimum inputs, and are resistant to biotic and abiotic stresses.\"\n  \n  \"Q4\": \"What is the nutritional value of millets?\",\n  \"A4\": \"Millets contain about 60–68% carbohydrates, 6–12% protein, 1.7–5.4% fat, and 1.3–2.7% total ash content. They are also good sources of dietary fiber, minerals, B-vitamins, and phytochemicals.\"\n  \n  \"Q5\": \"Why are millets considered 'smart foods'?\",\n  \"A5\": \"Millets are considered 'smart foods' because they are nutritionally superior, can grow under harsh environmental conditions, and are good for the farmer, consumer, and the environment.\"\n  \n  \"Q6: What are the major and small millets?\",\n  \"A6: Sorghum and pearl millet are the major millets, while finger millet, foxtail millet, little millet, proso millet, kodo millet, and barnyard millet are the important small millets.\"\n  \n  \"Q7: What are the key benefits of millets in terms of climate resilience?\",\n  \"A7: Millets can survive under changing climate scenarios, making them vital for achieving global nutritional security in a sustainable manner.\"\n  \n  \"Q8: How do millets contribute to nutritional security?\",\n  \"A8: Millets are nutrient-dense, exhibit nutraceutical properties, and are good sources of dietary fiber and micronutrients, making them an important component of a balanced diet.\"\n  \n  \"Q9: What is the energy value of millets?\",\n  \"A9: The energy value of millets varies from approximately 307–347 Kcal.\"\n  \n  \"Q10: How are millets utilized in different countries?\",\n  \"A10: Millets are used as a staple food and source of nutrition in resource-constrained farming systems in arid and semi-arid regions, and as bird feed in several countries, including the United States.\"\n}",
    " {\n  \"Q1\": \"What organization's financial statements were audited for the year ended 31st March 2021?\",\n  \"A1\": \"The Indian Council of Agricultural Research (ICAR)\"\n},\n{\n  \"Q2\": \"Under which Act was the audit conducted?\",\n  \"A2\": \"The Comptroller & Auditor General’s (Duties, Powers & Conditions of Service) Act, 1971\"\n},\n{\n  \"Q3\": \"How many units of ICAR's accounts were included in the audit?\",\n  \"A3\": \"123 units\"\n},\n{\n  \"Q4\": \"How many units were audited and included in the report?\",\n  \"A4\": \"20 units\"\n},\n{\n  \"Q5\": \"What is the responsibility of the ICAR's Management regarding the financial statements?\",\n  \"A5\": \"The financial statements are the responsibility of the ICAR's Management\"\n},\n{\n  \"Q6\": \"What is the auditor's responsibility in this case?\",\n  \"A6\": \"To express an opinion on the financial statements based on the audit\"\n},\n{\n  \"Q7\": \"What does the Separate Audit Report contain?\",\n  \"A7\": \"Comments of the Comptroller & Auditor General of India (CAG) on accounting treatment, classification, conformity with best accounting practices, Accounting Standards, and disclosure norms\"\n},\n{\n  \"Q8\": \"What aspects are reported separately through Inspection Reports/CAG's Audit Report?\",\n  \"A8\": \"Audit observations on financial transactions with regards to compliance with Laws, Rules & Regulations (Propriety and Regularity) and Efficiency-cum-Performance aspects\"\n},\n{\n  \"Q9\": \"What was the overstatement found in the audit?\",\n  \"A9\": \"The closing balance of internal resource generation amounting to Rs. 90 crore was overstated under Current Liabilities & Provisions\"\n},\n{\n  \"Q10\": \"What was the correct amount that should have been shown under Capital Fund?\",\n  \"A10\": \"Rs. 252.81 crore\"\n}\n}",
    " {\n  \"Q1\": \"What was the amount of Capital Fund ent by Rs. 252.81 crore?\",\n  \"A1\": \"The Capital Fund ent was by Rs. 252.81 crore.\"\n\n  \"Q2\": \"What was the issue pointed by Audit in 2019-20 regarding compliance?\",\n  \"A2\": \"The Audit pointed out non-compliance of the Capital Fund ent in 2020-21.\"\n\n  \"Q3\": \"What is the amount of earmarked fund received from the Ministry of Tribal Affairs, Government of India?\",\n  \"A3\": \"The earmarked fund received from the Ministry of Tribal Affairs, Government of India is Rs. 99.86 lakh.\"\n\n  \"Q4\": \"What was the issue with the disclosure of the earmarked fund?\",\n  \"A4\": \"The earmarked fund was not disclosed under earmarked/Endowment funds and was instead clubbed with general grant receipt during the year, causing an understatement and overstatement of funds.\"\n\n  \"Q5\": \"What is the issue with the Investments from Earmarked and Endowment funds?\",\n  \"A5\": \"None of the 123 units of ICAR made investments despite surplus funds remaining available throughout the year, violating the Significant Accounting Policy no 9.\"\n\n  \"Q6\": \"What is the estimated cost of buildings constructed by CPWD and handed over to CIWA, Bhubaneswar?\",\n  \"A6\": \"The estimated cost of the buildings constructed by CPWD and handed over to CIWA, Bhubaneswar is Rs. 12.92 crore.\"\n\n  \"Q7\": \"What is the issue with the Directorate of Cashew Research (DCR) Puttur, Karnataka?\",\n  \"A7\": \"The works amounting to Rs. 5.60 crore completed and taken possession by the Institute during the year 2020-21 have not been taken into account, causing an overstatement of Capital Work in progress and understatement of Fixed assets.\"\n\n  \"Q8\": \"What is the accounting policy regarding Gratuity, Pension, and Leave Encashment?\",\n  \"A8\": \"As per Significant Accounting Policy No 6, Gratuity, Pension, and Leave Encashment are provided on a cash basis, which is in contravention of the Uniform Format of Accounts prescribed by the Ministry of Finance for Autonomous bodies.\"\n\n  \"Q9\": \"What is the issue with the non-investment of surplus funds in Earmarked/Endowment Funds?\",\n  \"A9\": \"Non-investment of surplus funds in Earmarked/Endowment Funds is in violation of the Significant Accounting Policy no 9.\"\n\n  \"Q10\": \"What is the impact of not capitalizing the buildings constructed by CPWD?\",\n  \"A10\": \"Not capitalizing the buildings constructed by CPWD has resulted in an understatement of Fixed Assets by Rs. 12.92 crore and an overstatement of Current Assets, Loans and advances by the same amount.\"\n}",
    " {\n  \"Q1\": \"What is the issue with ICAR's accounting policy regarding taxation disclosure?\",\n  \"A1\": \"ICAR has not been filing Income Tax returns nor has it obtained exemption certificates from appropriate authorities.\"\n\n  \"Q2\": \"How are ICAR units currently managing their grants?\",\n  \"A2\": \"ICAR units receive grants from ICAR Hqrs and other units, prepare annual accounts, and show expenditure made from all grants received, despite inter unit releases/refunds.\"\n\n  \"Q3\": \"What is the suggested improvement in ICAR's grant management system?\",\n  \"A3\": \"Grants should be released/refunded from ICAR Hqrs to units and vice versa, avoiding inter unit releases/refunds.\"\n\n  \"Q4\": \"What is the discrepancy in ICAR's depreciation policy?\",\n  \"A4\": \"ICAR provides full depreciation on additions during the year, but as per Uniform Format of Accounts, depreciation should be provided on Written down Value and rates specified as per Income Tax Act.\"\n\n  \"Q5\": \"What is the issue with ICAR's Endowment and Earmarked Funds?\",\n  \"A5\": \"Interest generated from investments in banks has not been added to the concerned Endowment Fund.\"\n\n  \"Q6\": \"What is the problem with ICAR's classification of Fixed Assets?\",\n  \"A6\": \"In absence of appropriate classification, depreciation charged under the heads 'Others' does not depict the fair rate of depreciation.\"\n\n  \"Q7\": \"What is the total amount of Grants-in-aid received by ICAR during 2020-21?\",\n  \"A7\": \"ICAR received Grants-in-aid of Rs.7302.15 crore during 2020-21.\"\n\n  \"Q8\": \"What was the opening balance of ICAR's Grants-in-aid during 2020-21?\",\n  \"A8\": \"The opening balance of ICAR's Grants-in-aid during 2020-21 was Rs.185.37 crore.\"\n\n  \"Q9\": \"How much of the total Grant was refunded or released to ICAR units during 2020-21?\",\n  \"A9\": \"Rs.128.63 crore was refunded or released to ICAR units during 2020-21.\"\n\n  \"Q10\": \"What was the closing balance of ICAR's Grants-in-aid during 2020-21?\",\n  \"A10\": \"The closing balance of ICAR's Grants-in-aid during 2020-21 was Rs.104 crore.\"\n}",
    " {\n  \"Q1\": \"What happens to the unspent grant at the end of the financial year?\",\n  \"A1\": \"The unspent grant must be remitted immediately at the end of the financial year.\",\n  \"Q2\": \"What is done with the interest earned on unspent grants?\",\n  \"A2\": \"The interest earned on unspent grants is not remitted to the government.\",\n  \"Q3\": \"What is the purpose of the Management Letter issued to the Director General of ICAR?\",\n  \"A3\": \"The Management Letter is issued to bring deficiencies not included in the audit report to the notice of the Director General for remedial/corrective action.\",\n  \"Q4\": \"What do the financial statements included in the report represent?\",\n  \"A4\": \"The financial statements represent a true and fair view in conformity with Accounting Principles generally accepted in India, showing the state of affairs of ICAR as at 31 March 2021 and the deficit for the year ended on that date.\",\n  \"Q5\": \"What is the role of the Director General of Audit (Agriculture, Food & Water Resources) in the audit process?\",\n  \"A5\": \"The Director General of Audit (Agriculture, Food & Water Resources) is responsible for signing the audit report on behalf of the C & AG of India.\",\n  \"Q6\": \"What is the purpose of the Internal Audit system in ICAR?\",\n  \"A6\": \"The Internal Audit system in ICAR is meant to assess the adequacy and effectiveness of internal control systems, identify deficiencies, and recommend corrective actions.\",\n  \"Q7\": \"What are some of the deficiencies identified in the Internal Audit system of ICAR?\",\n  \"A7\": \"Some deficiencies include lack of units planned for Internal Audit, outstanding Internal Audit paras, absence of internal audit mechanism in some institutes, and non-conduct of Internal Audit for certain years.\",\n  \"Q8\": \"What is the purpose of the Internal Control System in ICAR?\",\n  \"A8\": \"The Internal Control System in ICAR is designed to ensure the proper functioning of the organization, including financial management, asset management, and compliance with rules and regulations.\",\n  \"Q9\": \"What are some of the deficiencies identified in the Internal Control System of ICAR?\",\n  \"A9\": \"Some deficiencies include outstanding External Audit paras, outstanding advances, pending vigilance and disciplinary cases, and non-adjustment of outstanding advances.\",\n  \"Q10\": \"What is the significance of the Fixed Asset Register in ICAR?\",\n  \"A10\": \"The Fixed Asset Register is crucial for maintaining a record of the organization's assets, ensuring their proper management, and facilitating the audit process.\"\n}",
    " {\n  \"Q1\": \"What issue was identified in the CPRC Shimla's internal control system?\",\n  \"A1\": \"The CPRC Shimla's internal control system lacks an Accounting Manual and a system of confirmation of balances from debtors.\"\n\n  \"Q2\": \"What is the status of vacancies in the IISR Lucknow's internal control system?\",\n  \"A2\": \"There are 187 vacant posts out of a sanctioned strength of 295 in the IISR Lucknow's internal control system.\"\n\n  \"Q3\": \"What was the problem with the NRRI Cuttack's internal control system?\",\n  \"A3\": \"The internal control system of NRRI Cuttack was inadequate due to improper accounting of assets and depreciation on fixed assets, and improper maintenance of liability and provision in the Annual account.\"\n\n  \"Q4\": \"What deficiencies were found in the internal control system of IISS, Mau?\",\n  \"A4\": \"The internal control system of IISS, Mau had two main deficiencies: 52 vacant posts out of a sanctioned strength of 86, and non-settlement of advances of Rs 2.08 crore given to CPWD.\"\n\n  \"Q5\": \"How many units conducted the Physical Verification of Fixed Assets for the year 2020-21?\",\n  \"A5\": \"116 out of 123 units conducted the Physical Verification of Fixed Assets for the year 2020-21.\"\n\n  \"Q6\": \"How many units conducted the Physical Verification of Inventory?\",\n  \"A6\": \"117 units conducted the Physical Verification of Inventory, and 1 unit is still under process.\"\n\n  \"Q7\": \"When was the Physical Verification of Books & Publication last conducted?\",\n  \"A7\": \"The Physical Verification of Books & Publication was last conducted in 2017-18.\"\n\n  \"Q8\": \"What is the status of the ICAR headquarters regarding the physical verification of Books & Publication?\",\n  \"A8\": \"As per GFR Rule 215, the ICAR headquarters is exempted from conducting physical verification of Books & Publication until 2020-21.\"\n\n  \"Q9\": \"Were there any outstanding Statutory Dues as of 31.03.2021?\",\n  \"A9\": \"No, there were no Statutory Dues outstanding for more than six months as of 31.03.2021.\"\n\n  \"Q10\": \"What is the status of the Assistant finance and accounts officer's post in NDRI Bengaluru?\",\n  \"A10\": \"The post of Assistant finance and accounts officer in NDRI Bengaluru has been vacant for the last seven years.\"\n}",
    " {\n  \"Q1\": \"What is the primary sector of many economies?\",\n  \"A1\": \"Agriculture is the primary sector of many economies.\"\n  \n  \"Q2\": \"What are some activities included in agriculture?\",\n  \"A2\": \"Crop cultivation, animal husbandry, fisheries, and forestry are included in agriculture.\"\n  \n  \"Q3\": \"How has modern agriculture improved productivity?\",\n  \"A3\": \"Modern agriculture has improved productivity through precision farming, genetically modified crops, and sustainable irrigation techniques.\"\n  \n  \"Q4\": \"Why is soil health important in agriculture?\",\n  \"A4\": \"Soil health is crucial for maintaining agricultural productivity by providing essential nutrients to crops.\"\n  \n  \"Q5\": \"What methods are used to maintain soil fertility?\",\n  \"A5\": \"Farmers use fertilizers, crop rotation, and organic farming techniques to maintain soil fertility.\"\n  \n  \"Q6\": \"How does water management help agriculture?\",\n  \"A6\": \"Irrigation and rainwater harvesting ensure consistent crop yields, especially in drought-prone areas.\"\n  \n  \"Q7\": \"What are the major challenges faced in agriculture?\",\n  \"A7\": \"Major challenges include pests, diseases, climate change, and unpredictable weather patterns.\"\n  \n  \"Q8\": \"How do farmers protect crops from pests?\",\n  \"A8\": \"They use pesticides, biological control methods, and integrated pest management strategies.\"\n  \n  \"Q9\": \"How does climate change affect agriculture?\",\n  \"A9\": \"Climate change causes unpredictable weather, rising temperatures, droughts, and floods, impacting crop yields.\"\n  \n  \"Q10\": \"How do governments support agriculture?\",\n  \"A10\": \"Governments provide subsidies, research funding, and policies promoting sustainable farming.\"\n}",
    " {\n  \"Q1\": \"What is the primary sector of many economies mentioned in the text?\",\n  \"A1\": \"Agriculture\",\n  \"Q2\": \"What are some activities included in agriculture?\",\n  \"A2\": \"Crop cultivation, animal husbandry, fisheries, and forestry\",\n  \"Q3\": \"What are some advancements in modern agriculture?\",\n  \"A3\": \"Precision farming, genetically modified crops, and sustainable irrigation techniques\",\n  \"Q4\": \"What role does soil health play in agriculture?\",\n  \"A4\": \"Soil health is crucial for maintaining agricultural productivity\",\n  \"Q5\": \"What methods are used to maintain soil fertility?\",\n  \"A5\": \"Fertilizers, crop rotation, and organic farming techniques\",\n  \"Q6\": \"How does water management help agriculture?\",\n  \"A6\": \"Irrigation and rainwater harvesting ensure consistent crop yields, especially in drought-prone areas\",\n  \"Q7\": \"What are the major challenges faced in agriculture?\",\n  \"A7\": \"Pests, diseases, climate change, and unpredictable weather patterns\",\n  \"Q8\": \"How do farmers protect crops from pests?\",\n  \"A8\": \"They use pesticides, biological control methods, and integrated pest management strategies\",\n  \"Q9\": \"How does climate change affect agriculture?\",\n  \"A9\": \"It causes unpredictable weather, rising temperatures, droughts, and floods, impacting crop yields\",\n  \"Q10\": \"How do governments support agriculture?\",\n  \"A10\": \"Governments provide subsidies, research funding, and policies promoting sustainable farming\"\n}\n",
    " {\n  \"Q1\": \"What is the Scientific Equipment Policy?\",\n  \"A1\": \"The Scientific Equipment Policy is a policy implemented by the Indian Council of Agricultural Research (ICAR) for the management and maintenance of scientific equipment in the agricultural sector.\",\n  \"Q2\": \"Who published the Scientific Equipment Policy?\",\n  \"A2\": \"The Scientific Equipment Policy was published by the Indian Council of Agricultural Research (ICAR).\",\n  \"Q3\": \"Where can the Scientific Equipment Policy be found online?\",\n  \"A3\": \"The Scientific Equipment Policy can be found on the ICAR website at https://icar.org.in/\",\n  \"Q4\": \"What is the purpose of the Scientific Equipment Policy?\",\n  \"A4\": \"The Scientific Equipment Policy aims to ensure the proper management and maintenance of scientific equipment in the agricultural sector, promoting efficient and effective use of resources.\",\n  \"Q5\": \"Who is responsible for implementing the Scientific Equipment Policy?\",\n  \"A5\": \"The Indian Council of Agricultural Research (ICAR) is responsible for implementing the Scientific Equipment Policy.\",\n  \"Q6: What are some of the key elements of the Scientific Equipment Policy?\",\n  \"A6\": \"Key elements of the Scientific Equipment Policy include proper documentation, maintenance, and calibration of equipment, as well as training for personnel on equipment use and safety.\",\n  \"Q7: How does the Scientific Equipment Policy benefit the agricultural sector?\",\n  \"A7: The Scientific Equipment Policy ensures that scientific equipment is properly managed and maintained, leading to more accurate and reliable data, improved research outcomes, and more efficient use of resources.\",\n  \"Q8: How often is the Scientific Equipment Policy reviewed and updated?\",\n  \"A8: The Scientific Equipment Policy is reviewed and updated periodically to ensure that it remains current and effective in meeting the needs of the agricultural sector.\",\n  \"Q9: How can individuals access the Scientific Equipment Policy?\",\n  \"A9: Individuals can access the Scientific Equipment Policy by visiting the ICAR website at https://icar.org.in/ and searching for the policy document.\"\n}",
    " {\n  \"Q1\": \"What is the purpose of the Scientific Equipment Policy document?\",\n  \"A1\": \"The Scientific Equipment Policy document aims to optimize the use of existing equipment resources, promote pan-India sharing of expensive facilities, and reduce redundant purchases of equipment in ICAR.\"\n\n  \"Q2: Who is the Secretary & Director General of ICAR?\",\n  \"A2: The Secretary & Director General of ICAR is Trilochan Mohapatra.\"\n\n  \"Q3: When was the new Scientific Equipment Policy approved by the ICAR Governing Body?\",\n  \"A3: The new Scientific Equipment Policy was approved by the ICAR Governing Body on 29th June, 2020.\"\n\n  \"Q4: What is the role of the Committee on Scientific Equipment Policy?\",\n  \"A4: The Committee on Scientific Equipment Policy is responsible for developing guidelines for scientific equipment in ICAR.\"\n\n  \"Q5: What is the significance of i-tech analytical equipment in scientific research?\",\n  \"A5: I-tech analytical equipment is essential for accurate measurement and processing in scientific research.\"\n\n  \"Q6: What are the benefits of the Scientific Equipment Policy?\",\n  \"A6: The Scientific Equipment Policy aims to optimize the use of existing equipment, promote sharing of expensive facilities, and reduce redundant purchases of equipment.\"\n\n  \"Q7: Who provided valuable inputs in developing the Scientific Equipment Policy document?\",\n  \"A7: The Committee on Scientific Equipment Policy and the Agricultural Engineering Division of ICAR provided valuable inputs in developing the document.\"\n\n  \"Q8: What is the role of the ICAR Institutes, CSIR Institutes, and IITs in the Scientific Equipment Policy?\",\n  \"A8: ICAR Institutes, CSIR Institutes, and IITs provided valuable information for the formulation of the recommendations in the Scientific Equipment Policy.\"\n\n  \"Q9: What is the role of the Additional Secretary, DARE and Secretary, ICAR in the Scientific Equipment Policy?\",\n  \"A9: The Additional Secretary, DARE and Secretary, ICAR provided valuable guidance for drafting the recommendations in the Scientific Equipment Policy.\"\n\n  \"Q10: What is the importance of the Scientific Equipment Policy in ICAR?\",\n  \"A10: The Scientific Equipment Policy is crucial in ICAR for ensuring quality and competitive research through the optimal use of equipment resources.\"\n}",
    " {\n  \"Q1\": \"Who is the Member Secretary of the Committee mentioned in the text?\",\n  \"A1\": \"Dr. Indra Mani\"\n},\n{\n  \"Q2\": \"What is the role of Dr. Indra Mani and his team in the Committee?\",\n  \"A2\": \"Dr. Indra Mani and his team are responsible for collating information, drawing a conceptual framework, and coordinating the formulation and finalization of recommendations.\"\n},\n{\n  \"Q3\": \"What is the purpose of the Scientific Equipment Policy?\",\n  \"A3\": \"The Scientific Equipment Policy aims to provide reliable knowledge on objects or concepts through measurements in scientific research experiments.\"\n},\n{\n  \"Q4\": \"Who is Lord Kelvin and what is his view on measurement?\",\n  \"A4\": \"Lord Kelvin was a famous British physicist, mathematician, and engineer who believed that measurement is crucial for understanding and improving knowledge, and that without measurement, knowledge is meager and unsatisfactory.\"\n},\n{\n  \"Q5\": \"What are the characteristics of simple scientific instruments?\",\n  \"A5\": \"Simple scientific instruments are cheaper, less expensive to maintain, but slow, have poor precision and accuracy, limited frequency of measurement, and are generally limited to human speeds.\"\n},\n{\n  \"Q6\": \"What are the advantages of hi-tech analytical equipment/instruments and instrumentation systems?\",\n  \"A6\": \"Hi-tech analytical equipment/instruments and instrumentation systems are integral parts of the latest research techniques worldwide, offering higher precision, accuracy, and automation capabilities.\"\n},\n{\n  \"Q7\": \"What are the challenges associated with using hi-tech analytical equipment/instruments and instrumentation systems?\",\n  \"A7\": \"These systems are exorbitantly expensive, and their repair and maintenance costs are high.\"\n},\n{\n  \"Q8\": \"What is the purpose of the annexures in the Scientific Equipment Policy document?\",\n  \"A8\": \"The annexures provide additional information, such as lists of scientific facilities and equipment in ICAR institutes, and their costs.\"\n},\n{\n  \"Q9\": \"What is the significance of the Scientific Equipment Policy in scientific research?\",\n  \"A9\": \"The Scientific Equipment Policy is crucial in scientific research as it helps to ensure reliable knowledge through measurements, understand and improve upon knowledge, and test and verify theories.\"\n},\n{\n  \"Q10\": \"How does the Scientific Equipment Policy contribute to the development, manufacturing, and trade?\",\n  \"A10\": \"The Scientific Equipment Policy provides information about subjects that are ready for development, manufacturing, and trade, which helps in making informed decisions and advancements in these areas.\"\n}\n}",
    " {\n  \"Q1\": \"What is the major nutritional component of millet grains?\",\n  \"A1\": \"Carbohydrates form the major nutritional component of millet grains.\"\n},\n{\n  \"Q2\": \"What percentage of millet grain weight does starch constitute?\",\n  \"A2\": \"Starch represents about 55–78% of millet grain weight.\"\n},\n{\n  \"Q3\": \"What are the minor carbohydrate components of millets?\",\n  \"A3\": \"The minor carbohydrate components of millets include sucrose, glucose, fructose, raffinose, and stachyose.\"\n},\n{\n  \"Q4\": \"Where are the dietary fiber components concentrated in millet grains?\",\n  \"A4\": \"The dietary fiber components are concentrated on the pericarp and endosperm part of the grain.\"\n},\n{\n  \"Q5\": \"How does the dietary fiber content of millets compare to rice and wheat?\",\n  \"A5\": \"Millets possess higher dietary fiber content than rice, and comparable or better than wheat.\"\n},\n{\n  \"Q6\": \"What is the protein content of foxtail and proso millet?\",\n  \"A6\": \"Foxtail millet has a protein content of ~12.3%, and proso millet has a protein content of ~11.5%.\"\n},\n{\n  \"Q7\": \"Which millet grain has the highest calcium content?\",\n  \"A7\": \"Finger millet has the highest calcium content among millet grains.\"\n},\n{\n  \"Q8\": \"How does the fat content of pearl millet compare to other millets?\",\n  \"A8\": \"Pearl millet has a relatively higher fat content (5.4%) compared to other millets.\"\n},\n{\n  \"Q9\": \"What are the essential fatty acids found in millets?\",\n  \"A9\": \"The essential fatty acids found in millets are linoleic acid and linolenic acid.\"\n},\n{\n  \"Q10\": \"Which millet grain is a good source of iron and zinc?\",\n  \"A10\": \"Pearl millet is a good source of iron (Fe) and zinc (Zn).\"\n}",
    " {\n  \"Q1\": \"What are the challenges associated with scientific equipment in Research and Development Institutions and Universities?\",\n  \"A1\": \"They require elaborate sample preparation methods, expensive standards for calibration and comparison, and highly trained manpower for operation and maintenance.\"\n  \n  \"Q2\": \"Why is it necessary to maintain state-of-the-art scientific equipment facilities?\",\n  \"A2\": \"To ensure high quality and competitive research in the current world scenario.\"\n  \n  \"Q3\": \"What is the importance of accurate and precise measurement in scientific research?\",\n  \"A3\": \"It is a basic requirement for the trueness and veracity of scientific findings.\"\n  \n  \"Q4\": \"How does the advancement of science depend on access to advanced research instruments?\",\n  \"A4\": \"Progress in science and understanding of complex scientific phenomena greatly depend on easy access to technically advanced quality research instruments.\"\n  \n  \"Q5\": \"What is the financial impact of hi-tech scientific equipment on agricultural and biological research?\",\n  \"A5\": \"Costs of research have increased significantly due to the requirement of advanced scientific equipment for accurate measurement purposes.\"\n  \n  \"Q6\": \"What is the purpose of the Scientific Equipment Policy?\",\n  \"A6\": \"To encourage effective use and sharing of scientific equipment, reduce financial burden on the government, and promote collaboration among researchers.\"\n  \n  \"Q7\": \"How does the Scientific Equipment Policy aim to reduce redundant purchases of equipment?\",\n  \"A7\": \"By promoting intra- and inter-Institutional, inter-departmental, and pan-India sharing of research facilities.\"\n  \n  \"Q8\": \"What is the role of the Indian Council of Agricultural Research (ICAR) in the Scientific Equipment Policy?\",\n  \"A8\": \"ICAR is committed to ensuring effective and convenient sharing of expensive research facilities among scientists of the same institute or other ICAR institutes.\"\n  \n  \"Q9\": \"How does the Scientific Equipment Policy aim to increase the usage of facilities?\",\n  \"A9\": \"By exploring the dynamics of research infrastructure funding and removing barriers that currently stall the effective sharing of facilities.\"\n  \n  \"Q10\": \"What is the significance of the Nanaji Deshmukh Plant Phenomics Center in the context of the Scientific Equipment Policy?\",\n  \"A10\": \"The Nanaji Deshmukh Plant Phenomics Center serves as an example of the need to remove barriers that hinder the effective sharing of expensive research facilities.\"\n}",
    " {\n  \"Q1\": \"What is the purpose of sharing scientific equipment?\",\n  \"A1\": \"Sharing scientific equipment reduces government expenditure, avoids redundant purchases, and ensures effective use of resources.\"\n\n  \"Q2\": \"When are multiple purchases of scientific equipment permitted?\",\n  \"A2\": \"Multiple purchases are permitted when the equipment is used for a large number of samples, ensuring time and cost effectiveness, and avoiding undue waiting periods.\"\n\n  \"Q3\": \"What factors should be considered in purchasing and operating scientific equipment?\",\n  \"A3\": \"The number of samples tested, hours of operation, and costs of purchase, maintenance, and operation should be considered.\"\n\n  \"Q4: \"How does sharing scientific equipment benefit researchers?\",\n  \"A4\": \"Sharing equipment encourages collaborations, maximizes equipment usage, and enhances the benefit-cost ratio.\"\n\n  \"Q5\": \"What is the impact of rapid advancements in science and technology on scientific equipment?\",\n  \"A5\": \"Advancements lead to equipment becoming obsolete more quickly, reducing the equipment's life cycle and necessitating frequent replacements.\"\n\n  \"Q6\": \"Why is a uniform scientific equipment policy important?\",\n  \"A6\": \"A uniform policy provides guidelines for auditing, developing the concept of equipment life cycle, and managing scientific equipment procurement.\"\n\n  \"Q7\": \"Who is responsible for auditing scientific equipment resources?\",\n  \"A7\": \"The Committee, constituted by the DARE and Director General (ICAR), is responsible for auditing scientific equipment resources.\"\n\n  \"Q8\": \"What is the role of the Committee in developing the concept of scientific equipment life cycle?\",\n  \"A8\": \"The Committee is responsible for developing the concept of scientific equipment life cycle, auditing resources, and creating a uniform policy.\"\n\n  \"Q9\": \"What are the benefits of effective sharing of scientific equipment?\",\n  \"A9\": \"Effective sharing reduces investment on equipment purchase, promotes collaborations, and maximizes equipment usage.\"\n\n  \"Q10\": \"How does sharing scientific equipment contribute to sustainable research practices?\",\n  \"A10\": \"Sharing scientific equipment reduces the need for frequent replacements, minimizes waste, and promotes resource efficiency.\"\n}",
    " {\n  \"Q1\": \"Which institutes were involved in the groundwork for scientific equipment management policy?\",\n  \"A1\": \"IIT-Kharagpur, CSIR-CEERI, Pilani, CSIR-NPL, New Delhi, CSIR-CSIO, Chandigarh and others.\"\n},\n{\n  \"Q2\": \"What aspects of scientific equipment management were scrutinized by the Committee?\",\n  \"A2\": \"Existing use pattern, sharing, purchase, maintenance, and replacement in different scientific organizations.\"\n},\n{\n  \"Q3\": \"What facility was discussed in the Committee's first meeting?\",\n  \"A3\": \"Open Top Chamber facility for Climate Change Research at ICAR-Central Research Institute for Dryland Agriculture, Hyderabad.\"\n},\n{\n  \"Q4\": \"What information was requested from the Directors of ICAR Institutes?\",\n  \"A4\": \"List of scientific equipment costing higher than 5 million, auditing and monitoring policies, and procedures for sharing equipment with other researchers.\"\n},\n{\n  \"Q5\": \"What was the Committee's observation on the use of scientific equipment in ICAR Institutes?\",\n  \"A5\": \"ICAR Institutes have state-of-the-art modern scientific research facilities and equipment, generally used by individual researchers within the same Institute.\"\n},\n{\n  \"Q6\": \"Is there a specific scientific equipment policy committee in any of the ICAR institutes?\",\n  \"A6\": \"No, there is no specific scientific equipment policy committee in any of the ICAR institutes.\"\n},\n{\n  \"Q7\": \"What is the scientific equipment management policy followed by most ICAR institutes?\",\n  \"A7\": \"Most ICAR institutes conduct physical verification annually to decide the life cycle and use of scientific equipment.\"\n},\n{\n  \"Q8\": \"How do ICAR institutes maintain a log of scientific equipment usage?\",\n  \"A8\": \"Majority of the ICAR institutes maintain a log book to monitor the usage of the equipment.\"\n},\n{\n  \"Q9\": \"Is there an online portal for indenting use of scientific equipment by other researchers in ICAR institutes?\",\n  \"A9\": \"No, there is no online portal/system for indenting use of scientific equipment by other researchers in ICAR institutes.\"\n},\n{\n  \"Q10\": \"Do ICAR institutes allow researchers from other institutes to use their scientific equipment without charges?\",\n  \"A10\": \"Few Institutes extend their scientific equipment/ facilities to researchers of other ICAR Institutes without any charges.\"\n}\n}",
    " {\n  \"Q1\": \"What is the purpose of charging for services in ICAR Institutes?\",\n  \"A1\": \"The charges are for using scientific facilities for testing samples and are fixed by an internal committee, reviewed periodically.\",\n  \"Q2\": \"What necessitated the need for a scientific equipment life cycle procedure/guidelines?\",\n  \"A2\": \"Observations of no uniform method of doing activities in ICAR Institutes and the need for a policy.\",\n  \"Q3\": \"What was the purpose of the draft report prepared by the committee?\",\n  \"A3\": \"To create a scientific equipment policy based on collected information and analyzed views of the committee members.\",\n  \"Q4\": \"Who suggested valuable suggestions and directions for fine-tuning the report?\",\n  \"A4\": \"Secretary, DARE and Director General, ICAR.\",\n  \"Q5\": \"What was the purpose of identifying 'National Level Scientific Equipment Facilities' in ICAR institutes?\",\n  \"A5\": \"To create a list of 'ICAR—Advanced National Scientific Facility' available in ICAR Institutes for research in specific subject areas.\",\n  \"Q6\": \"What was the cost threshold for including scientific equipment and facilities in the revised draft report?\",\n  \"A6\": \"Costing more than ¥ 2.5 million.\",\n  \"Q7\": \"What was the purpose of gathering information from ICAR Institutes on specific aspects?\",\n  \"A7\": \"To create a list of 'ICAR—Advanced National Scientific Facility' and standalone scientific equipment/facility costing $10 million or above available in ICAR Institutes.\",\n  \"Q8\": \"What was the cost threshold for standalone scientific equipment/facility to be included in the revised draft report?\",\n  \"A8\": \"Costing $10 million or above.\",\n  \"Q9\": \"What was the purpose of the meeting held on September 6, 20019?\",\n  \"A9\": \"To refine the draft report and include scientific equipment and facilities costing more than ¥ 10 million.\",\n  \"Q10\": \"What was the purpose of the meeting held on December 26, 2019?\",\n  \"A10\": \"To present the revised draft report and receive further suggestions, including a list of scientific equipment available in ICAR institutes costing ¥ 2.5 million and above.\"\n}",
    " {\n    \"Q1\": \"What is the ICAR-Central Institute of Research on Cotton Technology (CIRCOT) mentioned in the text?\",\n    \"A1\": \"The ICAR-Central Institute of Research on Cotton Technology (CIRCOT) is an institute under the Indian Council of Agricultural Research (ICAR) that focuses on research and development in cotton technology.\"\n    \n    \"Q2\": \"What is the purpose of the 'ICAR — Advanced National Scientific Facility'?\",\n    \"A2\": \"The 'ICAR — Advanced National Scientific Facility' is a state-of-the-art facility created by several ICAR institutes for research in various agricultural and allied areas.\"\n    \n    \"Q3\": \"How many 'ICAR — Advanced National Scientific Facility' are available in ICAR Institutes?\",\n    \"A3\": \"There are a total of 34 such facilities available in ICAR Institutes.\"\n    \n    \"Q4\": \"What is the cost range for individual scientific equipment available in ICAR Institutes?\",\n    \"A4\": \"The individual scientific equipment available in ICAR Institutes cost more than ¥2.5 million and up to €10 million.\"\n    \n    \"Q5\": \"How many such instruments or equipment are available in ICAR Institutes?\",\n    \"A5\": \"There are 146 instruments or equipment available in various ICAR Institutes.\"\n    \n    \"Q6\": \"What is the purpose of the Tissue Culture Laboratory at ICAR-Central Potato Research Institute, Shimla?\",\n    \"A6\": \"The Tissue Culture Laboratory at ICAR-Central Potato Research Institute, Shimla, is a facility for conducting research in tissue culture technology.\"\n    \n    \"Q7: What is the purpose of the Tissue Culture Research Facility at ICAR-National Research Centre for Banana, Tiruchirappalli?\",\n    \"A7\": \"The Tissue Culture Research Facility at ICAR-National Research Centre for Banana, Tiruchirappalli, is a facility for conducting research in tissue culture technology.\"\n    \n    \"Q8: What is the Scientific Equipment Policy, Audit and Life Cycle of Scientific Equipment in ICAR Institutes?\",\n    \"A8\": \"The Scientific Equipment Policy, Audit and Life Cycle of Scientific Equipment in ICAR Institutes is a policy that outlines the procedures for replacement of obsolete or worn-out instruments, equipment, and research facilities in ICAR Institutes.\"\n    \n    \"Q9: How are obsolete or worn-out instruments and equipment replaced in ICAR Institutes?\",\n    \"A9\": \"Obsolete or worn-out instruments and equipment in ICAR Institutes are replaced based on needs and following standard government guidelines, with a provision for replacement planned through a special committee at the institute level.\"\n    \n    \"Q10: What is the purpose of making an annual provision for funds in ICAR Institutes?\",\n    \"A10\": \"An annual provision for funds in ICAR Institutes is made for the purchase, operation, and maintenance of scientific equipment, similar to the practices in other scientific organizations like CSIR Institutes, ITs, and similar other Institutes.\"\n}",
    " {\n  \"Q1\": \"Who were present in the meeting where recommendations were drawn?\",\n  \"A1\": \"DARE Secretary, ICAR Secretary, and Instrument Policy Committee members.\"\n  \n  \"Q2\": \"When were the recommendations approved by the Governing Body of Indian Council of Agricultural Research?\",\n  \"A2\": \"The recommendations were approved on June 29, 2020.\"\n  \n  \"Q3: What is the first recommendation for ICAR Institutes regarding scientific equipment procurement?\",\n  \"A3\": \"Every ICAR Institute should have a well-defined and effective scientific equipment procurement strategy based on the needs of the researchers.\"\n  \n  \"Q4: What should ICAR institutes consider while fixing research priorities and equipment procurement strategies?\",\n  \"A4\": \"The mandates of the current national research thrusts and the immediate and long-term solutions required to solve the farming community problems.\"\n  \n  \"Q5: How should ICAR institutes facilitate the clearance and sourcing of scientific equipment?\",\n  \"A5\": \"They should facilitate quick clearance and sourcing of scientific equipment from domestic and international markets as per the demand and availability.\"\n  \n  \"Q6: What should ICAR institutes ensure when procuring costly scientific equipment?\",\n  \"A6\": \"They should ensure effective terms of service and maintenance after sale, service contracts (like AMC) for regular preventive maintenance and repair needs, and any other terms of service for smooth installation, operation, and maintenance.\"\n  \n  \"Q7: What is the recommended duration for an AMC contract for new equipment?\",\n  \"A7\": \"The recommended duration for an AMC contract is three years.\"\n  \n  \"Q8: What is the role of the Director/Competent Authority in relation to the SEAM Committee?\",\n  \"A8\": \"The Director/Competent Authority may constitute the SEAM Committee at the Institute level.\"\n  \n  \"Q9: What are the terms of reference for the SEAM Committee?\",\n  \"A9\": \"The SEAM Committee is responsible for conducting an annual scientific equipment review, monitoring proper usage of equipment, ensuring calibration, technical auditing, and analyzing relevant records.\"\n  \n  \"Q10: What is the role of the SEAM Committee in relation to scientific equipment?\",\n  \"A10\": \"The SEAM Committee is responsible for conducting an annual scientific equipment review, monitoring proper usage of equipment, ensuring calibration, technical auditing, and analyzing relevant records.\"\n}",
    " {\n  \"Q1\": \"What is the role of the SEAM Committee at the institute level?\",\n  \"A1\": \"The SEAM Committee at the institute level is responsible for deciding the life cycle of costly scientific equipment based on usage frequency, hours of use, and obsolescence of the working principle.\"\n},\n{\n  \"Q2\": \"What factors should the SEAM Committee consider when deciding the life cycle of common instruments?\",\n  \"A2\": \"The SEAM Committee should consider government regulations, frequency and hours of use, and obsolescence of the working principle when deciding the life cycle of common instruments.\"\n},\n{\n  \"Q3\": \"What is the policy on multiple purchases of the same scientific equipment within an institute?\",\n  \"A3\": \"Multiple purchases of the same scientific equipment should be discouraged within an institute, except for those frequently used, and this should be monitored by the SEAM Committee.\"\n},\n{\n  \"Q4\": \"Who should provide recommendations for the purchase of costly scientific equipment?\",\n  \"A4\": \"Recommendations for the purchase of costly scientific equipment should come from the SEAM Committee and be approved by the competent authority.\"\n},\n{\n  \"Q5\": \"What is the ICAR's definition of an \"ICAR-Advanced National Scientific Facility\"?\",\n  \"A5\": \"An \"ICAR-Advanced National Scientific Facility\" is defined as any scientific equipment or facility costing more than 40 million.\"\n},\n{\n  \"Q6\": \"How should long-term sustainability of an \"ICAR-Advanced National Scientific Facility\" be ensured?\",\n  \"A6\": \"Long-term sustainability of an \"ICAR-Advanced National Scientific Facility\" should be ensured by providing proper funds for operation and maintenance.\"\n},\n{\n  \"Q7\": \"What is the role of a facility in-charge or co-incharge in an \"ICAR-Advanced National Scientific Facility\"?\",\n  \"A7\": \"A facility in-charge or co-incharge is responsible for ensuring that the facility runs without any problems.\"\n},\n{\n  \"Q8\": \"Who should maintain costly equipment in the lab or an \"ICAR-Advanced National Scientific Facility\"?\",\n  \"A8\": \"Costly equipment in the lab or an \"ICAR-Advanced National Scientific Facility\" should be maintained by a Senior Technical Officer.\"\n},\n{\n  \"Q9\": \"What is the role of a technical person responsible for scientific equipment/facility?\",\n  \"A9\": \"A technical person responsible for scientific equipment/facility ensures the availability of consumables, spare parts, and other materials for smooth functioning of the facility.\"\n},\n{\n  \"Q10\": \"What is the role of the ASHOKA Super Computing Facility at the ICAR-Indian Agricultural Statistics Research Institute, New Delhi?\",\n  \"A10\": \"The ASHOKA Super Computing Facility at the ICAR-Indian Agricultural Statistics Research Institute, New Delhi, is responsible for food quality testing.\"\n}\n}",
    " {\n    \"Q1\": \"What is the purpose of creating an online information system/portal for scientific equipment?\",\n    \"A1\": \"To ensure sharing of scientific equipment with other institutes and facilitate easy booking and placing an indent online for using such facilities for a charge.\",\n    \n    \"Q2\": \"What should the web portal include regarding scientific equipment?\",\n    \"A2\": \"The web portal should have readily accessible and updated information related to availability and working condition of scientific equipment/facility in the Institute.\",\n    \n    \"Q3\": \"Who should have access to the scientific equipment available in ICAR institutes?\",\n    \"A3\": \"ICAR institutes, SAUs, and other scientific organizations should have access to the scientific equipment on a chargeable basis.\",\n    \n    \"Q4\": \"How are charges applied for the use of scientific equipment?\",\n    \"A4\": \"Charges are applicable for intra-institutional researchers and private/non-governmental institutes whose research has been funded by the government.\",\n    \n    \"Q5\": \"What is the role of the SEAM committee in managing scientific equipment?\",\n    \"A5\": \"The SEAM committee recommends the number of manpower requirement for the facility and the qualifications of such manpower to the competent authority.\",\n    \n    \"Q6\": \"Who supervises the development and maintenance of the web portal listing scientific equipment?\",\n    \"A6\": \"The ADG (ICT) at ICAR Head Quarters level supervises the development and maintenance of the web portal.\",\n    \n    \"Q7\": \"How often are meetings conducted to monitor the progress and maintenance of the portal?\",\n    \"A7\": \"Periodic meetings with all the DDGs and the ADG (ICT) are conducted at the Head Quarters to monitor the progress and maintenance of the portal.\",\n    \n    \"Q8\": \"What is the purpose of the ICAR Engineering Prototype Fabrication Unit?\",\n    \"A8\": \"The ICAR Engineering Prototype Fabrication Unit is a national-level facility that houses advanced scientific equipment.\",\n    \n    \"Q9\": \"How many Advance Scientific Equipment Facilities have been identified in different ICAR Institutes?\",\n    \"A9\": \"A total of 34 Advance Scientific Equipment Facilities have been identified in different ICAR Institutes.\",\n    \n    \"Q10\": \"What is the role of the SMDs in managing the web portal?\",\n    \"A10\": \"The SMDs monitor the web portal in association with the ADG (ICT).\"\n}",
    " {\n  \"Q1\": \"What is the purpose of the HDT ICAR 16 policy?\",\n  \"A1\": \"The HDT ICAR 16 policy ensures that facilities are available for other researchers as per the guidelines provided in the document, and rates are decided and notified by the SEAM Committee of the respective institute.\"\n\n  \"Q2\": \"What should institutes with 'ICAR — Advanced National Scientific Facility' do according to HDT ICAR 17?\",\n  \"A2\": \"They should highlight the products, technologies, publications, services, revenue generated, and other achievements from these facilities on their web portal.\"\n\n  \"Q3: What is the LSTEM portal?\",\n  \"A3\": \"The LSTEM (Indian Science Technology & Engineering facilities Map) portal is a web portal established by the Government of India to link researchers and resources of all research organizations in India.\"\n\n  \"Q4: What is the main objective of the LSTEM portal?\",\n  \"A4\": \"The main objective of the LSTEM portal is to link researchers and resources of all research organizations in India.\"\n\n  \"Q5: What is the requirement for ICAR institutes on the LSTEM portal?\",\n  \"A5\": \"ICAR institutes must list all their scientific equipment costing more than &2.5 million on the LSTEM portal.\"\n\n  \"Q6: What should the Director/Competent Authority do according to HDT ICAR 19?\",\n  \"A6\": \"The Director/Competent Authority should certify and submit a report annually regarding adherence to the guidelines provided in the scientific equipment policy and any difficulties encountered.\"\n\n  \"Q7: What flexibility is suggested in the implementation of the guidelines on Scientific Equipment Policy?\",\n  \"A7\": \"The Director/Competent Authority may adopt a flexible approach depending on the scientific strength and available facilities in the respective institute.\"\n\n  \"Q8: What are some of the advanced national scientific facilities available at ICAR institutes?\",\n  \"A8\": \"Some facilities include Nanaji Deshmukh Plant Phenomics Centre, National Phytotron Facility, Rice Genetics Facility, and Advanced Genomics Facility for Plants.\"\n\n  \"Q9: What is the purpose of the LSTEM portal according to HDT ICAR 18?\",\n  \"A9\": \"The LSTEM portal aims to connect researchers and resources of all research organizations in India.\"\n\n  \"Q10: What should ICAR institutes do with their scientific equipment according to HDT ICAR 19?\",\n  \"A10\": \"ICAR institutes should list all their scientific equipment costing more than &2.5 million on the LSTEM portal.\"\n}",
    " {\n  \"Q1\": \"What are the main activities of the Bureau of Fish Genetic Resources, Lucknow?\",\n  \"A1\": \"The Bureau of Fish Genetic Resources, Lucknow, is responsible for the conservation and management of fish genetic resources.\"\n\n  \"Q2\": \"What is the purpose of the Cotton Quality Testing Laboratory?\",\n  \"A2\": \"The Cotton Quality Testing Laboratory is used for testing and evaluating the quality of cotton.\"\n\n  \"Q3\": \"What is the function of the Natural Fibre Testing Centre?\",\n  \"A3\": \"The Natural Fibre Testing Centre is used for testing and evaluating the quality of natural fibres.\"\n\n  \"Q4\": \"What is the purpose of the DNA sequencing facility?\",\n  \"A4\": \"The DNA sequencing facility is used for sequencing DNA samples to study genetic information.\"\n\n  \"Q5\": \"What is the function of the Plant phenomics platform?\",\n  \"A5\": \"The Plant phenomics platform is used for studying plant phenotypes and their genetic basis.\"\n\n  \"Q6\": \"What is the purpose of the Sophisticated Analytical Instruments Facility for Horticultural Crops?\",\n  \"A6\": \"The Sophisticated Analytical Instruments Facility for Horticultural Crops is used for analyzing and evaluating horticultural crops.\"\n\n  \"Q7\": \"What is the function of the Genomics Facility for Horticultural Crops?\",\n  \"A7\": \"The Genomics Facility for Horticultural Crops is used for studying the genomes of horticultural crops.\"\n\n  \"Q8\": \"What is the purpose of the Laboratory for Embryo Biotechnology?\",\n  \"A8\": \"The Laboratory for Embryo Biotechnology is used for studying and manipulating embryos in biotechnological research.\"\n\n  \"Q9\": \"What is the function of the Facility for Peptide Synthesis?\",\n  \"A9\": \"The Facility for Peptide Synthesis is used for synthesizing peptides for research and development purposes.\"\n\n  \"Q10\": \"What is the purpose of the Automated Nucleic Acid Sequencing facility?\",\n  \"A10\": \"The Automated Nucleic Acid Sequencing facility is used for sequencing nucleic acids, such as DNA and RNA, in a high-throughput manner.\"\n}",
    " {\n  \"Q1\": \"What are the main B-vitamins found in millets?\",\n  \"A1\": \"The main B-vitamins found in millets are thiamine (B1), riboflavin (B2), niacin (B3), and folic acid.\",\n  \"Q2\": \"Which millet has the highest thiamine content?\",\n  \"A2\": \"Foxtail millet has the highest thiamine content among millets.\",\n  \"Q3\": \"How does decortication affect the nutrient content of millets?\",\n  \"A3\": \"Decortication, a commonly employed processing technique to convert small millets into edible form, is known to reduce the micronutrient content in millets.\",\n  \"Q4\": \"What are anti-nutrients and how do they affect millets?\",\n  \"A4\": \"Anti-nutrients are compounds that interfere with the absorption of minerals in the body. Millets contain certain anti-nutrients such as phytic acid and tannins, which are found in the outer layers of the grain.\",\n  \"Q5\": \"How can the negative impacts of anti-nutrients in millets be reduced?\",\n  \"A5\": \"Household processing methods like decortication, milling, soaking, roasting, germination, and fermentation are known to reduce the negative impacts of anti-nutrients in millets.\",\n  \"Q6\": \"What are phytochemicals and how do they benefit millets?\",\n  \"A6\": \"Phytochemicals are compounds found in plants that have various health benefits. In millets, abundant phytochemicals including phenolic compounds and phytosterols impart bioactivities like anti-oxidant, anti-microbial, anti-diabetic, and anti-hypertensive properties.\",\n  \"Q7\": \"Which millet contains 3-deoxy anthocyanins?\",\n  \"A7\": \"Sorghum contains 3-deoxy anthocyanins, which are known to exhibit several bioactivities including the ability to protect from certain types of cancers.\",\n  \"Q8\": \"What is the protein content of finger millet?\",\n  \"A8\": \"Finger millet has a protein content of 7.16%.\",\n  \"Q9\": \"What is the fat content of foxtail millet?\",\n  \"A9\": \"Foxtail millet has a fat content of 4.30%.\"\n}",
    " {\n  \"Q1\": \"What is the cost of a Transmission Electron Microscope according to the SCIENTIFIC EQUIPMENT POLICY?\",\n  \"A1\": \"The cost of a Transmission Electron Microscope is 19.70\",\n  \"Q2\": \"Which institute has a Cigarette Smoking Facility according to the HIPS ICAR EQUIPMENT POLICY?\",\n  \"A2\": \"The institute with a Cigarette Smoking Facility is ICAR-Central Tobacco Research Institute, Rajahmundry\",\n  \"Q3\": \"What is the cost of a High Pressure Food Processor System as per the HIPS ICAR EQUIPMENT POLICY?\",\n  \"A3\": \"The cost of a High Pressure Food Processor System is 24.90\",\n  \"Q4\": \"Which institute has a Confocal Microscope according to the HIPS ICAR EQUIPMENT POLICY?\",\n  \"A4\": \"The institute with a Confocal Microscope is ICAR-National Institute of High Security Animal Diseases, Bhopal\",\n  \"Q5\": \"What is the cost of a Liquid Chromatography (LCMSMS) as per the HIPS ICAR EQUIPMENT POLICY?\",\n  \"A5\": \"The cost of a Liquid Chromatography (LCMSMS) is 10.00\",\n  \"Q6\": \"What is the cost of a Fluorescent activated cell sorting system according to the HIPS ICAR EQUIPMENT POLICY?\",\n  \"A6\": \"The cost of a Fluorescent activated cell sorting system is 11.00\",\n  \"Q7\": \"Which institute has a High Pressure Homogenizer according to the HIPS ICAR EQUIPMENT POLICY?\",\n  \"A7\": \"The institute with a High Pressure Homogenizer is ICAR-National Dairy Research Institute, Karnal\",\n  \"Q8\": \"What is the cost of a High Pressure Homogenizer according to the HIPS ICAR EQUIPMENT POLICY?\",\n  \"A8\": \"The cost of a High Pressure Homogenizer is 30.00\",\n  \"Q9\": \"What is the cost of a High Pressure Food Processor System according to the HIPS ICAR EQUIPMENT POLICY?\",\n  \"A9\": \"The cost of a High Pressure Food Processor System is 24.90\",\n  \"Q10\": \"Which institute has a FATE (Free Air Temperature & CO, elevation) according to the HIPS ICAR EQUIPMENT POLICY?\",\n  \"A10\": \"The institute with a FATE (Free Air Temperature & CO, elevation) is ICAR-Central Marine Fisheries Research Institute, Kochi\"\n}",
    " {\n  \"Q1\": \"What is the cost of the CTGC (CO, Temperature and Gradient Chamber)?\",\n  \"A1\": \"14.20\"\n},\n{\n  \"Q2\": \"Which institute is responsible for the Smart Green House?\",\n  \"A2\": \"ICAR-Central Research Institute for Dryland Agriculture, Hyderabad\"\n},\n{\n  \"Q3\": \"What is the cost of the Plant Phenomics Facility?\",\n  \"A3\": \"10.00\"\n},\n{\n  \"Q4\": \"Which institute has the Gamma Irradiation Facility?\",\n  \"A4\": \"ICAR-Indian Agriculture Research Institute, New Delhi\"\n},\n{\n  \"Q5\": \"What is the cost of the UHPLC system?\",\n  \"A5\": \"3.04\"\n},\n{\n  \"Q6\": \"Which institute is responsible for the DNA Sequencer 24 capillary (14.80)?\",\n  \"A6\": \"ICAR-Central Research Institute for Dryland Agriculture, Hyderabad\"\n},\n{\n  \"Q7\": \"What is the cost of the Eddy covariance GHG flux tower?\",\n  \"A7\": \"8.80\"\n},\n{\n  \"Q8\": \"Which institute has the Photosynthesis and chlorophyll fluorescence system?\",\n  \"A8\": \"ICAR-Central Research Institute for Dryland Agriculture, Hyderabad\"\n},\n{\n  \"Q9\": \"What is the cost of the Ultra-Performance Liquid Chromatography?\",\n  \"A9\": \"275\"\n},\n{\n  \"Q10\": \"Which institute is responsible for the Medium Term Germplasm Unit?\",\n  \"A10\": \"ICAR-Central Island Agricultural Research Institute, Port Blair\"\n}\n}",
    " {\n  \"Q1\": \"What are some of the instruments available at ICAR-Indian Institute of Seed Science, New Delhi?\",\n  \"A1\": \"The institute has instruments like HPLC, Laser Diffraction Soil Particle Analyzer, Elemental Combustion System (CHNS), and GC-MS.\"\n  \n  \"Q2\": \"What is the cost of the Ultra-Centrifuge at ICAR-Indian Institute of Seed Science, New Delhi?\",\n  \"A2\": \"The Ultra-Centrifuge costs 8.90.\"\n  \n  \"Q3\": \"What instruments are available at ICAR-Indian Institute of Sugarcane Research, Mau?\",\n  \"A3\": \"The institute has instruments like HPLC, Laser Diffraction Soil Particle Analyzer, Elemental Combustion System (CHNS), and GC-MS.\"\n  \n  \"Q4\": \"What is the cost of the HPLC at ICAR-Indian Institute of Sugarcane Research, Mau?\",\n  \"A4\": \"The HPLC costs 3.66.\"\n  \n  \"Q5\": \"What instruments are available at ICAR-Vivekananda Parvatiya Krishi Anusandhan Sansthan, Lucknow?\",\n  \"A5\": \"The institute has instruments like HPLC, Laser Diffraction Soil Particle Analyzer, Elemental Combustion System (CHNS), and GC-MS.\"\n  \n  \"Q6\": \"What is the cost of the Laser Diffraction Soil Particle Analyzer at ICAR-Vivekananda Parvatiya Krishi Anusandhan Sansthan, Lucknow?\",\n  \"A6\": \"The Laser Diffraction Soil Particle Analyzer costs 5.65.\"\n  \n  \"Q7\": \"What instruments are available at ICAR-Central Potato Research Institute, Almora?\",\n  \"A7\": \"The institute has instruments like HPLC, Laser Diffraction Soil Particle Analyzer, Elemental Combustion System (CHNS), and GC-MS.\"\n  \n  \"Q8\": \"What is the cost of the Elemental Combustion System (CHNS) at ICAR-Central Potato Research Institute, Almora?\",\n  \"A8\": \"The Elemental Combustion System (CHNS) costs 3.09.\"\n  \n  \"Q9\": \"What instruments are available at ICAR-Central Horticultural Experiment Station, Shimla?\",\n  \"A9\": \"The institute has instruments like HPLC, Laser Diffraction Soil Particle Analyzer, Elemental Combustion System (CHNS), and GC-MS.\"\n  \n  \"Q10\": \"What is the cost of the GC-MS at ICAR-Central Horticultural Experiment Station, Shimla?\",\n  \"A10\": \"The GC-MS costs 2.49.\"\n}\n",
    " {\n  \"Q1\": \"What is the purpose of the ICT Roadmap published by the Indian Council of Agricultural Research?\",\n  \"A1\": \"The ICT Roadmap outlines the strategic plan for the implementation and utilization of Information & Communication Technology in the agricultural sector.\"\n\n  \"Q2\": \"Who published the ICT Roadmap?\",\n  \"A2\": \"The ICT Roadmap was published by Dr. S. K. Singh, Project Director, Directorate of Knowledge Management in Agriculture, Indian Council of Agricultural Research, New Delhi.\"\n\n  \"Q3: Where was the ICT Roadmap printed?\",\n  \"A3\": \"The ICT Roadmap was printed at M/s. Royal Offset Printers, located in Naraina Industrial Area, Phase-I, New Delhi 110028.\"\n\n  \"Q4: When was the ICT Roadmap published?\",\n  \"A4\": \"The ICT Roadmap was published in October 2021.\"\n\n  \"Q5: What is the ISBN of the ICT Roadmap?\",\n  \"A5\": \"The ISBN of the ICT Roadmap is 978.\"\n\n  \"Q6: Who compiled the ICT Roadmap?\",\n  \"A6: The ICT Roadmap was compiled by the Information & Communication Technology (ICT) Unit ICAR, New Delhi.\"\n\n  \"Q7: What guidance was provided for the ICT Roadmap?\",\n  \"A7: The ICT Roadmap was guided by the ICAR – ICT Steering Committee and implemented by ICAR – ICT Implem.\"\n\n  \"Q8: What is the role of ICAR-IASRI in the ICT Roadmap?\",\n  \"A8: ICAR-IASRI provided guidance and support for the implementation of the ICT Roadmap.\"\n\n  \"Q9: What is the purpose of the ICT Roadmap for the Indian Council of Agricultural Research?\",\n  \"A9: The ICT Roadmap serves as a strategic plan for the Indian Council of Agricultural Research to implement and utilize Information & Communication Technology in the agricultural sector.\"\n\n  \"Q10: Who is responsible for the ICT Roadmap within the Indian Council of Agricultural Research?\",\n  \"A10: The ICT Roadmap is the responsibility of the ICT Steering Committee and the ICT Implem within the Indian Council of Agricultural Research.\"\n}",
    " {\n  \"Q1\": \"What is the purpose of the Digital India Mission started by the Government of India?\",\n  \"A1\": \"The Digital India Mission aims to transform India into a digitally empowered society and knowledge economy, providing ICT-based citizen-centric services and an efficient e-governance system for transparency, accountability, and efficiency in all economic sectors.\"\n  \n  \"Q2\": \"What is the role of the Indian Council of Agricultural Research (ICAR) in the Digital India Mission?\",\n  \"A2\": \"ICAR, as a leader in one of the world's largest and most complex agriculture research systems, is developing various ICT tools and systems to digitally empower agriculture researchers, policymakers, extension workers, and farmers, transforming the agricultural research and education ecosystem in India.\"\n  \n  \"Q3\": \"What is the significance of the ICT road map developed by ICAR?\",\n  \"A3\": \"The ICT road map developed by ICAR will accelerate processes, establish two-way communication systems among stakeholders, and support agricultural technology innovations using disruptive ICT technologies like Machine Learning, Artificial Intelligence, Blockchain, Internet of Things, and Big Data Analytics.\"\n  \n  \"Q4\": \"What is the KVK portal, and how many Krishi Vigyan Kendras (KVKs) are connected to it?\",\n  \"A4\": \"The KVK portal is an online system developed by ICAR, connecting 721 Krishi Vigyan Kendras across India to disseminate agricultural technologies and services.\"\n  \n  \"Q5\": \"How are KVKs mapped to Common Service Centers in India?\",\n  \"A5\": \"KVKs are mapped to more than 3.5 lakhs Common Service Centers of the Ministry of Electronics and Information Technology, Government of India, for disseminating agricultural technologies and services.\"\n  \n  \"Q6\": \"What is the projected number of internet users in India by 2025?\",\n  \"A6\": \"India is expected to have 975 million internet users by 2025, up from 761 million in the current period.\"\n  \n  \"Q7\": \"What is the role of ICT tools and software in the agricultural sector according to the ICAR road map?\",\n  \"A7\": \"ICT tools and software are essential for providing efficient e-governance, supporting quality research output through data analytics, training human resources on emerging IT/ICT technologies, and developing effective communication systems for extension workers and farmers.\"\n  \n  \"Q8\": \"What are some of the disruptive ICT technologies that ICAR's road map supports?\",\n  \"A8\": \"The road map supports the use of disruptive ICT technologies such as Machine Learning, Deep Learning, Artificial Intelligence, Blockchain, Internet of Things, and Big Data Analytics in agriculture.\"\n  \n  \"Q9\": \"What is the role of the Operational Management Committee in ICAR's ICT road map?\",\n  \"A9\": \"The Operational Management Committee, led by Punit Bhasin, is responsible for overseeing the design, production, and implementation of ICAR's ICT road map.\"\n  \n  \"Q10\": \"What is the significance of the ICT road map in the context of India's agriculture research and education system?\",\n  \"A10\": \"The ICT road map is a comprehensive guide for developing ICT tools and software in the future, supporting agricultural technology innovations and transforming the agriculture research and education system in India.\"\n}",
    " {\n  \"Q1\": \"What is the role of ICAR in agricultural research and education?\",\n  \"A1\": \"ICAR conducts, promotes, supports, and coordinates research, education, and extension in agriculture across India.\"\n  \n  \"Q2\": \"What is the purpose of the ICT initiatives taken by ICAR?\",\n  \"A2\": \"The ICT initiatives aim to empower and support agricultural research and its e-Governance, transforming Indian agriculture into a digital-empowered knowledge economy.\"\n  \n  \"Q3\": \"What are some of the digital platforms developed by ICAR?\",\n  \"A3\": \"ICAR has developed various digital platforms, including the Advanced Super Computing Hub for Omics Knowledge in Agriculture (ASHOKA), ICAR Data Center, and Krishi Megh.\"\n  \n  \"Q4\": \"Who prepared the ICT Roadmap for ICAR?\",\n  \"A4\": \"The ICT Roadmap for ICAR was prepared by M/s. KPMG India.\"\n  \n  \"Q5: What is the purpose of the ICT Roadmap?\",\n  \"A5\": \"The ICT Roadmap aims to consolidate and strengthen ICAR's ICT initiatives, improving efficiency, transparency, and monitoring of various activities.\"\n  \n  \"Q6: What is the role of the IT/ICT infrastructure in ICAR's operations?\",\n  \"A6\": \"The IT/ICT infrastructure, including advanced computing and data centers, supports the development and implementation of software and tools for agricultural research, education, and extension.\"\n  \n  \"Q7: How does the ICT Roadmap contribute to ICAR's goals?\",\n  \"A7\": \"The ICT Roadmap provides direction for unification, coordination, and monitoring of existing systems in ICAR, ensuring their effective and optimum utilization.\"\n  \n  \"Q8: What is the importance of structural re-organization in ICAR's ICT activities?\",\n  \"A8\": \"Structural re-organization is necessary for effective implementation of IT/ICT activities, ensuring that they meet the specific needs of the Council and are aligned with its short, medium, and long-term goals.\"\n  \n  \"Q9: Who contributed to the development of the ICT Roadmap?\",\n  \"A9\": \"The ICT Roadmap was developed with guidance, critical inputs, and support from the Secretary of DARE & DG, ICAR, as well as other key officials and staff members of ICAR and ICAR-IASRI.\"\n  \n  \"Q10: What is the expected outcome of the ICT Roadmap for ICAR?\",\n  \"A10: The ICT Roadmap is expected to facilitate the effective implementation, coordination, and monitoring of various IT/ICT systems in ICAR, ultimately supporting the Council's mission to advance agricultural research, education, and extension in India.\"\n}",
    " {\n  \"Q1\": \"What is the e-Governance Policy of the Government of India?\",\n  \"A1\": \"The e-Governance Policy of the Government of India is a framework that guides the use of Information and Communication Technology (ICT) in governance to improve efficiency, transparency, and accountability.\"\n  \n  \"Q2\": \"What is the role of ICAR in Indian agriculture?\",\n  \"A2\": \"The Indian Council of Agricultural Research (ICAR) is an autonomous organization under the Department of Agricultural Research and Education (DARE), responsible for coordinating, guiding, and managing research and education in agriculture, including horticulture, fisheries, and animal sciences in India.\"\n  \n  \"Q3\": \"What are the key functions of the ICT Functional Groups (FGs) within ICAR?\",\n  \"A3\": \"The ICT Functional Groups (FGs) within ICAR are responsible for infrastructure, software development, software standards and quality assurance, implementation, operational maintenance and support, and data management and analytics.\"\n  \n  \"Q4\": \"What is the purpose of the Standing Committee in ICAR's ICT implementation?\",\n  \"A4\": \"The Standing Committee in ICAR's ICT implementation is responsible for overseeing the implementation and management of ICT initiatives.\"\n  \n  \"Q5\": \"What is the role of the ICT Steering Committee in ICAR?\",\n  \"A5\": \"The ICT Steering Committee in ICAR is responsible for providing strategic guidance and direction for the implementation and management of ICT initiatives.\"\n  \n  \"Q6\": \"What is the role of the Implementation and Operational Management Committee (IOMC) in ICAR?\",\n  \"A6\": \"The Implementation and Operational Management Committee (IOMC) in ICAR is responsible for overseeing the implementation and management of ICT initiatives.\"\n  \n  \"Q7\": \"What is the significance of the Flow Chart of ICT in ICAR?\",\n  \"A7\": \"The Flow Chart of ICT in ICAR illustrates the levels of decision-making within the organization's ICT implementation and management structure.\"\n  \n  \"Q8\": \"What are the ICT Targets/Milestones in ICAR?\",\n  \"A8\": \"The ICT Targets/Milestones in ICAR are specific goals and objectives that guide the implementation and management of ICT initiatives within the organization.\"\n  \n  \"Q9\": \"What is the role of the Permanent Staff in ICAR's ICT implementation?\",\n  \"A9\": \"The Permanent Staff in ICAR's ICT implementation are responsible for the day-to-day management and operation of ICT initiatives.\"\n  \n  \"Q10\": \"What is the role of the Contractual Manpower in ICAR's ICT implementation?\",\n  \"A10\": \"The Contractual Manpower in ICAR's ICT implementation are temporary employees hired to support the implementation and management of ICT initiatives.\"\n}",
    " {\n  \"Q1\": \"What is the purpose of NARES in the Indian agricultural sector?\",\n  \"A1\": \"NARES aims to harness advances in science for the welfare of society and engage fully with farmers, industry, entrepreneurs, and consumers.\",\n  \"Q2\": \"How is information and communication technology (ICT) being used in Indian agricultural research?\",\n  \"A2\": \"ICT is being used to transform the ecosystem of agriculture research, education, and extension through various digital programs and initiatives.\",\n  \"Q3\": \"What is the Digital India Mission?\",\n  \"A3\": \"The Digital India Mission is a government initiative to transform India into a digitally empowered society and knowledge economy.\",\n  \"Q4\": \"What is the role of ICAR in the evolution of agricultural research in India?\",\n  \"A4\": \"ICAR has launched several agricultural research and digital programs to transform and enable digitally empowered services in the agricultural sector.\",\n  \"Q5\": \"What is the ICT-Roadmap and its eight pillars of good governance?\",\n  \"A5\": \"The ICT-Roadmap is a policy initiative by the Ministry of Electronics and Information Technology (Meity) that focuses on open source software, open APIs, e-mail policy, use of IT resources, collaborative application development, and application development for cloud-ready applications.\",\n  \"Q6\": \"What are the three main aims of the e-Governance policies?\",\n  \"A6\": \"The three main aims are easy governance, effective governance, and good governance.\",\n  \"Q7\": \"What is the purpose of the \"Policy on adoption of open source software for Government of India\"?\",\n  \"A7\": \"The policy encourages the formal adoption and use of Open Source Software (OSS) in government organizations to ensure strategic control of e-Governance assets and business continuity.\",\n  \"Q8\": \"What is the \"Framework for Adoption of Open Source Software in e-Governance Systems\"?\",\n  \"A8\": \"The framework provides recommendations and procedures for promoting, managing, and enhancing the adoption of OSS in e-Governance systems.\",\n  \"Q9\": \"How do the e-Governance policies benefit government organizations?\",\n  \"A9\": \"The policies provide key principles for revamping existing projects and guide new and ongoing e-Governance projects, ensuring efficient, transparent, and affordable services to citizens.\",\n  \"Q10\": \"What is the role of subject matter experts in the development of e-Governance policies?\",\n  \"A10\": \"Subject matter experts from government departments, industry, and academia contribute their knowledge and expertise to ensure the policies are based on national and international best practices.\"\n}\n",
    " {\n  \"Q1\": \"What is the impact of adopting OSS in Government?\",\n  \"A1\": \"Adoption of OSS in India and the and\": \"\": \"O and the Government implementation\n source in the government and eOG Own on the Government\n A user\n Open and the and the Government and the use21\": \"\n provided on the in the adoption and the use \"O-in the Government and the Government and the official and the Government and its and \"\": \"OOpen and OGov the ads and opent in India and the Government and the in the Government of the Government on in India in the Government in the primary and the Government and the use in the impacts operating and the Government and the adoption\n operating and in the impact on in the in the use\n\n\n source\": \" and the impact of the use of the adoption: It and open \n AOpen\": \" \"Opening of the use in Government in and the adoption in Government in implementation in the Government in India in the Government and the Government and Open and the Government in the adoption: \"\n source and the in the and the government in the and the in the and e-related in implementation \n as in the on the O\": \"O1\": \"Owns in the use in the in India in the Government\n\" \"Open: \"\": \"e-17\": \"on the on and related the impact of the use of the Government and other systems and \n  in the Government in the in the in the and \n\n A domain \n    in the in the in India\n\n source\": \"  \"O O1\": \"open user\": \"\n    'O1\": \"opensopen on the in the Government in the in the adoption \"O1-related \n  role \"1\": \"O01 in the implementation \n \n \n O 1\": \"open \"O- \n \"Open and \n  \n O1\": \"O-related in the \n  in the in the government in the in the Government \n \"OGovationality and O 1\":  in the Government in the in the Government in the in the and  Open in the Government in the Government in the \n   implementation in the impacts in India in the Government\n \n and the and the Government and  and  and the adoption.\n\n \"OO1 O \n open \n\n \n \"O\": \"OG  in the Government and \n   Opening in the, \"on the\": \" \n    implementation on e-based on the \n \n \n 1 \n   O1\": \"OGin the \n1Open- \n    \"OG\n \"OG and open \n open in the in the \ns\": \"O  O Open in India in the O-openoints in the \n                   \n \n \n open in only and open O1\":  and \n  \"o1\": \"O  and \n  and open source and open-based in the in the \n   \n O1OSS \n  of \n \n  in the in the in the Government \"\n  O on open in the in the \n \n  and 1 O- e\": \" on Government in the Government and \n O1\": \"in the use \n\n  in the in  in the \n  the ease in the Government in the Government \n \n  in the government and  and  and \n  \"O-based in the Government and open and \n  in the in the government and in the ad\n \"OGovernance in the in the \n/ \n  in the in the \n                  and  in the in the impact on the \n on the \n \"O2\": \"The use in the impact of OGrowss in the Government\n \"OG \"O\": \"O open of the in the in the Government in the in the in the Government in the in the  in the Government in the   in the use in India in the impact in India \ns Open-  in the impacts of in the in the Government and open and in the  in the in the in India in India in the in the Government in the in the in the Government and \nOGovernment \n \n  in the in the Government in the Government in the  Open  and the impact on \ns in the  in the Government in the and  Own in the in the \n AG\n \n  in the \n    \"O12\": \" and the adverse: \n Open in the and its \n \n  \"\n    \" \n                  \n                 \n \" user\n                 \n  and \n  same of various in \"in the on in the \n \ns implementation in the Open in India in the adoption \n 1\": \" opening and  'Open \n \n \n 1, \n \n of O  and open source, and  and \n A  and O \n  OSS \n  same in the and \n   1 of the and \n                  and the  in the Government in the Government in the in the \n \n  userate in the  in the \n\n  in the Government in India in the Government in the Government and \n  \n \n \n  in the Government in the first\": \"in the adoption in the adoption in Government and open in the Government and the Government  and the government in the Government in Government in the Government in the in the  in theOG\n over \n                 operating \n  in the \n\n  Government in the Government in the adoption in the adoptionO in the government in Government in the Government in the in the Government in the Government in the use  in the Government in the impact of \nOpen source in the in the impact of the Government in the adoption in the in the in the  in the on  in the government in the \n                  and open on the \n \n \n \n \n  and \n   other organizations in the \n  in the  in the adoption in the in the \n  \"in the in the 1Open in the Government in the in the adoption \"OO\":  in the Government Open  in the Government in the Government in the Government in the Government and the and \n \n organizations, and  in the \n  in the \n  open-OSS in the \n \n  and its in the Government in the in the Government in the Government in the Government in the government in the Government and  in the government in the Government in the government in the \n \n \n \n/open and \n\n \"in \n \n2 and \n  and other organizations, other in the government in the Government\n  in the government in the Government and \n \n \n \n \n \n \n \n                \n \n organization in the Government in the Government and OGovern \n \n \n \n \n \n \n \n \n \n   \n\n \"e-in the Government \n                 same with the Government in the Government in the government in the Government in the Government in the Government and Open and \n \n \n \n                 \n \n                 1,  and the Government and \n\n \n\n \n  in the Government in the Government and in the Government in the Government in the Government and the Government and  and \n  in the Government in the government in the Government\n \n\n  Office, Open source, 1 and \n \n  and \n  and  and the and open and the government \ns   \n  and the Government in India,\n \n \n  and \n \n in the Government and \n  user in the in the in the \n                1. \"in to and \n \n \n  in the in India in the in the in  in the in the adoption in the Government in the in the in India and \n 1\": \"OSS and \n  in the in the in India in India\n    \"in the \n \ns \n  in the in India in the \n \n\n  and open source in the in the use \n  \"open in the government in the \n  in the Government and  in India in the Government in the Government in the Government \"\n 1  and \n  \"O 1 and open and open1 and in the in India in India in India\n 10\": \" \"Open- in \n\n\n  in the in the government in the e- \n  and open source in the in the \n  in the and its in the in the government in the in the Government in the in the Government in India\n \n \n \n \n \n \n\n user in the Government\n  in the Government in the \n \n",
    " { same, a and the e implementation and the e latest data.\n                A system and Ig latest web, eagree and, e-based and the information, the following and in the e digital and eg\n\n i earch and other and e and e-  other\n web and I web basedeties of the e- ICTs and e-based, e- software, and the other eats, e and other, eA e/development, e-based and the user for eg e of the e and e- e, in the following e latest",
    " {\n  \"Q1\": \"What is the significance of millets in addressing nutrient deficiencies?\",\n  \"A1\": \"Millets have a balanced nutritional composition, rich in micronutrients like iron, zinc, and calcium, making them relevant in addressing nutrient deficiencies.\"\n  \n  \"Q2\": \"Why are millets considered 'smart food'?\",\n  \"A2\": \"Millets are considered 'smart food' due to their low carbon footprint, adaptability to climate extremes, and nutritional benefits.\"\n  \n  \"Q3: What is the 'International Year of Millets'?\",\n  \"A3\": \"The 'International Year of Millets' is an initiative by the United Nations, declared in 2023, to create awareness about the nutritive value, health benefits, and cultivation of millets.\"\n  \n  \"Q4: What is the purpose of the textbook on sugarcane cultivation practices in India?\",\n  \"A4\": \"The textbook aims to provide comprehensive information on sugarcane cultivation practices in 17 Indian states, serving as a knowledge resource for research, training, extension, and development activities.\"\n  \n  \"Q5: Who are the intended readers of the sugarcane cultivation textbook?\",\n  \"A5\": \"The textbook is intended for stakeholders, researchers, and interested readers who want to learn about sugarcane cultivation practices across different Indian states.\"\n  \n  \"Q6: What are some key topics covered in the sugarcane cultivation textbook?\",\n  \"A6\": \"The textbook covers topics such as climatic conditions, soil, cropping systems, tillage, planting methods, fertilizers, irrigation, weed management, and cultivation economics.\"\n  \n  \"Q7: How does the textbook address the lack of information on sugarcane management practices in India?\",\n  \"A7\": \"The textbook collates and presents information on sugarcane management practices from different states, making it a comprehensive resource for the sugarcane industry.\"\n  \n  \"Q8: What is the role of the ICAR-Indian Institute of Millets Research in promoting millets?\",\n  \"A8\": \"The ICAR-Indian Institute of Millets Research is dedicated to research on millets, contributing to the development of sustainable nutritional security through millet cultivation.\"\n  \n  \"Q9: What is the importance of the 'International Year of Millets' for India?\",\n  \"A9\": \"The 'International Year of Millets' is significant for India as it was proposed by India to the FAO, highlighting the country's commitment to promoting millets and sustainable agriculture.\"\n  \n  \"Q10: How can one obtain a copy of the sugarcane cultivation textbook?\",\n  \"A10\": \"Copies of the textbook can be obtained by contacting the Business Unit Directorate of Knowledge Management in Agriculture at Krishi Anusandhan Bhavan-I, Pusa, New Delhi.\"\n}",
    " { implementation and the in the in the I I File for the following user and the following in the IC in the and in the and in the Council in the for the following and the ICTs and the for the e and in the IC and other e latest in the in the following as per and in the in the following and the e-\n functionisions in the for the in the in the I programn for the1 other and e.\n following in the in the following and in the for the following IC in the in the following and in the Council for the and the I function with the ICAR in the Council and the for the in the in the I technical for the in the following:\n\n program in the e-based and in the IC in the same and the1 other and a I and the integration of the IC from from the for the e-related in the various for the ICAR and other and the development and to build in the Council in the in the in the development of the following for the in the ICT in the plan and the in the Council in the Council and other e-IC and e-based in the I plan and the in the IC for the digital and the of ICG in the framework and the1 other in the Council in the for the in the for from the and in the on the following in the IC in for the e of the following in the following and the plan and in the followingformat and in the following and the following and 1 and for the following in the for the technical domain and for the e-based in the for the form for the IC and 1 implementation and in the on the on the1 program in the necessary to the e-based the in the following in the.\n program\n\n\n implementation1 other\n following of IC in the in the in the and \n1 as pertainsbased in the organization.\n\ns and in the1 other and the following 10\n program in the in the 11 following in the e-IC for the I of the for the ICT, as 1 to in the in the ICT for the\n from the \n following in the in the in the in the task and the following with the e-based on the in the following to develop in the building of the in and to the for the in the following in the for the1 and in the 121 of in the US other and the following in the ICT and  the integration for the Council for the organization other to provide and the and other with the 101  based on the and in the e-\n\n task in the following in the in the following following of the for the11 and the following for the following based and the to the 1 and to the in the1 of in the and for the 100, e-based in the following in the in the 151 in the10 task\n\n Inputs 1  from the I development1 following and the I the implementation - for the 101 same and \n following in the 1.\n1 and in the in the I same in the in the in the 1.\n\n\n in theisions in the in the ICT in the  and the  1101 other and the in the following and to achieve \n\n\n\n\n\n\n            and the 9 and in the and to ensure for the \n following in the following specific from the following in the following in the ICT in the I of the and in the of the in the for the in the 10 and the in the following the 1. other to the following with the following \n\n \n program\n\n 1th and to develop and the 10 10  for the in the in the following in the and the in the and the e- 12 and 1 for the function  with for with thebased on the in the 91 in the in the following \n other Department in the following in the following 1 and 1.\n\n provided to ensure and for the 1.\n\n\n function to ensure 10001 \n 1 \n for the e- 1.\n\n   \n  in the in the ICT for the \n\n following as per 1.\n format in the in the following 1/s\n role all I \n\n\n in the following of the following 1 role:\n\n\n\n \n\n  and the for the following for the ICT in the ICT in the in the other Framework and  and the 1.\n\n [1.\n\n\n    (10 format and in the 1 for the 1.\n role and \n\n\n{ role 1.\n 101 for the in the in the 10 1.\n  and 1.\n\n function and 1. other and  data and 101.\n projects, and 1 1.\n\n \n\n\n following, other and in the 1 and 1 programries and 1, and in the ICTsights in the 1.\n\n 1. The 1.\n  and the 1 in the in the 1.  and in the following with the in the for theination and \n task and the I for the following and to and the following 1.\n following \n 1.\n  to make \n\n\n\n function and \n\n\n  and to develop and 10 and the \n\n format in the and to enable the for the and to the  from the ICARS and 1.\n\n and the ICAR 1 and the \n\n provided in the 1 and the ICTs and to the 1 and other and  and the 1 of the on the e-  in the \n\n user and 1.\n                 1.\n\n 12 for the following and \n\n  and the 1 and 1\n\n\n\n\nrelated and to ensure in the in the in the in the 1. 1.\n 1 and 1.\n                 and 10 \n\n\n\n in the 1.\n\n\n\n\n\n\n from  in the following in the 1.\n and 1 1.\n\n\n\n\n\n\n\n\n\n\n\n\n1.\n  and  organization in the e in the10 and  same in other in the 1.\n \n\n\n\n from the 1.\n  same in the for the various and the e-based on the \n function and  virtual and 1 and in the 1 1 and the for the in the 1 from the 1.\n\n  ICT, ICTs 1.\n 1.\n and the ICT and in the following 1 and \n\n\n\n \n 1.\n   1.\n\n\n  and the in the 1.\n   \n\n\n\n\n\n\n  to ensure and in the ICT, e-based in the 1.\n\n\n\n\n to 1 for the for the use in the ICT and I 9th 1.\n to  The 1.\n  and other and 1.\n\n  and 1. 1.\nup in the 1 ICT and 1.\n \n resource and 1 and other organization and 1.\n \n methods1.\n   1.\n\n  to develop the 1. \n following with the  new and 1 from the e implementation\n\n for the 1.\n\n 12 in the \n from  in the\n\n to the 1.\n and other and 1 from from from the 1 to ensure and the in the e-IC for the 8 and the 1.\n \n 1 organizationational \n\n\n\n\n\n\n\n            1.\n\n\n                 and the  functions 1 and to make in the following and 1 and \n  and the following the 1 to provide to ensure and 1 and the 1.\n  following the for the for the for the following in the  and to the in other for the Council in the implementation for the 1 and in the \n other other management, and in the  organization to the 1.\n 1.\n\n other of the 1 1 1.\n\n following in the 1.\n\n    I in the following are 1.\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n \n 1.\n 1 scope of the in the following and in the activities.\n same for the 1.\n other 1.\n\n\n10 in the in the 1\n\n\n\n\n\n organization and to develop and 10 and for the, and 1.\n following 10  other and the on the 1.\n\n\n other and also 1 1.\n\n other in the in the e- 1. 1.\n\n following in the in the following 1.\n\n\n\n \n\n 10 and 1. same and 1.\n  activities on 1. following in the1.\n\n\n{ 1",
    " {2advise function and maintain and the and maintenance of the in the services and maintenance of the and maintenance of the and maintain function of the and the and other and network of the of the and in the of and management of and as in the Group and infrastructure and and services. domain of the\n    - Infrastructure functions of the of the server and 121 implementationand of the management and network of the in the in the I software of the of the operation of of in the of the of the F SQL and maintenance and infrastrage of the and IT for the system and up of the infrastructureities and IT Development of and Oper and systems of the of and maintenance of the services 2 Service and of the of the in the for the management\n\nbased and maintaining and maintenance and the of the in the of the in and the and in and security and infrastructure of all in the technicalologies - Services in the and maintenance of the Virtual Security of the\n In the in the server and maintenance of In management Data - up and network. other and services, data of the of In software of IC of all softwareability of the and software and IT Falls of of and operation and the group of the maintenance. resource and IT servicesite of the FTP\n server for the group\n\n\n Data: Operations and infrastr of the domain\n            and service of the and maintenance and the In the for all functions21 project. other and and maintenance and maintenance of the\n other other services. other Software in the for the and for the implementation and services and for the and security and the and 221 Servicepace and system and system and the\n                \n\n Y operations: network and the -based and the network and services and the and the and services and services, other software and systems in.\n F1 services of the - FI and data - To in the infrastructureities of the F same of the - other and web of the infrastrend Security and and maintenanceance21 management and relateda other.2 IP and services and maintain and the and maintenance of the and of the services: server/Cloud and to of the and related serviceskeep the hardware for the security maintain theend and support and maintenance and maintenance of the\n domain of the organization.\n\n 2, IT and the and related software and support in the in the. infrastructure and maintenance and in security of IT and maintenance and Office and maintenance and maintenance and software of the and servers and maintain of the in the and security of IT (2 to maintain and the of the and \n    Assignment in of of the services.uplication and related and for the and maintain of the of and maintenance and maintenance of the - Infrastr20 only for the21 software of the in the security and related and 1 Service of the I software and maintenance of the in the and maintenance and oper and maintenance of and 2 and maintenance and maintenanceain in the and maintain0221 Data: technical F1 FITS of the FG3 of theities: In the F task and 2 Services and Networks Network in the network and Network and maintenance and network and maintains and in the Group of the. 1220/upgrater and maintain Figries and 21 function and maintenance of the and maintenance for the \n        In the 2 implementation and  and the and 2 services and the group and services and IT and  and security and  other software and services and the and maintenance and 1 Service and maintenance and the in the system and maintenance and in and maintenance and management and IT and IT and data1.\n task in and to for the 2 of the 11 domain in the management in theisions Functions functions: Infrastr and 1 F Network and up and In organizations, hardware and In the in the IT and In software and Networks and IT 211 Network of of the of the of the 212up of all of the in the and other in the domain and Network and maintains and the In1 tasks and systems of the of the and 1 other and IT and support for the group of the and the in the data and all the of the of the of the and IT infrastr \n\n 2121 Data and related Software and theI implementation and IT and maintenance and maintain and security and maintenance of the and maintenance 2 of the managementementi21 function of the server and services and I Recovery and maintenance and infrastructure-based and Network and services of the in the and 11 function and \n\n\n task of the group in-related and the of the I Recovery - other1 other other Open and IT and 3 services IT Infrastr of the I project of the 11 implementation and 1211s and \n User and maintenance F21 Data and 221 software and the services of the and \nusing the group in the of all the group of the 2 and maintenance and \n functioning of the of the program of the\n Services of the for the, hardware and domain and maintenance and maintenance and network and maintenance and 12 and \n user and 112 projects of the\n 2 Functions and maintenance of the \n provided softwareities of the of the In and  and 1213 of and maintenance of the and building and maintenance and 1 services and 1 other 22 services for the and operation and security and 2.\n format and 1 and  and  and 12 of the of the group of the and related and \n\n and 2 system of all of all and services and maintenance of the and 21.\ns and \n\n function.\n system and 2 IT and the  functions in the and Services.   1. 31 1/cloud, in the 1.\n       1 function and 1.\n\n\n1\n\n1 and 1 implementation of the server\n\nbased\n\n\n\n\n\n\n\n1 network for the for the\n\n\n\n                   11221.\n            F1/Cloud of in the 10 1 web and 1.\n softwarear of the 211 -1 server and the services and the Central / 1.\n  and 1 services of the of the 20 2 1 211 and security1 out and other server and infrastructure in software and maintenance and 2 2- \n and maintenance and the \n network and services:  and in 1 2.\n other Internet and 1.\n  Data and maintenance and in the group in the \n\n\n\n network and operation and \n\n 10 format \n provided and 1.\n\n group of the and 101 and 1 task and 1 21 organization and maintenance and 1/Services and 1.\n\n Assigned 2 management and \n\n\n                        Few of the security of 1\n\n 1. \n\n 1 user and \n2222 1.\n project:\n\n\n\n\n112\n\n\n other 12 and maintains and maintenance of 2 services.1.\n\n user\n   2.\n\n of the functionities and 1.\n\n\n\n\n\n\n\n\n\n\n\n\n1. 2 \n\n   1.\n\n11s\n\n - 1. domain: 2\n 1.\n\n\n\n\n\n\n\n       1.\n\n\n of the domain\n\n\n\n\n 1.\n\n 1 new and maintenance and 1.\n\n\n 1 and 1.\n\n\n\n\n\n\n\n\n\n * In the \n\n\n\n                 1 function \n\n\n\n 2 Computing and \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n       1.\n\n   \n\n",
    " {\n  \"Q1\": \"What is the main objective of the Software Development group (FG2)?\",\n  \"A1\": \"The main objective of the Software Development group is to collect requirements for software development and ensure that the development follows Government of India and software engineering guidelines, principles, and standards.\"\n  \n  \"Q2\": \"What is the role of the UI / UX Design group (SG1)?\",\n  \"A2\": \"The UI / UX Design group is responsible for designing responsive web interfaces, layouts, screens, logos, images, and headers.\"\n  \n  \"Q3: What does the Application Development group (SG2) do?\",\n  \"A3: \"The Application Development group designs and develops standalone and web-based software, manages and monitors the source code repository, and maintains interoperability across various applications.\"\n  \n  \"Q4: What is the responsibility of the Web Portal Development group (SG3)?\",\n  \"A4: \"The Web Portal Development group is responsible for developing web portals and ensuring technology-specific and cross-platform development.\"\n  \n  \"Q5: What is the role of the Mobile App Development group (SG4)?\",\n  \"A5: \"The Mobile App Development group develops and upgrades mobile applications.\"\n  \n  \"Q6: What does the API and Web Service Development group (SG5) do?\",\n  \"A6: \"The API and Web Service Development group ensures compliance with standards and interoperability, and develops APIs and web services.\"\n  \n  \"Q7: What is the role of the Software Standards and Quality Assurance group (FG3)?\",\n  \"A7: \"The Software Standards and Quality Assurance group is responsible for preparing, generating, and maintaining software standards and quality assurance.\"\n  \n  \"Q8: How does the Software Development group ensure interoperability?\",\n  \"A8: \"The Software Development group ensures interoperability by adhering to Government of India and software engineering guidelines, principles, and standards, as well as developing APIs and web services.\"\n  \n  \"Q9: What is the purpose of the Software Requirement Specification (SRS) document?\",\n  \"A9: \"The Software Requirement Specification (SRS) document helps in the development of application software, portals, mobile apps, APIs, and web services, and ensures that the development follows the necessary guidelines and standards.\"\n  \n  \"Q10: What is the role of the ICT Steering Committee in software development?\",\n  \"A10: \"The ICT Steering Committee approves the requirements for software development and oversees the overall planning objectives and key performance indicators.\"\n}",
    " { program and maintenance the group and maintenance and the implementation of the in the group.\n\n\n\n implementation21 implementation of the project and oper and oper implementation of the project management and the implementation and the following group with the implementation of the team. keeping implementation of the implementation and maintenance and maintenance of the project management and the group. role and maintenance and maintenance and maintenance.\n{ Building and maintenance and the project in the group.\n  implementation of the group of1 implementation of the product and the implementation of the following activities for the group and in the implementation and the group of the project management and the development and maintenance and the project management and operability.\n and in the group and maintenance of the groupages in the implementation of the following the deployment and maintenanceability, project and implementation and the implementation and maintenance.1 implementation of the project and the group with the group of the group and maintenance and the group of the group:\n\n other other activities.\n Y Y implementation and the group\n\n program\n                 and the group of the group of the implementation of the and the implementation of the group of the project.\n                1 and the group of the development of the group, in the group group.\n and implementation of111 and for the group in the group and operationals, and implementation. Ass and opera.\n\n and the group.\n group. implementationating and maintenance and maintenance and support of the group tasks in the implementation of the group.\n implementation of the group and support of the in the implementation and maintenance and support and maintenance and maintenance.\n provided in the in the group and the group of the implementation of the group in the group to be the group in the implementation management of the group and in the system and maintenance and maintenance and in the project in the group and maintenance and maintenance1 other in the of the team and implementation of the group, training and implementation in the and the implementation:\n Y implementation and maintenance in the group will be of the in the in the implementation and project management and maintenance foraging software and other and the implementation, implementation, and maintenance and maintenance and implementation\n\n project and maintenance and maintenance and the implementation and the implementations and in the and in the implementation and maintenance of the implementation and maintenance of the implementation of the development and supports of the following and maintenance. implementation in the system, maintenance and the following in the implementation and maintenance and the in the group will be implementation and maintenance.\n\n group. project for the implementation and in the product in the in the group and maintenance. of and the software, maintenance of the implementation of the and operational and in the implementation.\n Data implementation and maintenance and the in the project of the implementation of the implementation.\n\n y other activities and the implementation of of the group of the group, including the project implementation, and the implementation.\n operations in the project and maintenance and in the implementation and the in the in the group in the for the group of the in the following and the following and in the project.\n format in the I. in the group.\n S of the group in the group.\n \n\n\n\n\n\n                 Services. program.up and support for the implementation, and other. Building in the group in the group.\n of the system and opera.\n\n operations and maintenance of the system and maintenance in the implementation and project management and the group and other. Building, and the following and in the project and maintenance and the group of the following in the and the group in the implementation and the group and the group in the implementation and support and project and support and maintenance and the development of the implementation of the project management and operability of the group11 Policy and in the21 role and the project of the implementation and the implementation of the implementation of the group the group in the development of the implementation the implementation and maintenance of the implementation.\n user and maintenance,1 project management and management of the group.\n\n\nbased and maintenance as per and maintenance and in the following the following of the group of the group and oper1 other and maintenance and in the group in the system and maintain and the group, including the group Ass and the group of the following group in the group of the group and the group of the implementation of the implementation and support\n                \n\n\n The group in the design and a.\n provided in the following (1 implementation and maintenance and maintenance and the in the implementation of the implementation of the group,time to group of the and oper\n implementation and testing and the in the group for the group, the implementation and the team will be in the following in the following. The group will be the group will be the group, and in the following respons and the implementation of the project, the implementation of group of the group and the group and support and the group of the group in the implementation of the in the following in the group and maintenance and maintenance and the implementation of the group. implementation and maintenance and maintain and maintenance and maintenance and implementation and implementation of project management, the group. implementationated121 building and maintenance and the following in the team in the following and testing management, maintenance and maintenance of the group, and oper and the following and in the and to provide the group:\n\n\ns role and the following. role and maintenance and support and support and the group of the following and maintenance and the following and maintenance and implementation and maintain.\n format of the group and the group of the group in the group policy and the group for the implementation and maintenance and maintenance of the group and the implementation and in the group and the 1 - 1 tasks and the: Implement and the group and the group to ensure, implementation of the implementation of the 1 program and the group and \n\n\n\n11 Policy and maintenance and maintenance and support, maintenance and maintenance of the implementation of the group in the development policy and in the implementation and maintenance of group, implementation of and maintenance in the group and maintenance of the group and the group of the group for the following1 implementation and maintenance and maintenance and the group.\n\ns implementation and support and operability and the group and maintenance and the group is responsible for the group and the group and the group and the group and maintenance and maintenance and maintenance of the development and support and maintenance and maintenance and maintenance, maintenance and maintenance and maintenance and maintenance of the group, 1 S 1\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\ns S11115. The group implementation and maintenance and maintenance and maintenance and 1 Data and the following and development and maintenance in the implementation and the project management and the implementation operations and maintenance and maintenance in the group and 1 and maintenance of the S111 and 1 and project implementation and maintenance and the group and the group \n project management of the group.\n                 and maintenance and support and 1 implementation and maintenance and maintenance and maintenance and maintenance and maintenance and operational \n role and the project: \n\n i tasksability and maintenance of the group and maintenance and maintenance and \n\n\n operation and the group in the project management and maintenance of the implementationations and maintenance of and maintenance and 11 implementation and operations- \n\n time and maintenance and maintenance and maintenance and maintenance and maintaining and maintenance and the following, testing and  implementation of the implementation 1 other systems\n implementation.\n\n\n program and maintenance of on the 1.\n function  implementation and the \n\n\n\n\nated in the group in the group implementation of will be the implementation and in the implementation and the group.\n\n           1.\n\n in the following and 1 standard of the implementation of the group and maintenance and maintenance and 1.\n provided for the group. \n project management, the implementation of the 1 member and management and \n  The group and to provide and the development, including 1 implementation\n provided \n\n\n\n\n\n\n\n\n\n\n to maintain and operations will be the group implementation and operational and to provide and the group and support, and the implementation and maintenance of the group.\n 1 other activities  in the following, training and the implementation of the implementation of up to ensure and the group and implementation of the implementation.\nsY implementation, and the group in the team will be responsible for the development of the group.\n\n project and 1 implementation and in the group of in the product and maintenance and maintenanceta and maintenance and the implementation of the maintenance and the group for the group and 1 other of the 3 and 1 tasks and the implementation, and project and \n                 1 other and implementation. The group in the 10.\n following the following and 1.\n\n\n\n\n\n\n\n\n\n\n\n\n project management and maintenance and maintenance and the 1 other group and the implementation of the group and maintenance and maintenance and \n\n\n role implementation and the group, the 1 for the group in the group - \n\n 1 and \n user and maintenance and \n\n\n\n\n\n\n                responsibility.\n user and in the group, 1 program and 21 1.\n 1 requirements \n project in the group and the project and the11 \n\n functions and the 112.\n\n\n\n\n\n\n Department role, maintenance and the group and 1.\nbased and maintenance and maintain and maintenance of the group of the implementation of the implementation of the group and the group. \n\nresponsions and maintenance of the for the implementation of the development of the team.\n provided \n user in the implementation and the group",
    " { for the in the data in the data analytics\n\n21 Recognition database and I of the in implementation\n\n10 tasks and in implementationatedg and data.\n\n\n\n\n\n\n21 Policyes Support and Data of the Dataased in the of - Data\n\n2121 implementation other Data and data and data for the and data and data and \n\n\n\n1ness and the and Data. Dataics and the41 implementation Data.\n111 Recognorm\n31 Data- Data \n\ntable and Data and in the.\nprovimplementation.up and Data and Dataam and Data and data and Big and the Data and  Data 76 implementation of the and data Data Data and Data.\n of the Data Data and data and in the in the in the in1 Data in the following for the following and Data and in the in the �ategry Data1 Supporting1 Dataytics in the in the in the Data.\n\n\n\n\n7 of the162age and in the and 1 new and Data for and 11. �ruction and  Framework 11 Data Data& Assessay and data managementaging 1. I Task in the in the in the in the for the 1 Data 17721up the 171 121 2   16 1. Data 1 Data.\n171 Technology.\n 1 other to the following:\n\n126 1 �ands. 1.\n\n",
    " { and in the committee and in the Committee on the in the of IC:\n\n\n\n\n of the Policy to in the Committee to provide other in the in the committee.\n\n\n                 of the in the in the Committee on the Committee of the Director    y i Documentation of the Member of the other other of in the and I\n\n1 programies and the on the Member for the and in the Member Secretary, ADG (ICT). yy Other invited Members. yy Monitoring of ICT / IT activities in the Council as well as in Institutes. yy Discussion on latest developments including new initiatives. yy Approval of ICT initiatives and research programs for development of ICT / IT tools / software / systems. yy Coordination and guidance among different ICT / IT programs and programs based on emerging and disruptive technologies. 20 ICT-Roadmap 6.2.1 Questions and Answers:\n\n{\n    \"Q1\": \"Who is the Chairman of the Standing Committee?\",\n    \"A1\": \"The Chairman of the Standing Committee is the Director General (DG) of ICAR, New Delhi.\"\n},\n{\n    \"Q2\": \"How many Deputy Director Generals are part of the Standing Committee?\",\n    \"A2\": \"There are three Deputy Director Generals of ICAR in the Standing Committee.\"\n},\n{\n    \"Q3\": \"What is the term period for the Directors of other ICAR Institutes in the Standing Committee?\",\n    \"A3\": \"The term period for the Directors of other ICAR Institutes in the Standing Committee is two years.\"\n},\n{\n    \"Q4\": \"Who nominates the IT Expert from the National Informatics Centre or the Ministry of Electronics and IT?\",\n    \"A4\": \"The IT Expert from the National Informatics Centre or the Ministry of Electronics and IT is nominated by the Secretary of the Department.\"\n},\n{\n    \"Q5\": \"How many Experts from the body of registered Association/Society/Trust can be part of the Standing Committee?\",\n    \"A5\": \"Two Experts from the body of registered Association/Society/Trust can be part of the Standing Committee.\"\n},\n{\n    \"Q6\": \"Who is the Chairman of the ICT Steering Committee?\",\n    \"A6\": \"The Chairman of the ICT Steering Committee is the Secretary DARE and DG, ICAR.\"\n},\n{\n    \"Q7\": \"What are the roles and functions of the ICT Steering Committee?\",\n    \"A7\": \"The roles and functions of the ICT Steering Committee include identification and approval of new ICT initiatives, coordination and guidance among different ICT programs, and monitoring of ICT / IT activities.\"\n},\n{\n    \"Q8\": \"How often does the ICT Steering Committee meet?\",\n    \"A8\": \"The ICT Steering Committee meets twice a year.\"\n},\n{\n    \"Q9\": \"Who approves the ICT initiatives and research programs for development of ICT / IT tools / software / systems?\",\n    \"A9\": \"The ICT Steering Committee approves the ICT initiatives and research programs for development of ICT / IT tools / software / systems.\"\n},\n{\n    \"Q10\": \"What is the role of the ICT Steering Committee in relation to emerging and disruptive technologies?\",\n    \"A10\": \"The ICT Steering Committee provides guidance and coordination among different ICT programs and programs based on emerging and disruptive technologies.\"\n}\n",
    " {\n  \"Q1\": \"What is the role of the Monitoring body in the Council?\",\n  \"A1\": \"The Monitoring body monitors different ICT programs/initiatives and emerging/disruptive IT technologies at the national level.\"\n  \n  \"Q2\": \"What is the purpose of providing guidelines and directives for collaboration with institutions and organizations?\",\n  \"A2\": \"The purpose is to foster collaboration with national and international institutions/organizations working in the field of ICT and disruptive technologies.\"\n  \n  \"Q3\": \"What is the responsibility of the Implementation and Operational Management Committee (IOMC)?\",\n  \"A3\": \"The IOMC is responsible for implementing ICT initiatives, managing operations, and supporting IT operations to achieve ICAR's vision, mission, and strategic goals.\"\n  \n  \"Q4\": \"Who are the members of the IOMC?\",\n  \"A4\": \"The IOMC consists of leaders from all functional groups, representatives from other related government departments or ministries, the Director (Finance), the Director (Administration), the Head (Computer Application) at ICAR-IASRI, and invited members as per requirement.\"\n  \n  \"Q5\": \"What is the role of the IOMC in change management?\",\n  \"A5\": \"The IOMC formulates and assigns a change management plan whenever necessary, and devises a plan to sensitize, educate, and train users for adaptability of a system within ICAR.\"\n  \n  \"Q6\": \"How often does the Implementation and Operational Management Committee meet?\",\n  \"A6\": \"The committee meets normally twice a year, but can be called anytime as per requirement.\"\n  \n  \"Q7: What is the role of the Monitoring body in resource allocation?\",\n  \"A7: The Monitoring body identifies and ensures resources required for implementing national level programs in the field of emerging/disruptive technologies in IT.\"\n  \n  \"Q8: What is the role of the Monitoring body in capacity building?\",\n  \"A8: The Monitoring body identifies and approves relevant areas for capacity building in the field of IT/ICT in the Council.\"\n  \n  \"Q9: What is the role of the Monitoring body in assigning roles and functions to ICAR institutes?\",\n  \"A9: The Monitoring body assigns roles and functions to different ICAR institutes to work in a national program of importance in the field of ICT and disruptive technologies.\"\n  \n  \"Q10: What is the role of the Monitoring body in project initiation and monitoring?\",\n  \"A10: The Monitoring body initiates new programs/projects or discontinues current programs/projects as per directives of the Standing Committee.\"\n}",
    " {\n  \"Q1\": \"What is the purpose of the committee mentioned in the text?\",\n  \"A1\": \"The committee is responsible for ensuring overall sustainability, maintenance, and upgradation of ICT infrastructure and framework, as well as organizational continuity.\"\n  \n  \"Q2\": \"How often will the committee meet to assess the health of IT initiatives?\",\n  \"A2\": \"The committee will meet regularly, on a monthly basis, to assess the health of IT initiatives and provide relevant guidance.\"\n  \n  \"Q3\": \"What role will the committee play in case of a fallback or disaster?\",\n  \"A3\": \"The committee will invoke necessary guidelines, procedures, directions, and measures to ensure organizational continuity in case of a fallback or disaster.\"\n  \n  \"Q4\": \"What is the role of the ICT Unit at ICAR-IASRI, New Delhi?\",\n  \"A4\": \"The ICT Unit at ICAR-IASRI, New Delhi will help in implementation, coordination, and monitoring of IT services to the Council and its institutes.\"\n  \n  \"Q5\": \"Who will be responsible for managing and maintaining the ICT and Non-ICT infrastructural facilities at ICAR-IASRI and ICAR-NAARM?\",\n  \"A5\": \"The facilities will be managed and maintained by outsourcing under the supervision of a Principal / Senior Scientist who will lead the Infrastructural Functional Group.\"\n  \n  \"Q6: What is the role of the Functional Groups in the ICT Unit?\",\n  \"A6: The Functional Groups will be created in the ICT Unit and will work under the supervision of the Group Leader of the respective Functional Group.\"\n  \n  \"Q7: How will the Group Leaders of the Functional Groups be reviewed?\",\n  \"A7: The Group Leaders will be reviewed by ADG (ICT), ICAR.\"\n  \n  \"Q8: What is the role of the ICT Roadmap in the implementation plan of ICT activities?\",\n  \"A8: The ICT Roadmap will provide a phased implementation plan for ICT activities in ICAR.\"\n  \n  \"Q9: What is the role of the ICT Unit in the EFC?\",\n  \"A9: The ICT Unit will have a separate budget allocation through EFC for implementation, coordination, and monitoring of IT services.\"\n  \n  \"Q10: What is the role of ICAR-IASRI and ICAR-NAARM in assisting the ICT Unit?\",\n  \"A10: ICAR-IASRI and ICAR-NAARM will assist the ICT Unit by generating resources and providing support for the implementation and maintenance of ICT infrastructure.\"\n}",
    " {\n  \"Q1\": \"What is the purpose of the ICT Unit of the Council?\",\n  \"A1\": \"The ICT Unit is responsible for the development, implementation, capacity building, management, and monitoring of IT/ICT activities in different ICAR institutes.\"\n  \n  \"Q2\": \"How does the ICT Unit provide support to ICAR institutes?\",\n  \"A2\": \"The ICT Unit provides support through contractual manpower and also by identifying and approving IT-based short duration projects for funding.\"\n  \n  \"Q3\": \"What is the role of Group Leaders in the ICT Unit?\",\n  \"A3\": \"Group Leaders are given limited financial and administrative power to ensure smooth functioning of services, especially emergency services.\"\n  \n  \"Q4\": \"What is the role of the Steering Committee in the ICT Unit?\",\n  \"A4\": \"The Steering Committee identifies and approves IT-based short duration projects for funding to different ICAR institutes.\"\n  \n  \"Q5\": \"What is the purpose of the centralized 24x7 Helpdesk service center?\",\n  \"A5\": \"The Helpdesk service center provides all ICT services and works under Functional Group – 4 i.e., Implementation, Operational, Maintenance, and Support.\"\n  \n  \"Q6: What is the ICT-Roadmap?\",\n  \"A6: The ICT-Roadmap outlines the tentative targets and milestones of the proposed ICT unit in Phase-I, Phase-II, and Phase-III.\"\n  \n  \"Q7: What are some of the targets/milestones for Phase I of the ICT-Roadmap?\",\n  \"A7: Some targets/milestones for Phase I include the development of data standards and ICT policies, standardization of ICAR institutes' websites and digital systems, and implementation of e-office in ICAR.\"\n  \n  \"Q8: What is the role of the IT Unit created at ICAR-IASRI, New Delhi?\",\n  \"A8: The IT Unit at ICAR-IASRI, New Delhi, leads different proposed Functional Groups and is supported by technical staff.\"\n  \n  \"Q9: What kind of manpower does the ICT Unit require?\",\n  \"A9: The ICT Unit requires minimal permanent scientific, technical, administrative, financial, and supporting manpower, and mainly contractual staff with different levels of expertise and experience.\"\n  \n  \"Q10: What are some of the responsibilities of the ICT Unit in terms of digital agriculture?\",\n  \"A10: The ICT Unit is responsible for coordinating digital agricultural platforms, precision agriculture, and developing and integrating digital information networks for farmers.\"\n}",
    " {\n  \"Q1\": \"What are the challenges in the field of IT/ICT regarding staffing?\",\n  \"A1\": \"The rapid and diversified technological changes in IT/ICT make it difficult to recruit permanent staff in each field, necessitating the hiring of contractual staff with different expertise as required.\"\n  \n  \"Q2\": \"How does hiring contractual staff benefit the Council in the field of IT/ICT?\",\n  \"A2\": \"Hiring contractual staff with different expertise allows the Council to develop digital solutions using the latest technologies, while also providing flexibility and efficiency in developing various digital solutions.\"\n  \n  \"Q3\": \"What is the role of permanent staff in the ICT Unit of ICAR?\",\n  \"A3\": \"Permanent staff in the ICT Unit of ICAR are re-deployed from existing cadres of the Council, and they are responsible for various roles such as scientists, technical staff, under secretaries, FAO, section officers, and assistant/UDC/LDC.\"\n  \n  \"Q4\": \"How many permanent staff are required in the ICT Unit at ICAR, New Delhi?\",\n  \"A4\": \"The ICT Unit at ICAR, New Delhi requires a total of 27 permanent staff, including 3 scientists, 3 technical staff, 1 under secretary, 1 FAO, 1 section officer, and 5 assistant/UDC/LDC.\"\n  \n  \"Q5\": \"How many permanent staff are required in the IT Unit at ICAR-IASRI, New Delhi?\",\n  \"A5\": \"The IT Unit at ICAR-IASRI, New Delhi requires a total of 11 permanent staff, including 5 scientists, 5 technical staff, and 1 assistant/UDC/LDC.\"\n  \n  \"Q6\": \"Why is capacity building important for permanent staff in the field of IT/ICT?\",\n  \"A6\": \"Capacity building is essential to make permanent staff productive, effective, and competitive in the latest ICT/IT developments.\"\n  \n  \"Q7\": \"How many contractual manpower are required in the field of IT/ICT at present?\",\n  \"A7\": \"At present, a maximum of 50 contractual manpower of various categories may be required in the field of IT/ICT.\"\n  \n  \"Q8\": \"What are the qualifications and experience of contractual staff in the field of IT/ICT?\",\n  \"A8\": \"The qualifications and experience of contractual staff in the field of IT/ICT may be modified based on requirements from time to time.\"\n  \n  \"Q9\": \"How is the hiring of contractual staff in the field of IT/ICT done?\",\n  \"A9\": \"The hiring of contractual staff in the field of IT/ICT is done following ICAR/DST/GoI procedures and approval from the Competent Authority.\"\n  \n  \"Q10\": \"What is the purpose of the 'Ex-situ Crop Residue Management Options' publication?\",\n  \"A10\": \"The 'Ex-situ Crop Residue Management Options' publication provides information and guidance on managing crop residues outside the field to reduce the problem of crop residue burning.\"\n}"
]