[
    "{\n  \"Q\": \"What is the primary sector of many economies that provides food, raw materials, and employment opportunities?\",\n  \"A\": \"Agriculture is the primary sector of many economies that provides food, raw materials, and employment opportunities.\",\n  \"Q\": \"What activities are included in agriculture?\",\n  \"A\": \"Agriculture includes crop cultivation, animal husbandry, fisheries, and forestry.\",\n  \"Q\": \"How has modern agriculture improved productivity?\",\n  \"A\": \"Modern agriculture has improved productivity through precision farming, genetically modified crops, and sustainable irrigation techniques.\",\n  \"Q\": \"Why is soil health important in agriculture?\",\n  \"A\": \"Soil health is crucial for maintaining agricultural productivity by providing essential nutrients to crops.\",\n  \"Q\": \"What methods are used to maintain soil fertility?\",\n  \"A\": \"Farmers use fertilizers, crop rotation, and organic farming techniques to maintain soil fertility.\",\n  \"Q\": \"How does water management contribute to agriculture?\",\n  \"A\": \"Irrigation and rainwater harvesting ensure consistent crop yields, especially in drought-prone areas.\",\n  \"Q\": \"What are the major challenges faced in agriculture?\",\n  \"A\": \"Major challenges in agriculture include pests, diseases, climate change, and unpredictable weather patterns.\",\n  \"Q\": \"How do farmers protect crops from pests?\",\n  \"A\": \"Farmers use pesticides, biological control methods, and integrated pest management strategies to protect crops.\",\n  \"Q\": \"How does climate change impact agriculture?\",\n  \"A\": \"Climate change impacts agriculture by causing unpredictable weather, rising temperatures, and increased occurrences of droughts and floods.\",\n  \"Q\": \"How do governments support agriculture?\",\n  \"A\": \"Governments support agriculture through subsidies, research funding, and policies promoting sustainable farming practices.\",\n  \"Q\": \"Why are agricultural markets and supply chains important?\",\n  \"A\": \"Agricultural markets and supply chains are crucial for ensuring fair prices for farmers and affordable food for consumers.\"\n}",
    "{\n  \"Q\": \"What does R RABI AgRo-AdvIsoRy stand for?\",\n  \"A\": \"R RABI AgRo-AdvIsoRy stands for Rabi Agricultural Research and Innovation for Farmers, a program by the Indian Council of Agricultural Research (ICAR).\",\n  \"Q\": \"What is the main purpose of R RABI AgRo-AdvIsoRy?\",\n  \"A\": \"The main purpose of R RABI AgRo-AdvIsoRy is to promote agricultural research and innovation for farmers.\",\n  \"Q\": \"Who sponsors R RABI AgRo-AdvIsoRy?\",\n  \"A\": \"R RABI AgRo-AdvIsoRy is sponsored by the Indian Council of Agricultural Research (ICAR).\",\n  \"Q\": \"What are the benefits of R RABI AgRo-AdvIsoRy for farmers?\",\n  \"A\": \"R RABI AgRo-AdvIsoRy provides farmers with access to improved agricultural practices, technologies, and innovations that can increase productivity and sustainability.\",\n  \"Q\": \"How does R RABI AgRo-AdvIsoRy contribute to sustainable agriculture?\",\n  \"A\": \"R RABI AgRo-AdvIsoRy contributes to sustainable agriculture by promoting research and innovation in areas such as soil health, water management, and pest management.\",\n  \"Q\": \"What types of research does R RABI AgRo-AdvIsoRy focus on?\",\n  \"A\": \"R RABI AgRo-AdvIsoRy focuses on research in areas such as crop cultivation, animal husbandry, fisheries, and forestry.\",\n  \"Q\": \"How does R RABI AgRo-AdvIsoRy support farmers in managing pests and diseases?\",\n  \"A\": \"R RABI AgRo-AdvIsoRy supports farmers in managing pests and diseases by promoting integrated pest management strategies and providing access to biological control methods.\",\n  \"Q\": \"What role does R RABI AgRo-AdvIsoRy play in addressing climate change impacts on agriculture?\",\n  \"A\": \"R RABI AgRo-AdvIsoRy plays a role in addressing climate change impacts on agriculture by promoting research and innovation in areas such as drought and flood management, and developing climate-resilient crops and farming practices.\",\n  \"Q\": \"How does R RABI AgRo-AdvIsoRy ensure that farmers receive fair prices for their produce?\",\n  \"A\": \"R RABI AgRo-AdvIsoRy ensures that farmers receive fair prices for their produce by supporting agricultural markets and supply chains, and promoting policies that protect farmers' rights and interests.\"\n}",
    "{\n  \"Q\": \"What does R RABI AgRo-AdvIsoRy stand for?\",\n  \"A\": \"R RABI AgRo-AdvIsoRy stands for Rabi Agricultural Research Institute's Agricultural Extension Services.\",\n  \"Q\": \"What is the primary purpose of R RABI AgRo-AdvIsoRy?\",\n  \"A\": \"The primary purpose of R RABI AgRo-AdvIsoRy is to provide agricultural research and extension services to farmers.\",\n  \"Q\": \"What kind of activities does R RABI AgRo-AdvIsoRy engage in?\",\n  \"A\": \"R RABI AgRo-AdvIsoRy engages in agricultural research, development, and extension activities to improve farming practices.\",\n  \"Q\": \"How does R RABI AgRo-AdvIsoRy support farmers?\",\n  \"A\": \"R RABI AgRo-AdvIsoRy supports farmers by conducting research, providing training, and disseminating information on improved agricultural practices.\",\n  \"Q\": \"What is the significance of R RABI AgRo-AdvIsoRy's work in agriculture?\",\n  \"A\": \"R RABI AgRo-AdvIsoRy's work is significant as it contributes to increasing agricultural productivity, ensuring food security, and enhancing the livelihoods of farmers.\",\n  \"Q\": \"What challenges does R RABI AgRo-AdvIsoRy address in agriculture?\",\n  \"A\": \"R RABI AgRo-AdvIsoRy addresses challenges such as pest and disease management, climate change impacts, and the adoption of sustainable farming practices.\",\n  \"Q\": \"How does R RABI AgRo-AdvIsoRy contribute to sustainable agriculture?\",\n  \"A\": \"R RABI AgRo-AdvIsoRy contributes to sustainable agriculture by promoting practices like crop rotation, organic farming, and efficient water management.\",\n  \"Q\": \"What role does R RABI AgRo-AdvIsoRy play in research and development?\",\n  \"A\": \"R RABI AgRo-AdvIsoRy plays a key role in agricultural research and development by conducting studies on crop improvement, soil health, and innovative farming techniques.\",\n  \"Q\": \"How does R RABI AgRo-AdvIsoRy disseminate its findings to farmers?\",\n  \"A\": \"R RABI AgRo-AdvIsoRy disseminates its findings through extension services, workshops, training programs, and publications aimed at farmers and agricultural stakeholders.\",\n  \"Q\": \"What impact does R RABI AgRo-AdvIsoRy have on the agricultural sector?\",\n  \"A\": \"R RABI AgRo-AdvIsoRy has a positive impact on the agricultural sector by enhancing productivity, promoting sustainable practices, and supporting farmers in adopting modern technologies.\"\n}",
    "{\n  \"Q1\": \"What has the Indian Council of Agricultural Research achieved in the development of new crop varieties?\",\n  \"A1\": \"The Indian Council of Agricultural Research has developed 52 biofortified varieties and new varieties of pulses, contributing to food and nutritional security.\",\n  \"Q2\": \"How did the development of new pulse varieties impact the agricultural sector during 2016-19?\",\n  \"A2\": \"The availability of high-quality seeds of new pulse varieties contributed significantly to the pulses revolution during 2016-19.\",\n  \"Q3\": \"What was the focus of the Indian Council of Agricultural Research in animal breed conservation and improvement?\",\n  \"A3\": \"The focus was on the conservation and improvement of indigenous animal breeds, including the registration of 41 animal breeds, including poultry.\",\n  \"Q4\": \"What initiatives were taken by the Indian Council of Agricultural Research towards the Blue Revolution?\",\n  \"A4\": \"Induced breeding technologies were standardized, open-sea cage farming was promoted, and nutraceutical/health products from sea-weeds were developed and commercialized.\",\n  \"Q5\": \"What was the significance of the Minilab for soil testing developed by the Indian Council of Agricultural Research?\",\n  \"A5\": \"The Minilab for soil testing was a milestone in the area of soil health assessment, providing affordable and integrated soil testing.\",\n  \"Q6\": \"What new farming system models were developed by the Indian Council of Agricultural Research?\",\n  \"A6\": \"The Indian Council of Agricultural Research developed new integrated and organic farming system models.\",\n  \"Q7\": \"How were the IFS models by the Indian Council of Agricultural Research upscaled?\",\n  \"A7\": \"The IFS models were upscaled by state governments of Tamil Nadu and Kerala, being implemented in thousands of farmers' fields.\",\n  \"Q8\": \"What measures were taken by the Indian Council of Agricultural Research to ensure high-quality higher agricultural education?\",\n  \"A8\": \"The Indian Council of Agricultural Research strengthened the process of accreditation of agricultural universities/colleges and took measures to attract talented students to agricultural education and research.\",\n  \"Q9\": \"What was the purpose of implementing the Fifth Deans’ Committee Report and National Higher Education Project by the Indian Council of Agricultural Research?\",\n  \"A9\": \"The purpose was to generate improvements in higher agricultural education and research in India.\",\n  \"Q10\": \"How did the Indian Council of Agricultural Research contribute to the conservation and improvement of indigenous animal breeds?\",\n  \"A10\": \"The Indian Council of Agricultural Research registered 41 animal breeds, including poultry, and focused on the development of new vaccines and diagnosis kits for efficient management of animal diseases, increasing animal productivity.\"\n}",
    "{\n\"Q: What was the impact of ICAR's efforts on rice residue burning events in 2018 compared to 2016?\",\n\"A: ICAR's efforts led to a 40% reduction in rice residue burning events in 2018 compared to 2016, as evidenced by remote sensing imagery.\",\n\"Q: Which regions did ICAR focus on for difficult and remote agricultural development?\",\n\"A: ICAR focused on Leh-Ladakh, high hills in the north-eastern region, and Andaman and Nicobar Island.\",\n\"Q: With which organizations did ICAR sign MoUs to enhance agricultural research?\",\n\"A: ICAR signed MoUs with DBT, CSIR, ICMR, ICFRE, IIT (D), and IMD.\",\n\"Q: What award did ICAR receive in 2018 for its work on wheat rust diseases?\",\n\"A: ICAR received the Global Gene Stewardship Award 2018 from the Borlaug Global Rust Initiative.\",\n\"Q: What was the theme of the ICAR Tableau presented on 26th January 2019?\",\n\"A: The theme of the ICAR Tableau was 'Kisan Gandhi'.\",\n\"Q: What are some of the focus areas of ICAR's research and development?\",\n\"A: ICAR's focus areas include food and nutritional security, pulses revolution, indigenous breeds and health management, fishery technologies, natural resources management, mechanization of field operations, higher agricultural education, lab to land and farmers outreach, interfacing and coordination with states, technology commercialization, and collaboration with national and international agencies.\",\n\"Q: How did ICAR's coordination and collaboration with international research centres and organizations improve during the five years?\",\n\"A: ICAR's coordination and collaboration with international research centres and organizations improved significantly, bringing visible impacts.\",\n\"Q: What were some of the significant achievements of DARE/ICAR during 2014-19?\",\n\"A: Significant achievements of DARE/ICAR during 2014-19 include advancements in agricultural R&D, increased efficiency, and new initiatives to meet current and future challenges.\",\n\"Q: How did ICAR's efforts contribute to the Pulses Revolution?\",\n\"A: ICAR's efforts contributed to the Pulses Revolution by focusing on research and development in pulses technology.\",\n\"Q: What role did ICAR play in the Blue Revolution?\",\n\"A: ICAR played a role in the Blue Revolution by developing fishery technologies.\",\n\"Q: How did ICAR contribute to climate resilient agriculture?\",\n\"A: ICAR contributed to climate resilient agriculture by focusing on natural resources management and developing technologies to adapt to climate change.\",\n\"Q: What initiatives did ICAR undertake to enhance agricultural education and outreach?\",\n\"A: ICAR undertook initiatives such as strengthening higher agricultural education and lab to land and farmers outreach to enhance agricultural education and outreach.\"\n}",
    "{\n  \"Q1\": \"What is the Indian National Agricultural Research and Education Systems (NARES) known for?\",\n  \"A1\": \"NARES is known for being one of the largest scientific communities in the world in terms of human resources, infrastructure, research, education, and frontline extension network.\",\n  \"Q2\": \"When was the Indian Council of Agricultural Research (ICAR) established?\",\n  \"A2\": \"ICAR was established on 16 July 1929.\",\n  \"Q3\": \"Under which ministry does ICAR operate?\",\n  \"A3\": \"ICAR operates under the Department of Agricultural Research and Education (DARE), Ministry of Agriculture and Farmers’ Welfare, Government of India.\",\n  \"Q4\": \"What is the primary function of ICAR?\",\n  \"A4\": \"ICAR coordinates, guides, and manages research, education, and extension in agriculture and allied sectors.\",\n  \"Q5\": \"How many research institutes are part of ICAR's network?\",\n  \"A5\": \"ICAR's network includes 102 research institutes.\",\n  \"Q6\": \"What is the role of ICAR in terms of germplasm conservation?\",\n  \"A6\": \"ICAR is the custodian of a huge collection of germplasm for plants, animals, fishes, insects, and microbes for their conservation and sustainable use.\",\n  \"Q7\": \"What type of advisory services does ICAR provide to the farming community?\",\n  \"A7\": \"ICAR provides science-based agro-technology advisory services to the farming community.\",\n  \"Q8\": \"What is the focus of ICAR's 2050 research and development areas?\",\n  \"A8\": \"The focus areas include genetic potential enhancement and development of value chains of agricultural commodities, as well as agricultural productivity, input-use efficiency, and profitability.\",\n  \"Q9\": \"How does ICAR support agricultural education in the country?\",\n  \"A9\": \"ICAR supports agricultural education through its deemed-to-be Universities and State Agricultural Universities, following the University Grants Commission (UGC) pattern.\",\n  \"Q10\": \"In what ways does ICAR support developing countries?\",\n  \"A10\": \"ICAR provides techno-economic and educational support to developing countries to increase international cooperation.\"\n}",
    "{\n\"Q\": \"What is the significance of the Pusa Basmati 1121 variety in Indian agriculture?\",\n\"A\": \"Pusa Basmati 1121, developed in 2003, now occupies about 70% of the basmati area in India and contributed Rs. 19939 crores in export earnings in 2018-19.\",\n\"Q\": \"How has the HD 2967 wheat variety impacted the Indian wheat sector?\",\n\"A\": \"The HD 2967 wheat variety, developed in 2011, covers about 40% of the wheat area in India and generated an economic surplus of Rs. 12,889 crores in 2018-19.\",\n\"Q\": \"What are the economic benefits of the Co 0238 sugarcane variety in India?\",\n\"A\": \"Co 0238, developed in 2009, achieved a sugar recovery of ~12% and covered over 80% of the sugarcane area in UP and northern States, generating an economic surplus of Rs. 10,064.3 crores in 2017-18.\",\n\"Q\": \"How has the Pusa Mustard 25 variety contributed to the mustard industry in India?\",\n\"A\": \"Pusa Mustard 25, released in 2010, occupied about 20% of the total mustard area in India and generated an estimated economic surplus of Rs. 14,323 crores during 2010-2018.\",\n\"Q\": \"What is the economic impact of the Potato variety Kufri Pukhraj in India?\",\n\"A\": \"Kufri Pukhraj, released in 1998, covers about 33% of the total potato area in India and generated an economic surplus of Rs. 4,729.0 crores in 2017-18.\",\n\"Q\": \"How have the Arka Rakshak and Arka Samrat tomato hybrids impacted the tomato industry in India?\",\n\"A\": \"The Arka Rakshak and Arka Samrat tomato hybrids, developed in 2010, are resistant to triple disease (leaf curl virus, bacterial wilt, and early blight), and since their release, they have accrued a total economic surplus of Rs. 237.82 crores (2018 prices).\",\n\"Q\": \"What is the economic impact of the attenuated PPR vaccine in India?\",\n\"A\": \"The attenuated PPR vaccine, developed in 2001, has resulted in a significant economic surplus of Rs. 9,826 crores in 2017-18.\",\n\"Q\": \"How has the Jayanti Rohu variety contributed to the Indian fish industry?\",\n\"A\": \"Jayanti Rohu, developed by ICAR, has an annual market value of Rs. 1313 crores and generated an economic surplus of Rs. 2547 crores during 1992-2018.\",\n\"Q\": \"What are the economic benefits of using drum seeders in paddy cultivation in India?\",\n\"A\": \"The adoption of drum seeders, an alternative to transplanting paddy seedlings, generated an economic surplus of Rs. 3,020 crores.\",\n\"Q\": \"How has the development of new agricultural technologies and initiatives contributed to farmers' welfare in India?\",\n\"A\": \"New agricultural technologies and initiatives, such as bio-security, agricultural mechanization, and the use of ICTs, have significantly contributed to farmers' welfare in India by enhancing productivity, reducing losses, and promoting sustainable farming practices.\"\n}",
    "{\n  \"Q1\": \"What are the main revolutions mentioned by the Prime Minister of India in 2017 to improve the lives of fishermen and farmers?\",\n  \"A1\": \"Green, White, Blue, and Sweet revolutions.\",\n  \"Q2\": \"What is the main objective of the Indian Council of Agricultural Research (ICAR) in relation to food security?\",\n  \"A2\": \"To ensure food security in the country and address challenges of climate change.\",\n  \"Q3\": \"By what year has India committed to achieving Zero Hunger according to Sustainable Development Goal-2 (SDG-2)?\",\n  \"A3\": \"2030.\",\n  \"Q4\": \"How many high yielding varieties were released by ICAR during 2014-19?\",\n  \"A4\": \"1234.\",\n  \"Q5\": \"How many of these varieties were climate resilient and stress tolerant?\",\n  \"A5\": \"1020.\",\n  \"Q6\": \"What was the percentage increase in the production of quality planting materials for horticultural crops by ICAR institutes during 2014-19 compared to 2009-14?\",\n  \"A6\": \"62.4% in cuttings, 71.5% in bulbs, and 89.1% in saplings.\",\n  \"Q7\": \"How many crop varieties were bio-fortified with higher levels of Fe, Zn, protein, and provitamin A during 2014-19?\",\n  \"A7\": \"52.\",\n  \"Q8\": \"How many quintals of breeder seed were produced for the 16 bio-fortified varieties during 2016-19 to 2018-19?\",\n  \"A8\": \"3483.8 quintals.\",\n  \"Q9\": \"What is the role of ICAR in the context of breeder seed production?\",\n  \"A9\": \"ICAR is the nodal agency for coordination of Breeder Seed production in the country.\",\n  \"Q10\": \"By what percentage did the breeder seed production increase during 2014-19 compared to the previous period?\",\n  \"A10\": \"10%.\"\n}",
    "{\n  \"Q1\": \"How much did the seed production in Krishi Vigyan Kendras (KVKs) increase from 2009-14 to 2014-19?\",\n  \"A1\": \"The seed production in KVKs increased by about 40% from 10.1 lakh quintals to 14.16 lakh quintals.\",\n  \"Q2\": \"What was the increase in planting materials production by KVKs from 2009-14 to 2014-19?\",\n  \"A2\": \"The planting materials production increased by 184% from 853.15 lakh to 2425.45 lakh.\",\n  \"Q3\": \"What was the net production of pulses in India in 2018-19?\",\n  \"A3\": \"The net production of pulses in India in 2018-19 was 25.42 million tonnes.\",\n  \"Q4\": \"What was the percentage increase in productivity of pulses in India during 2015-16?\",\n  \"A4\": \"The productivity of pulses in India increased by 24% during 2015-16.\",\n  \"Q5\": \"How many improved varieties of pigs and poultry were developed during 2014-19 compared to 2009-14?\",\n  \"A5\": \"During 2014-19, 13 improved varieties of pigs and poultry were developed, compared to 3 during 2009-14.\",\n  \"Q6\": \"How many animal clones of superior buffalo germplasm were registered/accessioned during 2014-19 compared to 2009-14?\",\n  \"A6\": \"During 2014-19, 7 animal clones of superior buffalo germplasm were registered/accessioned, compared to 3 during 2009-14.\",\n  \"Q7\": \"How many new breeds of livestock and poultry were registered/accessioned during 2014-19 compared to 2009-14?\",\n  \"A7\": \"During 2014-19, 41 new breeds of livestock and poultry were registered/accessioned, compared to 15 during 2009-14.\",\n  \"Q8\": \"What was the percentage increase in FMD surveillance testing during 2014-19 over 2009-14?\",\n  \"A8\": \"Sero-monitoring for FMD surveillance testing increased by 95% during 2014-19 over 2009-14.\",\n  \"Q9\": \"How many new vaccines/vaccine candidates for animal diseases were developed during 2014-19 compared to 2009-14?\",\n  \"A9\": \"During 2014-19, ten new vaccines/vaccine candidates for animal diseases were developed, compared to 7 during 2009-14.\",\n  \"Q10\": \"How many diagnostic kits for animal diseases and animal products were developed during 2014-19 compared to 2009-14?\",\n  \"A10\": \"Forty-three diagnostic kits for animal diseases and animal products were developed during 2014-19, compared to 29 during 2009-14.\"\n}",
    "{\n  \"Q\": \"What new finfish/shellfish species were identified during 2014-19 compared to 2009-14?\",\n  \"A\": \"Twenty-two new species were identified during 2014-19 compared to 17 during 2009-14.\",\n  \"Q\": \"How many improved strains/varieties of aquaculture species were developed during 2014-19?\",\n  \"A\": \"Five improved strains/varieties were developed during 2014-19.\",\n  \"Q\": \"What technologies were developed for ornamental fish breeding during 2014-19?\",\n  \"A\": \"Breeding technologies were developed for 36 ornamental fish species during 2014-19.\",\n  \"Q\": \"How many improved/new aquaculture systems were designed for finfish/shellfish culture during 2014-19?\",\n  \"A\": \"Twelve improved/new aquaculture systems were designed during 2014-19.\",\n  \"Q\": \"What species were expanded in marine cage culture along the coast in 2014-19?\",\n  \"A\": \"Cobia (Rachicentron canadum), silver pompano (Trichinotus blochi), and seabass (Lates calcarifer) were expanded.\",\n  \"Q\": \"How many indigenous fish feed formulations were developed during 2014-19?\",\n  \"A\": \"Twenty-five fish feed formulations were developed during 2014-19.\",\n  \"Q\": \"How many diagnostic/analysis kits were designed for fisheries and aquaculture management during 2014-19?\",\n  \"A\": \"Twenty-five diagnostic/analysis kits were designed during 2014-19.\",\n  \"Q\": \"How many high-value compounds and nutraceuticals were identified from seaweeds and fish waste during 2014-19?\",\n  \"A\": \"Thirty high-value compounds and nutraceuticals were identified during 2014-19.\",\n  \"Q\": \"How many fishing crafts/equipment/gadgets were designed for fisheries and aquaculture management during 2014-19?\",\n  \"A\": \"Nineteen fishing crafts/equipment/gadgets were designed during 2014-19.\",\n  \"Q\": \"How many value-added fish products were developed during 2014-19?\",\n  \"A\": \"Twenty-two value-added fish products were developed during 2014-19.\"\n}",
    "{\n  \"Q1\": \"What was the range of annual income enhancement per hectare for small and marginal farmers due to the developed models?\",\n  \"A1\": \"Rs. 1.5 - 3.6 lakhs\",\n  \"Q2\": \"How many IFS demonstration units were established in additional KVKs during 2014-19, and how many states were covered?\",\n  \"A2\": \"100 units covering 29 states\",\n  \"Q3\": \"How many demonstration units were developed during 2016-19 compared to 2009-14?\",\n  \"A3\": \"14 units developed during 2016-19 compared to 2009-14\",\n  \"Q4\": \"What types of technologies were included in the organic farming package for 33 crops/cropping systems?\",\n  \"A4\": \"Various technologies and practices\",\n  \"Q5\": \"How many crops and cropping systems had optimum irrigation schedules defined during 2014-19?\",\n  \"A5\": \"32 crops and cropping systems\",\n  \"Q6\": \"What was the increase in the number of agro-processing centres from 2009-14 to 2014-19?\",\n  \"A6\": \"Almost doubled from 121 to 217 centres\",\n  \"Q7\": \"How many food testing labs were established for the first time during 2014-19?\",\n  \"A7\": \"30 food testing labs\",\n  \"Q8\": \"What was the percentage reduction in straw burning events in 2018 compared to 2016?\",\n  \"A8\": \"40.86% reduction\",\n  \"Q9\": \"How many SAUs were accredited during 2014-19 compared to 2009-14?\",\n  \"A9\": \"59 SAUs accredited during 2014-19 compared to 4 during 2009-14\",\n  \"Q10\": \"What was the purpose of establishing 14 Centres of Excellence in SAUs and Deemed Universities of ICAR?\",\n  \"A10\": \"To promote agricultural research and education\"\n}",
    "{\n\"Q: How many experiential learning units were established in SAUs and how many students benefited from them in 2015-16?\",\n\"A: 452 experiential learning units were established in SAUs, benefiting 69621 students.\",\n\"Q: What was the purpose of the Emeritus Professor Scheme initiated in 2016-17?\",\n\"A: The Emeritus Professor Scheme was initiated to harness the potentials of experienced teachers in State Agricultural Universities.\",\n\"Q: How many slots were enhanced for the Netaji Subhash International Fellowship for overseas doctoral degree programs?\",\n\"A: The slots for the Netaji Subhash International Fellowship were enhanced from 25 to 50.\",\n\"Q: What was the Student-READY programme launched in 2015 focused on?\",\n\"A: The Student-READY programme was focused on exposing undergraduate students to various facets of agri-entrepreneurship.\",\n\"Q: How much was the student stipend under the Student-READY programme enhanced to?\",\n\"A: The student stipend under the Student-READY programme was enhanced to Rs. 3000 per month.\",\n\"Q: How many new pilot courses were introduced on communication skills, entrepreneurial skills, creative and innovative thinking, and leadership skills?\",\n\"A: 65 new pilot courses were introduced on communication skills, entrepreneurial skills, creative and innovative thinking, and leadership skills.\",\n\"Q: What was the major outcome of the H. Lab to Land and Farmers Outreach initiative?\",\n\"A: The major outcome of the H. Lab to Land and Farmers Outreach initiative was the establishment of District Agro-Met Units (DAMUs) in 199 KVKs.\",\n\"Q: How many units of agro-enterprises were established under the 'Attracting and Retaining Youth in Agriculture' (ARYA) program, and how many rural youth benefited from them?\",\n\"A: 1952 units of agro-enterprises were established under the ARYA program, benefitting 4964 rural youth.\",\n\"Q: How many mobiles apps on farm and farmers-related services were developed by ICAR between 2014-19?\",\n\"A: ICAR developed 171 mobiles apps on farm and farmers-related services between 2014-19.\",\n\"Q: How many mobile agro-advisories were provided by KVKs during 2014-19, and how does it compare to the period 2009-14?\",\n\"A: KVKs provided 26.85 crore mobile agro-advisories during 2014-19, compared to 0.41 crore during 2009-14.\",\n\"Q: How many farmers and extension personnel were trained by KVKs during 2014-19 compared to 2009-14?\",\n\"A: KVKs trained 78.52 lakh farmers and 6.83 lakh extension personnel during 2014-19, compared to 74.76 and 5.91 lakh respectively during 2009-14.\",\n\"Q: What was the purpose of the Technology Demonstration Component of NICRA launched by ICAR?\",\n\"A: The Technology Demonstration Component of NICRA was launched to demonstrate exclusive climate resilient technology packages of crops and livestock production systems in vulnerable districts.\"\n}",
    "{\n  \"Q1\": \"How many centers under ICAR and SAUs were involved in the program, and how many farm families did it benefit?\",\n  \"A1\": \"51 centers under ICAR and SAUs spread over 20 states benefited 155,265 farm families.\",\n  \"Q2\": \"What was the total number of frontline demonstrations (FLDs) organized, and how many farmers were trained through these demonstrations?\",\n  \"A2\": \"7.88 lakh FLDs were organized, training 78.52 lakh farmers, including farm women and rural youth.\",\n  \"Q3\": \"How many farmers were trained exclusively in pulses and oilseeds through FLDs?\",\n  \"A3\": \"3.17 lakh farmers were trained exclusively in pulses and 2.23 lakh in oilseeds.\",\n  \"Q4\": \"What role did Krishi Kalyan Abhiyan (KKA) play in the development work in 112 aspirational districts?\",\n  \"A4\": \"KKVs played a key role in intensifying development work in 112 aspirational districts under KKA.\",\n  \"Q5\": \"How many farmers were trained by KVKs, and how many training programs were organized?\",\n  \"A5\": \"11.05 lakh farmers from 5,716 villages were trained through 27,000 training programs.\",\n  \"Q6\": \"What was the purpose of the strategic Information, Education and Communication (IEC) campaign organized by KVKs?\",\n  \"A6\": \"The IEC campaign aimed for in situ management of crop residues in ~700 villages in northern India.\",\n  \"Q7\": \"What significant day was celebrated globally on 15th October, and how is it observed in India?\",\n  \"A7\": \"The 15th October celebrated globally as the International Day for Rural Women was declared as the Mahila Kisan Diwas in India, observed every year across the National Agricultural Research and Education System.\",\n  \"Q8\": \"What was the purpose of the Strategic Action Plan for Doubling of Farmers' Income?\",\n  \"A8\": \"The plan aimed to double farmers' income through State Level Coordination Committees, with action points and timelines defined for each state.\",\n  \"Q9\": \"How many Abri-business Incubators (ABIs) were established in 2016, and what was their purpose?\",\n  \"A9\": \"50 ABIs were established in 2016 to convert agriculture technologies into commercial propositions.\",\n  \"Q10\": \"How many successful startups were initiated during the periods 2009-14 and 2014-19, and how did the number of technologies licensed change between these periods?\",\n  \"A10\": \"During 2009-14, 53 successful startups were initiated, and during 2014-19, 501 startups were initiated. The number of technologies licensed increased from 332 during 2009-14 to 538 during 2014-19.\"\n}",
    "{\n  \"Q\": \"What significant partnership did ICAR enter into with DD-Kisan and when was the MoU signed?\",\n  \"A\": \"ICAR entered into a significant partnership with DD-Kisan, signing the MoU on 26th May, 2015 to enable mass media outreach.\"\n},\n{\n  \"Q\": \"Which prominent scientific organizations did ICAR sign a MoU with to break silos in frontline research?\",\n  \"A\": \"ICAR signed a MoU with CSIR, ICMR, ICFRE, DBT, and IIT(D) to break silos in frontline research.\"\n},\n{\n  \"Q\": \"What new section was established by ICAR to facilitate international cooperation?\",\n  \"A\": \"ICAR established a new section for International Relations to facilitate international cooperation.\"\n},\n{\n  \"Q\": \"What was the first-ever online platform introduced by ICAR for foreign deputation?\",\n  \"A\": \"ICAR introduced the first-ever online processing platform for foreign deputation at https://fvms.icar.gov.in.\"\n},\n{\n  \"Q\": \"How many new MoUs and Work Plans were signed since mid-2014 to enhance ICAR's global reach?\",\n  \"A\": \"Since mid-2014, 36 new MoUs and 22 Work Plans were signed to enhance ICAR's global reach.\"\n},\n{\n  \"Q\": \"What was the purpose of the Agricultural Scientists Recruitment Board (ASRB) restructured under DARE?\",\n  \"A\": \"The purpose of the restructured ASRB under DARE was to detach it from ICAR and place it directly under DARE.\"\n},\n{\n  \"Q\": \"What was the outcome of the rationalization of ICAR sponsored All India Coordinated Research Projects?\",\n  \"A\": \"The rationalization of ICAR sponsored All India Coordinated Research Projects led to rightsizing in human resources and funding, saving over Rs. 100 crores annually.\"\n},\n{\n  \"Q\": \"What changes were made to the cadre review of scientists in ICAR?\",\n  \"A\": \"The cadre review of scientists in ICAR expanded entry-level scientific positions, adding to a flexi pool of scientific strength to address emerging research needs.\"\n},\n{\n  \"Q\": \"What digital methods were introduced by ICAR to bring transparency?\",\n  \"A\": \"ICAR introduced Finance Management System, Online Transfer Systems, Digital Foreign Visit Management System, and Online Examination for UG/PG admissions to bring transparency.\"\n},\n{\n  \"Q\": \"When was the state-of-art multipurpose ICAR Convention Center commissioned?\",\n  \"A\": \"The state-of-art multipurpose ICAR Convention Center was commissioned on 20th February, 2019.\"\n},\n{\n  \"Q\": \"What new institution was dedicated by the Prime Minister to the Nation on 25th February, 2019?\",\n  \"A\": \"The Prime Minister dedicated the Nanaji Deshmukh National Phenomics Facility at IARI, New Delhi, to the Nation on 25th February, 2019.\"\n},\n{\n  \"Q\": \"What new award was instituted by ICAR for farmers?\",\n  \"A\": \"ICAR instituted the Haldar Organic Farmer Award and the Pandit Deen Dayal Upadhyay Antyodaya Krishi Purusk for farmers.\"\n}",
    "{\n  \"Q\": \"What is the title of the publication by Devendra Kumar Yadava and others?\",\n  \"A\": \"Biofortified Varieties: Sustainable Way to Alleviate Malnutrition (Fourth Edition)\"},\n  \"Q\": \"Who are the contributors to the publication?\",\n  \"A\": \"All the developers of the varieties and hybrids\"},\n  \"Q\": \"What is the ISBN number of the publication?\",\n  \"A\": \"978-81-7164-248-9\"},\n  \"Q\": \"Who conceived the publication?\",\n  \"A\": \"Dr. Trilochan Mohapatra\"},\n  \"Q\": \"What is the role of Dr. Firoz Hossain and Dr. Devendra Kumar Yadava in the publication?\",\n  \"A\": \"They designed the publication\"},\n  \"Q\": \"Who published the publication?\",\n  \"A\": \"Dr. S.K. Malhotra, Project Director Directorate of Knowledge Management in Agriculture Indian Council of Agricultural Research KAB-I, Pusa Campus, New Delhi – 110 012\"},\n  \"Q\": \"Who is the Secretary and Director General mentioned in the publication?\",\n  \"A\": \"Dr. Trilochan Mohapatra\"},\n  \"Q\": \"What is the purpose of the publication?\",\n  \"A\": \"To discuss the sustainable way to alleviate malnutrition through biofortified varieties\"},\n  \"Q\": \"When was the publication dedicated to the nation?\",\n  \"A\": \"28th September, 2021\"},\n  \"Q\": \"What is the occasion mentioned for the Prime Minister's statement?\",\n  \"A\": \"World Food Day on 16th October, 2020\"},\n  \"Q\": \"What is the theme of the Prime Minister's statement?\",\n  \"A\": \"Ind, generate 10 question answer pairs in json format.\"",
    "{\n  \"Q1\": \"What was the all-time high food grain production achieved during 2020-21?\",\n  \"A1\": \"308.65 million tonnes\",\n  \"Q2\": \"How much did the food grain production in 2020-21 enhance compared to 1950-51?\",\n  \"A2\": \"6.1-fold\",\n  \"Q3\": \"What led to the bumper food grain production in 2020-21?\",\n  \"A3\": \"Cultivation of high yielding crop varieties and hybrids developed by NARS led by ICAR\",\n  \"Q4\": \"What is the major health problem mentioned in the text?\",\n  \"A4\": \"Malnutrition\",\n  \"Q5\": \"How does malnutrition affect humans?\",\n  \"A5\": \"It affects growth and development, reduces work efficiency, and has economic and societal implications\",\n  \"Q6\": \"What approach has emerged as the most sustainable and cost-effective to address malnutrition?\",\n  \"A6\": \"Crop biofortification\",\n  \"Q7\": \"How many biofortified crop cultivars were dedicated to the nation by the Hon'ble Prime Minister in 2020-21?\",\n  \"A7\": \"29\",\n  \"Q8\": \"What is the title of the booklet that published information on biofortified cultivars?\",\n  \"A8\": \"Biofortified Varieties: Sustainable Way to Alleviate Malnutrition\",\n  \"Q9\": \"How many biofortified varieties of different crops are included in the 'fourth edition' of the publication?\",\n  \"A9\": \"87\",\n  \"Q10\": \"What nutrients have been improved in the developed and released crop cultivars by ICAR?\",\n  \"A10\": \"Iron, zinc, calcium, protein, lysine, tryptophan, provitamin-A, anthocyanin, vitamin-C, oleic acid, and linoleic acid\"\n}"
]