[
    "```json\n[\n    {\n        \"Q\": \"What was the Government of India's goal for farmers' income by 2022?\",\n        \"A\": \"The Government of India aimed to double farmers' income by 2022.\"\n    },\n    {\n        \"Q\": \"What is the seven-point action plan suggested by the Ministry of Agriculture and Farmers Welfare for doubling farmers' income?\",\n        \"A\": \"The action plan includes increasing farm production and productivity, lowering the cost of cultivation, ensuring better prices for farm produce, increasing non-farm income, diversifying towards high-value crops, efficient post-harvest management, and reducing post-harvest losses.\"\n    },\n    {\n        \"Q\": \"Why is potato considered an important crop in the plan to double farmers' income?\",\n        \"A\": \"Potato covers many components of the action plan, such as yield enhancement, cost reduction, crop diversification, and benefits from processed potato products and efficient storage and transportation.\"\n    },\n    {\n        \"Q\": \"How much yield enhancement is estimated for potato crops with better technologies?\",\n        \"A\": \"Yield enhancement for potato crops is estimated to be higher than 17.6% with better technologies.\"\n    },\n    {\n        \"Q\": \"What are some methods suggested for reducing the cost of cultivation in potato farming?\",\n        \"A\": \"Methods include using soil health cards, neem oil-coated urea, drip irrigation, and fertigation, which are estimated to reduce costs by more than 13.3%.\"\n    },\n    {\n        \"Q\": \"What are the major components of the basic framework for doubling farmers' income?\",\n        \"A\": \"The components include increasing production and productivity, decreasing cost of cultivation, reducing post-harvest losses, value addition, agricultural marketing reforms, risk management, and promoting allied activities.\"\n    },\n    {\n        \"Q\": \"What allied activities are suggested to enhance farmers' income?\",\n        \"A\": \"Allied activities include horticulture, integrated farming systems, white revolution (dairy), blue revolution (fisheries), agro-forestry, beekeeping, rural backyard poultry, mushroom farming, agri-tourism, and consultancies for landless farmers.\"\n    },\n    {\n        \"Q\": \"What is the potential income from beekeeping for farmers?\",\n        \"A\": \"Beekeeping can provide an income of ₹2500 per box without requiring land resources.\"\n    },\n    {\n        \"Q\": \"What role does the eNAM platform play in doubling farmers' income?\",\n        \"A\": \"The eNAM platform helps by improving agricultural marketing, ensuring better prices for farm produce, and reducing inefficiencies in the supply chain.\"\n    },\n    {\n        \"Q\": \"How does the white revolution contribute to farmers' income?\",\n        \"A\": \"The white revolution, focused on dairy farming, offers 65% higher income per acre compared to traditional crops.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the percentage share of crop productivity in enhancing farmers' income (EFI)?\",\n    \"A\": \"Crop productivity has a 17.6% share in enhancing farmers' income.\"\n  },\n  {\n    \"Q\": \"Why is crop productivity overweight for potato farmers?\",\n    \"A\": \"It is overweight due to drip irrigation technology, better quality seed potatoes, improved potato technologies, and efficient dissemination of technical know-how.\"\n  },\n  {\n    \"Q\": \"What is the relevance of livestock productivity for potato farmers?\",\n    \"A\": \"Livestock productivity has no relevance (0%) for potato farmers.\"\n  },\n  {\n    \"Q\": \"What is the role of better price realization in potato farmers' income?\",\n    \"A\": \"Better price realization contributes 7.1% and is overweight due to higher demand for processed potato products, seed potatoes, specialty potatoes, and improved storage and transportation efficiencies.\"\n  },\n  {\n    \"Q\": \"What is eNAM, and how does it benefit potato farmers?\",\n    \"A\": \"eNAM (electronic National Agricultural Market) is a scheme that integrates agricultural markets to reduce price variation and malpractices, ensuring higher price realization for potato farmers.\"\n  },\n  {\n    \"Q\": \"How many markets have been enrolled under the eNAM scheme so far?\",\n    \"A\": \"More than 585 markets across 16 states have been enrolled under the eNAM scheme.\"\n  },\n  {\n    \"Q\": \"What challenge does the APMC Act pose to farmers?\",\n    \"A\": \"The APMC Act restricts farmers' freedom to sell their produce at their will, reducing their ability to secure better prices.\"\n  },\n  {\n    \"Q\": \"How does the Model Act benefit potato farmers?\",\n    \"A\": \"The Model Act allows farmers to sell to multiple buyers, making contract farming more effective and reducing market-related risks for potato farmers.\"\n  },\n  {\n    \"Q\": \"What role does informed selling play for potato farmers?\",\n    \"A\": \"Informed selling helps potato farmers avoid distress sales caused by high cold storage and transportation charges, ensuring better price realization.\"\n  },\n  {\n    \"Q\": \"What steps has the government taken to increase farmers' income in recent years?\",\n    \"A\": \"The government announced steep enhancements in the support price of principal agricultural commodities during 2018-19 to boost farmers' income.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the purpose of the Pradhan Mantri Kisan Samman Nidhi scheme?\",\n        \"A\": \"The Pradhan Mantri Kisan Samman Nidhi scheme provides income supplementation of ₹6000 per year to farmers.\"\n    },\n    {\n        \"Q\": \"What are two examples of state-level farmers' income supplementation schemes in India?\",\n        \"A\": \"The Rythu Bandhu scheme of Telangana and the KALIA scheme of Odisha are examples of state-level farmers' income supplementation schemes.\"\n    },\n    {\n        \"Q\": \"How can India enhance its potato productivity by 25% over 7 years?\",\n        \"A\": \"India can enhance its potato productivity by ensuring healthy seed potatoes and expanding the use of micro-irrigation technologies, especially drip irrigation.\"\n    },\n    {\n        \"Q\": \"What is the total area under micro-irrigation in India for 2018-19?\",\n        \"A\": \"The total area under micro-irrigation in India for 2018-19 was 6.27 lakh hectares, with 3.26 lakh hectares under drip irrigation and 3.01 lakh hectares under sprinkler irrigation.\"\n    },\n    {\n        \"Q\": \"What is the significance of micro-irrigation in India?\",\n        \"A\": \"Micro-irrigation can save more than 50% of irrigation water and enhance agricultural productivity in India.\"\n    },\n    {\n        \"Q\": \"Why is agricultural productivity enhancement important for India?\",\n        \"A\": \"Agricultural productivity enhancement is crucial for feeding the ever-increasing population and ensuring food security, given the limited availability of additional agricultural land.\"\n    },\n    {\n        \"Q\": \"What percentage of potato production in India comes under short day conditions?\",\n        \"A\": \"About 95% of potato production in India occurs under short day conditions during the rabi season.\"\n    },\n    {\n        \"Q\": \"What is the average income of a farming family with a landholding size of less than 0.01 hectares?\",\n        \"A\": \"The average income of a farming family with a landholding size of less than 0.01 hectares is ₹55,104 per year.\"\n    },\n    {\n        \"Q\": \"Which landholding category has the highest average total income in India?\",\n        \"A\": \"The landholding category of 10.00+ hectares has the highest average total income, at ₹4,98,355 per year.\"\n    },\n    {\n        \"Q\": \"What are the main components of income for Indian farming households?\",\n        \"A\": \"The main components of income for Indian farming households are farming, livestock, non-agricultural enterprises, and wages/salaries.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What irrigation method has become successful in Indian potato cultivation?\",\n        \"A\": \"Drip irrigation has become a successful technology in Indian potato cultivation.\"\n    },\n    {\n        \"Q\": \"What was the reported yield increase in Gujarat under drip irrigation compared to furrow irrigation?\",\n        \"A\": \"A 33% higher potato yield was reported under drip irrigation compared to furrow irrigation.\"\n    },\n    {\n        \"Q\": \"What was the Benefit-Cost Ratio (BCR) for drip irrigation versus furrow irrigation in Gujarat?\",\n        \"A\": \"The Benefit-Cost Ratio was 1.67 for drip irrigation and 1.37 for furrow irrigation.\"\n    },\n    {\n        \"Q\": \"What was the potato yield under drip irrigation in the agronomy field trial?\",\n        \"A\": \"The potato yield under drip irrigation was 43.1 t/ha.\"\n    },\n    {\n        \"Q\": \"How much water saving is achieved with drip irrigation in potato cultivation?\",\n        \"A\": \"Drip irrigation saves up to 50% of irrigation water.\"\n    },\n    {\n        \"Q\": \"What percentage of labor economy was reported with drip irrigation?\",\n        \"A\": \"A labor economy of 30-35% was reported with drip irrigation.\"\n    },\n    {\n        \"Q\": \"How much income enhancement can drip irrigation bring to potato farmers per hectare?\",\n        \"A\": \"Drip irrigation can enhance farmers' income by ₹50,000 per hectare.\"\n    },\n    {\n        \"Q\": \"What percentage of fertilizer savings was achieved using drip irrigation in potato farming?\",\n        \"A\": \"Drip irrigation resulted in a 25% fertilizer saving.\"\n    },\n    {\n        \"Q\": \"What is the estimated potato area in India covered under healthy seed potato by 2022-23?\",\n        \"A\": \"By 2022-23, 55% of Indian potato area is estimated to be covered under healthy seed potato.\"\n    },\n    {\n        \"Q\": \"What was the average triennium ending yield of potato in India during 2015-16?\",\n        \"A\": \"The average triennium ending yield of potato in India during 2015-16 was 22.94 t/ha.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What percentage of potato area was covered by healthy seed potato during 2015-16?\",\n        \"A\": \"About 30% of potato area was covered by healthy seed potato during 2015-16.\"\n    },\n    {\n        \"Q\": \"By how much is potato productivity expected to increase with the use of healthy seed potato?\",\n        \"A\": \"Potato productivity is expected to increase by 20% with the use of healthy seed potato.\"\n    },\n    {\n        \"Q\": \"What was the average potato productivity in India during 2015-16?\",\n        \"A\": \"The average potato productivity in India during 2015-16 was 22.94 t/ha.\"\n    },\n    {\n        \"Q\": \"What was the total income per farm in 2012-13 compared to 2002-03?\",\n        \"A\": \"The total income per farm in 2012-13 was ₹77,888, which was 3.1 times higher than ₹34,176 in 2002-03.\"\n    },\n    {\n        \"Q\": \"What is the CAGR of income from livestock between 2002-03 and 2012-13?\",\n        \"A\": \"The CAGR of income from livestock between 2002-03 and 2012-13 was 24.72%.\"\n    },\n    {\n        \"Q\": \"Why is non-farm income important for Indian farmers?\",\n        \"A\": \"Non-farm income is important because more than two-thirds of Indian farmers cultivate less than 1 ha of land and agriculture contributes less than 14% of national income despite employing half of the population.\"\n    },\n    {\n        \"Q\": \"What initiatives has the government taken to promote non-farm employment for farmers?\",\n        \"A\": \"The government has promoted schemes like 'Startup India' and integrated agricultural skills with non-agricultural skills through the Agricultural Skill Council of India.\"\n    },\n    {\n        \"Q\": \"What is the goal of the Pradhan Mantri Krishi Sampada Yojana?\",\n        \"A\": \"The goal of the Pradhan Mantri Krishi Sampada Yojana is to develop value chains, improve supply chain efficiency, and enhance post-harvest management.\"\n    },\n    {\n        \"Q\": \"What schemes are implemented under the PM Kisan Sampada Yojana?\",\n        \"A\": \"Schemes under PM Kisan Sampada Yojana include mega food parks, integrated cold chain and value addition infrastructure, creation/expansion of food processing capacities, and agro-processing cluster infrastructure.\"\n    },\n    {\n        \"Q\": \"Why is post-harvest management of potatoes a concern in India?\",\n        \"A\": \"Post-harvest management of potatoes is a concern because a large proportion of the produce is wasted during post-harvest operations, including marketing.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"Why is potato considered beneficial for agri-processors?\",\n    \"A\": \"Potato is one of the first choices for agri-processors and benefits from initiatives aimed at improving productivity and quality assurance, which also benefit potato farmers.\"\n  },\n  {\n    \"Q\": \"What are Farmer Producer Organizations (FPOs) designed to achieve?\",\n    \"A\": \"FPOs aim to ensure scales of operations and better prices for small farmers, with a strong emphasis on post-harvest management.\"\n  },\n  {\n    \"Q\": \"What financial benefit do FPOs receive from the government?\",\n    \"A\": \"The income of FPOs is exempt from income tax.\"\n  },\n  {\n    \"Q\": \"How does NABARD support FPOs?\",\n    \"A\": \"NABARD supports FPOs by promoting agro-processing, government procurement schemes, dairy, organic farming, seed production and marketing, fishery, and other allied activities.\"\n  },\n  {\n    \"Q\": \"How are warehouse receipts beneficial for farmers, especially potato farmers?\",\n    \"A\": \"Loans against negotiable warehouse receipts provide financial liquidity, allowing farmers to sell their produce at the right time and price instead of under distress.\"\n  },\n  {\n    \"Q\": \"What role does the eNAM scheme play in helping potato farmers?\",\n    \"A\": \"The eNAM scheme, in conjunction with warehouse receipt loans, enables potato farmers to sell their produce at the right time and price, improving their financial situation.\"\n  },\n  {\n    \"Q\": \"What is the role of Krishi Vigyan Kendras (KVKs) in Indian agriculture?\",\n    \"A\": \"KVKs play a vital role in technology assessment, refinement, demonstration, and dissemination of technical know-how to farmers, including potato farmers.\"\n  },\n  {\n    \"Q\": \"How many Krishi Vigyan Kendras (KVKs) are there in India?\",\n    \"A\": \"There are 714 Krishi Vigyan Kendras (KVKs) in India.\"\n  },\n  {\n    \"Q\": \"Why are potato farmers particularly responsive to KVKs?\",\n    \"A\": \"Potato farmers are highly responsive to extension activities and benefit significantly from the technical support provided by KVKs, enhancing their farm income.\"\n  },\n  {\n    \"Q\": \"What makes potato cultivation significant in agriculture?\",\n    \"A\": \"Potato cultivation is significant due to its huge output per unit area and its potential to generate substantial income for farmers.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What are the key operations involved in potato production and processing?\",\n    \"A\": \"Key operations include seedbed preparation, fertilizer application, planting, weeding, earthing, digging, grading, and seed treatment.\"\n  },\n  {\n    \"Q\": \"Why is mechanization important in potato farming?\",\n    \"A\": \"Mechanization ensures the efficient use of expensive inputs like seeds and fertilizers, reduces manpower requirements, and helps complete operations in a limited time.\"\n  },\n  {\n    \"Q\": \"What are some machines used in potato farming?\",\n    \"A\": \"Machines include potato planters, fertilizer applicators, weeders, diggers, graders, and seed treatment equipment.\"\n  },\n  {\n    \"Q\": \"How can small farmers access expensive farming machines?\",\n    \"A\": \"Small farmers can purchase machines collectively as a group, use cooperatives, or opt for custom hiring services.\"\n  },\n  {\n    \"Q\": \"Why is potato considered an important food crop globally?\",\n    \"A\": \"Potato is one of the most important food crops, ranking third in production after wheat and rice, and is grown in both developed and developing countries.\"\n  },\n  {\n    \"Q\": \"What makes potato farming labor-intensive?\",\n    \"A\": \"Manual production of potatoes requires about 1,600-2,000 man-hours per hectare for all operations, making it time-consuming and tedious.\"\n  },\n  {\n    \"Q\": \"What is the duration of a potato crop, and why is it significant?\",\n    \"A\": \"Potato is a short-duration crop of 90-120 days, with the highest yield per day per unit area compared to other major crops, requiring timely mechanized operations.\"\n  },\n  {\n    \"Q\": \"What tools are used for field preparation in potato farming?\",\n    \"A\": \"Tools like disc plows, mould board plows, disc harrows, rotavators, and subsoilers are used for field preparation.\"\n  },\n  {\n    \"Q\": \"Why is pre-sowing irrigation important in potato farming?\",\n    \"A\": \"Pre-sowing irrigation ensures uniform germination by preparing the soil for planting and decomposition of green manure.\"\n  },\n  {\n    \"Q\": \"What soil conditions are ideal for potato cultivation?\",\n    \"A\": \"Potato requires loose, friable soil with good drainage, aeration, and adequate tilth to support stolon/tuber growth and root respiration.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the purpose of using a disc harrow and sub-soiler in field preparation?\",\n    \"A\": \"A disc harrow is used for cross harrowing, and deep tillage with a sub-soiler improves infiltration for better field preparation.\"\n  },\n  {\n    \"Q\": \"Which implement is most popular for achieving fine soil tilth during field preparation?\",\n    \"A\": \"The rotavator is the most popular implement for achieving fine soil tilth during field preparation.\"\n  },\n  {\n    \"Q\": \"What is the importance of fertilizer application in potato farming?\",\n    \"A\": \"Fertilizer application ensures efficient utilization, reduces farm input costs, and minimizes environmental risks.\"\n  },\n  {\n    \"Q\": \"What machine is used for uniform placement of fertilizer in furrows?\",\n    \"A\": \"A fertilizer drill-cum-marker or fertilizer broadcaster is used for uniform placement of fertilizer in furrows.\"\n  },\n  {\n    \"Q\": \"At what depth should fertilizer be placed for potato crops?\",\n    \"A\": \"Fertilizer should be placed 5-7 cm below the seed tubers and should not come in direct contact with the seeds.\"\n  },\n  {\n    \"Q\": \"How many seed potatoes are required per hectare for good yield?\",\n    \"A\": \"About 80-85 thousand seed potatoes are required per hectare for good yield.\"\n  },\n  {\n    \"Q\": \"What is the recommended weight of seed potato tubers per hectare for planting?\",\n    \"A\": \"The recommended weight of seed potato tubers is 35-55 g per hectare.\"\n  },\n  {\n    \"Q\": \"What is the function of a tractor-operated potato planter?\",\n    \"A\": \"A tractor-operated potato planter opens furrows, meters seed tubers, places them in the furrow, and covers them with a soil layer of 6-8 cm.\"\n  },\n  {\n    \"Q\": \"What are the common types of potato planters available in India?\",\n    \"A\": \"The common types of potato planters in India are rotating drum type, revolving magazine type, belt and cup type, and picker wheel type.\"\n  },\n  {\n    \"Q\": \"Why are automatic potato planters becoming popular?\",\n    \"A\": \"Automatic potato planters are becoming popular due to their advantages like uniform planting and reduced labor requirements.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What activities are carried out by a semi-automatic potato planter?\",\n    \"A\": \"A semi-automatic potato planter lifts individual tubers, drops them into rows, and covers them with soil mass, requiring labor only for filling the hopper.\"\n  },\n  {\n    \"Q\": \"What methods are used for weed control in potato crops?\",\n    \"A\": \"Mechanical and chemical weed control methods are used, including inter-row cultivation, ridgers, and tractor-operated multi-nozzle sprayers.\"\n  },\n  {\n    \"Q\": \"What is the purpose of a three-row tractor-operated inter-row cultivator in potato farming?\",\n    \"A\": \"It is used for inter-row cultivation 22-25 days after planting, when the plant height is 8-10 cm, to control weeds and prepare for earthing up.\"\n  },\n  {\n    \"Q\": \"What machine is used for earthing up and remaking ridges in potato farming?\",\n    \"A\": \"A three or five-row ridger is used for earthing up and remaking ridges, ensuring uniform ridges and sufficient soil mass around plants.\"\n  },\n  {\n    \"Q\": \"How is chemical weed control achieved in potato farming?\",\n    \"A\": \"Chemical weed control is achieved using tractor-operated multi-nozzle sprayers or spray guns for fast and uniform chemical application.\"\n  },\n  {\n    \"Q\": \"Why is timely application of plant protection chemicals important in potato farming?\",\n    \"A\": \"Timely application is crucial to prevent huge losses, especially in cases like late blight disease, where delays of 1-2 days can result in complete crop loss.\"\n  },\n  {\n    \"Q\": \"What equipment is effective for spraying chemicals to protect potato crops?\",\n    \"A\": \"High-capacity tractor-operated sprayers, multi-nozzle boom sprayers with 12-16 nozzles, and spray guns are effective for spraying chemicals.\"\n  },\n  {\n    \"Q\": \"What are the functions of a two-row potato combine harvester?\",\n    \"A\": \"It digs potato tubers from 15-20 cm deep soil, separates tubers from soil clods, conveys them to a sorting platform, and collects them in a hopper.\"\n  },\n  {\n    \"Q\": \"How many workers are needed for a two-row potato combine harvester, and what are their tasks?\",\n    \"A\": \"Four workers are needed to sort rotten tubers or soil clods passing on to the sorting table.\"\n  },\n  {\n    \"Q\": \"What type of tractor is required to operate a two-row potato combine harvester?\",\n    \"A\": \"A two-row potato combine harvester is usually powered by a 50 to 60 hp tractor.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"Why is manual grading of potatoes not efficient?\",\n        \"A\": \"Manual grading is not uniform, requires a lot of time and energy, and reduces overall returns.\"\n    },\n    {\n        \"Q\": \"What is commonly used in grading systems for potato tubers?\",\n        \"A\": \"Rubber belts with different size round or square-shaped perforations are commonly used.\"\n    },\n    {\n        \"Q\": \"What is the purpose of treating seed potatoes before storage?\",\n        \"A\": \"Seed treatment protects potatoes against diseases such as common scab, black scurf, and powdery scab.\"\n    },\n    {\n        \"Q\": \"How is boric acid used for seed potato treatment?\",\n        \"A\": \"Boric acid is sprayed on potatoes rolling over a conveyor in an electric-powered seed treatment machine.\"\n    },\n    {\n        \"Q\": \"What is the capacity of the boric acid seed treatment machine?\",\n        \"A\": \"The machine can treat about 300-350 quintals of potatoes per day.\"\n    },\n    {\n        \"Q\": \"What are the drawbacks of manual potato harvesting?\",\n        \"A\": \"Manual harvesting requires 600-700 man-hours/ha, causes up to 10% tuber cuts or bruises, and leaves some potatoes in the field.\"\n    },\n    {\n        \"Q\": \"What are the benefits of using a tractor-operated digger for potato harvesting?\",\n        \"A\": \"Tractor-operated diggers are fast, economical, and cause the least damage to the produce.\"\n    },\n    {\n        \"Q\": \"What percentage of tubers does a digger elevator expose under optimum field conditions?\",\n        \"A\": \"A digger elevator exposes 90-95% of tubers under optimum field conditions.\"\n    },\n    {\n        \"Q\": \"What is a multipurpose passive blade potato digger, and what is its efficiency?\",\n        \"A\": \"It is a less expensive equipment that exposes about 80-85% of potatoes and is easy to maintain.\"\n    },\n    {\n        \"Q\": \"Why is certification of seed potato tubers important in India?\",\n        \"A\": \"Certification ensures seed quality, prevents seed degeneration, and maintains the health of potato crops.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"Who manages seed certification in India?\",\n        \"A\": \"Seed certification is managed by the Central Seed Certification Board under the 'Seed Act'.\"\n    },\n    {\n        \"Q\": \"What is the role of State Seed Certification Agencies?\",\n        \"A\": \"State Seed Certification Agencies are responsible for ensuring the quality standards of seeds entering the trade market and implementing the rules set by the Central Seed Certification Board.\"\n    },\n    {\n        \"Q\": \"What are the three categories of seed multiplication phases in India?\",\n        \"A\": \"The three categories of seed multiplication phases are breeder or basic seed, foundation seed (FS-I and FS-II), and certified seed.\"\n    },\n    {\n        \"Q\": \"What is the difference between hill seed and plain seed for potatoes?\",\n        \"A\": \"Hill seed is grown in high hills generally 2500 meters above mean sea level, while plain seed is grown in areas with low aphid infestation during the crop-growing season.\"\n    },\n    {\n        \"Q\": \"What diseases disqualify a seed potato crop from certification?\",\n        \"A\": \"Seed potato crops grown on land infested with wart (Synchytrium endobioticum), common scab (Streptomyces scabies), brown rot or bacterial wilt (Ralstonia solanacearum), or nematodes (Globodera pallida, G. rostochinensis) within the previous three years are disqualified.\"\n    },\n    {\n        \"Q\": \"How many inspections are required for conventionally grown seed potatoes?\",\n        \"A\": \"A minimum of four inspections are required for conventionally grown seed potatoes.\"\n    },\n    {\n        \"Q\": \"What is the purpose of the first inspection for seed potatoes?\",\n        \"A\": \"The first inspection, conducted about 45 days after planting in the hills and 35 days in the plains, verifies isolation, off-types, and the extent of disease infection, including mild and severe mosaic, leaf roll, and yellows.\"\n    },\n    {\n        \"Q\": \"When is the second inspection for seed potatoes conducted?\",\n        \"A\": \"The second inspection is conducted about 60-65 days after planting for early varieties and 70-75 days for late varieties, depending on the crop duration.\"\n    },\n    {\n        \"Q\": \"What is the focus of the third inspection for seed potatoes?\",\n        \"A\": \"The third inspection is conducted immediately after haulms cutting/destruction to verify that it has been done by the prescribed date and in the proper manner.\"\n    },\n    {\n        \"Q\": \"How are plant samples taken for seed potato inspections?\",\n        \"A\": \"A minimum of four counts of 100 plants each are taken randomly in a zigzag manner per hectare, with two additional samples of 100 plants each for every additional hectare or part thereof.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What are the two conditions required for the final field inspection for certification?\",\n        \"A\": \"The previous history of the field, crop operations, manuring, and plant protection schedule should be available, and final roguing should be done before certification inspection.\"\n    },\n    {\n        \"Q\": \"What is the minimum isolation distance required for potato seed certification?\",\n        \"A\": \"A minimum isolation distance of 5 meters is required for foundation-I, foundation-II, and certified seed crops.\"\n    },\n    {\n        \"Q\": \"What should be done with off-type and diseased plants during roguing?\",\n        \"A\": \"All off-type and diseased plants, along with their tubers, should be removed during roguing.\"\n    },\n    {\n        \"Q\": \"What happens if haulms are not destroyed in time?\",\n        \"A\": \"Failure to destroy haulms in time will render the crop liable for rejection.\"\n    },\n    {\n        \"Q\": \"What is the permissible gap limit in a seed plot for certification?\",\n        \"A\": \"Gaps in the seed plot should not exceed 10.0%.\"\n    },\n    {\n        \"Q\": \"What is the tolerance limit for tubers not conforming to varietal characteristics in certified classes?\",\n        \"A\": \"Tubers not conforming to varietal characteristics should not exceed 0.1% by number in certified classes.\"\n    },\n    {\n        \"Q\": \"What is the maximum tolerance for cut, bruised, or damaged tubers in a seed lot?\",\n        \"A\": \"Cut, bruised, unshaped, cracked, or insect-damaged tubers should not exceed 1% by weight.\"\n    },\n    {\n        \"Q\": \"Does greenish pigmentation on tubers disqualify them from certification?\",\n        \"A\": \"No, greenish pigmentation on tubers is not a disqualification for certification.\"\n    },\n    {\n        \"Q\": \"What is the maximum percentage of tubers in a seed lot that can deviate from the specified size?\",\n        \"A\": \"Tubers not conforming to the specific size of seed should not exceed more than 5% by number.\"\n    },\n    {\n        \"Q\": \"What are the standards for potato-tissue culture raised minitubers (PTCMT)?\",\n        \"A\": \"The general standards are basic and, together with specific standards, constitute the requirements for approval of PTCMT.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What conditions are required for laboratory and greenhouse facilities to produce PTCMT?\",\n        \"A\": \"Laboratory and greenhouse facilities must meet standards like sterile potting media, clean water, hygienic practices, and approval as per guidelines.\"\n    },\n    {\n        \"Q\": \"What are the maximum permissible limits for off-types in seed potato certification during the 1st and 2nd inspections?\",\n        \"A\": \"The maximum permissible limits for off-types are 0.05% for Foundation-I and Foundation-II, and 0.10% for Certified stage.\"\n    },\n    {\n        \"Q\": \"What is the size range for hill-grown seed tubers classified as seed size?\",\n        \"A\": \"Hill-grown seed tubers classified as seed size have a size range of 30–60 mm and a corresponding weight of 25–150 g.\"\n    },\n    {\n        \"Q\": \"What viruses must potato varieties be tested for in an accredited laboratory before tissue culture initiation?\",\n        \"A\": \"Potato varieties must be tested for PVA, PVS, PVM, PVY, PVX, PLRV, PALCV, GBNV, PSTVd, and endophytic and epiphytic bacteria and fungi.\"\n    },\n    {\n        \"Q\": \"What are the requirements for greenhouse facilities used in PTCMT production?\",\n        \"A\": \"Greenhouse facilities must be insect-proof, equipped with double-door entrances, have footwear disinfestation provisions, and insect-proof ventilation screens.\"\n    },\n    {\n        \"Q\": \"What is the permissible limit for plants infected with brown rot in the Certified stage of seed potato certification?\",\n        \"A\": \"The permissible limit for plants infected with brown rot in the Certified stage is 3 plants per hectare.\"\n    },\n    {\n        \"Q\": \"What type of footwear is required for persons entering the protected greenhouse environment?\",\n        \"A\": \"Persons entering the protected greenhouse environment must wear Wellington boots (plastic boots).\"\n    },\n    {\n        \"Q\": \"What is the required documentation for materials initiated for producing PTCMT?\",\n        \"A\": \"Materials must be of a notified variety with confirmed identity and duly documented with respect to origin.\"\n    },\n    {\n        \"Q\": \"What are the size and weight ranges for plains-grown seed tubers classified as large size?\",\n        \"A\": \"Plains-grown seed tubers classified as large size are above 55 mm in size and above 125 g in weight.\"\n    },\n    {\n        \"Q\": \"What is the minimum number of plantlets required for virus testing in potato tissue culture?\",\n        \"A\": \"A minimum of 10 plantlets of each variety must be tested for viruses.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What methods are recommended for viroid testing?\",\n    \"A\": \"RT-PCR is recommended for viroid testing.\"\n  },\n  {\n    \"Q\": \"What procedures should be followed for fungi and bacteria testing?\",\n    \"A\": \"Light microscopy and culturing on media should be used for fungi and bacteria testing.\"\n  },\n  {\n    \"Q\": \"What information must the initiating facility maintain for review and audit?\",\n    \"A\": \"The initiating facility must maintain information on variety identification and origin, date of initiation, and testing results from an accredited laboratory.\"\n  },\n  {\n    \"Q\": \"What is required before initiating the microtuber production cycle?\",\n    \"A\": \"Valid pathogen testing results are required prior to initiating the microtuber production cycle or planting test tube plantlets in the greenhouse or aeroponics.\"\n  },\n  {\n    \"Q\": \"What are the standards for soil used in PTCMT production?\",\n    \"A\": \"The soil must not be infested with pathogens or pests of potato, such as Wart (Synchytrium endobioticum), cyst-forming nematodes (Globodera rostochiensis and G. pallida), or brown rot (Ralstonia solanacearum).\"\n  },\n  {\n    \"Q\": \"What is the maximum permissible limit for late blight, dry rot, or charcoal rot in certified tubers?\",\n    \"A\": \"The maximum permissible limit for late blight, dry rot, or charcoal rot in certified tubers is 1%.\"\n  },\n  {\n    \"Q\": \"What happens if a seed lot has common scab infection above the permissible limit?\",\n    \"A\": \"The seed lot will not be certified even after treatment if it has common scab infection above the permissible limit.\"\n  },\n  {\n    \"Q\": \"What is the maximum permissible limit for off-types in PTCMT production at net/poly house or aeroponics?\",\n    \"A\": \"The maximum permissible limit for off-types is 0.05%.\"\n  },\n  {\n    \"Q\": \"What is the maximum permissible limit for plants showing symptoms of severe mosaic, leaf roll, yellow, or apical leaf curl disease in PTCMT production?\",\n    \"A\": \"The maximum permissible limit is 0.05%.\"\n  },\n  {\n    \"Q\": \"What is the maximum permissible limit for plants infected by brown rot (bacterial wilt) in PTCMT production?\",\n    \"A\": \"The maximum permissible limit for plants infected by brown rot (Ralstonia solanacearum) is 0.00%.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What type of plants must the crop be grown from?\",\n    \"A\": \"The crop must be grown from certified basic in vitro plants or microtubers produced in an aseptic environment.\"\n  },\n  {\n    \"Q\": \"How many inspections are required during the crop growth process?\",\n    \"A\": \"A minimum of three inspections are required.\"\n  },\n  {\n    \"Q\": \"When should the first inspection be conducted?\",\n    \"A\": \"The first inspection should be conducted 35 days after planting in plains and 45 days after planting in hills.\"\n  },\n  {\n    \"Q\": \"What is the purpose of the second inspection?\",\n    \"A\": \"The second inspection verifies off-types, disease infection, and pathogen testing on a representative sample.\"\n  },\n  {\n    \"Q\": \"What must be done immediately after haulms cutting or destruction?\",\n    \"A\": \"The third inspection must verify that haulms have been cut or destroyed by the prescribed date and in a proper manner.\"\n  },\n  {\n    \"Q\": \"What sanitation practices must be followed in greenhouses?\",\n    \"A\": \"Effective sanitation practices, including insect and disease monitoring and prevention, must be adhered to.\"\n  },\n  {\n    \"Q\": \"What happens if banned viruses, fungi, or bacteria are detected in the protected environment?\",\n    \"A\": \"All crops in the protected environment will not be eligible for certification and the entire material will be destroyed.\"\n  },\n  {\n    \"Q\": \"What must be done before planting in nursery beds?\",\n    \"A\": \"The substrate in nursery beds must be properly sterilized before planting.\"\n  },\n  {\n    \"Q\": \"What should be used to monitor insect vectors like aphids, thrips, and whiteflies in greenhouses?\",\n    \"A\": \"Yellow sticky traps should be placed at least at three locations in the greenhouse.\"\n  },\n  {\n    \"Q\": \"What testing is required post-harvest for crops grown in protected environments?\",\n    \"A\": \"Post-harvest testing must confirm the absence of PVA, PVS, PVM, PVY, PVX, PLRV, GBNV, and PALCV for the crop to be assigned basic stock status.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the minimum isolation distance required between different varieties grown in net/polyhouse/greenhouse?\",\n    \"A\": \"A minimum isolation distance of 1 meter is required to avoid mechanical mixture.\"\n  },\n  {\n    \"Q\": \"What are the basic equipment requirements for a laboratory accredited for virus testing?\",\n    \"A\": \"The laboratory must have equipment such as an ultracentrifuge, electrophoretic system, PCR machine, and ELISA reader.\"\n  },\n  {\n    \"Q\": \"What facilities should a virus testing laboratory have for growing plants?\",\n    \"A\": \"The laboratory must have facilities for growing plants under insect-proof conditions.\"\n  },\n  {\n    \"Q\": \"What qualifications should scientists in a virus testing laboratory possess?\",\n    \"A\": \"The laboratory must have at least two scientists with good training in virology, preferably holding a PhD in Virology and experience in virus diagnosis.\"\n  },\n  {\n    \"Q\": \"What information must be included on the label of potato-tissue culture minitubers (PTCMT)?\",\n    \"A\": \"The label must include the kind, variety, name of the institution, rubber-stamped signature, name, and designation of the concerned agency.\"\n  },\n  {\n    \"Q\": \"What are the minimum standards for PTCMT tubers in terms of weight, germination, and purity?\",\n    \"A\": \"The minimum standards are: Weight - 1.0 g, Germination/Sprouting - 90.0%, Physical purity - 98.0%, Varietal purity - 99.0%, and Seed-borne virus - 0.01%.\"\n  },\n  {\n    \"Q\": \"What should the label color be for breeders' seed produced through PTCMT?\",\n    \"A\": \"The label color should be diagonally yellow (IS 5-1978) and opaline green (IS No. 275).\"\n  },\n  {\n    \"Q\": \"What are the field inspection requirements for seed potato crops?\",\n    \"A\": \"A minimum of 4 inspections must be made to verify isolation, off-type plants, and diseases such as mosaics, leaf roll, and brown rot.\"\n  },\n  {\n    \"Q\": \"What isolation distances are required between potato varieties and between seed and table potato crops?\",\n    \"A\": \"A minimum of 5 meters is required between potato varieties grown for seed certification and 15 meters between seed and table potato crops.\"\n  },\n  {\n    \"Q\": \"What conditions make seed potato crops ineligible for certification?\",\n    \"A\": \"Crops grown in land infested with wart, cyst-forming nematodes, brown rot, non-cyst nematodes, or common scab within the previous 3 years are ineligible for certification.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the purpose of the second inspection in seed crop production?\",\n        \"A\": \"The second inspection is conducted to verify isolation, off-types, mild and severe mosaics, mycoplasmal diseases, brown rot, and other relevant factors.\"\n    },\n    {\n        \"Q\": \"What must be done with off-types and diseased plants during inspections?\",\n        \"A\": \"All off-types and diseased plants must be rogued out along with their tubers and destroyed before the crop is submitted for inspection.\"\n    },\n    {\n        \"Q\": \"What is verified during the third inspection of the seed crop?\",\n        \"A\": \"The third inspection verifies that haulms have been cut or destroyed by the prescribed date and in the proper manner.\"\n    },\n    {\n        \"Q\": \"What is the purpose of the fourth inspection in seed crop production?\",\n        \"A\": \"The fourth inspection is conducted about 10 days after haulms cutting/destruction to ensure no re-growth of the haulms has occurred.\"\n    },\n    {\n        \"Q\": \"How many plants should be inspected per hectare during seed crop inspection?\",\n        \"A\": \"A minimum count of 100 plants from 4 randomly selected locations in a zig-zag manner per hectare should be inspected.\"\n    },\n    {\n        \"Q\": \"What is the spacing for planting Generation-0 (Gen. 0) minitubers?\",\n        \"A\": \"Generation-0 minitubers should be planted at a spacing of 30-40 × 10-15 cm depending on the size of the minituber.\"\n    },\n    {\n        \"Q\": \"What is the spacing for planting Generation-1 (Gen. 1) pre-basic seed?\",\n        \"A\": \"Generation-1 pre-basic seed should be planted at a spacing of 60 cm × 20 cm.\"\n    },\n    {\n        \"Q\": \"What testing method is used for field testing in Generation-1 (Gen. 1)?\",\n        \"A\": \"Randomly selected 300 plants per hectare in Generation-1 are tested using ELISA.\"\n    },\n    {\n        \"Q\": \"How many plants per hectare are tested using ELISA in Generation-2 (Gen. 2)?\",\n        \"A\": \"Only 150 plants per hectare are tested using ELISA in Generation-2.\"\n    },\n    {\n        \"Q\": \"What is the purpose of rogueing during field inspections?\",\n        \"A\": \"Rogueing is done to remove all diseased and off-type plants observed during field inspections.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the key difference in field multiplication of mini-tubers under Gen. 1 in potato production?\",\n    \"A\": \"The spacing is maintained closer due to the small size of mini-tubers, resulting in higher plant populations.\"\n  },\n  {\n    \"Q\": \"What is the purpose of quality control tests in potato seed production?\",\n    \"A\": \"Quality control tests determine the genetic purity of a seed lot and its conformity to prescribed standards.\"\n  },\n  {\n    \"Q\": \"How are samples for the grow-out test collected?\",\n    \"A\": \"Samples are drawn simultaneously by the seed supplier and recipient, with each party collecting 250 seed potato tubers from a lot of 100 quintals.\"\n  },\n  {\n    \"Q\": \"What observations are recorded during the grow-out test?\",\n    \"A\": \"Observations on germination, morphological characteristics, and incidence of viruses are recorded to ascertain genetic purity.\"\n  },\n  {\n    \"Q\": \"What is the role of genebanks in potato breeding?\",\n    \"A\": \"Genebanks maintain wild potato relatives, cultivars, and genetic stocks, providing a rich resource for potato breeders and scientists.\"\n  },\n  {\n    \"Q\": \"Why are wild potato species important for potato improvement?\",\n    \"A\": \"Wild species are reservoirs of genes for stress resistance, disease resistance, and improved tuber quality that are not available in cultivated potatoes.\"\n  },\n  {\n    \"Q\": \"What strategies have breeders used to overcome hybridization barriers in potatoes?\",\n    \"A\": \"Breeders have developed strategies to access potato germplasm by introducing diploid wild germplasm into cultivated potatoes at the diploid level and returning to the tetraploid level for cultivar development.\"\n  },\n  {\n    \"Q\": \"Which wild potato species are commonly used in resistance breeding?\",\n    \"A\": \"Wild species such as Solanum acaule, S. chacoense, S. demissum, and others are used in resistance breeding.\"\n  },\n  {\n    \"Q\": \"What is the significance of the Solanum tuberosum Andigenum group in potato improvement?\",\n    \"A\": \"The Solanum tuberosum Andigenum group has been an important source of genes for cultivated potato improvement.\"\n  },\n  {\n    \"Q\": \"What is the focus of recent interest in potato breeding?\",\n    \"A\": \"There is growing interest in diploid breeding and the development of hybrid diploid cultivars.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What are the major genes sourced from wild species for potato resistance?\",\n        \"A\": \"Major genes include resistance to late blight, viruses, and potato cyst nematodes.\"\n    },\n    {\n        \"Q\": \"Which wild species contributed R1, R2, and R3 late blight resistance genes?\",\n        \"A\": \"The wild species Solanum demissum contributed R1, R2, and R3 late blight resistance genes.\"\n    },\n    {\n        \"Q\": \"What is the role of the RB gene from S. bulbocastanum in potato breeding?\",\n        \"A\": \"The RB gene provides broad-spectrum resistance to late blight through a cisgenics approach.\"\n    },\n    {\n        \"Q\": \"Which genes have been introgressed for potato virus Y resistance?\",\n        \"A\": \"The Rysto gene from S. stoloniferum, Ryadg from S. tuberosum Andigenum group, and Rychc from S. chacoense have been introgressed.\"\n    },\n    {\n        \"Q\": \"Which wild species have contributed to improving potato chipping quality?\",\n        \"A\": \"S. chacoense and S. tarijense have contributed to improving potato chipping quality.\"\n    },\n    {\n        \"Q\": \"What is the significance of the self-incompatibility inhibitor (Sli) gene in potato breeding?\",\n        \"A\": \"The Sli gene from S. chacoense can enable a self-compatible breeding system, aiding in hybrid potato development.\"\n    },\n    {\n        \"Q\": \"What is the chromosome number of cultivated potato, Solanum tuberosum L.?\",\n        \"A\": \"Cultivated potato, Solanum tuberosum L., has a chromosome number of 2n=4x=48.\"\n    },\n    {\n        \"Q\": \"Where are wild potato species mostly distributed?\",\n        \"A\": \"Wild potato species are mostly distributed in the Andean highlands, the center of origin of the potato.\"\n    },\n    {\n        \"Q\": \"Which wild species has been used as a pollinator for dihaploid induction in potato breeding?\",\n        \"A\": \"Solanum phureja has been used as a pollinator for dihaploid induction.\"\n    },\n    {\n        \"Q\": \"What are some challenges in using wild species for potato improvement?\",\n        \"A\": \"Challenges include lack of information on desirable traits, hybridization barriers, and sterility problems.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the role of genomic data in research and breeding?\",\n        \"A\": \"Linkage between genomic data and phenotype helps identify lines with high value for research and breeding.\"\n    },\n    {\n        \"Q\": \"Which wild Solanum species are donors for late blight resistance?\",\n        \"A\": \"Wild Solanum species like S. demissum, S. verrucosum, S. stoloniferum, S. chacoense, S. berthaultii, S. microdontum, S. vernei, and S. bulbocastanum are donors for late blight resistance.\"\n    },\n    {\n        \"Q\": \"Which wild Solanum species contribute resistance to Potato Virus Y?\",\n        \"A\": \"S. stoloniferum, S. chacoense, S. tuberosum subsp. andigena, and S. demissum contribute resistance to Potato Virus Y.\"\n    },\n    {\n        \"Q\": \"What traits does Solanum phureja contribute to modern potato cultivars?\",\n        \"A\": \"Solanum phureja contributes tuber color and flavor traits to modern yellow-fleshed potato cultivars.\"\n    },\n    {\n        \"Q\": \"Why was the potato cultivar Lenape removed from the market?\",\n        \"A\": \"Lenape was removed due to excessive levels of glycoalkaloids in its tubers, likely originating from S. chacoense.\"\n    },\n    {\n        \"Q\": \"Which wild Solanum species are sources of frost tolerance?\",\n        \"A\": \"Wild Solanum species like S. acaule, S. ajanhuiri, S. commersonii, and S. vernei are sources of frost tolerance.\"\n    },\n    {\n        \"Q\": \"What are the subscription costs for Indian Horticulture magazine?\",\n        \"A\": \"The subscription costs are ₹150.00 for India and $30.00 for overseas.\"\n    },\n    {\n        \"Q\": \"Which wild Solanum species are donors for heat tolerance?\",\n        \"A\": \"S. chacoense and S. commersonii are donors for heat tolerance.\"\n    },\n    {\n        \"Q\": \"What issue arises with diploid wild Solanum species in breeding?\",\n        \"A\": \"Diploid wild Solanum species are self-incompatible due to the gametophytic self-incompatibility system.\"\n    },\n    {\n        \"Q\": \"How can someone subscribe to Indian Horticulture magazine?\",\n        \"A\": \"To subscribe, fill in the subscription form and send it with a Money Order or Draft to the Business Manager, Directorate of Knowledge Management in Agriculture, ICAR, Krishi Anusandhan Bhavan, Pusa, New Delhi 110 012.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the main achievement of the scientists at ICAR-Central Potato Research Institute, Shimla?\",\n    \"A\": \"They developed new interspecific potato somatic hybrids (Solanum tuberosum + S. pinnatisectum) by overcoming sexual incompatibility through symmetric protoplast fusion.\"\n  },\n  {\n    \"Q\": \"What is the most devastating disease of potatoes that these hybrids aim to resist?\",\n    \"A\": \"The hybrids aim to resist late blight, the most devastating disease of potatoes.\"\n  },\n  {\n    \"Q\": \"Which two potato species were fused to create the somatic hybrids?\",\n    \"A\": \"The cultivated potato (Solanum tuberosum dihaploid ‘C-13’) and the Mexican wild species (Solanum pinnatisectum) were fused.\"\n  },\n  {\n    \"Q\": \"What biotechnological approach was used to overcome sexual incompatibility between the two potato species?\",\n    \"A\": \"Somatic hybridization via symmetric protoplast fusion was used to overcome sexual incompatibility.\"\n  },\n  {\n    \"Q\": \"What is the registration number of the somatic hybrid clone P-7 with the NBPGR, New Delhi?\",\n    \"A\": \"The registration number is INGR 11051.\"\n  },\n  {\n    \"Q\": \"What are the ploidy characteristics of the somatic hybrids?\",\n    \"A\": \"The hybrids are tetraploid, similar to common potatoes, as confirmed by flow cytometry.\"\n  },\n  {\n    \"Q\": \"What are the key features of the interspecific potato somatic hybrids?\",\n    \"A\": \"Key features include very high resistance to late blight, diverse genetic base, nuclear and cytoplasm genes from two Solanum species, long tuber dormancy, and male and female fertility.\"\n  },\n  {\n    \"Q\": \"Are the somatic hybrids crossable with cultivated potato varieties?\",\n    \"A\": \"Yes, the somatic hybrids are crossable with cultivated potato varieties.\"\n  },\n  {\n    \"Q\": \"How was the hybridity of the somatic hybrids confirmed?\",\n    \"A\": \"Hybridity was confirmed using molecular markers and phenotypic analysis.\"\n  },\n  {\n    \"Q\": \"What makes the genetic base of the somatic hybrids diverse?\",\n    \"A\": \"The genetic base is diverse because it incorporates nuclear and cytoplasmic genes from both Solanum tuberosum and Solanum pinnatisectum.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"Who can be contacted for interaction regarding the research mentioned?\",\n    \"A\": \"Dr. J.K.T. Tiwari, Senior Scientist at ICAR-Central Potato Research Institute, Shimla, Himachal Pradesh. Email: jageshtiwari@gmail.com.\"\n  },\n  {\n    \"Q\": \"What is the benefit of developing resistant varieties through protoplast fusion technique?\",\n    \"A\": \"It helps resource-poor farmers save on cultivation costs by growing resistant varieties developed using these lines as parents in breeding programs.\"\n  },\n  {\n    \"Q\": \"What are the elite traits of the somatic hybrid progeny 11051?\",\n    \"A\": \"The elite traits include high resistance to late blight, high pollen fertility, and a diverse gene pool of two Solanum species.\"\n  },\n  {\n    \"Q\": \"What are the mental health benefits of gardening?\",\n    \"A\": \"Gardening provides peace, reduces stress, and offers a sense of self-esteem and mastery of the environment.\"\n  },\n  {\n    \"Q\": \"What is horticultural therapy, and where is it utilized?\",\n    \"A\": \"Horticultural therapy helps individuals cope with problems and is utilized in psychiatric hospitals, general hospitals, physical rehabilitation centers, homes for the elderly, prisons, and schools.\"\n  },\n  {\n    \"Q\": \"What is the current status of potato production in India?\",\n    \"A\": \"India is the second-largest producer and consumer of potatoes, with production increasing from 8.3 million tonnes in 1980 to 48.6 million tonnes in 2017.\"\n  },\n  {\n    \"Q\": \"What was the national average potato yield in India in 2017?\",\n    \"A\": \"The national average potato yield in 2017 was around 24 tonnes per hectare.\"\n  },\n  {\n    \"Q\": \"Why is the availability of quality seed material important for potato yield growth in India?\",\n    \"A\": \"Limited availability of quality seed material is a key factor for lower yield levels, particularly in eastern states.\"\n  },\n  {\n    \"Q\": \"What is the high cost of potato seed in India, and how does it impact small farmers?\",\n    \"A\": \"The cost of potato seed is around ₹60,000-75,000 per hectare, accounting for 40-50% of total production costs, making it difficult for small farmers to invest.\"\n  },\n  {\n    \"Q\": \"Where are potato seeds produced in India, and what challenges do farmers face regarding transportation?\",\n    \"A\": \"Potato seeds are produced in Punjab using seed plot techniques and aeroponic technology. High transportation costs increase seed prices, burdening poor farmers.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"Why has the spread of aeroponic technology been limited to Punjab?\",\n    \"A\": \"Aeroponic technology has been limited to Punjab due to its high capital requirement and long gestation period of nearly four years before any returns.\"\n  },\n  {\n    \"Q\": \"What is the potential benefit of low-cost technology for potato production?\",\n    \"A\": \"Low-cost technology can increase potato production by improving productivity and lowering the cost of production in eastern and southern states.\"\n  },\n  {\n    \"Q\": \"Which research center is a leader in apical rooted cuttings for producing mini tubers and seed tubers?\",\n    \"A\": \"The Potato Vegetable and Flower Research Centre (PVFC) in Dalat, Vietnam is a leader in apical rooted cuttings for producing mini tubers and seed tubers.\"\n  },\n  {\n    \"Q\": \"Where has apical rooted cutting technology been recently standardized in India?\",\n    \"A\": \"Apical rooted cutting technology has been standardized at ICAR-Central Potato Research Institute Shimla, India.\"\n  },\n  {\n    \"Q\": \"Which regions in India have soil and environment suitable for cultivating potato seed in rabi season?\",\n    \"A\": \"Many parts of the eastern and southern regions of India are suitable for cultivating potato seed in rabi season (October-March).\"\n  },\n  {\n    \"Q\": \"What are apical cuttings and how are they produced?\",\n    \"A\": \"Apical cuttings are rooted transplants produced in a glasshouse from tissue culture plantlets, where cuttings are taken from plantlets instead of allowing them to mature and produce minitubers.\"\n  },\n  {\n    \"Q\": \"What is the principle behind apical cuttings?\",\n    \"A\": \"When the apical bud is removed, the lowered IAA concentration allows lateral buds to grow and produce new shoots, promoting elongation and lateral growth.\"\n  },\n  {\n    \"Q\": \"How are mother plants used in apical cuttings production?\",\n    \"A\": \"Healthy microplants are used as mother stocks, planted in trays or nursery beds, and used to produce rooted cuttings for transplanting into the field.\"\n  },\n  {\n    \"Q\": \"What is the difference between aeroponic technology and apical cuttings for seed production?\",\n    \"A\": \"Aeroponic technology uses tissue culture plantlets to produce minitubers in screen houses, while apical cuttings use tissue culture plantlets as mother plants in cocopeat to produce cuttings.\"\n  },\n  {\n    \"Q\": \"Which Indian states could become potato seed hubs for supplying seeds to other regions?\",\n    \"A\": \"The northeastern states of India could become potato seed hubs, supplying seeds to West Bengal, Odisha, and Bihar.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What variety was used for the standardization of tissue culture plantlets?\",\n    \"A\": \"The variety used was Kufri Chandramukhi.\"\n  },\n  {\n    \"Q\": \"What materials can be used to fill the bottom of the crate for planting tissue culture plantlets?\",\n    \"A\": \"Cocopeat, vermiculite, sterile sand, soil, or a mixture of these materials can be used.\"\n  },\n  {\n    \"Q\": \"How long after planting are the first apical cuttings taken from tissue culture plantlets?\",\n    \"A\": \"The first apical cuttings are taken 10 days after planting.\"\n  },\n  {\n    \"Q\": \"What is the size of the first apical cutting taken from tissue culture plantlets?\",\n    \"A\": \"The first apical cutting is 2-3 cm long with two true leaves.\"\n  },\n  {\n    \"Q\": \"What is the multiplication rate achieved in 4-5 weeks using apical cuttings?\",\n    \"A\": \"The multiplication rate achieved is 1:7-8 times.\"\n  },\n  {\n    \"Q\": \"How many tubers can each rooted cutting produce?\",\n    \"A\": \"Each rooted cutting can produce 7 to 10 tubers, and up to 15+ tubers.\"\n  },\n  {\n    \"Q\": \"What is the quality of seed produced from rooted cuttings compared to certified seed?\",\n    \"A\": \"The seed produced is equivalent to basic or certified seed in seed certification systems.\"\n  },\n  {\n    \"Q\": \"What is the potential impact of rooted cuttings on potato seed systems?\",\n    \"A\": \"Rooted cuttings have the potential to transform potato seed systems by rapidly increasing multiplication rates and reducing seed potato shortages.\"\n  },\n  {\n    \"Q\": \"What percentage of potato production was used in processing industries in 2007-08?\",\n    \"A\": \"About 7% of potato production was used in processing industries.\"\n  },\n  {\n    \"Q\": \"What are the estimated demands for chips, french fries, and flakes/powder in the next 40 years?\",\n    \"A\": \"The estimated demands are 4.5% for chips, 11.6% for french fries, and 7.6% for flakes and powder.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"Why is processing potatoes beneficial for farmers?\",\n    \"A\": \"Processing reduces post-harvest losses, extends shelf life, and allows farmers to sell finished potato products at better prices.\"\n  },\n  {\n    \"Q\": \"What role do women play in potato processing and management?\",\n    \"A\": \"Women ensure the adoption and use of potatoes indoors, manage diets, and can be employed in selling processed potato products like chips in local markets.\"\n  },\n  {\n    \"Q\": \"How can small-scale potato processing benefit rural areas?\",\n    \"A\": \"Setting up small units for chips, papads, and other products can provide employment opportunities for rural women and youth while connecting rural production to urban markets.\"\n  },\n  {\n    \"Q\": \"What are the industrial processed potato products?\",\n    \"A\": \"Industrial products include chips, frozen French fries, flakes, starch, custard powder, soup, and potato bhujia.\"\n  },\n  {\n    \"Q\": \"What are examples of small-scale and cottage industry potato products?\",\n    \"A\": \"Small-scale products include dehydrated chips, dices, cubes, wadi, papad, vermicelli, cakes, biscuits, naan-khatai, sticks, and cuttings.\"\n  },\n  {\n    \"Q\": \"What are some processed potato products served in fast food outlets and restaurants?\",\n    \"A\": \"Fast food products include aloo tikki, samosa, French fries, idli, vada, aloo masala dosa, and aloo parantha.\"\n  },\n  {\n    \"Q\": \"What are some domestic processed potato products?\",\n    \"A\": \"Domestic products include potato pickle, lachha, marmalade (murabba), potato tikki, potato jam, potato samosa, and potato lollipop.\"\n  },\n  {\n    \"Q\": \"What are the three main classifications of processed potato substances?\",\n    \"A\": \"Processed substances are classified into fried (e.g., potato chips, French fries), dehydrated (e.g., potato flakes, potato powder), and canned.\"\n  },\n  {\n    \"Q\": \"Why is there a need for processed potato products in India?\",\n    \"A\": \"India produces 87% of its potatoes in sub-tropical Indo-Gangetic plains, and post-harvest losses are estimated at 15-20%. Processing helps reduce these losses and extends the usability of potatoes.\"\n  },\n  {\n    \"Q\": \"How does global potato consumption trend affect farmers?\",\n    \"A\": \"The shift from fresh potatoes to value-added and processed products increases potato demand, improves farmer income, and creates employment opportunities.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What are the benefits of value addition in potato products?\",\n        \"A\": \"Value addition promotes income, meets increasing yields, fulfills the demand for processed products, and increases shelf life.\"\n    },\n    {\n        \"Q\": \"How do potato chips enhance storage and shelf life?\",\n        \"A\": \"Potato chips can be stored in nitrogen-sealed packets, which increases their shelf life.\"\n    },\n    {\n        \"Q\": \"What is the process of preparing potato chips?\",\n        \"A\": \"Potatoes are washed, peeled, sliced (1-1.8 mm thickness), dried, and fried at 180°C until bubbling stops. Salt or spices can be added for flavor.\"\n    },\n    {\n        \"Q\": \"Why is the demand for French fries increasing?\",\n        \"A\": \"French fries are appreciated by people of all ages, and frozen French fries are becoming popular due to changing lifestyles and eating patterns.\"\n    },\n    {\n        \"Q\": \"How are frozen French fries prepared?\",\n        \"A\": \"Thin potato strips are cut, dried, fried for one minute, and stored in a deep freezer. They can be fried for three minutes before serving.\"\n    },\n    {\n        \"Q\": \"What are dehydrated potato products, and why are they popular?\",\n        \"A\": \"Dehydrated potato products include chips, granules, flakes, wadi, and papad. They absorb less oil and are suitable for health-conscious individuals.\"\n    },\n    {\n        \"Q\": \"How are dehydrated potato chips prepared?\",\n        \"A\": \"Potato slices (2.0 mm thick) are boiled for 15-20 minutes, dried in sunlight, and stored in airtight containers for up to six months.\"\n    },\n    {\n        \"Q\": \"What are the uses of potato flour?\",\n        \"A\": \"Potato flour is used in cookies, stuffing, and other products. It is rich in quality, flavorful, and can be stored for up to six months.\"\n    },\n    {\n        \"Q\": \"Which potato variety is suitable for making potato flour?\",\n        \"A\": \"The Indian potato variety Kufri Chipsona-3 is suitable for making potato flour.\"\n    },\n    {\n        \"Q\": \"What are potato flakes, and how are they used?\",\n        \"A\": \"Potato flakes are small pieces of potato that can be kneaded with warm water for quick preparation, catering to busy individuals.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What are some popular food products made using potato flakes?\",\n        \"A\": \"Potato flakes are used in potato parantha, potato tikki, burger, samosa, and dosa stuffing.\"\n    },\n    {\n        \"Q\": \"What is the approximate price of one kilogram of potato flakes?\",\n        \"A\": \"The price of one kilogram of potato flakes is about ₹500.\"\n    },\n    {\n        \"Q\": \"What process is used to make potato flakes?\",\n        \"A\": \"Peeled potatoes are cut, washed, steamed, mashed, dried in a drum drier, and then broken into flakes.\"\n    },\n    {\n        \"Q\": \"What industries use potato starch?\",\n        \"A\": \"Potato starch is used in the paper industry, textile industry, pharmaceutical companies, and for making instant pudding.\"\n    },\n    {\n        \"Q\": \"What is the required dry matter content in potatoes for maximum starch recovery?\",\n        \"A\": \"The dry matter content in potatoes should be more than 20% for maximum starch recovery.\"\n    },\n    {\n        \"Q\": \"How can potato processing help in food security?\",\n        \"A\": \"Potato processing reduces post-harvest losses by utilizing surplus production to develop value-added potato-based food products.\"\n    },\n    {\n        \"Q\": \"What percentage of the world's potato production does India contribute?\",\n        \"A\": \"India contributes around 13% of the total world potato production.\"\n    },\n    {\n        \"Q\": \"What percentage of the world's potato export does India contribute?\",\n        \"A\": \"India contributes around 1.6% of the world's potato export.\"\n    },\n    {\n        \"Q\": \"Why has India's potato export been limited historically?\",\n        \"A\": \"India's potato export has been limited due to the semi-perishable nature of potatoes, lack of long-term policy support, and the need to keep domestic prices affordable.\"\n    },\n    {\n        \"Q\": \"What is suggested to increase India's potato exports in international markets?\",\n        \"A\": \"To increase potato exports, India needs to build credibility and establish long-term contracts in international markets.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What was the area, yield, and production of potatoes in India during 1949-50?\",\n    \"A\": \"The area was 0.234 million ha, the yield was 6.59 t/ha, and the production was 1.54 million tonnes.\"\n  },\n  {\n    \"Q\": \"What was India's potato production, area, and yield by 2016-17?\",\n    \"A\": \"India produced 48.61 million tonnes of potatoes from an area of 2.18 million ha with an average yield of 22.30 t/ha.\"\n  },\n  {\n    \"Q\": \"What is the estimated potato production in India for 2018-19?\",\n    \"A\": \"The estimated potato production for 2018-19 is approximately 52 million tonnes.\"\n  },\n  {\n    \"Q\": \"Why does India experience recurrent gluts in potato production?\",\n    \"A\": \"Recurrent gluts occur due to lack of proper marketing channels, insufficient/expensive cold storage facilities, and low domestic utilization.\"\n  },\n  {\n    \"Q\": \"What issues need urgent attention to address potato production gluts in India?\",\n    \"A\": \"Issues related to utilization, storage, marketing, processing, and export need urgent attention.\"\n  },\n  {\n    \"Q\": \"What are the objectives of the Agriculture Export Policy formulated by the Department of Commerce?\",\n    \"A\": \"The objectives include doubling agricultural exports, diversifying the export basket, promoting high-value exports, addressing barriers, and integrating with the global value chain.\"\n  },\n  {\n    \"Q\": \"Which states and districts in India have been identified for potato export promotion?\",\n    \"A\": \"The identified states and districts are Uttar Pradesh (Agra, Farukkabad), Punjab (Jalandhar, Hoshiarpur, Kapurthala, Navashehar), Gujarat (Banaskantha, SabarKantha), and Madhya Pradesh (Indore, Gwalior).\"\n  },\n  {\n    \"Q\": \"What factors were considered for identifying potato export clusters in India?\",\n    \"A\": \"Factors include existing production contributing to exports, exporters' operations, scalability, export market size, awareness about SPS requirements, and potential for growth.\"\n  },\n  {\n    \"Q\": \"What is the target for India's agricultural exports by 2022 under the Agriculture Export Policy?\",\n    \"A\": \"The target is to double agricultural exports from ~US$ 30+ Billion to ~US$ 60+ Billion by 2022.\"\n  },\n  {\n    \"Q\": \"Why is potato identified as a potential commodity for export in India?\",\n    \"A\": \"Potato is identified due to its production scale, export potential, and its inclusion in the Agriculture Export Policy for promoting exports.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is required for exporting horticultural products?\",\n        \"A\": \"Exporting horticultural products requires significant volumes of high-quality produce of the same variety with standard parameters matching import demands.\"\n    },\n    {\n        \"Q\": \"Why is export-oriented cluster development important for agriculture in India?\",\n        \"A\": \"Export-oriented cluster development ensures surplus produce with standard physical and quality parameters that meet export demands.\"\n    },\n    {\n        \"Q\": \"What challenges do small landholding patterns in India pose for exports?\",\n        \"A\": \"Small landholding patterns and low farmer awareness result in limited volumes of different varieties of multiple crops with little or no standardization.\"\n    },\n    {\n        \"Q\": \"What steps should State Governments take to support export clusters?\",\n        \"A\": \"State Governments should identify suitable production clusters, conduct farmer registrations, digitize land records, and promote Farmer Producer Organizations (FPOs).\"\n    },\n    {\n        \"Q\": \"Which organization is helping identify potato export clusters in India?\",\n        \"A\": \"The ICAR-Central Potato Research Institute (ICAR-CPRI) is facilitating the identification of potato export clusters.\"\n    },\n    {\n        \"Q\": \"What are the strengths of Indian potato production?\",\n        \"A\": \"Strengths include diverse agro-climatic conditions, strong R&D infrastructure, a robust seed production program, surplus production, and ease of organic production.\"\n    },\n    {\n        \"Q\": \"What seasonal advantage does India have in potato production?\",\n        \"A\": \"About 90% of Indian potatoes are produced in winters when no fresh potatoes are available in the northern hemisphere.\"\n    },\n    {\n        \"Q\": \"How does the ICAR-CPRI support the potato industry in India?\",\n        \"A\": \"ICAR-CPRI provides research and development support and works with regional scientists through the AICRP network to improve the potato industry.\"\n    },\n    {\n        \"Q\": \"What is the current production level of potatoes in India?\",\n        \"A\": \"India's potato production has reached 52 million tonnes due to improved varieties and technologies.\"\n    },\n    {\n        \"Q\": \"Why is organic potato production easier in some parts of India?\",\n        \"A\": \"In some regions, especially hilly areas, the use of chemicals is minimal, making organic potato production easier.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is a strength of organic potato production in India?\",\n        \"A\": \"India has potential for organic potato production in several regions, which may capture the global organic market.\"\n    },\n    {\n        \"Q\": \"What is a major weakness in India's potato certification system?\",\n        \"A\": \"The certification system for seed and table potatoes is inadequate and unreliable, failing to meet international standards.\"\n    },\n    {\n        \"Q\": \"Why is infrastructure a weakness for potato exports in India?\",\n        \"A\": \"India lacks sufficient infrastructure, such as cold chain facilities, modern transportation racks, and grading/packaging lines, which increases export costs.\"\n    },\n    {\n        \"Q\": \"What is the issue with warehousing facilities near ports for potato exports?\",\n        \"A\": \"There is a lack of warehousing and cold storage facilities near exporting ports, increasing the risk of potato spoilage.\"\n    },\n    {\n        \"Q\": \"Why do Indian potatoes lack brand value in global markets?\",\n        \"A\": \"Indian potatoes have low export volumes, preventing the creation of a strong brand in world trade.\"\n    },\n    {\n        \"Q\": \"What opportunities exist for private participation in potato seed production?\",\n        \"A\": \"Private agencies are producing quality potato seeds using Indian varieties, meeting export norms for table and processing potatoes.\"\n    },\n    {\n        \"Q\": \"How does the growing processing sector create export opportunities for Indian potatoes?\",\n        \"A\": \"With 8% of potato production used for processing and increasing demand for processed products, India has opportunities to export frozen and processed potatoes.\"\n    },\n    {\n        \"Q\": \"What is the export opportunity related to fresh potatoes in the northern hemisphere?\",\n        \"A\": \"India's fresh potato harvest in winter coincides with shortages in Eastern Europe, North Africa, and the Middle East, creating export opportunities.\"\n    },\n    {\n        \"Q\": \"How does the demand for organic produce benefit Indian potato exports?\",\n        \"A\": \"The global demand for organically produced food, including potatoes, offers India an opportunity to export organic potatoes.\"\n    },\n    {\n        \"Q\": \"What is a major threat to potato production in India due to climate change?\",\n        \"A\": \"Rising temperatures and changing climate conditions are expected to negatively impact potato production, reducing surplus for export.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the current percentage of post-harvest losses in potato crops?\",\n        \"A\": \"Post-harvest losses in potato crops are approximately 16%.\"\n    },\n    {\n        \"Q\": \"What causes high post-harvest losses in potatoes?\",\n        \"A\": \"High post-harvest losses are caused by high moisture varieties and poor infrastructure for handling, transportation, and storage.\"\n    },\n    {\n        \"Q\": \"Why might potato exports face rejection from importing countries?\",\n        \"A\": \"Potato exports might face rejection due to stringent quarantine requirements and excessive use of pesticides and chemicals.\"\n    },\n    {\n        \"Q\": \"What aggressive trade policies affect India's potato exports?\",\n        \"A\": \"Aggressive trade policies of other exporters in the globalized economy create competition and challenges for India's potato exports.\"\n    },\n    {\n        \"Q\": \"What R&D measures are suggested for improving potato exports?\",\n        \"A\": \"R&D measures include developing scientific methods for detecting quarantine diseases, validating X-ray facilities for brown rot detection, and training stakeholders on storage and packaging.\"\n    },\n    {\n        \"Q\": \"What export target is suggested for Indian potatoes over the next five years?\",\n        \"A\": \"A moderate export target of 5% of production is suggested for Indian potatoes over the next five years.\"\n    },\n    {\n        \"Q\": \"How can India become a credential player in the global potato export market?\",\n        \"A\": \"India can establish long-term export contracts, meet export obligations, and maintain a regular and minimum fixed quantum of exports to established markets.\"\n    },\n    {\n        \"Q\": \"What advantage does India have in exporting fresh potatoes?\",\n        \"A\": \"India can export fresh table potatoes from January to June when European supply dwindles and supply fresh potatoes year-round due to diverse agro-climates.\"\n    },\n    {\n        \"Q\": \"What should be done to address the requirements of destination countries for potato exports?\",\n        \"A\": \"The requirements of destination countries should be listed and made available to exporters and producers.\"\n    },\n    {\n        \"Q\": \"What communication strategy is proposed for monitoring potato export activities?\",\n        \"A\": \"Creating a Potato Export group on WhatsApp for prompt communication between stakeholders, with regular meetings at least thrice a year, is proposed.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What gives India a competitive advantage in international potato trade?\",\n    \"A\": \"India has a competitive advantage due to low production costs resulting from the availability of cheap labor.\"\n  },\n  {\n    \"Q\": \"What policy recommendation could simplify potato export processes?\",\n    \"A\": \"A single window system for potato export should be developed to provide all necessary information to stakeholders.\"\n  },\n  {\n    \"Q\": \"What council is proposed to promote potato export?\",\n    \"A\": \"The Potato Export Promotion Council is proposed to address issues related to potato export.\"\n  },\n  {\n    \"Q\": \"What type of export incentives are suggested for potato exporters?\",\n    \"A\": \"Export incentives should be designed in consultation with established potato exporters.\"\n  },\n  {\n    \"Q\": \"Which regions in India are suggested for special/industrial status for seed potato production?\",\n    \"A\": \"Punjab, western Uttar Pradesh, Madhya Pradesh, and Rajasthan are suggested for special/industrial status for seed potato production.\"\n  },\n  {\n    \"Q\": \"What infrastructure platform is proposed to connect potato stakeholders?\",\n    \"A\": \"A platform like 'PotatoNet' is proposed to connect producers, cold store owners, processing industries, exporters, and government departments.\"\n  },\n  {\n    \"Q\": \"Why is the east coast of India considered for potato export?\",\n    \"A\": \"The east coast is convenient for exporting potatoes to Sri Lanka and South East Asian countries like Malaysia, Vietnam, Thailand, and Singapore.\"\n  },\n  {\n    \"Q\": \"What facilities should be established at exporting ports to aid potato export?\",\n    \"A\": \"Warehousing and cold storage facilities should be established at exporting ports to store and ship potatoes as per the requirements of importing countries.\"\n  },\n  {\n    \"Q\": \"What modern techniques are encouraged for high-grade export-quality potato handling?\",\n    \"A\": \"Modern handling, grading, and packaging lines for high-grade export-quality potatoes should be encouraged with policy support.\"\n  },\n  {\n    \"Q\": \"Who can be contacted for further interaction on potato export recommendations?\",\n    \"A\": \"Dr. S. K. Chakrabarti, Director of ICAR-Central Potato Research Institute, Shimla, can be contacted at director.cpri@icar.gov.in.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What percentage of global annual emissions is contributed by agriculture, forestry, and land-use changes?\",\n    \"A\": \"Agriculture, forestry, and land-use changes contribute to 25% of global annual emissions according to the IPCC Working Group III report.\"\n  },\n  {\n    \"Q\": \"Which continents are the leading producers of potatoes?\",\n    \"A\": \"Asia (42.5%) and Europe (38.8%) are the leading continents in potato production.\"\n  },\n  {\n    \"Q\": \"In which climates is potato cultivation well-suited?\",\n    \"A\": \"Potato cultivation is well-suited to cold climates and is widely grown in temperate, subtropical, and cool tropical regions.\"\n  },\n  {\n    \"Q\": \"How is potato production carried out in northern Europe and North America?\",\n    \"A\": \"Potato production in northern Europe and North America is carried out with intensive farming practices, including high rates of fertilization, pesticide use, and necessary irrigation.\"\n  },\n  {\n    \"Q\": \"What challenges do potatoes face in the Peruvian highlands during February?\",\n    \"A\": \"In the Peruvian highlands, temperatures during February can drop to –30°C, causing significant yield losses.\"\n  },\n  {\n    \"Q\": \"What impact does drought have on potato production?\",\n    \"A\": \"Drought hampers potato yield in some regions.\"\n  },\n  {\n    \"Q\": \"What is the significance of potato as a food crop?\",\n    \"A\": \"Potato is the third most important food crop in terms of production and has invaluable significance for the diets and livelihoods of millions of people worldwide.\"\n  },\n  {\n    \"Q\": \"What has the Food and Agriculture Organization (FAO) declared about potatoes?\",\n    \"A\": \"The FAO has declared potato as a wholesome food.\"\n  },\n  {\n    \"Q\": \"What does the International Food Policy Research Institute (IFPRI) predict about major food sources up to 2050?\",\n    \"A\": \"The IFPRI predicts that major food sources in the world, including wheat, rice, corn, and potatoes, will steadily decrease up to 2050.\"\n  },\n  {\n    \"Q\": \"How might future potato yields be affected by climate change?\",\n    \"A\": \"Future potato yields are likely to be affected by anthropogenic climate change and direct effects of emissions such as carbon dioxide (CO2) fertilization.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"How does climate change directly affect potato production?\",\n    \"A\": \"Climate change affects potato production by altering temperature and humidity, which impacts the crop cycle and productivity.\"\n  },\n  {\n    \"Q\": \"What is the impact of higher temperatures on potato yields?\",\n    \"A\": \"Higher temperatures can lead to adverse effects on potato yields, with expected yield declines of 20–30% in tropical and subtropical regions.\"\n  },\n  {\n    \"Q\": \"How do night temperatures above 22°C affect potato tuber development?\",\n    \"A\": \"Night temperatures above 22°C severely hamper starch deposition and tuber development in potatoes.\"\n  },\n  {\n    \"Q\": \"What conditions are optimal for the highest tuber yield in potatoes?\",\n    \"A\": \"The highest tuber yield is achieved under short-day (12-hour photoperiod) conditions at a temperature of 20°C.\"\n  },\n  {\n    \"Q\": \"How does climate change affect late blight in potatoes?\",\n    \"A\": \"Warmer and wetter conditions due to climate change make late blight more favorable, extending its susceptibility period by 10-20 days and expanding its range.\"\n  },\n  {\n    \"Q\": \"What is the estimated yield loss in potatoes for each 1°C increase in temperature?\",\n    \"A\": \"The estimated yield loss in potatoes is 2 t/ha for each 1°C increase in temperature.\"\n  },\n  {\n    \"Q\": \"How does a 2°C rise in temperature affect insect life cycles in temperate zones?\",\n    \"A\": \"A 2°C rise in temperature could result in one to five additional life cycles of certain insects, such as aphids and whiteflies, per season.\"\n  },\n  {\n    \"Q\": \"What is the impact of rising temperatures on the geographical range of insect infestations in potatoes?\",\n    \"A\": \"Rising temperatures (2°C) may increase the geographical range of insect infestations, including aphids, whiteflies, and leafhoppers.\"\n  },\n  {\n    \"Q\": \"How does increased precipitation affect potato diseases?\",\n    \"A\": \"Increased precipitation creates warmer and wetter conditions that are favorable for diseases like late blight in potatoes.\"\n  },\n  {\n    \"Q\": \"What challenges do farmers face in managing late blight due to climate change?\",\n    \"A\": \"Farmers may need 1-4 additional fungicide applications to manage late blight, increasing costs and environmental risks.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the expected impact of rising temperatures on potato viruses?\",\n    \"A\": \"The multiplication rate of most potato viruses is expected to rise with the increase in temperature.\"\n  },\n  {\n    \"Q\": \"What are the potential consequences of heavy rains on potato crops?\",\n    \"A\": \"Heavy rains might lead to outbreaks of late blight disease and pests like armyworms and beetles.\"\n  },\n  {\n    \"Q\": \"How much is pesticide usage expected to increase by 2050 due to pests and diseases?\",\n    \"A\": \"Pesticide usage is expected to increase by 2.4 to 2.7-fold by 2050.\"\n  },\n  {\n    \"Q\": \"Why are wild potato species important for potato breeding?\",\n    \"A\": \"Wild potato species are crucial gene pools for breeding new stress-resistant varieties.\"\n  },\n  {\n    \"Q\": \"What percentage of wild potato species are predicted to be on the verge of extinction by 2055?\",\n    \"A\": \"16–22% of all wild potato species are predicted to be on the verge of extinction by 2055.\"\n  },\n  {\n    \"Q\": \"What could happen to potato yields in leading potato-producing countries without adaptation to climate change?\",\n    \"A\": \"Without adaptation, potential potato yields could decrease by 19-32% in leading potato-producing countries.\"\n  },\n  {\n    \"Q\": \"How can adaptation strategies affect potential potato yield losses?\",\n    \"A\": \"With adaptation, potential yield losses could decrease to 2–24%, depending on the region.\"\n  },\n  {\n    \"Q\": \"What are some adaptation strategies for potato cultivation under climate change?\",\n    \"A\": \"Adaptation strategies include changes in the month of planting and the maturity class of the cultivar.\"\n  },\n  {\n    \"Q\": \"Which regions in India might see changes in potato productivity due to rising temperatures by 2020?\",\n    \"A\": \"Parts of Bihar, Madhya Pradesh, and West Bengal may see changes in productivity, while some parts of Punjab may experience higher yields.\"\n  },\n  {\n    \"Q\": \"What is the role of stress-resistant potato varieties in mitigating climate change impacts?\",\n    \"A\": \"Stress-resistant varieties can ensure sufficient yields under climate change conditions, contributing to food and income security.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the estimated increase in potato tuber yield for every 100 ppm increase in CO2 concentration?\",\n    \"A\": \"The tuber yield is estimated to increase by approximately 10% for every 100 ppm increase in CO2 concentration.\"\n  },\n  {\n    \"Q\": \"What CO2 concentration level could increase potato tuber yield by 20-30% according to simulation analysis?\",\n    \"A\": \"A CO2 concentration level of 700 ppm could increase potato tuber yield by 20-30%.\"\n  },\n  {\n    \"Q\": \"What are the positive effects of elevated CO2 concentration on potato growth attributed to?\",\n    \"A\": \"The positive effects are attributed to increased photosynthesis, ranging from 10 to 40%.\"\n  },\n  {\n    \"Q\": \"What are some adverse effects of elevated CO2 concentration on potato plants?\",\n    \"A\": \"Adverse effects include reduced chlorophyll content in leaves, accelerated leaf senescence, and faster depletion of leaf nitrogen concentration.\"\n  },\n  {\n    \"Q\": \"How is CO2 concentration correlated with assimilation in potato plants?\",\n    \"A\": \"CO2 concentration and assimilation are positively correlated in potato plants.\"\n  },\n  {\n    \"Q\": \"What is the botanical name of the potato plant?\",\n    \"A\": \"The botanical name of the potato plant is Solanum tuberosum L.\"\n  },\n  {\n    \"Q\": \"Which potato varieties are grown in the North-Western hills during the summer crop period?\",\n    \"A\": \"Varieties include Kufri Jyoti, K. Himalini, K. Girdhari, K. Kanchan, and K. Chandramukhi.\"\n  },\n  {\n    \"Q\": \"What is the crop period for potato production in the North-Eastern plains?\",\n    \"A\": \"The crop period in the North-Eastern plains is from the 4th week of October to February/March.\"\n  },\n  {\n    \"Q\": \"Which potato varieties are suitable for autumn planting in the North Central plains (UP)?\",\n    \"A\": \"Suitable varieties include K. Bahar, K. Sadabahar, K. Anand, K. Surya, K. Chipsona I, III & IV, K. Frysona, K. Gaurav, K. Badshah, K. Garima, and K. Mohan.\"\n  },\n  {\n    \"Q\": \"What is the significance of potato as a food crop globally?\",\n    \"A\": \"Potato is the third most important food crop in terms of human consumption after rice and wheat, contributing to global food and nutritional security.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the propagation method for potatoes?\",\n    \"A\": \"Potatoes are propagated using the tuber (vegetative) part.\"\n  },\n  {\n    \"Q\": \"What type of soil and pH is suitable for potato cultivation?\",\n    \"A\": \"Loamy and sandy loam soil with a pH of 5.8-6.6 is suitable for potato cultivation.\"\n  },\n  {\n    \"Q\": \"What is the optimum temperature range for potato tuberization?\",\n    \"A\": \"The optimum temperature range for potato tuberization is 18-22°C, with a night temperature below 20°C.\"\n  },\n  {\n    \"Q\": \"What is the recommended planting density for potatoes?\",\n    \"A\": \"The recommended planting density for potatoes is 30-35 g tuber weight and spacing of 60 x 20 cm.\"\n  },\n  {\n    \"Q\": \"How are potato seeds produced at ICAR-CPRI, Shimla?\",\n    \"A\": \"Potato seeds are produced using conventional and aeroponic systems, with ICAR-CPRI, Shimla producing 3,000 tonnes of nucleus and breeder seeds annually.\"\n  },\n  {\n    \"Q\": \"What are the manure and fertilizer requirements for potato cultivation?\",\n    \"A\": \"The requirements are 20-25 t/ha FYM, 120-160 kg N/ha, 60-80 kg P/ha, and 80-100 kg K/ha.\"\n  },\n  {\n    \"Q\": \"What are some common pests and diseases affecting potatoes?\",\n    \"A\": \"Common pests and diseases include late blight, viruses, common scab, black scurf, dry rot, soft rot, PCN, aphid, white fly, cut worm, and potato tuber moth.\"\n  },\n  {\n    \"Q\": \"When are potatoes typically harvested?\",\n    \"A\": \"Potatoes are typically harvested 90-100 days after planting.\"\n  },\n  {\n    \"Q\": \"What is the recommended seed treatment for potatoes?\",\n    \"A\": \"Potato seeds should be dipped or sprayed in 3% boric acid for 25-30 minutes.\"\n  },\n  {\n    \"Q\": \"What are some value-added products made from potatoes?\",\n    \"A\": \"Value-added products include chips, french fries, daliya, halwa, cookies, and starch.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the Indian Council of Agricultural Research (ICAR) known for?\",\n        \"A\": \"ICAR is one of the largest agricultural research organizations in the world, fostering integration of research, education, and extension education.\"\n    },\n    {\n        \"Q\": \"What partnership has ICAR established to promote agricultural research?\",\n        \"A\": \"ICAR has created a symbiotic working partnership between Central Institutes and Agricultural Universities through All-India Coordinated Research Projects.\"\n    },\n    {\n        \"Q\": \"What is the purpose of ICAR's whole-village operational research projects?\",\n        \"A\": \"These projects assess untapped production potential at current technology levels and identify constraints faced by small and marginal farmers.\"\n    },\n    {\n        \"Q\": \"What are Krishi Vigyan Kendras, and what principle are they based on?\",\n        \"A\": \"Krishi Vigyan Kendras are Farm Science Centres based on the principle of 'learning by doing' to bridge gaps between food production and accessibility.\"\n    },\n    {\n        \"Q\": \"What approach has ICAR initiated to integrate different production systems?\",\n        \"A\": \"ICAR has fostered an integrated approach to crop-livestock-fish production systems in various agro-ecological and socio-cultural settings.\"\n    },\n    {\n        \"Q\": \"How does ICAR contribute to the development of new agricultural technology?\",\n        \"A\": \"ICAR strengthens mission-oriented basic research to ensure a steady flow of new technologies for increased food production from limited land.\"\n    },\n    {\n        \"Q\": \"What mechanism has ICAR established to evaluate its research investments?\",\n        \"A\": \"ICAR has set up a monitoring mechanism to measure the returns on investments in agricultural research.\"\n    },\n    {\n        \"Q\": \"What qualities are essential for individuals involved in agricultural science and education, according to ICAR?\",\n        \"A\": \"Integrity, dedication, scholarship, and an attitude where work and recreation are synonymous are essential qualities.\"\n    },\n    {\n        \"Q\": \"How does ICAR maintain contact with both policymakers and farmers?\",\n        \"A\": \"ICAR's organizational structure enables continuous contact with policymakers and farmers, who are the ultimate users and judges of research value.\"\n    },\n    {\n        \"Q\": \"What steps has ICAR taken to address deficiencies in its operations?\",\n        \"A\": \"ICAR's structure allows for the speedy rectification of deficiencies as they are identified.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"When was the Agricultural Research Service introduced by ICAR?\",\n        \"A\": \"The Agricultural Research Service was introduced by ICAR on October 2, 1975.\"\n    },\n    {\n        \"Q\": \"What is the purpose of the Agricultural Research Service for ICAR scientists?\",\n        \"A\": \"The purpose is to enable scientists to receive the highest salary possible in public services without leaving their field of specialization or shifting to managerial and administrative posts.\"\n    },\n    {\n        \"Q\": \"How does the Agricultural Research Service aim to reduce unhealthy competition?\",\n        \"A\": \"It fosters cooperation and encourages scientists to compete with their own past performance rather than with colleagues.\"\n    },\n    {\n        \"Q\": \"What is the significance of linking rights and responsibilities in the Agricultural Research Service?\",\n        \"A\": \"It instills the principle that dedicated and efficient discharge of responsibilities is the means to secure professional advancement.\"\n    },\n    {\n        \"Q\": \"How does the Agricultural Research Service promote horizontal and vertical mobility?\",\n        \"A\": \"It enables scientists to advance their careers irrespective of vacancies and allows them to work in neglected and tribal regions as a service duty.\"\n    },\n    {\n        \"Q\": \"What training initiatives have been introduced by ICAR for its scientists?\",\n        \"A\": \"ICAR provides management training to Directors of Central Institutes and plans to use the Central Staff College for Agriculture for regular training programs.\"\n    },\n    {\n        \"Q\": \"What is the goal of interdisciplinary teamwork in the Agricultural Research Service?\",\n        \"A\": \"The goal is to solve specific field problems through teamwork rather than focusing solely on discipline worship or paper publication.\"\n    },\n    {\n        \"Q\": \"How does the five-year assessment system benefit ICAR scientists?\",\n        \"A\": \"It ensures that professional advancement is based on efficient and dedicated discharge of responsibilities.\"\n    },\n    {\n        \"Q\": \"What change in attitude does the Agricultural Research Service aim to bring among scientists?\",\n        \"A\": \"It aims to shift the focus from competing with colleagues to competing with one's own record and linking rights with responsibilities.\"\n    },\n    {\n        \"Q\": \"What are the major aims of the Agricultural Research Service introduced by ICAR?\",\n        \"A\": \"The major aims include fostering cooperation, enabling salary advancement without managerial shifts, promoting interdisciplinary teamwork, ensuring mobility, and linking rights with responsibilities.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"When was the Indian Council of Agricultural Research (ICAR) established?\",\n    \"A\": \"The Indian Council of Agricultural Research (ICAR) was established in 1929.\"\n  },\n  {\n    \"Q\": \"What was the primary role of ICAR before 1965?\",\n    \"A\": \"Before 1965, ICAR functioned as an apex coordinating body financing ad-hoc research projects through revenues obtained from the Agricultural Produce Cess Act of 1940.\"\n  },\n  {\n    \"Q\": \"What responsibility was entrusted to ICAR by the Government of India in 1965?\",\n    \"A\": \"In 1965, ICAR was entrusted with managing research institutions in agriculture, animal husbandry, and fisheries.\"\n  },\n  {\n    \"Q\": \"What unique position does ICAR occupy among scientific organizations in India?\",\n    \"A\": \"ICAR occupies a unique position as it has concurrent responsibility for both agricultural research and education.\"\n  },\n  {\n    \"Q\": \"What are All-India Coordinated Research Projects sponsored by ICAR?\",\n    \"A\": \"All-India Coordinated Research Projects are initiatives that bring together scientists from various disciplines and institutions to work collaboratively on well-defined areas of research.\"\n  },\n  {\n    \"Q\": \"How does ICAR support agricultural universities?\",\n    \"A\": \"ICAR fosters and supports the growth and development of agricultural universities.\"\n  },\n  {\n    \"Q\": \"What mechanisms does ICAR use for extension education?\",\n    \"A\": \"ICAR conducts extension education through national demonstrations, mini-kit demonstrations, operational research projects, pilot projects, and other mechanisms.\"\n  },\n  {\n    \"Q\": \"How does ICAR integrate research and farming systems?\",\n    \"A\": \"ICAR uses its charter and structure to sponsor integrated farming systems research through coordinated experiments across disciplines and institutions.\"\n  },\n  {\n    \"Q\": \"What feedback mechanism has ICAR established with farmers?\",\n    \"A\": \"ICAR has established feedback mechanisms with farmers through collaborative projects involving scientists from ICAR and agricultural universities.\"\n  },\n  {\n    \"Q\": \"What funding mechanism did ICAR use for ad-hoc research schemes?\",\n    \"A\": \"ICAR used funds from the Agricultural Produce Cess Act to support ad-hoc research schemes.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the key factor in determining the effectiveness of a research organization?\",\n    \"A\": \"The effectiveness of a research organization depends on the quality and quantum of work done by its scientists.\"\n  },\n  {\n    \"Q\": \"Who supports scientists in a research organization to enhance effectiveness?\",\n    \"A\": \"Scientists are supported by technical, administrative, and supporting personnel.\"\n  },\n  {\n    \"Q\": \"Why are personnel policies important for a research organization?\",\n    \"A\": \"Personnel policies are crucial as they ensure each individual can give their best, maximizing the return on public investment.\"\n  },\n  {\n    \"Q\": \"What are the primary objectives of ICAR's research programs?\",\n    \"A\": \"The objectives include improving crop and animal productivity, enhancing yield and income per unit of resources, ensuring stability in production, integrating production and post-harvest technologies, and making agricultural education relevant.\"\n  },\n  {\n    \"Q\": \"What steps has ICAR taken to align personnel policies with its objectives?\",\n    \"A\": \"ICAR has restructured personnel policies for scientific, technical, administrative, and supporting staff to meet organizational needs.\"\n  },\n  {\n    \"Q\": \"What are the two services constituted by ICAR for scientific personnel?\",\n    \"A\": \"The two services are Agricultural Research Service (ARS) and Research Management Positions (RMP).\"\n  },\n  {\n    \"Q\": \"When were the ARS and RMP services constituted by ICAR?\",\n    \"A\": \"The ARS was constituted on October 1, 1975, and the RMP on April 1, 1976.\"\n  },\n  {\n    \"Q\": \"What is a significant feature of ICAR's new personnel policies for scientists?\",\n    \"A\": \"Scientists can achieve the highest salary within the organization without needing to move from their field of specialization or compete recurrently.\"\n  },\n  {\n    \"Q\": \"What role may scientists have to play during their careers under ICAR's policies?\",\n    \"A\": \"Scientists may have to help solve problems in neglected and tribal areas during their careers.\"\n  },\n  {\n    \"Q\": \"Where and when was the Agricultural Research Service (ARS) inaugurated?\",\n    \"A\": \"The ARS was inaugurated on October 2, 1975, at NDRI, Karnal.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the purpose of the Agricultural Scientists' Recruitment Board?\",\n        \"A\": \"The Agricultural Scientists' Recruitment Board is an independent recruiting agency responsible for recruitment to posts in the Agricultural Research Service, assisting in personnel matters, advising on disciplinary issues, and submitting annual reports to the President of the ICAR Society.\"\n    },\n    {\n        \"Q\": \"Who heads the Agricultural Scientists' Recruitment Board?\",\n        \"A\": \"The Agricultural Scientists' Recruitment Board is headed by a whole-time Chairman who reports directly to the President of the ICAR Society.\"\n    },\n    {\n        \"Q\": \"What are research management positions in ICAR?\",\n        \"A\": \"Research management positions are posts at the ICAR Headquarters and Institutes, filled on a tenurial basis, and are outside the Agricultural Research Service.\"\n    },\n    {\n        \"Q\": \"What happens to scientists after completing their tenure in research management posts?\",\n        \"A\": \"After completing their tenure in research management posts, scientists return to a matching position in research work.\"\n    },\n    {\n        \"Q\": \"What is one of the objectives of the Agricultural Research Service?\",\n        \"A\": \"One objective of the Agricultural Research Service is to generate a scientific culture and provide opportunities for continuous professional growth and life-long specialization.\"\n    },\n    {\n        \"Q\": \"How does the Agricultural Research Service attract talent?\",\n        \"A\": \"The Agricultural Research Service attracts talent by recruiting and training promising postgraduates and graduates with an aptitude for agricultural research.\"\n    },\n    {\n        \"Q\": \"What is the role of the Agricultural Research Service in promoting collaboration?\",\n        \"A\": \"The Agricultural Research Service promotes team work and genuine professional collaboration, particularly on an interdisciplinary basis, while eliminating unhealthy rivalry.\"\n    },\n    {\n        \"Q\": \"How does the Agricultural Research Service help scientists advance in their careers?\",\n        \"A\": \"The Agricultural Research Service enables scientists to advance in their careers while continuing to work on problems related to specific crops, animals, or areas of agriculture.\"\n    },\n    {\n        \"Q\": \"What are the recruitment and promotion rules for ICAR personnel aimed at?\",\n        \"A\": \"The recruitment and promotion rules for ICAR personnel are aimed at providing better prospects for career advancement.\"\n    },\n    {\n        \"Q\": \"What is one of the functions of the Agricultural Scientists' Recruitment Board related to disciplinary matters?\",\n        \"A\": \"The Agricultural Scientists' Recruitment Board advises the Council on disciplinary matters related to personnel recruited or appointed by the Council or in consultation with the Board.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the primary goal of the ICAR Agricultural Research Service?\",\n    \"A\": \"The primary goal is to promote effective planning, implementation of research programs, and organized cooperation in agricultural research.\"\n  },\n  {\n    \"Q\": \"What is the unique feature of the ICAR Agricultural Research Service?\",\n    \"A\": \"The Service replaces the 'post-centered' system with a 'scientist-centered' system, allowing promotions based on periodic assessments rather than vacancy availability.\"\n  },\n  {\n    \"Q\": \"Who conducts the periodic assessments for promotions in the ICAR Agricultural Research Service?\",\n    \"A\": \"An external panel of eminent scientists headed by the Chairman of the Agricultural Scientists' Recruitment Board conducts the assessments.\"\n  },\n  {\n    \"Q\": \"What are the four major disciplines of the ICAR Agricultural Research Service?\",\n    \"A\": \"The four major disciplines are agricultural sciences, animal sciences, social sciences, and technology.\"\n  },\n  {\n    \"Q\": \"What is the role of the Agricultural Scientists' Recruitment Board in the ICAR Service?\",\n    \"A\": \"The board oversees promotions, assessments, and recognition of outstanding research contributions.\"\n  },\n  {\n    \"Q\": \"What does the Service aim to achieve in terms of scientist mobility?\",\n    \"A\": \"The Service facilitates smooth mobility of scientists between ICAR institutes, universities, and other organizations like the Council of Scientific and Industrial Research and Bhabha Atomic Research Centre.\"\n  },\n  {\n    \"Q\": \"What types of posts are included in the ICAR Agricultural Research Service?\",\n    \"A\": \"The Service includes posts related to agricultural research and education, including physical, biological, statistical, engineering, technological, home, and social sciences.\"\n  },\n  {\n    \"Q\": \"What are the grades and pay scales in the ICAR Agricultural Research Service?\",\n    \"A\": \"The grades and pay scales are: Scientist (S) Rs 550-25-750-EB-30-900, Scientist 1 (S-1) Rs 700-40-900-EB-40-1100-50-1300, Scientist 2 (S-2) Rs 1100-50-1600, and Scientist 3 (S-3) Rs 1500-60-1800-100-2000.\"\n  },\n  {\n    \"Q\": \"How does the Service address career advancement for scientists?\",\n    \"A\": \"It provides better career advancement opportunities through rigorous periodic assessments, irrespective of vacancy occurrences.\"\n  },\n  {\n    \"Q\": \"What is the purpose of focusing on areas with untapped agricultural growth potential?\",\n    \"A\": \"The aim is to address specific scientific problems and convert agricultural potential into meaningful wealth for the people.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What was the initial cadre strength of the Agricultural Research Service (ARS) on 1-10-1975?\",\n    \"A\": \"The initial cadre strength was fixed at 4,800.\"\n  },\n  {\n    \"Q\": \"Who is the controlling authority of the Agricultural Research Service?\",\n    \"A\": \"The controlling authority is the President of the ICAR Society, assisted by the Committee on Agricultural Research Service.\"\n  },\n  {\n    \"Q\": \"Who presides over the Committee on Agricultural Research Service?\",\n    \"A\": \"The Director-General of ICAR presides over the Committee on Agricultural Research Service.\"\n  },\n  {\n    \"Q\": \"Who is the appointing authority for the Agricultural Research Service?\",\n    \"A\": \"The President of the ICAR is the appointing authority.\"\n  },\n  {\n    \"Q\": \"When was the Agricultural Research Service initially constituted?\",\n    \"A\": \"The Agricultural Research Service was initially constituted on 1-10-1975.\"\n  },\n  {\n    \"Q\": \"How is the Agricultural Research Service maintained in the future?\",\n    \"A\": \"It is maintained by promotion based on assessment, competitive examinations, lateral entry through selection by the ASRB, and invitations to eminent Indian scientists.\"\n  },\n  {\n    \"Q\": \"What is the retirement age for members of the Agricultural Research Service?\",\n    \"A\": \"The retirement age is 60 years, with suitability assessments at 50, 55, and 58 years of age.\"\n  },\n  {\n    \"Q\": \"Are members of the Agricultural Research Service liable for transfer across India?\",\n    \"A\": \"Yes, members are liable to be transferred to any place in India.\"\n  },\n  {\n    \"Q\": \"What is the minimum service requirement in less developed areas for ARS members?\",\n    \"A\": \"Members may be required to serve a minimum period in backward or less developed areas as decided by the Controlling Authority.\"\n  },\n  {\n    \"Q\": \"What rules govern the conditions of service for members of the Agricultural Research Service?\",\n    \"A\": \"Members are governed by the rules applicable to ICAR employees from time to time.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What does 'Agriculture' include according to the text?\",\n    \"A\": \"Agriculture includes production, processing, marketing, and utilization of crops, livestock, and fisheries, as well as social and economic aspects of agricultural development.\"\n  },\n  {\n    \"Q\": \"What is the role of the Agricultural Scientists' Recruitment Board?\",\n    \"A\": \"The Agricultural Scientists' Recruitment Board is constituted under Rule 25 of the Rules of the Indian Council of Agricultural Research (ICAR).\"\n  },\n  {\n    \"Q\": \"Who is referred to as the 'Appointing Authority' in the text?\",\n    \"A\": \"The 'Appointing Authority' refers to the President.\"\n  },\n  {\n    \"Q\": \"What is the objective of the Agricultural Research Service in terms of recruitment?\",\n    \"A\": \"One objective is to attract, recruit, and train promising graduates and post-graduates with an aptitude for research in various branches of agriculture.\"\n  },\n  {\n    \"Q\": \"What does 'Scheduled Castes' refer to in the context of the text?\",\n    \"A\": \"'Scheduled Castes' refers to castes, races, or tribes deemed under Article 341 of the Constitution to be Scheduled Castes for the purpose of the Constitution.\"\n  },\n  {\n    \"Q\": \"What is the purpose of promoting team work in the Agricultural Research Service?\",\n    \"A\": \"The purpose is to encourage genuine professional collaboration, particularly on an interdisciplinary basis, and to eliminate unhealthy rivalry.\"\n  },\n  {\n    \"Q\": \"What is meant by 'Service' in the context of the text?\",\n    \"A\": \"'Service' refers to the Agricultural Research Service constituted under Rule 5.\"\n  },\n  {\n    \"Q\": \"What is one of the objectives related to the career advancement of scientists?\",\n    \"A\": \"One objective is to enable scientists to advance in their careers while continuing to work on problems related to a particular crop, animal, or area of agricultural study for an extended period.\"\n  },\n  {\n    \"Q\": \"What is the function of the 'Governing Body' as mentioned in the text?\",\n    \"A\": \"The 'Governing Body' is constituted under Rule 35 of the Rules of the ICAR.\"\n  },\n  {\n    \"Q\": \"What is the aim of giving recognition to the research management function in the Agricultural Research Service?\",\n    \"A\": \"The aim is to ensure that scientists with an aptitude for research management and coordination can focus on effective planning and related tasks.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the purpose of the Agricultural Research Service (ARS)?\",\n        \"A\": \"The ARS is constituted to include scientists engaged in Agricultural Research and Education, including planning, programming, and management of scientific research.\"\n    },\n    {\n        \"Q\": \"What are the four broad categories of scientific disciplines in the ARS cadre?\",\n        \"A\": \"The four categories are agricultural sciences, animal sciences, social sciences, and technology.\"\n    },\n    {\n        \"Q\": \"What is the pay scale for a Scientist (S) in the ARS?\",\n        \"A\": \"The pay scale for a Scientist (S) is Rs 550-25-750-EB-30-900.\"\n    },\n    {\n        \"Q\": \"How is the permanent strength of the ARS determined?\",\n        \"A\": \"It is assumed that 80% of the total positions of scientists under the Council are likely to continue indefinitely and will be included in the permanent strength.\"\n    },\n    {\n        \"Q\": \"What is the role of the Controlling Authority in determining cadre strength?\",\n        \"A\": \"The Controlling Authority prescribes the cadre strength for each discipline and institute for a period of 5 years, aligning with Five-Year Plan periods.\"\n    },\n    {\n        \"Q\": \"What is the purpose of facilitating the mobility of scientists within ICAR and other organizations?\",\n        \"A\": \"The mobility of scientists is facilitated to ensure smooth and reciprocal interchange between research and management roles and to promote collaboration with sister organizations like universities, CSIR, and BARC.\"\n    },\n    {\n        \"Q\": \"What is the pay scale for a Scientist 3 (S-3) in the ARS?\",\n        \"A\": \"The pay scale for a Scientist 3 (S-3) is Rs 1500-60-1800-100-2000.\"\n    },\n    {\n        \"Q\": \"What is the norm prescribed by the Controlling Authority for posts among various grades?\",\n        \"A\": \"The Controlling Authority prescribes a norm for the ratio of posts among various grades to ensure a proper balance of manpower at different levels.\"\n    },\n    {\n        \"Q\": \"What is the scope of posts included in the Agricultural Research Service?\",\n        \"A\": \"All posts engaged in Agricultural Research and Education, including Physical, Biological, Statistical, Engineering, Technology, Home, or Social Sciences, are included in the ARS.\"\n    },\n    {\n        \"Q\": \"What is the purpose of scientific attention to underdeveloped areas in the country?\",\n        \"A\": \"The purpose is to address problems in areas with untapped potential for agricultural growth and convert it into meaningful wealth for the people.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"Who is the Controlling Authority for the Agricultural Research Service?\",\n    \"A\": \"The President, assisted by the Committee on Agricultural Research Service, is the Controlling Authority.\"\n  },\n  {\n    \"Q\": \"Who presides over the Committee on Agricultural Research Service?\",\n    \"A\": \"The Director-General of I.C.A.R. presides over the Committee.\"\n  },\n  {\n    \"Q\": \"How many members are nominated by the President to the Committee on Agricultural Research Service?\",\n    \"A\": \"Six members are nominated by the President, including the Secretary of I.C.A.R., the Director of I.A.R.I., and one Director of another Institute of the Council.\"\n  },\n  {\n    \"Q\": \"Who is the Appointing Authority for the Agricultural Research Service?\",\n    \"A\": \"The President is the Appointing Authority for the Service.\"\n  },\n  {\n    \"Q\": \"What is the role of the Agricultural Scientists' Recruitment Board in the initial constitution of the Service?\",\n    \"A\": \"The Board constitutes a Selection Committee to assess the suitability of the Council's candidates for the grades included in the cadre.\"\n  },\n  {\n    \"Q\": \"What happens to Council's candidates who are not absorbed in the initial constitution of the Service?\",\n    \"A\": \"They will continue to work as at present and may be considered for appointment at a later stage in consultation with the Board.\"\n  },\n  {\n    \"Q\": \"What is the procedure for recruiting candidates from the open market after the initial constitution?\",\n    \"A\": \"The Controlling Authority decides the qualifications and mode of selection in consultation with the Board.\"\n  },\n  {\n    \"Q\": \"What option is available to a Council candidate who does not wish to be absorbed in the Service?\",\n    \"A\": \"The candidate may continue to hold their current position, provided they inform the Council in writing within six months of their selection.\"\n  },\n  {\n    \"Q\": \"What are the methods of recruitment to Grade S-1 after the initial constitution of the Service?\",\n    \"A\": \"Recruitment to Grade S-1 can be made through a competitive examination and interview via the A.S.R.B. or through promotion from Grade S.\"\n  },\n  {\n    \"Q\": \"Who determines the method of recruitment to Grade S-1 after the initial constitution of the Service?\",\n    \"A\": \"The Controlling Authority determines the method or methods of recruitment.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"How are vacancies in Grade S filled?\",\n        \"A\": \"Vacancies in Grade S are filled by selection based on performance during the last 5 years by the Board from positions recognized by the Controlling Authority.\"\n    },\n    {\n        \"Q\": \"On what basis can a scientist be promoted to Grade S-1, S-2, and S-3?\",\n        \"A\": \"A scientist can be promoted to Grade S-1, S-2, and S-3 on the basis of merit as determined by appropriate assessment specified in Rule 19.\"\n    },\n    {\n        \"Q\": \"How are vacancies that cannot be filled by promotion handled?\",\n        \"A\": \"Vacancies that cannot be filled by promotion are filled by direct recruitment through the Board as prescribed in Schedule II.\"\n    },\n    {\n        \"Q\": \"What is the tenure for scientists selected for S-3 Grade (Project Coordinators)?\",\n        \"A\": \"Scientists selected for S-3 Grade (Project Coordinators) are given a tenure of five years, extendable for another five years.\"\n    },\n    {\n        \"Q\": \"Can posts in disciplines not approved for recruitment to A.R.S. be filled? If yes, how?\",\n        \"A\": \"Yes, posts in disciplines not approved for recruitment to A.R.S. can be filled on deputation basis by recruiting suitable persons from other scientific organizations and State/Central Government Departments through the A.S.R.B.\"\n    },\n    {\n        \"Q\": \"What provision exists for scientists of outstanding merit?\",\n        \"A\": \"Scientists of outstanding merit may be allowed a personal scale of pay higher than Grade S-3 in recognition of their exceptional research performance.\"\n    },\n    {\n        \"Q\": \"What is required of candidates selected through competitive examination?\",\n        \"A\": \"Candidates selected through competitive examination are required to undergo an intensive course of study and training for one year.\"\n    },\n    {\n        \"Q\": \"What bond must trainees execute upon selection?\",\n        \"A\": \"Trainees must execute a bond to serve the Council for a minimum period of four years from the date of joining.\"\n    },\n    {\n        \"Q\": \"Can highly qualified Indian scientists outside the Council be invited for appointments?\",\n        \"A\": \"Yes, the Director-General of ICAR, in consultation with the Board and with approval from the Controlling Authority, can invite highly qualified Indian scientists for appointments in the Service.\"\n    },\n    {\n        \"Q\": \"What happens to scientists holding permanent posts in other organizations when selected for ARS posts?\",\n        \"A\": \"Scientists holding permanent posts in other organizations may be appointed under the Council on deputation for a period not exceeding three years without excluding the posts from the purview of the service.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What happens if a trainee fails to serve the Council for the stipulated period after training?\",\n    \"A\": \"The trainee will be liable to refund 50% of the salary paid during the training period.\"\n  },\n  {\n    \"Q\": \"What is the consequence for a trainee found guilty of unbecoming conduct during training?\",\n    \"A\": \"The trainee will be discharged and must refund the full amount of emoluments paid during the training period.\"\n  },\n  {\n    \"Q\": \"What is the probation period for candidates appointed to the Service?\",\n    \"A\": \"The probation period is 2 years.\"\n  },\n  {\n    \"Q\": \"Can the probation period be extended?\",\n    \"A\": \"Yes, the Controlling Authority may extend the probation period.\"\n  },\n  {\n    \"Q\": \"What happens if a scientist is deemed unfit for permanent appointment during or after probation?\",\n    \"A\": \"The scientist may be discharged, reverted to their substantive post, or subjected to other orders by the Controlling Authority.\"\n  },\n  {\n    \"Q\": \"What powers does the Controlling Authority have regarding posts in any grade?\",\n    \"A\": \"The Controlling Authority can exclude posts in any grade from the purview of the Service.\"\n  },\n  {\n    \"Q\": \"How can vacancies in the Service be filled according to the Controlling Authority?\",\n    \"A\": \"Vacancies can be filled by direct recruitment through the Board or by temporary appointments under specific conditions.\"\n  },\n  {\n    \"Q\": \"What is the maximum duration for temporary appointments of scientists from outside the Council?\",\n    \"A\": \"Temporary appointments can be made for a period not exceeding 2 years at a time.\"\n  },\n  {\n    \"Q\": \"What is the limit on the number of vacancies that can be filled by temporary appointments from outside the Council?\",\n    \"A\": \"The total number of such vacancies cannot exceed 5% of the authorized strength of the Service.\"\n  },\n  {\n    \"Q\": \"What is the purpose of deputation under the Controlling Authority?\",\n    \"A\": \"Deputation allows scientists to work in posts under the Central or State Government, Agricultural Universities, or elsewhere in the interest of agricultural research and education.\"\n  }\n]\n```"
]