[
    "```json\n[\n    {\n        \"Q\": \"What does AICRP on Irrigation Water Management (IWM) focus on?\",\n        \"A\": \"AICRP on IWM focuses on optimizing irrigation schedules and improving water use efficiency for better crop yields and farmer income.\"\n    },\n    {\n        \"Q\": \"How many crops have standardized optimum irrigation schedules based on IW/CPE ratios?\",\n        \"A\": \"Optimum irrigation schedules have been standardized for 57 crops.\"\n    },\n    {\n        \"Q\": \"What is the role of the Water Technology Center for Eastern Region (WTC-ER)?\",\n        \"A\": \"WTC-ER focuses on managing rainwater, canal water, groundwater, and disseminating on-farm water management technologies.\"\n    },\n    {\n        \"Q\": \"What technologies were developed to enhance irrigation water use efficiency?\",\n        \"A\": \"Technologies include rainwater harvesting, recycling, conjunctive use of water resources, micro-irrigation, alternate furrow irrigation, and mulching.\"\n    },\n    {\n        \"Q\": \"What is the purpose of the flexible rubber dam technology?\",\n        \"A\": \"The flexible rubber dam is designed to harvest rainwater and regulate water flow in streams.\"\n    },\n    {\n        \"Q\": \"What is skimming well/Doruvu technology used for?\",\n        \"A\": \"Skimming well/Doruvu technology is used to tap shallow good quality groundwater floating over subsurface saline water in coastal regions.\"\n    },\n    {\n        \"Q\": \"What are the National guidelines for use of saline and alkali water for irrigation?\",\n        \"A\": \"The guidelines were prepared in 1990 and published as Indian Standard (IS 11624: 2019) for irrigation water quality.\"\n    },\n    {\n        \"Q\": \"Which states have adopted the guidelines for saline and alkali water use for irrigation?\",\n        \"A\": \"The states include Haryana, Uttar Pradesh, Andhra Pradesh, Karnataka, and Gujarat.\"\n    },\n    {\n        \"Q\": \"What is the tank-cum-well system technology designed for?\",\n        \"A\": \"It is designed for rainwater harvesting along drainage lines in plateau areas with slopes of 2 to 5%.\"\n    },\n    {\n        \"Q\": \"What improvement was achieved using sensor-based drip irrigation in banana cultivation?\",\n        \"A\": \"Sensor-based drip irrigation improved banana productivity and saved 20% water compared to manual drip irrigation.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": What is the lead country for agriculture under BIMSTEC?\n        \"A\": The Republic of Myanmar is the lead country for agriculture under BIMSTEC.\n    },\n    {\n        \"Q\": What are some significant achievements in agriculture under BIMSTEC?\n        \"A\": Achievements include one meeting of agriculture ministers, eight agricultural experts' meetings, workshops on good agricultural practices (GAP), and agricultural trade and investment.\n    },\n    {\n        \"Q\": What concept notes did India propose in the 4th Expert Group on Agricultural Cooperation meeting?\n        \"A\": India proposed concept notes on the “South-South East Asian Diagnosis Network for Ensuring Bio-security and Bio-safety” and “Human Resources Development in Agriculture.”\n    },\n    {\n        \"Q\": What seminar was organized by ICAR in December 2019 for BIMSTEC countries?\n        \"A\": ICAR organized the International Seminar on Climate Smart Farming Systems in December 2019.\n    },\n    {\n        \"Q\": How many scholarships did India sponsor for BIMSTEC nations in 2021?\n        \"A\": India sponsored six scholarships, one for each of the six BIMSTEC nations other than India.\n    },\n    {\n        \"Q\": What is the nodal department for India-ASEAN agricultural cooperation?\n        \"A\": DARE (Department of Agricultural Research and Education) is the nodal department for India-ASEAN agricultural cooperation.\n    },\n    {\n        \"Q\": What are some priority areas in the ASEAN-India Medium-Term Plan of Action for 2021-2025?\n        \"A\": Priority areas include scholarships, climate-smart agriculture, robotics and drones in agriculture, post-harvest technology, and transboundary disease management.\n    },\n    {\n        \"Q\": What projects have been implemented under India-ASEAN agricultural cooperation?\n        \"A\": Projects include exchange of experts and farmers for training, higher agricultural education under ASEAN-India Fellowships, and training on organic certification for fruits and vegetables.\n    },\n    {\n        \"Q\": When was the 6th ASEAN-India Ministerial Meeting on Agriculture held?\n        \"A\": The 6th ASEAN-India Ministerial Meeting on Agriculture was held on October 21, 2020.\n    },\n    {\n        \"Q\": What opportunities does the G-20 provide for agricultural cooperation?\n        \"A\": The G-20 offers opportunities for chief scientists of national-level organizations to collaborate and share expertise in agriculture.\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"When did India start participating in the Agriculture Technology Sharing (ATS) working group?\",\n    \"A\": \"India started participating in the ATS working group in 2016.\"\n  },\n  {\n    \"Q\": \"What are the global critical areas ICAR has been contributing to?\",\n    \"A\": \"ICAR has been contributing to climate change, food security, agri-food systems, transboundary diseases, and zoonosis.\"\n  },\n  {\n    \"Q\": \"What suggestion did India make during the 9th Meeting of Agricultural Chief Scientists (MACS) of G20 in 2020?\",\n    \"A\": \"India suggested regional cooperation among G20 nations for monitoring and forecasting transboundary insects/pests movement using spatial techniques and information technology.\"\n  },\n  {\n    \"Q\": \"What initiatives did India present during the 10th MACS held virtually in 2021?\",\n    \"A\": \"India presented its initiatives on One Health and climate-resilient and resilient agri-food systems.\"\n  },\n  {\n    \"Q\": \"When was the BRICS Agricultural Research Platform (ARP) officially made operational?\",\n    \"A\": \"The BRICS Agricultural Research Platform (ARP) was officially made operational on 27 August, 2021.\"\n  },\n  {\n    \"Q\": \"What is the purpose of the BRICS Agricultural Research Platform (ARP)?\",\n    \"A\": \"The BRICS-ARP serves as a global platform for science-led agriculture to address hunger, malnutrition, poverty, and inequality, while enhancing agricultural trade, bio-security, and climate-resilient agriculture.\"\n  },\n  {\n    \"Q\": \"What was the focus of the BRICS Agriculture Action Plan for 2021-24?\",\n    \"A\": \"The BRICS Agriculture Action Plan for 2021-24 focused on agri-value chains, agrobiodiversity for nutrition, climate change management for resilient agri-food systems, digital agricultural solutions, One Health approach, and trade development.\"\n  },\n  {\n    \"Q\": \"When was the MoU for establishing the BRICS Agricultural Research Platform signed?\",\n    \"A\": \"The MoU for establishing the BRICS Agricultural Research Platform was signed on 16 October, 2016.\"\n  },\n  {\n    \"Q\": \"What support has India provided to Afghanistan in agricultural development?\",\n    \"A\": \"India supported the establishment of the Afghan National Agricultural Sciences and Technology University (ANASTU) in Kandahar through a bilateral cooperation program.\"\n  },\n  {\n    \"Q\": \"Where is the secretariat of BRICS Agricultural Research Platform located?\",\n    \"A\": \"The secretariat of BRICS Agricultural Research Platform is located in New Delhi under the governance of DARE.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"When was the MoU between ICAR and ANASTU signed?\",\n    \"A\": \"The MoU between ICAR and ANASTU was signed on April 21, 2016.\"\n  },\n  {\n    \"Q\": \"How many students were enrolled under the Indian-Afghanistan Fellowship program from 2016-2019?\",\n    \"A\": \"A total of 187 students were enrolled for UG, PG, and Ph.D. courses during 2016-2019.\"\n  },\n  {\n    \"Q\": \"What assistance has ICAR-IARI provided to ANASTU?\",\n    \"A\": \"ICAR-IARI has helped in establishing laboratories, devising course curricula for Master's programs, and building the capacity of ANASTU faculty in advanced research and agricultural technologies.\"\n  },\n  {\n    \"Q\": \"When was the MoU for setting up ACARE in Myanmar signed?\",\n    \"A\": \"The MoU for setting up ACARE in Myanmar was signed on May 28, 2012.\"\n  },\n  {\n    \"Q\": \"What new PG programs were started at ACARE in 2017-18?\",\n    \"A\": \"Three new PG programs were started: Agricultural Extension Education, Molecular Biology & Biotechnology, and Food Engineering & Technology.\"\n  },\n  {\n    \"Q\": \"How many Myanmar students joined the M.Sc. program under the IARI-ACARE program in 2017-18 and 2018-19?\",\n    \"A\": \"Four Myanmar students joined in 2017-18, and two joined in 2018-19.\"\n  },\n  {\n    \"Q\": \"What was the purpose of the Participatory KM program in Myanmar?\",\n    \"A\": \"Under the Participatory KM program, four villages within a 30 km radius of ACARE were adopted for demonstrating agricultural techniques.\"\n  },\n  {\n    \"Q\": \"What is the focus of the India-Nepal work plan for 2014-20?\",\n    \"A\": \"The work plan focused on study visits, training, collaborative research, agri-business, capacity building through fellowships, and opening National Agricultural Universities.\"\n  },\n  {\n    \"Q\": \"How many Nepalese students completed graduate/post-graduate courses in India by 2016-17 under the Nepal-Aid Fund Scheme?\",\n    \"A\": \"Fifteen Nepalese students completed their graduate/post-graduate courses in India by 2016-17.\"\n  },\n  {\n    \"Q\": \"When did ICAR-SLCARP cooperation between India and Sri Lanka begin?\",\n    \"A\": \"ICAR-SLCARP cooperation between India and Sri Lanka began in 1998.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What opportunities have been enabled for Sri Lankan scientists in India?\",\n    \"A\": \"Short-term training, M.Sc. and Ph.D. courses, exchange of germplasm and technologies, and collaborative research projects have been enabled for Sri Lankan scientists in India.\"\n  },\n  {\n    \"Q\": \"What is the purpose of the South-South Cooperation (SSC)?\",\n    \"A\": \"The South-South Cooperation (SSC) supports sustained economic growth in emerging economies.\"\n  },\n  {\n    \"Q\": \"What is the India-UN Development Partnership Fund?\",\n    \"A\": \"It is a fund established in 2017 under the United Nations Fund for South-South Cooperation to support initiatives for sustainable development.\"\n  },\n  {\n    \"Q\": \"What agricultural scholarships are offered under the India-Africa Forum Summits (IAFS)?\",\n    \"A\": \"Special agricultural scholarships for Masters and Ph.D. programs are offered to African students under IAFS.\"\n  },\n  {\n    \"Q\": \"What agricultural projects have been proposed for African countries under IAFS?\",\n    \"A\": \"Projects include establishing soil, water, and tissue testing laboratories, agricultural seed production-cum-demonstration centers, and Farm Science Centres (KVKs) in various African countries.\"\n  },\n  {\n    \"Q\": \"What is the role of ICAR in the Asia-Pacific Association of Agriculture Research Institutions (APAARI)?\",\n    \"A\": \"ICAR is a founder member of APAARI, contributes US$10,000 annually, and hosts ICAR scientists for thematic trainings and consultative workshops.\"\n  },\n  {\n    \"Q\": \"What is the role of ICAR-CIFA in the Network of Aquaculture Centres in Asia-Pacific (NACA)?\",\n    \"A\": \"ICAR-CIFA, Bhubaneswar, is a regional lead center of NACA, focusing on improved spawn production, infrastructure development, and training for fisheries scientists.\"\n  },\n  {\n    \"Q\": \"What was the focus of the regional consultation organized by ICAR-NBFGR in February 2019?\",\n    \"A\": \"The consultation focused on 'genetically responsible aquaculture: sustainability of genetically fit bloodstock and seed of certified origin in Asia aquaculture.'\"\n  },\n  {\n    \"Q\": \"What is the objective of the collaboration between DARE and the Centre for Agriculture and Bioscience International (CABI)?\",\n    \"A\": \"The collaboration focuses on information management, pest management, capacity building, transfer of technology, and research on microbial resources in agriculture.\"\n  },\n  {\n    \"Q\": \"What strategic research program was implemented under the DARE-CABI collaboration in 2018?\",\n    \"A\": \"A program on microbial taxonomy, diagnostics, biocontrol, and quarantine protocols was implemented under the DARE-CABI collaboration.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the scientific name of barnyard millet?\",\n    \"A\": \"The scientific name of barnyard millet is Echinochloa sp.\"\n  },\n  {\n    \"Q\": \"Which two major species of barnyard millet are cultivated for human consumption and livestock feed?\",\n    \"A\": \"The two major species are Echinochloa esculenta (Japanese barnyard millet) and Echinochloa frumentacea (Indian barnyard millet).\"\n  },\n  {\n    \"Q\": \"Which country is the largest producer of barnyard millet?\",\n    \"A\": \"India is the largest producer of barnyard millet.\"\n  },\n  {\n    \"Q\": \"What is the average productivity of barnyard millet in India over the last three years?\",\n    \"A\": \"The average productivity of barnyard millet in India is 1034 kg/ha.\"\n  },\n  {\n    \"Q\": \"What are the nutritional benefits of barnyard millet?\",\n    \"A\": \"Barnyard millet is a good source of protein, carbohydrates, fibre, iron, zinc, and vitamins.\"\n  },\n  {\n    \"Q\": \"What are some of the recent advancements in barnyard millet research?\",\n    \"A\": \"Recent advancements include characterization of germplasm, identification of trait-specific accessions, discoveries of genes/QTLs, transcriptome analysis studies, and genome sequencing.\"\n  },\n  {\n    \"Q\": \"Which organizations are involved in barnyard millet research and improvement?\",\n    \"A\": \"Organizations include ICAR-Indian Institute of Millets Research (IIMR), ICAR-National Bureau of Plant Genetic Resources (NBPGR), and International Crops Research Institute for the Semi-Arid Tropics (ICRISAT).\"\n  },\n  {\n    \"Q\": \"How many germplasm accessions of barnyard millet are conserved globally?\",\n    \"A\": \"Globally, 8000 germplasm accessions of barnyard millet are conserved.\"\n  },\n  {\n    \"Q\": \"What is the significance of genome sequencing in barnyard millet research?\",\n    \"A\": \"Genome sequencing helps in understanding the adaptability of barnyard millet, dissecting phenotypic traits at the genotypic level, and improving yield-contributing traits.\"\n  },\n  {\n    \"Q\": \"Which institutions conserve barnyard millet germplasm accessions?\",\n    \"A\": \"Institutions include Vivekananda Parvatiya Krishi Anusandhan Sansthan (VPKAS) in India, Indian Institute of Millets Research (IIMR), National Institute of Agro-biological Sciences (NIAS) in Japan, and ICRISAT.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"Which ICAR institutes are actively involved in foreign-aided collaborative research programs?\",\n    \"A\": \"ICAR-NBAIM (Mau, Uttar Pradesh) and ICAR-NBAIR (Bengaluru) are actively involved.\"\n  },\n  {\n    \"Q\": \"How many foreign-aided projects in agricultural R&D have been implemented since 2018-19?\",\n    \"A\": \"A total of 54 foreign-aided projects have been implemented.\"\n  },\n  {\n    \"Q\": \"Which international organizations fund foreign-aided projects in ICAR?\",\n    \"A\": \"Organizations like UN Agencies (FAO, UNDP), US programs (USIEF, USAID), and others like CABI, AVRDC, DIFD, and BMGF fund these projects.\"\n  },\n  {\n    \"Q\": \"What is the focus of the BMGF-supported project launched in January 2019?\",\n    \"A\": \"The project focuses on next-generation breeding, genotyping, and digitalization for improving genetic gain in Indian staple crops.\"\n  },\n  {\n    \"Q\": \"Which countries' research organizations have collaborated with ICAR in foreign-aided projects?\",\n    \"A\": \"Research organizations from countries like Australia, United Kingdom, USA, and Norway have collaborated with ICAR.\"\n  },\n  {\n    \"Q\": \"What is the Indo-Swiss and Indo-UK collaboration in agriculture about?\",\n    \"A\": \"Under these collaborations, 3 projects have been supported in agricultural research and development.\"\n  },\n  {\n    \"Q\": \"What was the aim of the Newton Fund Global Research Partnership in Aquaculture?\",\n    \"A\": \"It aimed to evaluate the costs and benefits of prophylactic health products and novel alternatives for smallholder aquaculture farmers in Asia and Africa.\"\n  },\n  {\n    \"Q\": \"What collaboration did ICAR-CIFT, Kochi establish under the FAO-UK Sandpit project?\",\n    \"A\": \"ICAR-CIFT collaborated with universities like Edinburgh, Bradford, Southampton, and others to assess food loss from selected gillnet and trammel.\"\n  },\n  {\n    \"Q\": \"What was the significance of the rice biotechnology project supported by the Rockefeller Foundation?\",\n    \"A\": \"It laid the scientific foundation for rice biotechnology, leading to discoveries like DNA molecular marker maps, pest resistance, and hybrid rice breeding.\"\n  },\n  {\n    \"Q\": \"What is the Asia Rice Biotechnology Network, and how did it contribute to rice research?\",\n    \"A\": \"The Asia Rice Biotechnology Network linked national rice biotechnology research efforts with advanced institutes globally and trained about 400 rice scientists over 17 years.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What initiative did India join in 2009 to combat wheat rust?\",\n    \"A\": \"India joined the Borlaug Global Rust Initiative (BGRI) in 2009 for collaborative research on combating wheat rust.\"\n  },\n  {\n    \"Q\": \"What project was initiated by ICAR and ACIAR for wheat improvement?\",\n    \"A\": \"ICAR and ACIAR initiated a strategic molecular wheat breeding project focusing on Ug99, water use efficiency, waterlogging tolerance, quality improvement, and bioinformatics.\"\n  },\n  {\n    \"Q\": \"What is the purpose of the Netaji Subhas International Fellowships instituted by ICAR?\",\n    \"A\": \"The fellowship aims to develop human resources in cutting-edge technologies and showcase India's agricultural strengths abroad.\"\n  },\n  {\n    \"Q\": \"How many fellowships are awarded annually under the Netaji Subhas International Fellowships?\",\n    \"A\": \"A total of 30 fellowships, including Indian and foreign candidates, are awarded annually for pursuing Ph.D. degrees.\"\n  },\n  {\n    \"Q\": \"What is the purpose of ICAR-SAUs umbrella MoUs?\",\n    \"A\": \"The purpose is to establish AICRP cooperating centers in SAUs and KVKs for collaborative research, technology dissemination, and validation of technologies.\"\n  },\n  {\n    \"Q\": \"Which national R&D organizations has ICAR signed MoUs with since 2014?\",\n    \"A\": \"ICAR has signed MoUs with CSIR, ICMR, ICFRE, DBT, and IMD to strengthen research in agricultural sciences.\"\n  },\n  {\n    \"Q\": \"What organizations has ICAR collaborated with to enhance farmer outreach?\",\n    \"A\": \"ICAR has collaborated with NCDC, NGOs like Patanjali Bio Research Institute, ICICI Foundation, ICFA, and financial institutions like NABARD.\"\n  },\n  {\n    \"Q\": \"What is the purpose of the MoU signed between ICAR and the Ministry of MSME in 2021?\",\n    \"A\": \"The MoU aims to strengthen collaboration with industries and promote agricultural technologies.\"\n  },\n  {\n    \"Q\": \"What sub-national collaborations has ICAR engaged in?\",\n    \"A\": \"ICAR has signed MoUs with State Governments, agricultural universities, SAMETIs, and industries for research and technology dissemination.\"\n  },\n  {\n    \"Q\": \"What is the objective of ICAR's MoU with the Chhattisgarh Minor Forest Produce Cooperative Federation?\",\n    \"A\": \"The objective is to promote technologies related to minor forest produce and develop the capacities of producers.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"Which company collaborated with IISR for doubling the income of sugarcane farmers in Lakhimpur-Khiri district?\",\n    \"A\": \"DCM Sriram Ltd collaborated with IISR since 2016-17 for doubling the income of sugarcane farmers in Lakhimpur-Khiri district.\"\n  },\n  {\n    \"Q\": \"What was the purpose of the collaboration between IISR and Bihar Government in 2013?\",\n    \"A\": \"The collaboration aimed at breeder seed production of sugarcane, which significantly increased the availability of breeder seed in Bihar under IISR supervision.\"\n  },\n  {\n    \"Q\": \"How did the IPM demonstration in Basmati rice help farmers in Haryana and Punjab?\",\n    \"A\": \"The IPM demonstration reduced the use of tricyclazole and covered 38,600 acres across 5 districts of Haryana and 2 districts of Punjab with the partnership of Ebro India Pvt Ltd in 2013.\"\n  },\n  {\n    \"Q\": \"What was the outcome of the ICAR-IMD collaboration initiated in 2018?\",\n    \"A\": \"The collaboration led to the installation of automatic weather stations, exchange of data, and online access to weather data for agro-advisories.\"\n  },\n  {\n    \"Q\": \"What is PRH-10, and when was it licensed to seed companies?\",\n    \"A\": \"PRH-10 is the first super fine grain aromatic rice hybrid, licensed to 19 seed companies in 2008.\"\n  },\n  {\n    \"Q\": \"Which Basmati rice variety with resistance to blast disease was commercialized through 11 seed companies?\",\n    \"A\": \"The Basmati variety PB 1637, an improvement of Pusa Basmati 1, was commercialized through 11 seed companies.\"\n  },\n  {\n    \"Q\": \"How many companies were licensed for the commercialization of wheat variety HD 3086?\",\n    \"A\": \"HD 3086 was commercialized to 202 companies within two years.\"\n  },\n  {\n    \"Q\": \"Which organization collaborated with ITC Ltd. for wheat variety trials, and what was the outcome?\",\n    \"A\": \"IARI collaborated with ITC Ltd., revealing 6 wheat varieties (e.g., HI 1544, HI 1605) with superior yield potential and quality based on trials at 20 centers across India.\"\n  },\n  {\n    \"Q\": \"What is the significance of the collaboration between CIRCOT and M/s. Forech Mining & Constructions International?\",\n    \"A\": \"The collaboration was established for the development of ginning machines.\"\n  },\n  {\n    \"Q\": \"Which hybrid rice varieties were licensed for seed production and commercialization between 2013 and 2016?\",\n    \"A\": \"Hybrid rice varieties Rajalaxmi, CR Dhan 701, and Hybrid Rice Ajay were licensed to 20 seed industries between 2013 and 2016.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"Which organizations collaborated in 2018 to promote rubber check dams?\",\n    \"A\": \"ICAR-IIWM, Bhubaneswar and Indian Rubber Manufacturers Research Association (IRMRA) collaborated in 2018 to promote rubber check dams.\"\n  },\n  {\n    \"Q\": \"What was the purpose of the MoU between IARI and Ajay Bio Tech (India) Ltd. in 2018?\",\n    \"A\": \"The MoU aimed to disseminate entomopathogenic nematode in tea gardens in West Bengal and Assam.\"\n  },\n  {\n    \"Q\": \"What is the product 'Bio-fighter' launched in 2019 effective against?\",\n    \"A\": \"'Bio-fighter' is effective against tea semi-looper, armyworms, cutworms, white grubs, and termites.\"\n  },\n  {\n    \"Q\": \"What areas were covered under ICAR's umbrella MoUs since 2014?\",\n    \"A\": \"The areas included R&D, exchange of germplasm, GM technology, agricultural education, zoonotic diseases, ICT research, post-harvest management, agro-forestry, and agricultural biotechnology.\"\n  },\n  {\n    \"Q\": \"Which organization collaborated with ICAR for agricultural education in 2014?\",\n    \"A\": \"AMITY University collaborated with ICAR for agricultural education in 2014.\"\n  },\n  {\n    \"Q\": \"What was the focus of the collaboration between ICAR and NABARD in 2019?\",\n    \"A\": \"The focus was on promoting and upscaling climate-resilient technology.\"\n  },\n  {\n    \"Q\": \"What is the purpose of linking KVKs with rural CSCs under the outreach programs?\",\n    \"A\": \"The purpose is to enhance the reach of KVKs to rural areas.\"\n  },\n  {\n    \"Q\": \"What initiative was started under PMFME by ICAR in 2020?\",\n    \"A\": \"Capacity development and need-based research for one-district one-product initiatives were started under PMFME in 2020.\"\n  },\n  {\n    \"Q\": \"Which organization collaborated with ICAR in 2020 for training and capacity building of farmers’ cooperatives?\",\n    \"A\": \"The National Cooperative Development Corporation (NCDC), New Delhi, collaborated with ICAR for this purpose.\"\n  },\n  {\n    \"Q\": \"What was the focus of ICAR's collaboration with the Chhattisgarh Minor Forest Produce Cooperative Federation Ltd. in 2021?\",\n    \"A\": \"The focus was on R&D related to non-wood forest produce.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What role do international collaborations play in agriculture?\",\n    \"A\": \"International collaborations help through revolutions and transformations by supporting science-based agricultural research and innovation.\"\n  },\n  {\n    \"Q\": \"When was DARE established, and what is its purpose?\",\n    \"A\": \"DARE was established in 1973 to facilitate international cooperation and agricultural research in India.\"\n  },\n  {\n    \"Q\": \"What division was established in ICAR in 2014 to enhance international cooperation?\",\n    \"A\": \"The International Relations (IR) division was established in ICAR in 2014.\"\n  },\n  {\n    \"Q\": \"What challenges require concerted efforts in agricultural R&D?\",\n    \"A\": \"Escalating biotic stresses of a transboundary nature require concerted efforts in agricultural R&D.\"\n  },\n  {\n    \"Q\": \"What should future agricultural R&D collaborations focus on?\",\n    \"A\": \"Future collaborations should focus on digital agriculture, precision farming, climate change management, and secondary agriculture.\"\n  },\n  {\n    \"Q\": \"How can financing for agricultural projects be augmented?\",\n    \"A\": \"Financing can be augmented through public-private partnerships and CSR funding for mutually beneficial projects.\"\n  },\n  {\n    \"Q\": \"What is the importance of global technology foresighting in agriculture?\",\n    \"A\": \"Global technology foresighting strengthens research collaborations across borders and supports agricultural research development.\"\n  },\n  {\n    \"Q\": \"What is the role of Centers of Excellence in agricultural R&D?\",\n    \"A\": \"Centers of Excellence in public and private sectors focus on innovations and build relationships for agricultural R&D.\"\n  },\n  {\n    \"Q\": \"Which organizations facilitate international cooperation in agriculture in India?\",\n    \"A\": \"Organizations like ICAR, DARE, and the Department of Agriculture & Farmers Welfare facilitate international cooperation.\"\n  },\n  {\n    \"Q\": \"What does the chapter summarize about agricultural development in India?\",\n    \"A\": \"The chapter traces agricultural growth in post-independent India through phases of technology adoption, stagnation, and revival.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the primary responsibility of agriculture in India?\",\n        \"A\": \"Agriculture bears the prime responsibility of ensuring food and nutritional security in India.\"\n    },\n    {\n        \"Q\": \"How much has agriculture's share in national output declined from 1950-51 to 2019-20?\",\n        \"A\": \"Agriculture's share in national output has declined from 53% in 1950-51 to 18% in 2019-20.\"\n    },\n    {\n        \"Q\": \"What proportion of India's workforce is still dependent on agriculture for livelihood?\",\n        \"A\": \"About half of India's workforce is still dependent on agriculture for livelihood.\"\n    },\n    {\n        \"Q\": \"What was the impact of the Green Revolution on Indian agriculture?\",\n        \"A\": \"The Green Revolution transformed Indian agriculture from a food-deficit economy to a food-surplus and net-exporting country.\"\n    },\n    {\n        \"Q\": \"What is the recent development agenda in Indian agriculture focused on?\",\n        \"A\": \"The recent development agenda has shifted from production-enhancing strategies to income-improvement strategies for farmers’ welfare.\"\n    },\n    {\n        \"Q\": \"What role do public and private institutions play in agricultural transformation?\",\n        \"A\": \"Public and private institutions provide policy support to reshape and reform the agriculture sector during the development process.\"\n    },\n    {\n        \"Q\": \"What are some institutional arrangements promoting agricultural entrepreneurship?\",\n        \"A\": \"Institutional arrangements such as agri-startups and Farmer Producer Organizations (FPOs) promote agricultural entrepreneurship.\"\n    },\n    {\n        \"Q\": \"What factors are critical for agricultural growth and sustainability?\",\n        \"A\": \"Technology commercialization, intellectual property rights, public-private partnerships, and higher research allocations are critical for agricultural growth and sustainability.\"\n    },\n    {\n        \"Q\": \"What does the paper analyze regarding Indian agriculture?\",\n        \"A\": \"The paper analyzes the growth trajectory of Indian agriculture and its transition from subsistence farming to a commercialized enterprise.\"\n    },\n    {\n        \"Q\": \"What are the key sections discussed in the paper on Indian agriculture?\",\n        \"A\": \"The paper discusses trends in agricultural growth, price policies, market reforms, governance supports, property rights, partnerships, and the promotion of FPOs and agri-startups.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What were the two key institutions established in 1965 for price support and procurement operations?\",\n    \"A\": \"The Commission for Agricultural Costs & Prices (CACP) and the Food Corporation of India (FCI) were established in 1965.\"\n  },\n  {\n    \"Q\": \"When was the Minimum Support Price (MSP) system started and for which crop?\",\n    \"A\": \"The MSP system started in 1966-67 for wheat.\"\n  },\n  {\n    \"Q\": \"What was the purpose of the Seeds Act enacted in 1966?\",\n    \"A\": \"The Seeds Act was enacted to regulate the quality of certain seeds for sale and matters connected therewith.\"\n  },\n  {\n    \"Q\": \"Which organization was established in 1982 as the apex body for Regional Rural Banks (RRBs) and Cooperative Banks?\",\n    \"A\": \"The National Bank for Agriculture and Rural Development (NABARD) was established in 1982.\"\n  },\n  {\n    \"Q\": \"What is the purpose of the Kisan Credit Card (KCC) scheme introduced in 1998?\",\n    \"A\": \"The Kisan Credit Card (KCC) scheme was introduced to offer credit to farmers to meet their farm expenses.\"\n  },\n  {\n    \"Q\": \"What was the goal of the National Horticulture Mission launched in 2005-06?\",\n    \"A\": \"The goal was to promote the horticulture sector by diversifying agriculture.\"\n  },\n  {\n    \"Q\": \"What is the Soil Health Card Scheme launched in 2015 aimed at achieving?\",\n    \"A\": \"The scheme aims to improve crop productivity through the judicious use of inputs by providing crop-wise recommendations of nutrients to farmers.\"\n  },\n  {\n    \"Q\": \"What is the purpose of the e-NAM scheme introduced in 2016?\",\n    \"A\": \"The e-NAM scheme aims to integrate existing markets into one nation, one market for agricultural commodities.\"\n  },\n  {\n    \"Q\": \"When were Regional Rural Banks (RRBs) set up, and what was their purpose?\",\n    \"A\": \"Regional Rural Banks (RRBs) were set up in 1976 to expand credit to agriculture and other rural activities.\"\n  },\n  {\n    \"Q\": \"What is the Protection of Plant Variety and Farmers Right Act (PPVFR Act) enacted in 2001 designed for?\",\n    \"A\": \"The PPVFR Act provides an effective system for protecting plant varieties, the rights of farmers and plant breeders, and encourages the development of new plant varieties.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What was the PM-KISAN Scheme, and when did it become operational?\",\n    \"A\": \"The PM-KISAN Scheme became operational on December 1, 2018, and provides income support of Rs. 6,000 per year to all land-holding farmer families in three equal installments.\"\n  },\n  {\n    \"Q\": \"What new ministry was formed in 2019 related to agriculture?\",\n    \"A\": \"The Ministry of Fisheries, Animal Husbandry, and Dairying (MoFAH&D) was formed in 2019.\"\n  },\n  {\n    \"Q\": \"What were the three acts enacted in 2020 to reform the agriculture sector?\",\n    \"A\": \"The three acts were: a) Farmers’ Produce Trade and Commerce (Promotion and Facilitation) Act, 2020; b) Farmers (Empowerment and Protection) Agreement on Price Assurance and Farm Services Act, 2020; and c) Essential Commodities (Amendment) Act (ECA), 2020.\"\n  },\n  {\n    \"Q\": \"Why were the 2020 agricultural reform acts repealed in 2021?\",\n    \"A\": \"The acts were repealed due to continuous protests by some sections of farmers.\"\n  },\n  {\n    \"Q\": \"What is the Agriculture Infrastructure Fund announced in 2020?\",\n    \"A\": \"The Agriculture Infrastructure Fund is a medium- to long-term debt financing facility for investment in viable projects for post-harvest management infrastructure and community farming assets.\"\n  },\n  {\n    \"Q\": \"What is the average annual growth rate of GVA from agriculture and allied sectors between 1950-51 and 2019-20?\",\n    \"A\": \"The average annual growth rate of GVA from agriculture and allied sectors during this period was 2.7%.\"\n  },\n  {\n    \"Q\": \"What was the decadal growth rate of agriculture during 1950-51 to 1960-61?\",\n    \"A\": \"The decadal growth rate of agriculture during 1950-51 to 1960-61 was 2.8%.\"\n  },\n  {\n    \"Q\": \"How did the Green Revolution impact agricultural growth in India?\",\n    \"A\": \"The Green Revolution led to significant acceleration in agricultural growth, reaching about 3% by 1975-76.\"\n  },\n  {\n    \"Q\": \"What caused the deceleration in agricultural growth during the mid-1990s to mid-2000s?\",\n    \"A\": \"The deceleration was attributed to the general neglect of agriculture, limited benefits from the terms of trade, and the introduction of globalization and liberalization policies in the early 1990s.\"\n  },\n  {\n    \"Q\": \"How many times did the GVA from agriculture and allied sectors increase between 1950-51 and 2019-20?\",\n    \"A\": \"The GVA from agriculture and allied sectors increased 6.7 times between 1950-51 and 2019-20.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"When did agricultural productivity begin to improve significantly in India?\",\n    \"A\": \"Agricultural productivity began to improve significantly in the mid-2000s.\"\n  },\n  {\n    \"Q\": \"Which states experienced faster growth in agricultural productivity since the mid-2000s?\",\n    \"A\": \"Low-productivity states experienced faster growth in agricultural productivity since the mid-2000s.\"\n  },\n  {\n    \"Q\": \"How does agricultural growth compare to non-agricultural growth in India?\",\n    \"A\": \"Agricultural growth has lagged behind non-agricultural growth during most of the period.\"\n  },\n  {\n    \"Q\": \"What factors contributed to the historically high agricultural growth in recent years?\",\n    \"A\": \"Technological interventions and policy reforms contributed to the historically high agricultural growth in recent years.\"\n  },\n  {\n    \"Q\": \"What are the sub-sectors of agriculture and allied sectors in India?\",\n    \"A\": \"The sub-sectors include crops, livestock, fisheries and aquaculture, and forestry and logging.\"\n  },\n  {\n    \"Q\": \"Which sub-sector has grown at a significantly higher rate since 2001-02?\",\n    \"A\": \"The livestock sector has grown at a significantly higher rate since 2001-02.\"\n  },\n  {\n    \"Q\": \"Which sub-sectors have helped sustain higher agricultural growth over decades?\",\n    \"A\": \"The livestock and fisheries sub-sectors have helped sustain higher agricultural growth over decades.\"\n  },\n  {\n    \"Q\": \"What is the trend in the growth of the crop sub-sector in recent years?\",\n    \"A\": \"The growth of the crop sub-sector has been decelerating in recent years.\"\n  },\n  {\n    \"Q\": \"What has driven the diversification in Indian agriculture?\",\n    \"A\": \"Diversification has been driven by demand from higher growth in industrial and service sectors, and the subsequent rise in income per capita.\"\n  },\n  {\n    \"Q\": \"What is the impact of diversification on agricultural output in India?\",\n    \"A\": \"Diversification has led to a declining share of the crop sub-sector and made agriculture more market-driven.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What has been the trend in the share of the crop sub-sector in agricultural output from 1950-51 to 2019-20?\",\n    \"A\": \"The share of the crop sub-sector in agricultural output decreased from 67% in 1950-51 to 58% in 2019-20.\"\n  },\n  {\n    \"Q\": \"Which agricultural sub-sectors are rising in share over time?\",\n    \"A\": \"The livestock and fisheries sub-sectors are rising in share over time.\"\n  },\n  {\n    \"Q\": \"What initiated the commercialization of Indian agriculture during the 1960s?\",\n    \"A\": \"The onset of the Green Revolution initiated agricultural intensification using modern inputs like high-yielding varieties, chemical fertilizers, and pesticides.\"\n  },\n  {\n    \"Q\": \"What are some indicators of rising commercialization in Indian agriculture on the factor side?\",\n    \"A\": \"Indicators include increasing use of certified seeds, rising fertilizer consumption (NPK), improved irrigation coverage, higher electricity use, and reduced labor use due to mechanization.\"\n  },\n  {\n    \"Q\": \"What changes have been observed on the product side of Indian agriculture's commercialization?\",\n    \"A\": \"Changes include an increase in the marketed surplus ratio, higher agricultural exports, and a diversification towards non-food grain crops.\"\n  },\n  {\n    \"Q\": \"What was the marketed surplus ratio of agricultural products in TE 2017-18 compared to a decade earlier?\",\n    \"A\": \"The marketed surplus ratio increased to 78% in TE 2017-18 from 68% a decade earlier.\"\n  },\n  {\n    \"Q\": \"How has the share of agricultural exports in total output changed from TE 1987-88 to TE 2017-18?\",\n    \"A\": \"The share of agricultural exports increased from 3.3% in TE 1987-88 to 7.8% in TE 2017-18.\"\n  },\n  {\n    \"Q\": \"What percentage of the crop sector output is contributed by non-food crops?\",\n    \"A\": \"Around two-thirds of the total crop sector output is contributed by non-food crops, such as cotton.\"\n  },\n  {\n    \"Q\": \"What factors indicate rising commercialization in Indian agriculture on the factor side?\",\n    \"A\": \"Rising commercialization is indicated by increased use of quality seeds, higher fertilizer consumption, improved irrigation coverage, increased electricity use, and reduced labor use due to mechanization.\"\n  },\n  {\n    \"Q\": \"What role has public expenditure played in the transition of Indian agriculture?\",\n    \"A\": \"A gradual rise in public sector expenditures in agriculture and rural development has supported the transition of Indian agriculture.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What are the three trait-specific genetic stocks registered with the National Gene Banks for barnyard millet?\",\n    \"A\": \"The three genetic stocks are easy dehulling, glumeless mutant, and grain smut disease-resistant.\"\n  },\n  {\n    \"Q\": \"What are the main breeding methods used in barnyard millet?\",\n    \"A\": \"The main breeding methods are pureline selection and the pedigree method.\"\n  },\n  {\n    \"Q\": \"Which two barnyard millet varieties were released from germplasm accessions in India?\",\n    \"A\": \"K1 was released from Tamil Nadu, and PRJ 1 was released from VPKAS Almora.\"\n  },\n  {\n    \"Q\": \"What methods are currently being focused on in barnyard millet crop improvement programs?\",\n    \"A\": \"Recombination breeding followed by the pedigree method is currently being focused on.\"\n  },\n  {\n    \"Q\": \"What chemical hybridizing agents (CHAs) were used to induce male sterility in barnyard millet, and what were their success rates?\",\n    \"A\": \"Alcohol at 15% concentration induced male sterility up to 40%, and Ethrel at 1500 ppm induced male sterility up to 75%.\"\n  },\n  {\n    \"Q\": \"What molecular advancements have been made in understanding the genome of barnyard millet?\",\n    \"A\": \"Scientists from China released the whole genome sequence of the weedy species E. cruss-galli, with a total genome length of 1.27 Gb representing 90% of the predicted genome size.\"\n  },\n  {\n    \"Q\": \"Why has there been limited research on the genomic structure of Indian barnyard millet?\",\n    \"A\": \"Limited research is due to the genome complexity of Indian barnyard millet and a lack of research funding.\"\n  },\n  {\n    \"Q\": \"What is the significance of sequencing the genome of Indian barnyard millet?\",\n    \"A\": \"Sequencing the genome will help in better understanding, quicker improvements in cultivar development, and positioning India internationally in agricultural scientific achievements.\"\n  },\n  {\n    \"Q\": \"What is the year of release and production condition for the barnyard millet variety VL 207?\",\n    \"A\": \"VL 207 was released in 2008 and is suited for rainfed/kharif production conditions.\"\n  },\n  {\n    \"Q\": \"What are the recommended states for cultivating VL 207 barnyard millet variety?\",\n    \"A\": \"VL 207 is recommended for all states except Gujarat and Tamil Nadu.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"How has public expenditure in agriculture and rural development changed since the early 1990s?\",\n    \"A\": \"Public expenditure in agriculture and rural development has risen from less than a lakh crore in the early 1990s to around four lakh crores at present, increasing fourfold within a short span.\"\n  },\n  {\n    \"Q\": \"What was the share of agriculture in total public sector expenditure during the 1990s and 2010s?\",\n    \"A\": \"The share of agriculture in total public sector expenditure rose from 3.4% in the 1990s to more than 14% in the 2010s.\"\n  },\n  {\n    \"Q\": \"What has been the trend in irrigation expenditure as a share of total public sector expenditure?\",\n    \"A\": \"Irrigation expenditure increased from 3.9% in the 1990s to 11.5% in the 2010s.\"\n  },\n  {\n    \"Q\": \"How have investments in roads and infrastructure affected agriculture in rural regions?\",\n    \"A\": \"Investments in roads and infrastructure have substantially risen, contributing to higher agricultural growth and sustainability.\"\n  },\n  {\n    \"Q\": \"What has been the trend in per capita food production in India from 1950-51 to 2019-20?\",\n    \"A\": \"Per capita food production increased from 0.94 kg/day in 1950-51 to 2.65 kg/day in 2019-20.\"\n  },\n  {\n    \"Q\": \"What factors have contributed to the growth in per capita food production in recent years?\",\n    \"A\": \"The deceleration in population growth and improvement in productivity have contributed to the growth in per capita food production.\"\n  },\n  {\n    \"Q\": \"What percentage of growth in cereal production during 2004-05 to 2014-15 was attributed to yield improvements?\",\n    \"A\": \"92% of the growth in cereal production was attributed to yield improvements.\"\n  },\n  {\n    \"Q\": \"What role has yield improvement played in the production growth of pulses and oilseeds?\",\n    \"A\": \"Yield improvements contributed 76% to the growth in pulses production and 67% to the growth in oilseeds production.\"\n  },\n  {\n    \"Q\": \"What is the impact of scientific developments and investments on food production in India?\",\n    \"A\": \"Scientific developments and investments have increased food production, enabling it to meet rising demand and sustain food security in the country.\"\n  },\n  {\n    \"Q\": \"How have credit institutions influenced agricultural development in India?\",\n    \"A\": \"Credit institutions and supportive policies have played a pivotal role in addressing credit inadequacy in the farm sector and supporting agricultural development.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What was the primary source of credit for farmers in 1951?\",\n    \"A\": \"In 1951, around 70% of farmers' credit requirements were financed by money lenders.\"\n  },\n  {\n    \"Q\": \"What percentage of farmers accessed credit through cooperatives in 1951?\",\n    \"A\": \"Only 3.3% of farmers accessed credit through cooperatives in 1951.\"\n  },\n  {\n    \"Q\": \"When were Regional Rural Banks (RRBs) established, and based on whose recommendations?\",\n    \"A\": \"RRBs were established in 1976 based on the recommendations of the Narasimham Committee.\"\n  },\n  {\n    \"Q\": \"What was the share of commercial banks in agricultural credit in 1951 and 2019?\",\n    \"A\": \"The share of commercial banks in agricultural credit was 0.9% in 1951 and 44.5% in 2019.\"\n  },\n  {\n    \"Q\": \"What was the purpose of the National Bank for Agriculture and Rural Development (NABARD) established in 1982?\",\n    \"A\": \"NABARD was established to undertake agricultural credit-related functions of the Reserve Bank of India and refinancing functions of the Agricultural Refinance and Development Corporation.\"\n  },\n  {\n    \"Q\": \"How did the share of institutional credit change from 1951 to 2019?\",\n    \"A\": \"The share of institutional credit increased from 7.3% in 1951 to 69.6% in 2019.\"\n  },\n  {\n    \"Q\": \"What was the share of cooperatives in agricultural credit in 1983-84 and 2019-20?\",\n    \"A\": \"The share of cooperatives in agricultural credit was 49.8% in 1983-84 and 13.3% in 2019-20.\"\n  },\n  {\n    \"Q\": \"What policy was introduced in 1974 to enhance credit flow to agriculture?\",\n    \"A\": \"The concept of 'priority sector lending' was introduced in 1974, advising commercial banks to allocate 33.33% of their aggregate advances to priority sectors, including agriculture, by March 1979.\"\n  },\n  {\n    \"Q\": \"How did the composition of agricultural credit change between cooperatives and commercial banks from 1983-84 to 2019-20?\",\n    \"A\": \"The share of cooperatives in agricultural credit decreased from 49.8% in 1983-84 to 13.3% in 2019-20, while the share of commercial banks increased from 45.8% to 71.9% during the same period.\"\n  },\n  {\n    \"Q\": \"What factors contributed to the increased credit flow from commercial banks to agriculture after 1991?\",\n    \"A\": \"The increased credit flow was due to the expansion of commercial banks in rural regions and supportive government policies toward the farm sector.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What has been the trend in the share of cooperatives in agricultural credit delivery since 1983-84?\",\n    \"A\": \"The share of cooperatives in agricultural credit delivery declined from around 50% in 1983-84 to just above 13% in 2019-20.\"\n  },\n  {\n    \"Q\": \"How has the share of Regional Rural Banks (RRBs) in agricultural credit delivery changed over time?\",\n    \"A\": \"The share of RRBs rose from 4.4% in 1983-84 to 14.8% in 2019-20, surpassing the credit outstanding of cooperatives.\"\n  },\n  {\n    \"Q\": \"What was the annual growth rate of credit outstanding for cooperatives, commercial banks, and RRBs during 1991-2020?\",\n    \"A\": \"The annual growth rate was 10.7% for cooperatives, 18% for commercial banks, and 19.5% for RRBs.\"\n  },\n  {\n    \"Q\": \"What was the fertilizer subsidy expense incurred by the Government in 2019-20?\",\n    \"A\": \"The Government incurred fertilizer subsidy expenses amounting to Rs. 81,124 crores in 2019-20.\"\n  },\n  {\n    \"Q\": \"What is the Pradhan Mantri Kisan Samman Nidhi (PM-KISAN) scheme?\",\n    \"A\": \"The PM-KISAN scheme, launched on 24th February 2019, transfers Rs. 6,000 annually in three installments directly to farmers.\"\n  },\n  {\n    \"Q\": \"What was the Government's expense on credit subsidy for farmers in 2019-20?\",\n    \"A\": \"The Government incurred a credit subsidy expense of more than Rs. 16,000 crores in 2019-20.\"\n  },\n  {\n    \"Q\": \"When was the subvention rate introduced for short-term production credit, and what was the initial rate?\",\n    \"A\": \"The subvention rate was introduced in Kharif 2006-07 at an initial rate of 2%.\"\n  },\n  {\n    \"Q\": \"How did the subvention rate change between 2009-10 and 2011-12?\",\n    \"A\": \"The subvention rate increased from an additional 1% in 2009-10 to 2% in 2010-11 and 3% in 2011-12.\"\n  },\n  {\n    \"Q\": \"What was the gross capital formation (GCF) in agriculture by the public sector in 2019-20?\",\n    \"A\": \"The gross capital formation (GCF) in agriculture by the public sector was Rs. 76,141 crores in 2019-20.\"\n  },\n  {\n    \"Q\": \"What were the fertilizer subsidy expenses in 1976-77 compared to 2019-20?\",\n    \"A\": \"The fertilizer subsidy expenses were Rs. 60 crores in 1976-77 and rose to Rs. 81,124 crores in 2019-20.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"How many farmers are benefiting from the government scheme mentioned in the text?\",\n    \"A\": \"More than 11 crore farmers are benefiting from the scheme.\"\n  },\n  {\n    \"Q\": \"What is the total expense incurred by the government for the scheme?\",\n    \"A\": \"The government has incurred an expense of Rs. 66 thousand crores.\"\n  },\n  {\n    \"Q\": \"What was the public sector Gross Capital Formation (GCF) in agriculture in 2019-20?\",\n    \"A\": \"The public sector GCF in agriculture was Rs. 76.1 thousand crores in 2019-20.\"\n  },\n  {\n    \"Q\": \"What major welfare intervention is provided by states for farmers?\",\n    \"A\": \"States provide loan waivers and subsidized electricity for agricultural purposes.\"\n  },\n  {\n    \"Q\": \"How have credit subsidies changed over the years?\",\n    \"A\": \"Credit subsidies rose from Rs. 2,000 crores in 2009-10 to more than Rs. 12,000 crores in 2015-16.\"\n  },\n  {\n    \"Q\": \"What institutions were established in 1965 to support Indian agriculture?\",\n    \"A\": \"The Commission for Agricultural Costs & Prices (CACP) and the Food Corporation of India (FCI) were established in 1965.\"\n  },\n  {\n    \"Q\": \"What is the role of the Minimum Support Price (MSP)?\",\n    \"A\": \"The MSP acts as a safety net for farmers when market prices fail to guarantee reasonable prices for commodities.\"\n  },\n  {\n    \"Q\": \"For how many crops is the MSP currently announced?\",\n    \"A\": \"The MSP is announced for 14 kharif crops and 10 rabi crops.\"\n  },\n  {\n    \"Q\": \"What is the Fair and Remunerative Price (FRP) for sugarcane?\",\n    \"A\": \"The FRP is a price announced to guarantee fair returns to sugarcane growers and ensure the smooth operation of sugar industries.\"\n  },\n  {\n    \"Q\": \"What is the purpose of procurement mechanisms like MSP and FRP?\",\n    \"A\": \"These mechanisms ensure adequate buffer stock for national food security and act as tools for domestic price stability.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"How much rice was procured in the Kharif Marketing Season (KMS) 2020-21?\",\n        \"A\": \"About 60 million tons (Mt) of rice was procured in KMS 2020-21.\"\n    },\n    {\n        \"Q\": \"How many farmers benefitted from the procurement of rice and wheat in 2020-21?\",\n        \"A\": \"More than 1.3 crore farmers benefited during the kharif season, and over 43 lakh farmers during the rabi season in 2020-21.\"\n    },\n    {\n        \"Q\": \"What is the aim of the government in the agricultural policy domain?\",\n        \"A\": \"The government aims to double farmers' income, double agricultural exports, and improve price realizations at the market.\"\n    },\n    {\n        \"Q\": \"What is e-NAM, and how does it help farmers?\",\n        \"A\": \"e-NAM (e-National Agricultural Market) is an initiative to connect traditional agricultural markets electronically, promoting better market access for farmers.\"\n    },\n    {\n        \"Q\": \"What was the purpose of the Farmers’ Produce Trade and Commerce (Promotion and Facilitation) Act (2020)?\",\n        \"A\": \"It provided farmers a mechanism to carry out their farm businesses outside the APMCs, encouraging free-market operations.\"\n    },\n    {\n        \"Q\": \"What was the role of the Essential Commodities (Amendment) Act?\",\n        \"A\": \"It allowed trade in food grains, pulses, edible oils, and onions, except during times of crisis, to promote competitiveness.\"\n    },\n    {\n        \"Q\": \"What is the Kisan Credit Card scheme, and how many cards were issued till 2019-20?\",\n        \"A\": \"The Kisan Credit Card scheme provides financial inclusion for farmers, with around 19 crore cards issued till 2019-20.\"\n    },\n    {\n        \"Q\": \"What are some examples of direct benefit transfer initiatives in agriculture?\",\n        \"A\": \"Examples include direct income transfers through PM-KISAN and the direct benefit transfer approach in the fertilizer industry.\"\n    },\n    {\n        \"Q\": \"How has the private sector contributed to agricultural information governance?\",\n        \"A\": \"The private sector has emerged in agro-advisory services, improving information governance for farmers' welfare.\"\n    },\n    {\n        \"Q\": \"What are some examples of digitalization efforts in agriculture?\",\n        \"A\": \"Examples include the digitalization of rural land records and connecting farmers to formal financial institutions through Kisan Credit Cards.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What collaboration has the Indian Council of Agricultural Research (ICAR) undertaken to extend tele-advisory services?\",\n        \"A\": \"ICAR has collaborated with the Digital India Corporation (DIC) to extend tele-advisory services.\"\n    },\n    {\n        \"Q\": \"Which organizations partnered to provide sowing advisories in India?\",\n        \"A\": \"Microsoft and the International Crops Research Institute for the Semi-Arid Tropics (ICRISAT) partnered to provide sowing advisories.\"\n    },\n    {\n        \"Q\": \"What act was introduced in India in 2001 to protect plant varieties and farmers' rights?\",\n        \"A\": \"The Protection of Plant Varieties & Farmers Right Act (PPVFR Act) was introduced in 2001.\"\n    },\n    {\n        \"Q\": \"What percentage of plant varieties registered under the PPVFR Act (2009-2021) were from farmers?\",\n        \"A\": \"Around 39.78% of the plant varieties registered under the PPVFR Act (2009-2021) were from farmers.\"\n    },\n    {\n        \"Q\": \"What was India's response to the World Trade Organization's TRIPS agreement in 1995?\",\n        \"A\": \"India opted for a sui generis system for the protection of plant varieties through the PPVFR Act in 2001.\"\n    },\n    {\n        \"Q\": \"What was the focus of the amendments made to the Indian Patent Act to comply with the TRIPS agreement?\",\n        \"A\": \"The amendments focused on accommodating chemicals and ensuring compliance with TRIPS.\"\n    },\n    {\n        \"Q\": \"What rank does India hold globally in patent filing for the agriculture and allied sector?\",\n        \"A\": \"India ranks 14th globally in patent filing for the agriculture and allied sector.\"\n    },\n    {\n        \"Q\": \"How does the Indian Council of Agricultural Research (ICAR) commercialize its technologies?\",\n        \"A\": \"ICAR commercializes its technologies through an institutional mechanism developed under the IP and technology commercialization policy introduced in 2006.\"\n    },\n    {\n        \"Q\": \"What is the purpose of patents in India's agricultural sector?\",\n        \"A\": \"Patents are used as a protection mechanism to preserve innovations and prevent competitors from claiming priority over inventions.\"\n    },\n    {\n        \"Q\": \"What percentage of plant varieties registered under the PPVFR Act (2009-2021) were from private organizations?\",\n        \"A\": \"29.61% of plant varieties registered under the PPVFR Act (2009-2021) were from private organizations.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What significant change occurred in the commercialization of technologies after 2007?\",\n    \"A\": \"The number of technologies commercialized increased significantly, from 29 in 2007 to 575 in 2021.\"\n  },\n  {\n    \"Q\": \"Which entities have stimulated the commercialization process in agriculture?\",\n    \"A\": \"The Business Planning and Development units under the National Agricultural Innovation Project (NAIP), Institute Technology Management Units, and Agrinnovate India Ltd. have stimulated the commercialization process.\"\n  },\n  {\n    \"Q\": \"What role do agri-startups play in agriculture?\",\n    \"A\": \"Agri-startups develop products and services to improve efficiency in the value chain, including areas like storage, farm automation, precision agriculture, market linkages, agri-finance, and agri-biotech.\"\n  },\n  {\n    \"Q\": \"What is the definition of a startup according to the Government of India gazette notification 2019?\",\n    \"A\": \"A startup is an entity incorporated or registered in India not prior to 10 years, with an annual turnover not exceeding Rs. 100 crores, working towards innovation, development, or improvement of products, processes, or services, and having a scalable business model with high potential for employment generation or wealth creation.\"\n  },\n  {\n    \"Q\": \"What tools are commonly used by agri-startups to improve agriculture?\",\n    \"A\": \"Agri-startups commonly use tools like artificial intelligence (AI), Internet of Things (IoT), imaging, and sensors.\"\n  },\n  {\n    \"Q\": \"What was India's rank in the Global Innovation Index 2021?\",\n    \"A\": \"India ranked 46th in the Global Innovation Index 2021.\"\n  },\n  {\n    \"Q\": \"How has the role of private sector-led innovation changed since the mid-1990s?\",\n    \"A\": \"Since the mid-1990s, private sector-led innovation has played a major role in economic growth, especially after the economy opened up.\"\n  },\n  {\n    \"Q\": \"What are some areas where startups have emerged in recent years?\",\n    \"A\": \"Startups have emerged in agriculture, healthcare, biotech, engineering, fintech, transport, environmental services, clean energy, logistics, IT services, and marketplaces.\"\n  },\n  {\n    \"Q\": \"What is the role of innovation in the agri-food system?\",\n    \"A\": \"Innovation helps the agri-food system address grand challenges and contributes to achieving Sustainable Development Goals (SDGs).\"\n  },\n  {\n    \"Q\": \"What impact has the rise of startups had on India's global innovation ranking?\",\n    \"A\": \"The rise of startups has contributed to India being ranked 46th in the Global Innovation Index 2021 and 2nd among the 34 lower middle-income group economies.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What technologies are being used in agriculture to improve yield, efficiency, and profitability?\",\n        \"A\": \"Technologies like remote sensing, drones, data analytics, and blockchain are being used in agriculture.\"\n    },\n    {\n        \"Q\": \"What is the Primary Agricultural Cooperative Society (PACS)?\",\n        \"A\": \"PACS is one of the oldest forms of farmers’ organizations in India.\"\n    },\n    {\n        \"Q\": \"What are some examples of producer organizations in agriculture?\",\n        \"A\": \"Examples include self-help groups (SHGs), Federation of SHGs, Common Interest Groups (CIGs), Joint Liability Groups (JLGs), and Farmers Clubs.\"\n    },\n    {\n        \"Q\": \"What are Farmers Producers Organizations (FPOs)?\",\n        \"A\": \"FPOs are organizations that bring farmers together to collectively perform specific or multiple functions, including producer companies.\"\n    },\n    {\n        \"Q\": \"Why have agricultural cooperatives not made a profound impact across all sectors in India?\",\n        \"A\": \"Agricultural cooperatives have not significantly improved farmers' livelihoods and incomes in all sectors, unlike in dairy, sugar, or fertilizer production.\"\n    },\n    {\n        \"Q\": \"What led to the concept of producer companies in India?\",\n        \"A\": \"The concept was introduced in 2000 by a committee chaired by Prof. Y.K. Alagh to combine the best attributes of cooperatives and corporates for the benefit of small and marginal farmers.\"\n    },\n    {\n        \"Q\": \"What is a Farmers Producers Company (FPC)?\",\n        \"A\": \"An FPC is a type of Farmers Producers Organization (FPO) registered as a Producer Company under the Companies Act and promoted by the Small Farmers Agribusiness Consortium (SFAC).\"\n    },\n    {\n        \"Q\": \"Under which legal frameworks can FPOs be registered?\",\n        \"A\": \"FPOs can be registered under the Companies Act, State Co-operative Society Act, Mutually Aided Cooperative Society (MACS), Trust, or as a Section 8 company.\"\n    },\n    {\n        \"Q\": \"What challenges do agri-startups face?\",\n        \"A\": \"Agri-startups face challenges like lack of technical support, early-stage funding, scaling up, and low market acceptability of products and services.\"\n    },\n    {\n        \"Q\": \"What is required to create an ecosystem for agri-startups?\",\n        \"A\": \"An ecosystem for agri-startups requires enabling policies, early-stage funding support, incubation facilities, and mentorship.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What was the purpose of the plan launched by the Government of India in January 2016?\",\n    \"A\": \"The plan aimed to build a strong ecosystem for nurturing innovation and startups.\"\n  },\n  {\n    \"Q\": \"How have technology-led startups impacted agriculture?\",\n    \"A\": \"Technology-led startups, also known as tech-startups, have introduced innovative ideas in agriculture and other sectors.\"\n  },\n  {\n    \"Q\": \"What role do incubators play in supporting startups?\",\n    \"A\": \"Incubators validate and improve innovations, bring technology to market acceptability, and provide business, technical, financial, legal, IPR, and networking services.\"\n  },\n  {\n    \"Q\": \"How do incubators help startups find funding?\",\n    \"A\": \"Incubators connect startups with funding agencies such as angel investors and venture capitalists.\"\n  },\n  {\n    \"Q\": \"How many incubators are there in India, and how many are agriculture-specific?\",\n    \"A\": \"There are about 890 incubators in India, out of which about 80 are agriculture-specific.\"\n  },\n  {\n    \"Q\": \"What is the role of ICAR in supporting agri-entrepreneurs?\",\n    \"A\": \"ICAR has 50 incubators that facilitate the business environment for agri-entrepreneurs and support various agricultural domains.\"\n  },\n  {\n    \"Q\": \"What is the NIDHI Incubation Programme, and who supports it?\",\n    \"A\": \"The NIDHI Incubation Programme, supported by the Department of Science and Technology, helps startups through Technology Business Incubators (TBIs), Seed Support Systems (SSS), and Accelerator programmes.\"\n  },\n  {\n    \"Q\": \"What is BIRAC, and how does it support startups?\",\n    \"A\": \"BIRAC, under the Department of Biotechnology, promotes incubators like Bionest through programmes such as the BIRAC Ignition Grant (BIG) and the Small Business Innovation Research Initiative (SBIRI).\"\n  },\n  {\n    \"Q\": \"How does NITI Aayog contribute to startup incubation?\",\n    \"A\": \"NITI Aayog supports incubation centers under the Atal Innovation Mission.\"\n  },\n  {\n    \"Q\": \"What domains do agricultural incubators in India focus on?\",\n    \"A\": \"Agricultural incubators focus on domains like animal science, crop science, agricultural engineering, agricultural education, horticulture, fisheries, and natural resource management.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What initiative did ICAR start in 2012 to promote entrepreneurship in agriculture?\",\n    \"A\": \"ICAR initiated the entrepreneurship development programme by establishing 10 Business Planning and Development (BPD) units.\"\n  },\n  {\n    \"Q\": \"What was the primary objective of the BPD units established by ICAR?\",\n    \"A\": \"The primary objective was to transfer technology to commercial ventures so that developed technology reaches targeted stakeholders.\"\n  },\n  {\n    \"Q\": \"What project under the XII Plan supported innovation and incubation in agriculture?\",\n    \"A\": \"The project on 'National Agriculture Innovation Fund (NAIF)' supported innovation and incubation in agriculture.\"\n  },\n  {\n    \"Q\": \"How many Agri-Business Incubation (ABI) Centres does ICAR currently have?\",\n    \"A\": \"ICAR currently has 50 Agri-Business Incubation (ABI) Centres.\"\n  },\n  {\n    \"Q\": \"How many entrepreneurs and startups were enrolled in ABIs during 2014-2021?\",\n    \"A\": \"A total of 977 entrepreneurs and startups were enrolled in ABIs during 2014-2021.\"\n  },\n  {\n    \"Q\": \"What was the success rate of incubates during the 2014-2021 period attributed to?\",\n    \"A\": \"The success rate was attributed to conducive policies like Startup India, Mudra Loan, and other programmes.\"\n  },\n  {\n    \"Q\": \"What event did ICAR organize on World Food Day in 2018 to promote agripreneurship?\",\n    \"A\": \"ICAR organized a two-day Agri-Startup and Entrepreneurship Conclave called UPAYA on World Food Day in 2018.\"\n  },\n  {\n    \"Q\": \"What scheme did the Ministry of Agriculture & Farmers’ Welfare launch to promote agripreneurship?\",\n    \"A\": \"The Ministry launched the RKVY-RAFTAAR scheme to promote agripreneurship and agribusiness.\"\n  },\n  {\n    \"Q\": \"What is the role of incubators in the startup ecosystem?\",\n    \"A\": \"Incubators help startups by scouting innovative ideas, supporting growth stages, and bringing funding sources to the table.\"\n  },\n  {\n    \"Q\": \"Who are the key players in agribusiness incubation initiatives in India?\",\n    \"A\": \"Key players include ICAR Research institutes, SAUs, IITs, IIMs, engineering/management colleges, NGOs, and corporate entities.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the maturity duration of VL 207 barnyard millet?\",\n        \"A\": \"VL 207 barnyard millet is a medium maturing variety with a duration of 85–100 days.\"\n    },\n    {\n        \"Q\": \"What are the key features of the CO2 barnyard millet variety?\",\n        \"A\": \"CO2 barnyard millet has a medium maturing duration (95–100 days), narrow leaves with erect growth habit, cylindrical and purple-colored inflorescence, absence of culm branching, and a compact panicle type.\"\n    },\n    {\n        \"Q\": \"What is the grain yield of DHBM93-3 barnyard millet?\",\n        \"A\": \"The grain yield of DHBM93-3 barnyard millet is 24.0 q/ha.\"\n    },\n    {\n        \"Q\": \"Which states are recommended for the cultivation of DHBM23-3 barnyard millet?\",\n        \"A\": \"DHBM23-3 barnyard millet is recommended for Andhra Pradesh, Karnataka, Madhya Pradesh, and Tamil Nadu.\"\n    },\n    {\n        \"Q\": \"What is the year of release for the MDU1 barnyard millet variety?\",\n        \"A\": \"The MDU1 barnyard millet variety was released in the year 2018.\"\n    },\n    {\n        \"Q\": \"What are the pest resistances of DHBM93-3 barnyard millet?\",\n        \"A\": \"DHBM93-3 barnyard millet is resistant to shoot fly, head smut, and grain smut.\"\n    },\n    {\n        \"Q\": \"What is the significance of whole genome sequencing in barnyard millet improvement?\",\n        \"A\": \"Whole genome sequencing helps understand the genetic and molecular architecture of barnyard millet, identify genes/QTLs responsible for high grain and biomass yield, and strengthen breeding programs.\"\n    },\n    {\n        \"Q\": \"What is the fodder yield range of DHBM23-3 barnyard millet?\",\n        \"A\": \"The fodder yield range of DHBM23-3 barnyard millet is 6–7 t/ha.\"\n    },\n    {\n        \"Q\": \"Why is barnyard millet considered an underutilized crop?\",\n        \"A\": \"Barnyard millet is considered underutilized due to a lack of funding and research attention from agencies and organizations.\"\n    },\n    {\n        \"Q\": \"What is the primary focus of recent advances in barnyard millet breeding?\",\n        \"A\": \"Recent advances in barnyard millet breeding focus on recombination breeding, improved crossing techniques, and identifying trait-specific parental lines to improve yield levels.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the aim of the Ministry of Agriculture and Farmers’ Welfare (MoA&FW) in India?\",\n    \"A\": \"The aim is to strengthen infrastructure in agriculture and allied sectors to promote agripreneurship and agribusiness by providing financial support and nurturing the incubation ecosystem.\"\n  },\n  {\n    \"Q\": \"When was the Start-up India Policy launched by the Government of India?\",\n    \"A\": \"The Start-up India Policy was launched in 2016.\"\n  },\n  {\n    \"Q\": \"What benefits do startups receive under the Start-up India Policy?\",\n    \"A\": \"Startups can self-certify compliance for Labour and Environmental Laws, fast-track patent applications, receive income tax exemptions for 3 consecutive financial years, get exemptions under Section 56(2)(VIIB) of the Income Tax Act, wind up companies easily, and list products on the Government e-Marketplace (GeM) with exemptions.\"\n  },\n  {\n    \"Q\": \"What funding schemes are available for agri-startups in India?\",\n    \"A\": \"Agri-startups can avail seed funds from incubators, the Startup India Seed Fund, and the RAFTAR scheme of the Government of India.\"\n  },\n  {\n    \"Q\": \"Which incubator of IIM Ahmedabad has been instrumental in seed funding for agri-startups?\",\n    \"A\": \"The CIIE incubator of IIM Ahmedabad has been instrumental in seed funding for agri-startups.\"\n  },\n  {\n    \"Q\": \"Which ICAR incubator has pioneered seed investments in agri-startups?\",\n    \"A\": \"The a-IDEA incubator of NAARM has pioneered seed investments in agri-startups.\"\n  },\n  {\n    \"Q\": \"What role do venture capital firms play in funding agri-startups?\",\n    \"A\": \"Venture capital firms like Omnivore Partners, Aavishkaar, and others invest in good agri-startups at early stages, helping them scale up.\"\n  },\n  {\n    \"Q\": \"Which global funds have recently shown interest in India’s agriculture sector?\",\n    \"A\": \"Global funds such as Blume, Nexus, Sequoia, Tiger Global, and RTP have recently shown interest in the sector.\"\n  },\n  {\n    \"Q\": \"At what rate are India’s agritech startups growing annually?\",\n    \"A\": \"India’s agritech startups are growing at 45% year-on-year.\"\n  },\n  {\n    \"Q\": \"How much investment have agritech startups in India raised so far, and what is the future expectation?\",\n    \"A\": \"Agritech startups in India have raised over US$ 313 million, and the sector is expected to attract more than US$ 500 million in the next few years.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What challenges do farmers in developing countries face?\",\n    \"A\": \"Farmers face multiple risks such as lack of quality inputs, advisory, and financial services.\"\n  },\n  {\n    \"Q\": \"What technologies are agri-startups using to address agricultural challenges?\",\n    \"A\": \"Agri-startups use IoT, big data analytics, and blockchain technology.\"\n  },\n  {\n    \"Q\": \"What are the three broad categories of agri-startup innovations?\",\n    \"A\": \"The three categories are pre-production startups, production stage startups, and post-production stage startups.\"\n  },\n  {\n    \"Q\": \"What services do pre-production agri-startups offer?\",\n    \"A\": \"Pre-production startups provide advisory, crop planning, soil testing, input supplies, and financing.\"\n  },\n  {\n    \"Q\": \"What is Agrostar known for in the agri-startup space?\",\n    \"A\": \"Agrostar is the largest startup in input supply to farmers and has mobilized $47 million in funding.\"\n  },\n  {\n    \"Q\": \"What is EM3's Farming as a Service (FaaS) platform designed for?\",\n    \"A\": \"EM3's FaaS platform provides technology for efficient and affordable farm operations through farm centers.\"\n  },\n  {\n    \"Q\": \"What service does Krishitantra provide to farmers?\",\n    \"A\": \"Krishitantra offers advanced soil health testing solutions with automation and engineering proficiency.\"\n  },\n  {\n    \"Q\": \"Which startup uses aeroponic technology for potato seed production?\",\n    \"A\": \"Handa Biotech uses aeroponic technology for better potato seed production.\"\n  },\n  {\n    \"Q\": \"What innovation has Eruvaka developed for the aqua sector?\",\n    \"A\": \"Eruvaka has developed AI-based on-farm diagnostic equipment for the production process.\"\n  },\n  {\n    \"Q\": \"How many agri-startups are registered under the Startup India Initiative?\",\n    \"A\": \"There are 2,421 agri-startups registered under the Startup India Initiative.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What does CropIn provide to farmers?\",\n    \"A\": \"CropIn provides complete digitization of farms using SaaS-based cloud software, helping farmers with operational control and decision-making in agriculture.\"\n  },\n  {\n    \"Q\": \"How does Bharat Rohan assist farmers?\",\n    \"A\": \"Bharat Rohan uses drones to analyze field-wise biotic and abiotic stress, advises farmers, and supplies inputs to overcome these stresses.\"\n  },\n  {\n    \"Q\": \"What technology does FlyBird use for irrigation management?\",\n    \"A\": \"FlyBird installs soil sensors to detect moisture content and control irrigation at a low cost.\"\n  },\n  {\n    \"Q\": \"What innovation does Kisan Raja offer to farmers?\",\n    \"A\": \"Kisan Raja provides a device that allows farmers to remotely control agricultural motors using mobile phones or landlines.\"\n  },\n  {\n    \"Q\": \"What solutions does Gen Agritech provide?\",\n    \"A\": \"Gen Agritech uses bio-based formulations for soil treatment and repellents against wild boar, blue bull, and birds.\"\n  },\n  {\n    \"Q\": \"Which agri-startups focus on post-production processes like harvesting and marketing?\",\n    \"A\": \"Agri-startups like BigBasket, DeHaat, Ninjacart, WayCool, ZopNow, ShopKirana, Jumbotail, AgriBazaar, Bijak, and MilkBasket focus on post-production processes.\"\n  },\n  {\n    \"Q\": \"How do startups like Licious, FreshtoHome, and TenderCut operate in the animal sector?\",\n    \"A\": \"These startups procure live animals directly from farmers and supply meat products to consumers at their doorstep.\"\n  },\n  {\n    \"Q\": \"What technology is used by AgNEXT, IntelloLab, and AgriX for quality checks?\",\n    \"A\": \"They use multispectral and hyperspectral image analysis for quality checks.\"\n  },\n  {\n    \"Q\": \"What does Delmos specialize in within the dairy sector?\",\n    \"A\": \"Delmos tests milk adulteration using strip-based technology.\"\n  },\n  {\n    \"Q\": \"What role does the Small Farmers Agri-Business Consortium (SFAC) play in India?\",\n    \"A\": \"SFAC acts as a nodal agency to provide technical support, training, and growth opportunities for Farmer Producer Organizations (FPOs).\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What does FPO stand for?\",\n    \"A\": \"FPO stands for Farmer Producer Organization.\"\n  },\n  {\n    \"Q\": \"Which organizations were encouraged to include FPOs in their activities?\",\n    \"A\": \"Organizations like NCDC, NAFED, and the Food Corporation of India (FCI) were encouraged to include FPOs in their activities.\"\n  },\n  {\n    \"Q\": \"What financial institutions were involved in facilitating credit for FPOs?\",\n    \"A\": \"NABARD and other financial institutions were involved in facilitating credit for FPOs.\"\n  },\n  {\n    \"Q\": \"What is the purpose of the 'Equity Grant and Credit Guarantee Fund Scheme'?\",\n    \"A\": \"The scheme provides a grant of up to Rs. 10 lakhs to double the member equity of FPOs and allows collateral-free loans of up to Rs. 1 crore from banks.\"\n  },\n  {\n    \"Q\": \"What special declaration was made in 2014 by the Ministry of Agriculture, Government of India?\",\n    \"A\": \"The year 2014 was declared as the 'Year of Farmer Producer Organizations (FPOs)' with a special package allocation of Rs. 200 crores to NABARD as the PRODUCE Fund.\"\n  },\n  {\n    \"Q\": \"How many FPOs were registered under the Companies Act as of March 31, 2021?\",\n    \"A\": \"As of March 31, 2021, there were more than 9,500 FPOs registered under the Companies Act.\"\n  },\n  {\n    \"Q\": \"What is the key difference in governance between FPCs and private limited companies?\",\n    \"A\": \"In FPCs, each member has only one vote irrespective of the number of shares held, whereas this is not the case in private limited companies.\"\n  },\n  {\n    \"Q\": \"Who governs a Farmer Producer Company (FPC)?\",\n    \"A\": \"An FPC is governed by a Board of Directors (BoDs) selected from shareholder-members, and may include independent directors without voting rights.\"\n  },\n  {\n    \"Q\": \"What is the role of hired staff in an FPC?\",\n    \"A\": \"Hired staff, including a Manager or CEO, help run the business operations of an FPC smoothly.\"\n  },\n  {\n    \"Q\": \"How many total FPOs are registered in India as of the provided data?\",\n    \"A\": \"There are approximately 10,000 FPOs registered in India, including those under the Companies Act and other legal entities.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What are the basic principles behind a Farmer Producer Company (FPC)?\",\n    \"A\": \"The basic principles of an FPC include voluntary and open membership, democratic farmer member control, autonomy, and co-operation amongst farmers.\"\n  },\n  {\n    \"Q\": \"How do FPOs benefit smallholder farmers?\",\n    \"A\": \"FPOs help smallholder farmers leverage collective strength and bargaining power to access inputs, services, technologies, reduce transaction costs, tap high-value markets, and form equitable partnerships with private entities.\"\n  },\n  {\n    \"Q\": \"What stages of the agricultural value chain do FPOs operate in?\",\n    \"A\": \"FPOs operate in various stages of the agricultural value chain, including input purchase, output collectivization, value addition, storage, transportation, and marketing.\"\n  },\n  {\n    \"Q\": \"What are some revenue-generating activities for FPOs?\",\n    \"A\": \"FPOs generate revenue by bulk buying and selling of seeds, fertilizers, pesticides, providing custom hiring services for farm implements, primary processing (cleaning and grading), value addition, and levying auction fees from buyers.\"\n  },\n  {\n    \"Q\": \"What is the role of NABARD in rural development?\",\n    \"A\": \"NABARD is an apex financing agency under the Ministry of Finance, Government of India, responsible for policy, planning, and operations in the field of credit for agriculture and rural economic activities.\"\n  },\n  {\n    \"Q\": \"What challenges do smallholder farmers in India face that FPOs aim to address?\",\n    \"A\": \"Smallholder farmers face challenges like lack of working capital, insufficient basic infrastructure, lack of business acumen in management teams, and limited understanding of markets.\"\n  },\n  {\n    \"Q\": \"What is the Equity Grant Scheme of SFAC?\",\n    \"A\": \"The Equity Grant Scheme provides eligible FPOs with a grant matching their equity contribution, up to a maximum of Rs. 10 lakh, to enhance their viability and sustainability.\"\n  },\n  {\n    \"Q\": \"What is the Credit Guarantee Fund Scheme of SFAC?\",\n    \"A\": \"The Credit Guarantee Fund Scheme provides credit guarantees to FPOs, helping them secure loans for their operations and development.\"\n  },\n  {\n    \"Q\": \"How can FPOs contribute to rural development and food security?\",\n    \"A\": \"FPOs enhance rural development, poverty reduction, productivity gains, and food security by enabling smallholder participation in the agricultural value chain.\"\n  },\n  {\n    \"Q\": \"What are some government initiatives to support FPOs in India?\",\n    \"A\": \"Government initiatives include the Equity Grant Scheme, Credit Guarantee Fund Scheme, and other schemes to address issues like working capital, infrastructure, and market understanding for FPOs.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the maximum credit amount eligible FPOs can receive under the collateral-free guarantee cover?\",\n    \"A\": \"Eligible FPOs can receive collateral-free credit up to Rs. 100 lakhs under the guarantee cover.\"\n  },\n  {\n    \"Q\": \"What is the maximum guarantee cover percentage for collateral-free credit?\",\n    \"A\": \"The maximum guarantee cover is restricted up to 85% of the amount.\"\n  },\n  {\n    \"Q\": \"What is the purpose of the Venture Capital Assistance provided by SFAC?\",\n    \"A\": \"The Venture Capital Assistance helps FPOs invest in setting up agribusiness projects.\"\n  },\n  {\n    \"Q\": \"What is the cost range for agribusiness projects eligible for Venture Capital Assistance by SFAC?\",\n    \"A\": \"The cost of proposed agribusiness projects must be between Rs. 15 lakh and Rs. 500 lakhs.\"\n  },\n  {\n    \"Q\": \"How does NABKISAN Finance Limited support FPOs?\",\n    \"A\": \"NABKISAN Finance Limited provides credit assistance to FPOs at various stages without collateral or guarantee cover, covering costs like buildings, machinery, transportation, and working capital.\"\n  },\n  {\n    \"Q\": \"What is the purpose of the Agriculture Infrastructure Fund (AIF) launched in 2020?\",\n    \"A\": \"The AIF aims to create farm-gate infrastructure and provide medium to long-term debt financing for post-harvest management infrastructure.\"\n  },\n  {\n    \"Q\": \"What is the loan limit for credit guarantee coverage under the Agriculture Infrastructure Fund?\",\n    \"A\": \"The credit guarantee coverage is available for loans up to Rs. 200 lakhs.\"\n  },\n  {\n    \"Q\": \"What is the PM Matsya Sampada Yojana, and who does it support?\",\n    \"A\": \"The PM Matsya Sampada Yojana supports fish farmers and fish FPOs by providing credit guarantee assistance for modernizing and strengthening the fish value chain.\"\n  },\n  {\n    \"Q\": \"What is the goal of the Central Sector Scheme on 'Formation and Promotion of 10,000 New FPOs'?\",\n    \"A\": \"The scheme aims to promote 10,000 new FPOs in India with financial and managerial support, targeting a five-year period from 2019-20 to 2023-24.\"\n  },\n  {\n    \"Q\": \"Which organizations have been identified as Implementing Agencies for the scheme to promote 10,000 new FPOs?\",\n    \"A\": \"SFAC, NCDC (National Cooperative Development Corporation), and NABARD have been identified as Implementing Agencies.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"Under which acts can Farmer Producer Organizations (FPOs) be registered?\",\n    \"A\": \"FPOs can be registered under the Companies Act or the States’ Co-operative Societies Act.\"\n  },\n  {\n    \"Q\": \"What is the role of Cluster Based Business Organizations (CBBOs) in FPOs?\",\n    \"A\": \"CBBOs assist FPOs with farmer mobilization, marketing of agricultural products, MIS implementation, and overall business development.\"\n  },\n  {\n    \"Q\": \"What funding support is provided to FPOs under the scheme?\",\n    \"A\": \"FPOs receive funding support for the first 3 years, Equity Guarantee of up to Rs. 15.0 lakhs, and Credit Guarantee of up to Rs. 2.0 crore of project loan per FPO.\"\n  },\n  {\n    \"Q\": \"How is capacity building and skill development conducted for FPO stakeholders?\",\n    \"A\": \"Training is provided to CEOs, Board of Directors, accountants, and other stakeholders through national and regional training institutions in India.\"\n  },\n  {\n    \"Q\": \"What factors contribute to the success of FPOs?\",\n    \"A\": \"Strong management systems, governance, capital structure, market and financial accessibility, farmer-members engagement plans, infrastructure development, and better pricing mechanisms contribute to FPO success.\"\n  },\n  {\n    \"Q\": \"What challenges do FPOs face in India?\",\n    \"A\": \"Challenges include weak sense of ownership among producer-shareholders, inadequate funding, poor management skills, weak governance, and lack of business understanding.\"\n  },\n  {\n    \"Q\": \"How do FPOs benefit smallholder farmers?\",\n    \"A\": \"FPOs increase average family income, provide easy access to farm inputs, and establish linkages with financial institutions.\"\n  },\n  {\n    \"Q\": \"What is the annual turnover of Bhose Agro Producer Company in Maharashtra?\",\n    \"A\": \"Bhose Agro Producer Company has an annual turnover of about Rs. 1.50 crore.\"\n  },\n  {\n    \"Q\": \"What businesses has Narmadanchal Producer Company undertaken in Madhya Pradesh?\",\n    \"A\": \"Narmadanchal Producer Company has undertaken agri-input trading and commodity trading businesses.\"\n  },\n  {\n    \"Q\": \"What activities is Narsingh FPCL involved in?\",\n    \"A\": \"Narsingh FPCL is involved in agri-input trading, seed production, and trade of agricultural produce, and has set up its own seed processing infrastructure.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the full name of SFPC?\",\n    \"A\": \"Sahyadri Farmers Producers Company Ltd.\"\n  },\n  {\n    \"Q\": \"When was SFPC incorporated?\",\n    \"A\": \"SFPC was incorporated in December 2010.\"\n  },\n  {\n    \"Q\": \"How many farmers is SFPC connected with?\",\n    \"A\": \"SFPC is connected with more than 6,000 farmers.\"\n  },\n  {\n    \"Q\": \"What type of crops do SFPC farmers grow?\",\n    \"A\": \"SFPC farmers grow horticultural crops such as grapes, tomatoes, bananas, pomegranates, guavas, vegetables, and floriculture crops.\"\n  },\n  {\n    \"Q\": \"What milestone did SFPC achieve in 2019?\",\n    \"A\": \"In 2019, SFPC became India’s largest grape exporter.\"\n  },\n  {\n    \"Q\": \"What was SFPC's revenue and net profit in 2020?\",\n    \"A\": \"SFPC achieved revenue of Rs. 465 crores and net profit of Rs. 19 crores in 2020.\"\n  },\n  {\n    \"Q\": \"What is the authorized and paid-up capital of SFPC as of 2020?\",\n    \"A\": \"The authorized capital is Rs. 70 crores, and the paid-up capital is Rs. 55.67 crores.\"\n  },\n  {\n    \"Q\": \"What is the full name of SAFPC?\",\n    \"A\": \"Sahaja Aharam Farmers Producers Company Ltd.\"\n  },\n  {\n    \"Q\": \"How many organic farmers does SAFPC work with?\",\n    \"A\": \"SAFPC works with 10,000 fully organic farmers.\"\n  },\n  {\n    \"Q\": \"What types of products does SAFPC offer?\",\n    \"A\": \"SAFPC offers more than 100 SKUs, including cereals, millets, edible oils, and sweeteners, certified under NPOP/USDA standards.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What types of agricultural products are available on e-commerce platforms?\",\n    \"A\": \"Products like spices, processed foods, health foods, fresh fruits, and vegetables are available on e-commerce platforms.\"\n  },\n  {\n    \"Q\": \"What does SAFPC provide to farmer-members?\",\n    \"A\": \"SAFPC provides technical know-how, seeds, and conducts capacity-building programs for farmer-members.\"\n  },\n  {\n    \"Q\": \"How does SAFPC ensure higher prices for producer-farmers?\",\n    \"A\": \"By shortening the supply chain, SAFPC ensures about 50% higher prices for producer-farmers.\"\n  },\n  {\n    \"Q\": \"What is the current average farm income in India?\",\n    \"A\": \"The current average farm income in India is Rs. 816 per capita per month.\"\n  },\n  {\n    \"Q\": \"How can farm income be increased?\",\n    \"A\": \"Farm income can be increased by reducing production costs, improving productivity with modern technologies, or capturing value from the agricultural value chain.\"\n  },\n  {\n    \"Q\": \"Why is synergy between agri-startups and FPOs important?\",\n    \"A\": \"Synergy between agri-startups and FPOs provides farmers access to modern technologies and services, while startups gain access to a large market and reduced transaction costs.\"\n  },\n  {\n    \"Q\": \"What functions do FPOs perform for farmers?\",\n    \"A\": \"FPOs aggregate demand for farm inputs and produce, link farmers to markets, and provide support like financing, advisory, warehousing, and capacity building.\"\n  },\n  {\n    \"Q\": \"What challenges do agri-startups in India face?\",\n    \"A\": \"Agri-startups in India are often fund-starved and face challenges in customer acquisition despite being revenue-positive.\"\n  },\n  {\n    \"Q\": \"How are agri-startups adapting to work with FPOs?\",\n    \"A\": \"Many agri-startups are orienting their business models to cater to the needs of FPOs, providing innovative technology and services at low costs.\"\n  },\n  {\n    \"Q\": \"What is the role of scientific advancements in Indian agriculture?\",\n    \"A\": \"Scientific advancements are reshaping Indian agriculture by shifting focus from cereal self-sufficiency to commodities like pulses, milk, meat, fish, fruits, and vegetables.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the visible trend in agriculture mentioned in the text?\",\n    \"A\": \"A pattern of diversified agriculture is clearly visible.\"\n  },\n  {\n    \"Q\": \"What mechanisms are supporting agri-preneurship and startups?\",\n    \"A\": \"Technology business incubators and financial infrastructure are supporting agri-preneurship and startups.\"\n  },\n  {\n    \"Q\": \"What continuous efforts are needed to ensure sustainability in agriculture?\",\n    \"A\": \"Efforts are needed in sustainability in resource use, environmental impacts, risk-handling, and business ecosystem development.\"\n  },\n  {\n    \"Q\": \"What is considered key to addressing agricultural challenges?\",\n    \"A\": \"Upscaling expenses for research and development (R&D) and research prioritization are key.\"\n  },\n  {\n    \"Q\": \"How can private sector participation benefit agriculture?\",\n    \"A\": \"Private sector participation can help in commercialization of agricultural technologies, developing agri-preneurship through startups, and supporting innovative organizations like Farmer Producer Organizations (FPOs).\"\n  },\n  {\n    \"Q\": \"What are Farmer Producer Organizations (FPOs)?\",\n    \"A\": \"FPOs are innovative organizations that aim to support farmers and balance the agricultural ecosystem.\"\n  },\n  {\n    \"Q\": \"Which government initiative supports startups in agriculture?\",\n    \"A\": \"The Startup India Action Plan by the Ministry of Commerce and Industry supports startups in agriculture.\"\n  },\n  {\n    \"Q\": \"What is the significance of research and development in agriculture?\",\n    \"A\": \"Research and development are crucial for addressing sustainability challenges and improving agricultural productivity.\"\n  },\n  {\n    \"Q\": \"What report discusses the formation and conversion of cooperative businesses into companies?\",\n    \"A\": \"The 'Report of the High-Powered Committee for Formation and Conversion of Cooperative Business into Companies' by the Government of India in 2000 discusses this.\"\n  },\n  {\n    \"Q\": \"What publication provides agricultural statistics in India?\",\n    \"A\": \"The 'Agricultural Statistics at a Glance 2020' by the Ministry of Agriculture & Farmers Welfare provides agricultural statistics in India.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What are some common types of cooking oils mentioned in the text?\",\n        \"A\": \"Canola oil, olive oil, sunflower oil, butter, margarine, and virgin coconut oil.\"\n    },\n    {\n        \"Q\": \"How many calories are in a tablespoon of liquid cooking oil?\",\n        \"A\": \"There are about 120 calories per tablespoon of liquid cooking oil.\"\n    },\n    {\n        \"Q\": \"What is the major source of oil in our diets according to the text?\",\n        \"A\": \"The major source of oil in our diets is packaged foods and fast-food meals.\"\n    },\n    {\n        \"Q\": \"Which cooking oils are likely to be genetically modified?\",\n        \"A\": \"Corn, soy, and canola oils are likely to be genetically modified.\"\n    },\n    {\n        \"Q\": \"Which oils are recommended for frying due to their higher smoke points?\",\n        \"A\": \"Sunflower oil and canola oil are recommended for frying due to their higher smoke points.\"\n    },\n    {\n        \"Q\": \"What is the smoke point of extra-virgin olive oil?\",\n        \"A\": \"The smoke point of extra-virgin olive oil is about 190°C/375°F.\"\n    },\n    {\n        \"Q\": \"What is kodo millet, and where is it primarily grown in India?\",\n        \"A\": \"Kodo millet is a small-seeded annual cereal grass, primarily grown in Madhya Pradesh, Chhattisgarh, Uttar Pradesh, Tamil Nadu, Maharashtra, Karnataka, and some parts of Andhra Pradesh.\"\n    },\n    {\n        \"Q\": \"What are some alternative names for kodo millet in different Indian languages?\",\n        \"A\": \"Kodo millet is known as kodo (Hindi), varagu (Tamil), arika (Telugu), harka (Kannada), kodra (Gujarati, Marathi, and Punjabi), and kodua (Oriya).\"\n    },\n    {\n        \"Q\": \"What are some valuable characteristics of kodo millet?\",\n        \"A\": \"Kodo millet has characteristics such as more herbage, branched ear, large number of seeds per raceme, high fertility, and unique storage ability.\"\n    },\n    {\n        \"Q\": \"Which states account for the largest area and production of kodo millet in India?\",\n        \"A\": \"Madhya Pradesh and Chhattisgarh account for nearly 80% of the area and production of kodo millet in India.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the focus of the National Agricultural Research, Education and Extension System (NARES)?\",\n        \"A\": \"NARES focuses on addressing complex agricultural problems through research, education, and extension with visionary leadership.\"\n    },\n    {\n        \"Q\": \"What challenges does NARES face today?\",\n        \"A\": \"NARES faces challenges like reducing resources, limited scientific manpower, and localization, which impact its national character.\"\n    },\n    {\n        \"Q\": \"What is the significance of visionary leadership in NARES?\",\n        \"A\": \"Visionary leadership is essential to implement structural and cyclical changes to address emerging challenges and adapt to the geo-political ecosystem.\"\n    },\n    {\n        \"Q\": \"What did Prime Minister Atal Bihari Vajpayee emphasize at the 85th session of the Indian Science Congress?\",\n        \"A\": \"He emphasized the importance of agricultural research and innovation for India's development.\"\n    },\n    {\n        \"Q\": \"What does the report by NITI Aayog (2018) focus on?\",\n        \"A\": \"It focuses on demand and supply projections for crops, livestock, fisheries, and agricultural inputs towards 2033.\"\n    },\n    {\n        \"Q\": \"What is the impact of research-led agricultural productivity growth, according to Thirtle, Lin, and Piesse (2003)?\",\n        \"A\": \"It has significantly contributed to poverty reduction in Africa, Asia, and Latin America.\"\n    },\n    {\n        \"Q\": \"What issues are highlighted in the policy brief on pesticide use in Indian agriculture by Subash et al. (2017)?\",\n        \"A\": \"The brief discusses trends, market structure, and policy issues related to pesticide use in Indian agriculture.\"\n    },\n    {\n        \"Q\": \"What is the focus of the working paper by Prasad CS and Prateek G (2019)?\",\n        \"A\": \"It focuses on Farmer Producer Organizations (FPOs) in India and provides an annotated bibliography on their role in farming futures.\"\n    },\n    {\n        \"Q\": \"What does the RBI's Handbook of Statistics on Indian Economy (2021) provide?\",\n        \"A\": \"It provides comprehensive data and statistics related to the Indian economy, including agriculture.\"\n    },\n    {\n        \"Q\": \"What is the theme of the policy brief by Pal, Saxena, and Balaji (2020)?\",\n        \"A\": \"It discusses market and innovation-led agricultural transformation in India.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"When was the Indian Council of Agricultural Research (ICAR) established?\",\n    \"A\": \"The Indian Council of Agricultural Research (ICAR) was established in 1929.\"\n  },\n  {\n    \"Q\": \"What was the purpose of creating DARE in 1973?\",\n    \"A\": \"DARE was created in 1973 to provide linkage between ICAR, the government, and line departments.\"\n  },\n  {\n    \"Q\": \"Which committee's recommendations led to the creation of subject matter divisions in ICAR?\",\n    \"A\": \"The subject matter divisions in ICAR were created following the recommendations of the GVK Rao Committee in 1988.\"\n  },\n  {\n    \"Q\": \"What was the impact of allowing foreign germplasms in Indian agriculture?\",\n    \"A\": \"Allowing foreign germplasms in breeding programs revolutionized Indian agriculture post-independence.\"\n  },\n  {\n    \"Q\": \"What is the role of Agrinnovate India Ltd. (AgIn)?\",\n    \"A\": \"Agrinnovate India Ltd. (AgIn), established in 2011, focuses on the commercialization of ICAR technologies.\"\n  },\n  {\n    \"Q\": \"What were some key revolutions supported by ICAR leadership?\",\n    \"A\": \"ICAR leadership supported the green, white, yellow, blue, pulses, sugar, and gene revolutions.\"\n  },\n  {\n    \"Q\": \"Which policies and regulations has ICAR contributed to since independence?\",\n    \"A\": \"ICAR contributed to policies such as the Seed Bill (2004), Coastal Aquaculture Authority Act (2005), National Agroforestry Policy (2014), and Pesticide Management Bill (2020).\"\n  },\n  {\n    \"Q\": \"When was the Agricultural Scientists’ Recruitment Board (ASRB) established?\",\n    \"A\": \"The Agricultural Scientists’ Recruitment Board (ASRB) was established in 1973.\"\n  },\n  {\n    \"Q\": \"What reforms were implemented after the Peer Review Committee in 2017?\",\n    \"A\": \"Reforms included restructuring of ASRB, reforms in AICRPs, cadre review, and accreditations of SAUs.\"\n  },\n  {\n    \"Q\": \"What role has ICAR played in climate change mitigation and adaptation?\",\n    \"A\": \"ICAR has actively engaged in policy formulation and implementation related to climate change mitigation and adaptation.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is the significance of Azadi Ka Amrut Mahotsav in the context of Indian agriculture?\",\n    \"A\": \"It is a time to honor the great leaders who helped remove hunger and poverty from 1/6th of humanity on the globe.\"\n  },\n  {\n    \"Q\": \"What challenges does Indian agriculture face today?\",\n    \"A\": \"Indian agriculture faces challenges like meeting food and nutritional needs of a growing population from depleting land, water, and other resources under acute pressure due to overuse, misuse, and abuse.\"\n  },\n  {\n    \"Q\": \"What factors contributed to the progress of Indian agriculture post-independence?\",\n    \"A\": \"Factors include political will, science and technology, human resources, investments, infrastructure, and the resilient farming community.\"\n  },\n  {\n    \"Q\": \"What was the significance of the Green Revolution in India?\",\n    \"A\": \"The Green Revolution in the mid-60s boosted farm production using science and technology through the synergy of political, scientific, and bureaucratic leaders.\"\n  },\n  {\n    \"Q\": \"What was the White Revolution in India, and what did it achieve?\",\n    \"A\": \"The White Revolution, driven by cooperative farming and cross-bred breeds, transformed milk production and supply chain management in India.\"\n  },\n  {\n    \"Q\": \"When was the Agricultural Research Service (ARS) established, and why?\",\n    \"A\": \"The Agricultural Research Service (ARS) was established in 1975 to enhance human resource development in agricultural research.\"\n  },\n  {\n    \"Q\": \"What is the role of the National Academy of Agricultural Research Management (NAARM)?\",\n    \"A\": \"NAARM, established in 1976, focuses on human resource development and was initially called the Central Staff College for Agriculture.\"\n  },\n  {\n    \"Q\": \"How has agricultural research diversified over the decades in India?\",\n    \"A\": \"Agricultural research diversified to include natural resource management, farm power and energy, high-value cropping, allied sectors, farmers’ outreach, policy, HRD, and research governance.\"\n  },\n  {\n    \"Q\": \"What is the primary goal of agricultural research in India?\",\n    \"A\": \"The goal is to provide affordable technologies to farmers and sustainable growth in agricultural productivity to benefit consumers.\"\n  },\n  {\n    \"Q\": \"What was the milestone achieved in Indian agricultural research in 1929?\",\n    \"A\": \"The establishment of the Imperial Council of Agricultural Research (ICAR) was a significant milestone in 1929.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"When was the Indian Council of Agricultural Research (ICAR) established?\",\n    \"A\": \"The Indian Council of Agricultural Research (ICAR) was established in 1929.\"\n  },\n  {\n    \"Q\": \"What was the first All-India Co-ordinated Research Project (AICRP) introduced in 1957?\",\n    \"A\": \"The first AICRP introduced in 1957 was on maize.\"\n  },\n  {\n    \"Q\": \"Where was the first State Agricultural University (SAU) established in India, and when?\",\n    \"A\": \"The first State Agricultural University (SAU) was established in Pantnagar in 1960.\"\n  },\n  {\n    \"Q\": \"When was the Green Revolution initiated in India?\",\n    \"A\": \"The Green Revolution was initiated in India in 1965.\"\n  },\n  {\n    \"Q\": \"What significant development occurred in ICAR in 1973?\",\n    \"A\": \"In 1973, the Department of Agricultural Research and Education (DARE) was created, and the Director-General of ICAR was given the status of Secretary, DARE.\"\n  },\n  {\n    \"Q\": \"Where and when was the first Krishi Vigyan Kendra (KVK) established?\",\n    \"A\": \"The first Krishi Vigyan Kendra (KVK) was established in Puducherry in 1974.\"\n  },\n  {\n    \"Q\": \"What is the significance of the year 1979 in Indian agricultural research?\",\n    \"A\": \"In 1979, the Lab-to-Land Programme and the National Agricultural Research Project (NARP) were launched.\"\n  },\n  {\n    \"Q\": \"What was the purpose of the World Bank-funded Agricultural Human Resource Development (AHRD) project launched in 1995?\",\n    \"A\": \"The purpose of the AHRD project was to enhance agricultural human resource development in India.\"\n  },\n  {\n    \"Q\": \"When was Agri-innovate India Ltd. (AgIn) Company established?\",\n    \"A\": \"Agri-innovate India Ltd. (AgIn) Company was established in 2011.\"\n  },\n  {\n    \"Q\": \"What was the role of the GVK Rao Committee constituted in 1988?\",\n    \"A\": \"The GVK Rao Committee was constituted to review the infrastructure, personnel policies, and functional role of ICAR.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the Indian Council of Agricultural Research (ICAR) known for?\",\n        \"A\": \"ICAR is known for engaging in basic agricultural research for knowledge discovery and solving real-time agricultural problems.\"\n    },\n    {\n        \"Q\": \"What does the National Agricultural Research System (NARS) consist of?\",\n        \"A\": \"NARS consists of national research institutions, universities, independent research organizations, the private sector, and international research centers.\"\n    },\n    {\n        \"Q\": \"What are some potential disconnects in agricultural research?\",\n        \"A\": \"Potential disconnects include time lags between research and its utilization, disconnects between basic and applied research, and spatial or cultural/social disconnects.\"\n    },\n    {\n        \"Q\": \"Why is basic research important in agriculture?\",\n        \"A\": \"Basic research is an important starting point for applied research, as it addresses fundamental issues that can lead to solutions for specific agricultural problems.\"\n    },\n    {\n        \"Q\": \"What challenges do research organizations face today in conducting basic research?\",\n        \"A\": \"Research organizations face financial constraints, making it more difficult to access resources for continuing basic research in some subjects.\"\n    },\n    {\n        \"Q\": \"What is the role of leadership in ICAR?\",\n        \"A\": \"Leadership in ICAR is required to guide diverse organizations and institutions along the continuum of fundamental to applied research, ensuring minimal duplication and maximum synergy.\"\n    },\n    {\n        \"Q\": \"How did ICAR's structure change in 1963?\",\n        \"A\": \"In 1963, ICAR's structure was reorganized, including reconstitution of the Governing Body, administrative control of research institutes, and the appointment of a Scientist as Director General.\"\n    },\n    {\n        \"Q\": \"Who was the first Director General of ICAR, and when was he appointed?\",\n        \"A\": \"Dr. B.P. Pal was the first Director General of ICAR, appointed in May 1965.\"\n    },\n    {\n        \"Q\": \"What recommendations led to the reorganization of ICAR in 1963?\",\n        \"A\": \"The reorganization of ICAR in 1963 followed the recommendations of the Joint Indo-American Teams of 1954 and 1959, and the Agricultural Research Review Team.\"\n    },\n    {\n        \"Q\": \"How did visionary leadership benefit India's agricultural research system in the past?\",\n        \"A\": \"Visionary leadership enabled a diverse and dynamic agricultural research system to contribute immensely to achieving food security in India.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"When was the first All India Coordinated Research Project (AICRP) for maize initiated?\",\n        \"A\": \"The first AICRP for maize was initiated in 1957.\"\n    },\n    {\n        \"Q\": \"Which organization collaborated with the Ministry of Food and Agriculture, GOI, to start the AICRP for maize?\",\n        \"A\": \"The Rockefeller Foundation collaborated with the Ministry of Food and Agriculture, GOI.\"\n    },\n    {\n        \"Q\": \"What was the impact of the coordinated maize project in India?\",\n        \"A\": \"It was a watershed moment in agricultural research planning in India.\"\n    },\n    {\n        \"Q\": \"How many coordinated projects are currently operational in India?\",\n        \"A\": \"Currently, 60 coordinated projects are operational in India.\"\n    },\n    {\n        \"Q\": \"Who were the key leaders behind India's Green Revolution?\",\n        \"A\": \"Mrs. Indira Gandhi, C Subramaniam, and Dr. M.S. Swaminathan were key leaders behind India's Green Revolution.\"\n    },\n    {\n        \"Q\": \"What were the key elements of the Green Revolution in India?\",\n        \"A\": \"The Green Revolution involved high-yielding dwarf wheat varieties, irrigation, chemical fertilizers, and pesticides.\"\n    },\n    {\n        \"Q\": \"What was the outcome of the Green Revolution for India?\",\n        \"A\": \"India transitioned from a food importer reliant on aid to a food exporter, significantly increasing crop yields and reducing starvation and malnutrition.\"\n    },\n    {\n        \"Q\": \"Who is regarded as the father of the Indian Green Revolution?\",\n        \"A\": \"Dr. M.S. Swaminathan is regarded as the father of the Indian Green Revolution.\"\n    },\n    {\n        \"Q\": \"What structural changes were introduced by Dr. M.S. Swaminathan in the agricultural research system?\",\n        \"A\": \"Dr. M.S. Swaminathan introduced DARE in 1973, established the first Krishi Vigyan Kendra (KVK) in 1974, and initiated the Agricultural Research Service (ARS) in 1975.\"\n    },\n    {\n        \"Q\": \"What was Dr. Om Prakash Gautam’s contribution to Indian agriculture during his tenure as Director General of ICAR?\",\n        \"A\": \"Dr. Om Prakash Gautam revitalized the Indian Agricultural Education System and made Agricultural Universities Centers of Excellence.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What new areas of research were included in the expanded mandate of the research project?\",\n    \"A\": \"The expanded mandate included irrigated farming, horticulture, commercial field crops, agro-forestry, and animal nutrition.\"\n  },\n  {\n    \"Q\": \"What program was recommended for practical-oriented education in agriculture degree programs?\",\n    \"A\": \"The Rural Work Experience (RAWE) program was recommended for practical-oriented education.\"\n  },\n  {\n    \"Q\": \"What was the Technology Mission on Oilseeds (TMO), and when was it launched?\",\n    \"A\": \"The Technology Mission on Oilseeds (TMO) was launched in 1986 to improve oilseed production in India.\"\n  },\n  {\n    \"Q\": \"Who led the Technology Mission on Oilseeds (TMO), and what was its outcome?\",\n    \"A\": \"Dr. M.V. Rao led the TMO, resulting in an increase in oilseed production from 10.83 million tons in 1985-86 to 24.75 million tons in 1998-99.\"\n  },\n  {\n    \"Q\": \"What is the Yellow Revolution, and when did it occur?\",\n    \"A\": \"The Yellow Revolution (1986-1990) refers to India's achievement of near-self-sufficiency in edible oil production.\"\n  },\n  {\n    \"Q\": \"What was the significance of the GVK Rao Committee recommendations in 1988?\",\n    \"A\": \"The recommendations led to the establishment of subject matter divisions in ICAR to foster inter-institutional collaboration.\"\n  },\n  {\n    \"Q\": \"What contributions did Dr. R.S. Paroda make as DG of ICAR?\",\n    \"A\": \"Dr. R.S. Paroda established over 20 new institutes, initiated the National Agriculture Technology Project (NATP), and launched the Agricultural Human Resource Development (AHRD) Project.\"\n  },\n  {\n    \"Q\": \"What is the National Agriculture Technology Project (NATP), and what was its focus?\",\n    \"A\": \"The NATP, initiated during Dr. R.S. Paroda's tenure, aimed to reorient agricultural research, education, and extension systems to meet new challenges.\"\n  },\n  {\n    \"Q\": \"What was established in 1996 under Dr. R.S. Paroda's leadership, and why is it significant?\",\n    \"A\": \"The world's largest and most advanced national gene bank was established in 1996, housing over 400,000 crop germplasm accessions.\"\n  },\n  {\n    \"Q\": \"What were Dr. Panjab Singh’s significant contributions as Secretary, DARE, and DG, ICAR?\",\n    \"A\": \"Dr. Panjab Singh strengthened laws to protect India’s bio-resources from bio-piracy and promoted the translation of innovative technologies.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What was the purpose of the National Agricultural Innovation Project (NAIP)?\",\n    \"A\": \"The purpose of NAIP was to achieve excellence in science, utilize science for society and commerce, and enhance rural livelihood security through technology and agricultural economy integration.\"\n  },\n  {\n    \"Q\": \"Who led ICAR during 2003-2009, and what was their contribution?\",\n    \"A\": \"Dr. Mangala Rai led ICAR during 2003-2009, fostering collaborations among public organizations, farmers’ groups, the private sector, and other stakeholders to transform Indian agriculture for poverty alleviation and income generation.\"\n  },\n  {\n    \"Q\": \"What institutions were established under Dr. Mangala Rai’s leadership?\",\n    \"A\": \"Institutions such as ICAR-National Institute of Abiotic Stress Management (NIASM), ICAR-National Institute of Biotic Stress Management (NIBSM), ICAR-Indian Institute of Seed Science, ICAR-National Institute for Agriculturally Important Microorganisms (ICAR-NIAIM), and ICAR-Indian Institute of Agriculture Biotechnology (ICAR-IIAB) were established.\"\n  },\n  {\n    \"Q\": \"What is the National Fund for Basic, Strategic, and Frontier Application Research in Agriculture (NFBSFARA) now called?\",\n    \"A\": \"NFBSFARA was renamed as the National Agricultural Science Fund (NASF) following the recommendations of the Mashelkar Committee in 2005.\"\n  },\n  {\n    \"Q\": \"What were Dr. S. Ayyappan’s contributions to Indian fisheries?\",\n    \"A\": \"Dr. S. Ayyappan brought Indian fisheries to a level of excellence in basic science and fish commercialization, leading to significant increases in production and productivity.\"\n  },\n  {\n    \"Q\": \"What new initiatives were planned under Dr. S. Ayyappan’s leadership for eastern India?\",\n    \"A\": \"A new era of establishing Indian Agricultural Research Institute (IARI)-like institutions in Jharkhand and Assam was planned to bring the green revolution to eastern India.\"\n  },\n  {\n    \"Q\": \"What is Borlaug’s Institute for South Asia, and where are its research centers located?\",\n    \"A\": \"Borlaug’s Institute for South Asia was established in India with research centers in Madhya Pradesh and Bihar.\"\n  },\n  {\n    \"Q\": \"What advancements were made under Dr. Trilochan Mohapatra’s leadership at ICAR?\",\n    \"A\": \"Dr. Trilochan Mohapatra focused on leveraging recent advances in science and technology, such as digital technologies, smart farming, and biotechnological advancements, to address challenges in Indian agriculture.\"\n  },\n  {\n    \"Q\": \"What role did ICAR play in upgrading its directorates and NRCs during this period?\",\n    \"A\": \"ICAR upgraded many of its directorates and NRCs into full-fledged institutions to ensure inclusivity and enhance agricultural research and development.\"\n  },\n  {\n    \"Q\": \"Which committee recommended renaming NFBSFARA to NASF?\",\n    \"A\": \"The Mashelkar Committee recommended renaming NFBSFARA to the National Agricultural Science Fund (NASF).\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What is ICAR and why is it significant?\",\n    \"A\": \"ICAR (Indian Council of Agricultural Research) is the world's largest agricultural research and education system, proactively transforming itself to meet India's evolving needs.\"\n  },\n  {\n    \"Q\": \"What institutes were established under ICAR's leadership?\",\n    \"A\": \"Institutes like ICAR-Mahatma Gandhi Integrated Farming Research Institute, IARI Jharkhand Campus, Assam Campus, and the International Centre for Foot and Mouth Disease, Mukteshwar were established.\"\n  },\n  {\n    \"Q\": \"What policy was implemented in the NARES system under ICAR's leadership?\",\n    \"A\": \"The National Education Policy (NEP 2020) was implemented in the NARES system under ICAR's leadership.\"\n  },\n  {\n    \"Q\": \"What structural reforms were carried out based on the Peer Review Committee's recommendations?\",\n    \"A\": \"Reorganization of the ASRB, right-sizing of AICRPs, and cadre review of ICAR were effectively implemented.\"\n  },\n  {\n    \"Q\": \"What changes were made to ICAR's intellectual property and technology transfer guidelines?\",\n    \"A\": \"ICAR revised its guidelines on Regulations for Intellectual Property Management and Technology Transfer/Commercialization and accreditation of SAUs for higher agricultural education standards.\"\n  },\n  {\n    \"Q\": \"How did ICAR expand its international relations?\",\n    \"A\": \"ICAR established ACARE in Myanmar, ANASTU in Afghanistan, and a Deemed University for Agricultural Education in Nepal, while also providing fellowships for students from African countries.\"\n  },\n  {\n    \"Q\": \"What were the impacts of the Green Revolution in India?\",\n    \"A\": \"The Green Revolution reduced poverty, averted hunger, transformed agriculture into a commercial activity, and made India self-sufficient in food production.\"\n  },\n  {\n    \"Q\": \"What is the significance of the White Revolution in India?\",\n    \"A\": \"The White Revolution transformed India into the largest producer of milk, enhancing rural incomes and improving nutrition.\"\n  },\n  {\n    \"Q\": \"Who were some notable leaders in Indian agriculture?\",\n    \"A\": \"Notable leaders include Dr. A.B. Joshi, Dr. N.G.P. Rao, Dr. D.R. Bhumla, and Dr. Ananta Rao, who contributed to ICAR's early recognition.\"\n  },\n  {\n    \"Q\": \"What is the role of CSR funding in ICAR's research and extension activities?\",\n    \"A\": \"CSR funding was mainstreamed into ICAR's research and extension activities, with ICAR releasing its CSR Guidelines in 2021.\"\n  }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"What transformation did India undergo in milk production?\",\n    \"A\": \"India transformed from a milk-deficient nation to a world leader in milk production.\"\n  },\n  {\n    \"Q\": \"What revolution helped India achieve near self-sufficiency in edible oils?\",\n    \"A\": \"The Yellow Revolution helped India achieve near self-sufficiency in edible oils.\"\n  },\n  {\n    \"Q\": \"What is the focus of the Blue Revolution in India?\",\n    \"A\": \"The Blue Revolution focuses on increasing fisheries production and productivity from aquaculture and fisheries resources, including inland, freshwater, and marine.\"\n  },\n  {\n    \"Q\": \"How has food consumption changed in India over the decades?\",\n    \"A\": \"Average milk, egg, fruit, vegetable, and meat consumption improved, leading to diversified food systems, nutrition security, and increased life expectancy.\"\n  },\n  {\n    \"Q\": \"What role has ICAR played in sustaining agricultural revolutions in India?\",\n    \"A\": \"ICAR technologies contributed to sustaining the benefits of agricultural revolutions despite challenges like depleting natural resources, diseases, pests, droughts, and floods.\"\n  },\n  {\n    \"Q\": \"When did ICAR first introduce guidelines for engaging researchers with external agencies?\",\n    \"A\": \"ICAR introduced guidelines for engaging researchers with external agencies in 1997.\"\n  },\n  {\n    \"Q\": \"What are the 'ICAR Rules and Guidelines for Professional Service Functions (PSF)'?\",\n    \"A\": \"The PSF guidelines, updated in 2014, enable researchers to collaborate with external agencies and achieve ICAR's core objectives.\"\n  },\n  {\n    \"Q\": \"How has ICAR supported resource mobilization for research?\",\n    \"A\": \"ICAR encouraged researchers to collaborate with external sponsoring bodies, corporate firms, and international agencies through guidelines for training, consultancy, and contract research.\"\n  },\n  {\n    \"Q\": \"What are some of the challenges faced by Indian agriculture despite advancements?\",\n    \"A\": \"Challenges include depleting natural resources, deteriorating soil, water, biodiversity, climate, and escalating stresses such as diseases, pests, droughts, and floods.\"\n  },\n  {\n    \"Q\": \"What initiatives have been attributed to ICAR's seamless operation of externally funded projects?\",\n    \"A\": \"The seamless operation is attributed to ICAR's guidelines for training, consultancy, contract research, and professional service functions.\"\n  }\n]\n```"
]