[
    "{ Q: What is the significance of celebrating Mahatma Gandhi's 150th birth anniversary?\n                            A: The 150th birth anniversary of Mahatma Gandhi is an opportunity to recapitulate his ideas, teachings, and principles in public life and service.\n                            Q: How can Gandhiji's ideas contribute to world development?\n                            A: Gandhiji's ideas on non-violence, peace, and truthfulness can guide world development policy and bring change in governance and public service.\n                            Q: Which regions need greater focus for rural development?\n                            A: Asia, Africa, and Latin America need greater focus for rural development as most of the poor, hungry, and disadvantaged people live in these regions.\n                            Q: How is agricultural development linked to SDGs?\n                            A: Several SDGs, such as no poverty, zero hunger, reduced inequality, life below water and on land, are directly related to agricultural development.\n                            Q: What are the areas identified by the Indian Government for achieving SDGs?\n                            A: The Indian Government has identified areas for interventions to achieve SDGs and targets concentrated agricultural and institutional development efforts for the 171 Aspirational Districts.\n                            Q: What is the role of ICAR innovations in realizing Gandhiji's vision for agriculture and rural development?\n                            A: ICAR innovations play a significant role in realizing Gandhiji's vision for agriculture and rural development by improving the life and livelihood of rural people.\n                            Q: What is the significance of RAD (Rainfed Area Development)?\n                            A: RAD focuses on improving agricultural productivity and sustainability in rainfed areas, which are often prone to drought and other climate-related challenges.\n                            Q: What is the purpose of the RKVY (Rashtriya Krishi Vikas Yojana)?\n                            A: RKVY aims to promote agricultural growth and development by providing financial support to state-level projects and initiatives.\n                            Q: What is the role of the SFAC (Small Farmers Agri-Business Consortia)?\n                            A: SFAC promotes the development of small and marginal farmers by providing access to credit, technology, and marketing support.\n                            Q: What is the purpose of the SIA (State Implementing Agencies)?\n                            A: SIA is responsible for implementing various agricultural development schemes and programs at the state level.}",
    "{ Q: What was the main purpose of Gandhiji's Champaran Satyagraha in 1917?\n                            A: The Champaran Satyagraha aimed to protect the interests of poor peasants.\n                            Q: How did Gandhiji influence the establishment of agricultural institutions?\n                            A: Gandhiji's rural-centric approach led to the establishment of agricultural institutions based on the US Land-Grant System.\n                            Q: What role did ICAR play in agricultural development?\n                            A: ICAR contributed to agricultural development through the green and other revolutions.\n                            Q: How did ICAR follow Gandhian principles in its working?\n                            A: ICAR worked in partnerships with clients and farmers, focusing on equity, environment, and smallholder farmers.\n                            Q: What is the concept of development in harmony with nature?\n                            A: It involves developing technology and practices for conservation agriculture and natural resources.\n                            Q: How have ICAR-led efforts contributed to national food security?\n                            A: ICAR's efforts have helped increase agricultural productivity, ensuring food security and reducing poverty.\n                            Q: What is the significance of Satyagraha in Gandhiji's philosophy?\n                            A: Satyagraha represents Gandhiji's pursuit of truth through peaceful means.\n                            Q: How is agricultural research related to the pursuit of truth?\n                            A: Agricultural research aims to discover new knowledge and use it for the betterment of people.\n                            Q: What is the focus of agricultural research in understanding production systems?\n                            A: Agricultural research focuses on the inter-relationship between living and non-living systems.\n                            Q: Why is there a need for further research in agricultural systems?\n                            A: Further research is needed to exploit synergies and improve the efficiency of agricultural systems.}",
    "{ Q: What is the purpose of understanding biological systems in agriculture?\n                            A: Understanding biological systems helps develop new varieties and breeds that are more responsive to inputs, resilient to stresses, and rich in nutrients.\n                            Q: What potential benefits do bio-economy and microbiome offer in agriculture?\n                            A: They can improve the efficiency and resilience of living systems and have applications in food and agro-industries.\n                            Q: How can advancements in molecular biology benefit agriculture?\n                            A: They can address production constraints like drought tolerance and pest tolerance that cannot be addressed through conventional breeding methods.\n                            Q: What is the guiding principle for scientific exploration in agriculture?\n                            A: Scientific exploration should discover new knowledge without altering the basic fundamentals of nature.\n                            Q: What is Gandhiji's Talisman, and how can it be applied to agricultural research?\n                            A: Gandhiji's Talisman is a call to prioritize the needs of the weakest sections of society. It can be used to develop a framework for agricultural research that focuses on their upliftment.\n                            Q: What is the importance of Gandhiji's talisman in the context of rural economy and ecosystem preservation?\n                            A: Gandhiji's talisman emphasizes reviving the rural economy, preserving ecosystems, and reducing consumption to avoid environmental stress.\n                            Q: How can Gandhiji's philosophy be incorporated into economic policy?\n                            A: By making his thoughts and philosophy a part of economic policy, the welfare of all through the weakest sections of society can be prioritized.\n                            Q: What is the purpose of a formal priority-setting mechanism in agricultural research?\n                            A: It helps incorporate concerns of equity and ecology, leading to more effective and efficient use of resources.\n                            Q: How has the allocation of resources in agricultural research changed with the adoption of a formal priority-setting mechanism?\n                            A: There have been visible and perceptible changes in allocation, leading to greater objectivity and transparency in addressing priority research themes.}",
    "{ Q: What is the focus of agricultural research in the text?\n                            A: The focus is on addressing poverty, marginal areas, gender issues, and institutional developments.\n                            Q: How is priority setting approached in agricultural research?\n                            A: The approach is objective, transparent, and impact-focused, targeting vulnerable sections of society.\n                            Q: Which marginal areas receive significant public expenditure on agricultural research?\n                            A: Rainfed, arid, and hill & mountain regions account for two-thirds of public expenditure.\n                            Q: How have resource allocations towards marginalized areas changed over time?\n                            A: Resource allocation towards marginalized areas has increased significantly over time.\n                            Q: What is the purpose of establishing new institutes in the eastern region?\n                            A: To address low productivity and high incidence of poverty in the region.\n                            Q: What is the goal of the Tribal Sub-Plan (TSP)?\n                            A: To bridge the gap between Schedule Tribes (STs) and the general population concerning socio-economic development.\n                            Q: What is the objective of the Scheduled Caste Sub-Plan (SCSP)?\n                            A: To ensure the flow of targeted financial and physical benefits for the economic development of Scheduled Castes.\n                            Q: What is the new strategy in NARS for resource allocation?\n                            A: The new strategy is to rationalize resource allocation based on a prioritized research portfolio.\n                            Q: What is the guiding principle of the PME process in NARS?\n                            A: The guiding principle is that the PME process should be objective, transparent, and decentralized.}",
    "{ Q: What is the focus of environmental sustainability in agriculture?\n                            A: Environmental sustainability focuses on how technology affects the natural resource base and maintaining productivity over time.\n                            Q: How has India's research and education system evolved?\n                            A: The country's research and education system has undergone significant changes, with a vast network of ICAR institutions addressing commodity and region-specific research problems.\n                            Q: What factors are considered in the finalization of research programs?\n                            A: Natural resource status, soil and water depletion, and degradation are considered in the finalization of research programs.\n                            Q: What was Gandhiji's dream for society?\n                            A: Gandhiji dreamt of equality and emphasized priority setting based on the potential impact on the rural poor.\n                            Q: How should government policies focus on vulnerable sections of society?\n                            A: Government policies should focus on vulnerable and marginalized sections, even if it requires making special provisions for such classes.\n                            Q: Who should be involved in setting priorities for agro-ecosystems and production systems?\n                            A: A multi-disciplinary team in close interaction with all stakeholders like farmers, NGOs, etc., should be involved in setting priorities.\n                            Q: What was Gandhiji's vision for village economies?\n                            A: Gandhiji advocated for self-reliant village economies where villages would be independent yet inter-dependent economic units for production, consumption, and trade.\n                            Q: What was Gandhiji's view on industrialization?\n                            A: Gandhiji was not against industrialization but was against exploitation of resources and people for profiteering in mass-scale industrialization.\n                            Q: What did Gandhiji believe about agricultural land distribution?\n                            A: Gandhiji was against the concentration of agricultural land in fewer hands and favored distribution to the tillers and collective farming.\n                            Q: What was Gandhiji's opinion on rural industries?\n                            A: Gandhiji believed that agricultural development should go hand in hand with the development of rural industries based on local resources and family labor.}",
    "{ Q: What are the benefits of rural industries according to Gandhiji?\n                            A: Gandhiji believed that rural industries could generate employment, income, and rural prosperity through local resources.\n                            Q: What did Gandhiji use to symbolize rural industrialization?\n                            A: Khadi and Charkha.\n                            Q: What is Gandhiji's view on using modern machines in villages?\n                            A: He believed villagers could use modern machines they could make and afford to use, provided the village industry's character was maintained.\n                            Q: Why is rural industrialization important in the context of Covid-19?\n                            A: The pandemic exposed urbanization's weaknesses and the need for labour-intensive rural industrialization based on local resources.\n                            Q: What impact did economic development have on rural areas?\n                            A: Economic development left behind rural areas, leading to increased rural-urban disparities in social and economic welfare indicators.\n                            Q: How do rural industries benefit the population?\n                            A: They help decentralize economic activities, benefiting a large proportion of the population.\n                            Q: What is the government's current emphasis in rural industrialization?\n                            A: The government emphasizes developing micro, medium, and small-scale enterprises that are labour-intensive and require less capital.\n                            Q: What is the relevance of collective action in agriculture?\n                            A: Collective action can help farmers achieve scale economies in production and marketing, which is essential given the fragmentation of landholdings.\n                            Q: What initiatives has the government taken to promote collectivization in farming?\n                            A: The government has initiated the expansion of rural industries, strengthening Farmer Producer Organizations, and one-district one-product based clustering farming.}",
    "{ Q: Who are the key players in agriculture mentioned in the text?\n                            A: Millions of small-scale producers, rural artisans, and landless workers.\n                            Q: What is the relevance of Gandhiji's advocacy for sustainable agriculture?\n                            A: It is crucial in addressing the ongoing agrarian crisis and promoting conservation practices.\n                            Q: What was the main reason for promoting high-yield crop varieties?\n                            A: To produce more food for the growing population.\n                            Q: What role did the ICAR-SAU system play in food security?\n                            A: It developed high-yielding crop varieties that made the country food secure.\n                            Q: What are the negative externalities of intensive agriculture?\n                            A: It led to environmental degradation and frequent climatic shocks.\n                            Q: How is ICAR addressing the negative impacts of intensive agriculture?\n                            A: By promoting conservation agricultural practices and climate-smart technologies.\n                            Q: What is ICAR's current approach to enhancing agricultural productivity?\n                            A: Technological empowerment of small farmers for sustainable use of natural resources.\n                            Q: How can Gandhiji's dream of self-reliant village economies be achieved?\n                            A: Through advancements in information and communication technologies, biotechnology, and logistics.\n                            Q: What is the importance of non-violence in development, according to Gandhiji?\n                            A: It promotes harmony with nature and sustainable development.}",
    "{ Q: What is the main objective of ICAR's research activities?\n                            A: The main objective of ICAR's research activities is to establish harmony with nature and achieve sustainable development.\n                            Q: What are some key practices used by ICAR to promote harmony with nature?\n                            A: Integrated Nutrient Management (INM), Integrated Pest Management (IPM), and conservation of germplasm are some key practices.\n                            Q: How does ICAR's research approach align with the concept of \"Sarvodaya\"?\n                            A: ICAR's research approach covers all stakeholders engaged in farming, irrespective of class and region, making it more inclusive.\n                            Q: How does ICAR's policy advocacy reflect Gandhiji's principles?\n                            A: ICAR's policy advocacy emphasizes building harmony with nature and using non-violent means to achieve its goals.\n                            Q: What role do KVKs, ATARIs, and Regional stations play in ICAR's system?\n                            A: They help solve problems, transfer research benefits, and enhance the resource and knowledge base of rural India.\n                            Q: How does ICAR address climate-related issues?\n                            A: ICAR promotes plant varieties, management practices, and technologies to reduce farmers' vulnerability to climate adversaries.\n                            Q: What is the significance of \"Sarvodaya\" in ICAR's research approach?\n                            A: \"Sarvodaya\" in ICAR's research approach signifies sustainable development, benefiting all stakeholders engaged in farming.\n                            Q: How does ICAR contribute to the conservation of natural resources?\n                            A: ICAR contributes through integrated approaches for the conservation of germplasm, soil, water, biosphere, and ecosystem.\n                            Q: What steps has ICAR taken to promote economic equality?\n                            A: ICAR has organized Kisan Melas, training programs, and mass demonstrations to enhance the availability of advanced technologies.\n                            Q: How does ICAR's system reflect Gandhiji's vision for rural development?\n                            A: ICAR's system focuses on the healthy development of rural India, conserving natural resources and promoting sustainable agriculture.}",
    "{ Q: What is the Gandhian principle violated by some ICAR practices?\n                            A: The Gandhian principle of non-violence and harmony with nature is violated by some ICAR practices.\n                            Q: What did Gandhiji caution about before modern environmentalists?\n                            A: Gandhiji cautioned the world about climate change and its impacts before any modern-day environmentalist.\n                            Q: What is ICAR-NIAP's role in climate change adaptation?\n                            A: ICAR-NIAP conducts research on mainstreaming climate adaptation into the development agenda and assesses the impact of climate change on crops across different agro-ecoregions.\n                            Q: How does ICAR build resilience to climate change?\n                            A: ICAR strengthens knowledge and resource endowments with government and civil society support to build resilience to climate change.\n                            Q: What is the significance of ICAR's climate-smart villages?\n                            A: ICAR's climate-smart villages showcase technological and institutional options for dealing with climate change in agriculture.\n                            Q: How does agriculture contribute to climate resilience?\n                            A: Agriculture can bring back lost climate resilience through sustainable practices and production methods.\n                            Q: How does ICAR's approach align with sustainable development and social harmony?\n                            A: ICAR's approach focuses on ecological practices of peasants and rural populace, aiming to bridge regional inequality and promote overall development.\n                            Q: What is the role of non-violence in ICAR's research and development?\n                            A: ICAR practices non-violence while conducting research and taking it to farmer fields, promoting harmony with nature.\n                            Q: How does ICAR facilitate policy and institutional reforms in agriculture?\n                            A: ICAR pioneers, adopts, and facilitates policy and institutional reforms in agriculture and rural development, motivated by the Gandhian philosophy of change.}",
    "{ Q: What are the programs initiated to link research with farming communities?\n                            A: Lab-to-Land, Institute-Village Linkage, technology demonstration, farmer participatory seed production, and Mera Gaon, Mera Gaurav.\n                            Q: How are rural women and youth empowered through agricultural programs?\n                            A: They are empowered through technology, skills, entrepreneurship, and participation in agriculture activities like Joint Liability Groups.\n                            Q: What is the issue with decision-making in public organizations?\n                            A: Decision-making in public organizations is often described as 'top-down' and lacking grass root realities.\n                            Q: How do modern management methods improve decision-making?\n                            A: They make decision-making more objective and transparent by using information, facts, and decision-making criteria.\n                            Q: How is transparency adopted in resource allocation?\n                            A: Through the development of objective and transparent decision-making criteria.\n                            Q: How is the performance of scientists evaluated?\n                            A: Scientists are evaluated against their traits and contributions using a quantitative assessment framework.\n                            Q: What principles are adopted for the recruitment of scientists and management personnel?\n                            A: A similar objective framework is used for the recruitment of scientists and management personnel.\n                            Q: How is autonomy and decentralization encouraged in ICAR?\n                            A: By focusing on flexibility in governance and management functions such as human resource development, finance, and administrative procedures.\n                            Q: What are the benefits of decentralization of responsibility in ICAR?\n                            A: It helps in reducing transaction costs and improving research efficiency.\n                            Q: How is financial management decentralized in ICAR?\n                            A: The responsibility and financial management are decentralized down to the project level with compliance.}",
    "{ Q: What is the purpose of the government's financial rules in agricultural research?\n                            A: The purpose is to innovate in project implementation and bring research closer to farmers' needs.\n                            Q: What is the importance of research monitoring in agriculture?\n                            A: Research monitoring ensures the implementation of prioritized programs, evaluates progress, and directs resources to social needs and weaker sections.\n                            Q: How was the monitoring and evaluation mechanism adopted by ICAR?\n                            A: ICAR adopted a monitoring and evaluation mechanism that was later adopted by state agricultural universities.\n                            Q: What are the factors responsible for the success of the monitoring mechanism?\n                            A: The success of the monitoring mechanism is due to the adoption of the monitoring process as a learning tool and the use of simple, objective, and verifiable indicators.\n                            Q: How does ICAR fund research projects?\n                            A: ICAR uses competitive funding for research, where researchers compete for dedicated funds for specific research to address high priority R&D needs.\n                            Q: What is the role of competitive funding in institutional reforms?\n                            A: Competitive funding is a powerful mechanism to bring institutional reforms in the research system to improve relevance, cost-effectiveness, and accountability of research.\n                            Q: How does ICAR address the concerns of need-based research?\n                            A: ICAR's competitive funding addresses concerns of need-based research by attracting the participation of other scientific organizations, including private R&D, to address research needs in partnership modes.\n                            Q: What is the purpose of the information system developed by ICAR?\n                            A: The information system developed by ICAR compiles information on resources allocated to institutions working in different production environments and community-specific programs like tribal sub-plans, gender, etc.\n                            Q: How has the timely availability of information improved research planning?\n                            A: Timely availability of information has improved the quality of research planning and enabled judicious use of resources.}",
    "{ Q: What efforts have been made to improve access to agricultural technology for disadvantaged groups?\n                            A: Efforts include providing better access to technology, quality inputs like seeds and planting materials, and directed programs to target groups.\n                            Q: How has information communication technology (ICT) improved agriculture?\n                            A: ICT has facilitated an improved information system in ICAR, which has been adopted by other research organizations.\n                            Q: What is the goal of the information system for research outputs, technology, and their dissemination?\n                            A: The goal is to develop a system for research outputs, technology, and their dissemination, outcomes, and impacts.\n                            Q: What was Gandhiji's vision for village institutions?\n                            A: Gandhiji believed in strong village institutions for the overall development of rural society and economic autonomy.\n                            Q: What did Gandhiji do to promote decentralization?\n                            A: He suggested the institutions of villages as units of economic autonomy and started the Sevagram yojana in Wardha district of Maharashtra in 1934.\n                            Q: What is the role of the village in a decentralized system?\n                            A: The village is the lowest unit of a decentralized system, politically small enough to permit everyone to participate directly in the decision-making process.\n                            Q: How did agricultural development activities benefit from the Panchayati Raj movement?\n                            A: Agricultural development activities got a push under this system, especially when MNREGA activities were converged with agricultural development activities.\n                            Q: What is the role of ICAR institutes in watershed development?\n                            A: ICAR institutes, especially those working under Natural Resource Management and Crop Science Divisions, are working for the development of watersheds with the active involvement of gram panchayats.\n                            Q: How have watershed development projects by ICAR institutes impacted rural communities?\n                            A: These projects have empowered poor rural communities by creating better access to quality drinking water and higher income from agriculture and livestock activities.}",
    "{ Q: What role did gram panchayats play in the development of grasslands?\n                            A: Gram panchayats were actively involved in developing grasslands for better fodder availability and improved livestock productivity.\n                            Q: What is the secret to successful cooperative efforts?\n                            A: The secret to successful cooperative efforts is that members must believe in cooperation, which should have a definite progressive goal.\n                            Q: What did Gandhiji believe about cooperation and its role in society?\n                            A: Gandhiji believed that cooperation was necessary for creating a socialistic society and complete decentralization of power.\n                            Q: How did Gandhiji envision cooperatives in agriculture?\n                            A: Gandhiji believed that any industry based on agricultural produce should be on a cooperative basis to secure the best value for the output.\n                            Q: What are some successful examples of cooperatives in India?\n                            A: Some successful examples of cooperatives in India include AMUL, fruits and sugarcane cooperatives in Maharashtra.\n                            Q: How have ICAR institutes contributed to the growth of dairy cooperatives?\n                            A: ICAR institutes have provided technological backstopping to cooperatives, helping them produce various milk products with enhanced shelf life.\n                            Q: How have ICAR institutes helped fruit crop-based cooperatives?\n                            A: ICAR institutes have helped fruit crop-based cooperatives by enhancing farm productivity and improving post-harvest operations.\n                            Q: What role do KVKs play in human resource development for agriculture?\n                            A: KVKs play a vital role in human resource development by providing skilled manpower for agricultural development.\n                            Q: How has agriculture evolved in recent times?\n                            A: Agriculture has evolved into agri-business, with farmers using modern technologies for better production and marketing of their produce.}",
    "{ Q: What is the vision of Science and technology-led growth in agriculture?\n                            A: The vision is to enhance productivity, profitability, and sustainability of agriculture.\n                            Q: What is the mission of KVKs?\n                            A: The mission of KVKs is farmer-centric growth in agriculture and allied sectors.\n                            Q: Who supports capacity building of farmers for adopting new technologies?\n                            A: ICAR and SAUs support capacity building of farmers through KVKs.\n                            Q: What is the role of KVKs in supporting allied and non-farm activities?\n                            A: KVKs support allied and non-farm activities through various capacity building programs.\n                            Q: What are some human capital development initiatives of ICAR through KVKs?\n                            A: ARYA, Farmers FIRST, and skill development through ASCI are some initiatives.\n                            Q: What is the focus of women-centric capacity building programs by KVKs?\n                            A: The focus is on primary processing of agriculture, horticulture, and dairy products.\n                            Q: How do these programs contribute to fulfilling Gandhiji's dream of Swaraj?\n                            A: They develop man resources for participation and management of village-level institutions.\n                            Q: What is ICAR's commitment to Mahatma Gandhi's vision of agriculture and rural development?\n                            A: ICAR is committed to improving rural livelihoods and income through technological interventions.\n                            Q: Who are the main clients of ICAR?\n                            A: Small farmers, women, and rural workers are the main clients of ICAR.\n                            Q: What is the main goal of ICAR's empowerment efforts?\n                            A: The main goal is the economic and social empowerment of rural people and strengthening democratic principles of village institutions.}",
    "{ Q: What is the significance of agriculture in India's economy?\n                            A: Agriculture is the largest source of livelihood in India and a key driver of national economic growth.\n                            Q: How did agriculture perform during the COVID-19 pandemic?\n                            A: Agriculture was the only sector that showed positive growth during the COVID-19 pandemic in India.\n                            Q: What role does horticulture play in India's agriculture?\n                            A: Horticulture has surpassed agriculture production since 2012 and is a major contributor to economic growth.\n                            Q: How has horticulture benefited small and marginal farmers?\n                            A: The rise in horticultural crop production has brought prosperity to small and marginal farmers, who constitute 85% of the farming population.\n                            Q: What is ICAR's contribution to horticulture in India?\n                            A: ICAR has developed varieties and technologies to boost the income of horticultural farmers throughout the country over the last five decades.\n                            Q: What are the main research areas in horticulture?\n                            A: The main research areas include enhancing productivity, breeding for stress resistance, integrated pest management, and improving post-harvest practices.\n                            Q: What are some frontier research areas in horticulture?\n                            A: Frontier research areas include hi-tech horticulture, precision farming, information technology, and biotechnological interventions.\n                            Q: Which institutes are involved in horticultural crop research in India?\n                            A: IIHR, CISH, CITH, CIAH, IIVR, CTCRI, CPCRI, IISR, and NRCs are some institutes involved in horticultural crop research.\n                            Q: How have horticultural crop institutes contributed to rural livelihoods?\n                            A: Horticultural crop institutes have linked their research outputs with the upliftment of rural livelihoods and providing nutritional security.}",
    "{ Q: What was Mahatma Gandhi's view on rural economy?\n                            A: Gandhi believed that India's progress was dependent on rural economy and emphasized self-sufficiency (Atma Nirbharatha).\n                            Q: What did Gandhi think about rural under-development?\n                            A: He believed rural under-development was the cause of poverty and emphasized collective sacrifice for the whole unit.\n                            Q: How has ICAR contributed to rural development?\n                            A: ICAR has worked with commitment for rural development and helped farmers find livelihood through horticultural technologies.\n                            Q: What was Gandhi's approach to nutrition and diet?\n                            A: He emphasized the quality of food and conducted diet-related experiments on himself or at his ashram.\n                            Q: What kind of diet did Gandhi follow?\n                            A: He followed a strict regimen of two meals a day, mostly comprising fruits and vegetables.\n                            Q: What was Gandhi's preference in food?\n                            A: He preferred vegetarian food, including salads, curd, fresh fruits, unpolished rice, millets, pulses, jaggery, and dry fruits.\n                            Q: How did Gandhi use horticulture for nutritional security?\n                            A: He used horticulture to promote the intake of fruits and vegetables for better nutrition.\n                            Q: What is ICAR's focus in realizing Gandhi's vision of rural development?\n                            A: ICAR's focus is on generating employment opportunities in different sectors and promoting self-sufficiency (Atma Nirbhar Bharat).\n                            Q: How have horticultural technologies helped farmers in rural areas?\n                            A: Horticultural technologies have helped farmers find livelihood and promote employment in rural parts of the country.\n                            Q: What is the significance of Gandhi's diet experiments?\n                            A: His experiments with diet laid the foundation for present-day dieticians and emphasized the importance of nutritious food for overall health.}",
    "{ Q: What is the role of agricultural institutes in India?\n                            A: Agricultural institutes train farmers in sustainable farming, water resource management, and farming techniques to enhance profitability and food availability.\n                            Q: What is one of the major focuses of ICAR?\n                            A: ICAR aims to increase the availability, affordability, and consumption of nutrient-rich fruits, vegetables, and spices to reverse malnutrition.\n                            Q: What is the origin of jackfruit?\n                            A: Jackfruit is native to India and grows wildly in the Western Ghat regions up to an elevation of 2,400 MSL.\n                            Q: What are the uses of jackfruit?\n                            A: Jackfruit is a multi-purpose crop used for food, traditional medicine, timber, fuel, and fodder.\n                            Q: How is jackfruit propagated?\n                            A: Jackfruit is a cross-pollinated crop propagated through seeds.\n                            Q: What variations are observed in jackfruit?\n                            A: Variations include fruit shape, size, density of tubercles, color of rind and flakes, thickness, fiber content, fruit quality, and maturity.\n                            Q: How are superior jackfruit genotypes identified?\n                            A: ICAR-Indian Institute of Horticulture Research surveys traditional jackfruit growing regions to identify superior genotypes based on horticultural traits and organoleptic values.\n                            Q: How many jackfruit trees were identified during the 2016-2020 survey?\n                            A: 125+ jackfruit trees were identified during the survey.\n                            Q: What is unique about the jackfruit tree identified in Tumkur district, Karnataka?\n                            A: The tree fruits during May-July with an average fruit weight of 2.44 kg, coppery red flakes, high carotenoids, and lycopene content.}",
    "{ Q: What makes the Siddu Jack variety of jackfruit special?\n                            A: The Siddu Jack variety has high antioxidant activity and potential health benefits, making it a functional food.\n                            Q: Who identified the Siddu Jack variety and how was it promoted?\n                            A: ICAR-Indian Institute of Horticultural Research identified the Siddu Jack variety and promoted it through mass media, research journals, official websites, and jackfruit diversity fairs.\n                            Q: How was the farmer involved in the commercialization of the Siddu Jack variety?\n                            A: The farmer was recognized as a custodian of genetic diversity, trained in propagation techniques, and given 75% of the revenue generated from commercialization.\n                            Q: What was the outcome of the commercialization of the Siddu Jack variety?\n                            A: The farmer produced over 25,000 saplings, distributed them to other farmers, and earned a gross income of Rupees twenty-five lakhs within two years.\n                            Q: How was another elite jackfruit variety identified?\n                            A: Through participatory breeding research with local farmers, a 12-year-old seedling jack tree was identified in Tumkur district of Karnataka.\n                            Q: What are the characteristics of tamarind as a crop?\n                            A: Tamarind is widely adaptable, suitable for marginal lands, starts bearing fruit from 6-8 years, and has a productive life of 50-70 years.\n                            Q: What is the yield of a healthy tamarind tree?\n                            A: A healthy tamarind tree yields about 50-100 kg of fruits, harvested in multiple pickings over an 8-10-week period.\n                            Q: What are the uses of tamarind pulp and its by-products?\n                            A: Tamarind pulp is the economic part, while the seed, shell, and fiber are useful for various purposes.\n                            Q: Why should tamarind receive more attention as a crop?\n                            A: Tamarind has nutritional and adaptive features that can help tackle malnutrition, climate change adaptation, and provide livelihood opportunities for rural India.}",
    "{ Q: What is the significance of the L1 accession in Nandihalli village?\n                            A: L1 accession is superior in yield and quality traits, providing employment and income opportunities for the villagers.\n                            Q: How does the processing of L1 tamarind create employment?\n                            A: One person can process 15-20 kg pods per day and earn around Rs 400, creating employment for six months.\n                            Q: What are the different products obtained from L1 tamarind processing?\n                            A: The products obtained are pulp, seeds, and shell chips, which are sold at different rates.\n                            Q: How does collective marketing benefit the L1 tamarind producers?\n                            A: Collective marketing provides livelihood and regular income, improving the rural economy.\n                            Q: How did Gandhiji's vision help improve the rural economy?\n                            A: Gandhiji believed in improving rural economy through enhanced farmers' income, leading to overall country development.\n                            Q: What role did NRC for Banana play in exporting Nendran Bananas?\n                            A: NRC for Banana collaborated with APEDA and Fair Exports Pvt. Ltd. to make the first shipment of Nendran Bananas to West Asia.\n                            Q: How did marketing with a Geographical Indicator help Malihabadi Dusseri mango producers?\n                            A: GI tag (G-125) helped the farmers sell their produce at a premium price of Rs. 60 kg-1.\n                            Q: Why are ecosystem services important for horticultural ecosystems?\n                            A: Ecosystem services provide benefits like water filtration, habitat for diverse flora and fauna, and recreation opportunities.\n                            Q: How do horticultural ecosystems contribute to pollination and biocontrol?\n                            A: They are habitats for wild bees and natural enemies, which are important as pollinators and biocontrol agents.}",
    "{ Q: What is the potential of perennial trees, herbs, and associated flora and fauna in contributing to the environment?\n                            A: They have great potential to contribute to the environment beyond regular crop yields.\n                            Q: What did the Indian Institute of Horticultural Research study about multi-varietal mango orchards?\n                            A: They studied the ecosystem services provided by multi-varietal mango orchards.\n                            Q: What benefits do multi-varietal mango orchards provide compared to mono-varietal orchards?\n                            A: They provide an array of benefits, including denser and diverse pollinator fauna and beneficial arthropods.\n                            Q: How does the pollinator fauna in multi-varietal orchards differ from mono-varietal orchards?\n                            A: The pollinator fauna in multi-varietal orchards is denser and diverse due to the availability of floral resources for longer periods.\n                            Q: What is the role of honeybees in agro-ecosystems?\n                            A: Honeybees provide the most essential ecosystem service, pollination, in agro-ecosystems.\n                            Q: How do multi-varietal orchards contribute to non-marketable ecosystem services?\n                            A: They contribute by adding organic matter to the soil and carbon sequestration.\n                            Q: How does beekeeping impact rural economies?\n                            A: Beekeeping plays a major role in rural economy by providing additional income and value addition.\n                            Q: What initiatives have been taken to promote beekeeping among farmers?\n                            A: Capacity building, providing bee colonies, and conducting awareness sessions have been initiated.\n                            Q: How does the new line of high-yielding aonla (CISH-A—33) contribute to nutritional security?\n                            A: It is rich in ascorbic acid and polyphenols, contributing to nutritional security.\n                            Q: What was Gandhiji's belief about fruits and vegetables in his diet?\n                            A: Gandhiji emphasized fruits and vegetables as a major part of his diet, believing in the curative value of indigenous fruits.}",
    "{ Q: What is the special feature of the pomegranate hybrid Pur Lal?\n                            A: Pur Lal is rich in vitamin C and anthocyanin content and has high iron content compared to other pomegranate varieties.\n                            Q: Why has sweet potato gained popularity recently?\n                            A: Sweet potato has gained popularity due to its high nutritive value.\n                            Q: What are the notable features of the sweet potato variety Bhu Sona?\n                            A: Bhu Sona is rich in carotene, tolerant to salinity, and suitable for cultivation in eastern states.\n                            Q: What are some nutritionally superior varieties of fruits and vegetables developed by IIHR?\n                            A: IIHR has developed lycopene-rich guava and tomato, carotenoid-rich mango and pumpkin, vitamin C-rich guava and chili, and antioxidant-rich leafy vegetables.\n                            Q: What is special about the new drumstick line IIHR-D-16?\n                            A: IIHR-D-16 records 135 fruits per plant compared to PKM-1 (105 fruits/plant) and has a good nutritional profile.\n                            Q: Which leafy vegetable contains higher phenolics and antioxidant potential?\n                            A: Enhydra fluctuans (locally called HilMilchi) contains higher phenolics and antioxidant potential.\n                            Q: How have tuber crops improved the livelihood of the Nicobarese tribe in Andaman and Nicobar Islands?\n                            A: The introduction of tuber crops in their Tuhet Garden System has increased employment generation and ensured livelihood for the younger generation.\n                            Q: What is the significance of kitchen gardens in rural areas?\n                            A: Kitchen gardens ensure nutritional security in rural areas by providing access to nutritious vegetables.\n                            Q: How has the Arka vegetable seed kit program impacted rural households in Orissa?\n                            A: The program has provided 400 adopted households in 25 villages with Arka vegetable seed kits for kitchen gardens and training on various horticultural practices.}",
    "{ Q: What new crops were introduced in tribal areas?\n                            A: Teasel gourd, ivy gourd, and pointed gourd were introduced.\n                            Q: Which regions were explored for mushroom species?\n                            A: Western Ghats of Karnataka, Andaman Islands, Gujarat, Rajasthan, Madhya Pradesh, Sikkim, and Manipur.\n                            Q: How many mushroom species were documented?\n                            A: 392 species of mushrooms were documented.\n                            Q: How many mushroom species are being maintained at IIHR?\n                            A: Germplasm of 90 species of edible, medicinal, and ornamental mushrooms are being maintained.\n                            Q: Which mushroom species have been domesticated and commercialized?\n                            A: Twelve indigenous species of culinary mushrooms have been domesticated and commercialized.\n                            Q: What is the purpose of developing sporeless and low-spored mutants?\n                            A: To avoid Farmers' lung disease and hay fever related to respiratory problems.\n                            Q: How was solar energy integrated into mushroom production?\n                            A: Solar energy was integrated to save up to 40% of electrical energy used in mushroom production.\n                            Q: What indigenous machinery was developed for mushroom production?\n                            A: Grain cleaner, grain boiler, boiled grain and chalk powder mixer, bag filler, inoculator, and paddy straw pasteurizer.\n                            Q: What value-added mushroom products were developed?\n                            A: Mushroom fortified 'Arka Rasam powder' and seven variants of Arka mushroom chutney powders with high nutrition.}",
    "{ Q: What is the purpose of the outdoor mushroom growing chamber?\n                            A: The outdoor mushroom growing chamber helps rural farmers with space and resource constraints to grow mushrooms.\n                            Q: How is the mushroom growing chamber powered?\n                            A: The mushroom growing chamber is integrated with solar energy.\n                            Q: What is the benefit of using paddy straw in mushroom production?\n                            A: Using paddy straw in mushroom production reduces straw burning.\n                            Q: How many mechanized spawn production labs have been established?\n                            A: Twenty-six mechanized spawn production labs have been established in 14 states.\n                            Q: What is the primary requirement for mushroom cultivation?\n                            A: Quality spawn is the primary requirement for mushroom cultivation.\n                            Q: How were technology transfer activities conducted for rural populations?\n                            A: Technology transfer activities were conducted through Tribal Sub Plan and NEH funds of ICAR.\n                            Q: Where were spawn production laboratories established?\n                            A: Spawn production laboratories were established at Saregachi, KVK Nellore, and KVK Mudigere.\n                            Q: Who received training in mushroom cultivation and spawn production in 2018?\n                            A: Rural women and youth in Tripura and Arunachal Pradesh received training in mushroom cultivation, spawn production, and value-added products.\n                            Q: What is the Seed Village concept of ICAR?\n                            A: The Seed Village concept empowers farmers to produce seeds of improved varieties, providing employment and profitable returns.}",
    "{ Q: What is the purpose of distributing shers to trained turmeric FPOs?\n                            A: To produce polished dried turmeric of high quality and secure better prices in the market.\n                            Q: What is bio-encapsulation and its significance in agriculture?\n                            A: Bio-encapsulation is a technique that promotes the use of beneficial microorganisms in agriculture, reducing chemical inputs and enhancing sustainability.\n                            Q: What is the objective of the Tribal Sub-plan by ICAR?\n                            A: To contribute to the livelihood and nutritional security of rural areas since 2013.\n                            Q: What activities were conducted in Mysuru and Tumkuru districts of Karnataka?\n                            A: Many demonstrations on livelihood security were conducted in these districts.\n                            Q: What technologies were distributed to rural areas in eastern India in 2019?\n                            A: Beehives, seeds of vegetable and flower crops, mushroom spawn, kitchen garden vegetable kits, and microbial formulations were distributed.\n                            Q: How has the production of planting materials helped tribal areas?\n                            A: It has helped cater to the planting material requirement of adjoining regions and nearby blocks of the district.\n                            Q: What impact did the promotion of commercial vegetables have in Gajapati?\n                            A: It increased the seasonal income of farmers in the region.\n                            Q: What activities were conducted under the tribal sub-plan by ICAR-Indian Institute of Spices Research?\n                            A: Several training programs were conducted in selected tribal areas across the country.\n                            Q: What is the focus of the value chain approach in the tribal sub-plan activities?\n                            A: The focus is on creating sustainable livelihood activities for rural communities.}",
    "{ Q: What is the purpose of the Horticulture Nursery and Training Institute in Visakhapatnam District?\n                            A: The Horticulture Nursery and Training Institute in Visakhapatnam District established a master black pepper nursery and distributed improved black pepper cuttings to tribal farmers.\n                            Q: How many rooted black pepper cuttings were distributed to tribal farmers in 2018?\n                            A: Five thousand rooted black pepper cuttings of improved varieties were distributed to tribal farmers in 2018.\n                            Q: Who conducted training on mushroom cultivation and value addition at BR Hills?\n                            A: Training on mushroom cultivation was conducted at BR Hills in collaboration with NGO Vivekananda Girijana Kalyana Kendra (VGKK).\n                            Q: How many RTF bags were given to women participants for mushroom cultivation?\n                            A: Every month, 10 ready to fruit (RTF) bags were given to women participants for six months.\n                            Q: How many RTF bag production units were established in 2018-19?\n                            A: One RTF bag production unit was established at People trust, NGO, Srirmanahalli, Bengaluru rural district, College of Agriculture Limbuchera Agartala (Tripura), KVK, Roing, Lower Debang District (Arunachal Pradesh) and College of Horticulture & Forestry, Pasighot (Arunachal Pradesh).\n                            Q: How many families benefited from the RTF bag production units in 2018-19?\n                            A: Over 1000 families benefited from the RTF bag production units in 2018-19.\n                            Q: Who was honoured during the National Horticultural Fair conducted in 2018-2020?\n                            A: Progressive farmers from rural areas belonging to tribal communities and socially deprived societies were honoured during the National Horticultural Fair conducted in 2018-2020.\n                            Q: How many demonstrations on tuber crops technologies were conducted in 2019?\n                            A: 1160 demonstrations with an area of 344.65 acres were undertaken in 21 crops and 42 varieties/hybrids of the institute involving 41 KVKs in NEH states (Mizoram, Nagaland, Meghalaya, Tripura, Sikkim and Arunachal Pradesh) in 2019.\n                            Q: How many Arka series varieties were demonstrated in Assam in 2018-19?\n                            A: Demonstration of 24 Arka series varieties were taken up in an area of 113.5 acres in 2018-19 alone in Assam.}",
    "{ Q: What is the purpose of the mushroom cultivation project in BR Hills, Karnataka?\n                            A: The purpose of the project is to empower rural women and provide them with a livelihood.\n                            Q: What are the improved varieties demonstrated by ICAR-CTCRI under the TSP program?\n                            A: The improved varieties demonstrated by ICAR-CTCRI are elephant foot yam and Colocasia.\n                            Q: What items were distributed to KVKS in the NEH region for organic pest management?\n                            A: Arka Vegetable Special (250 kg) and Arka Neem soap (200 kg) were distributed to 10 KVKS in the NEH region.\n                            Q: What is the objective of demonstrating improved varieties of yard long bean in North Eastern States?\n                            A: The objective is to enhance productivity and income of rural farmers.\n                            Q: What is the significance of the tomato hybrid (Arka Samrat) demonstration in Champai, Mizoram?\n                            A: The demonstration aims to improve tomato productivity and income for farmers in the region.\n                            Q: What is the purpose of establishing a master black pepper nursery by ICAR IISR at Paderu, Andhra Pradesh?\n                            A: The purpose is to promote black pepper cultivation and improve the livelihood of farmers.\n                            Q: What is the main focus of the \"Horticulture for Rural Livelihood and Nutritional Security\" program?\n                            A: The main focus is to empower rural people through improved livelihood with horticultural technologies.\n                            Q: What is Mahatma Gandhi's vision of agriculture, according to the text?\n                            A: Mahatma Gandhi's vision of agriculture is to achieve a prosperous rural India through sustainable research-led innovations in horticulture.\n                            Q: What is the significance of indigenous cattle in Indian tradition and culture?\n                            A: Indigenous cattle are considered a part of the family and accorded motherly status as \"Gaumata\" in Indian tradition.\n                            Q: What are the health benefits of cow milk, as described in the text?\n                            A: Cow milk enhances tissue regeneration, improves immune response for disease resistance, and is considered a good food during convalescence.}",
    "{ Q: What is India's position in terms of cattle population?\n                            A: India has the second-highest cattle population in the world, with 193.46 million as per the 20th Livestock census.\n                            Q: What is the share of cattle in the Indian Livestock population?\n                            A: Cattle constitute 36.04% of the Indian Livestock population.\n                            Q: How many registered cattle breeds are there in India?\n                            A: There are 50 registered cattle breeds in India.\n                            Q: What are the utility classifications of Indian cattle breeds?\n                            A: Indian cattle breeds are classified as milch (4), dual (10), and draft (36).\n                            Q: What was the annual milk yield in India in 2018-19?\n                            A: The annual milk yield in India in 2018-19 was 187.75 million tonnes.\n                            Q: What is the per capita availability of milk in India?\n                            A: The per capita availability of milk in India is 394 g day-1.\n                            Q: How do Indian cattle contribute to the economy apart from milk?\n                            A: Indian cattle contribute to draft power, bio-manure, fuel, medicines, and leather production.\n                            Q: Which countries have imported Indian cattle breeds for crossbreeding?\n                            A: Brazil, West Indies, Australia, Kenya, and Indonesia have imported Indian cattle breeds.\n                            Q: What did Mahatma Gandhi say about the cow?\n                            A: Gandhiji said, \"The cow to me means the entire sub-human world extending man's sympathies beyond his own species.\"}",
    "{ Q: Who did Gandhi compare the cow to in terms of usefulness?\n                            A: Gandhi compared the cow to a mother, saying she was as useful dead as when she is alive.\n                            Q: What did Gandhi believe about cow protection?\n                            A: Gandhi believed that cow protection was one of the most wonderful phenomena in human evolution.\n                            Q: How did Gandhi feel about killing a human or a cow for protection?\n                            A: Gandhi said he would not kill a human for the protection of a cow, nor would he kill a cow for saving a human life.\n                            Q: What did Gandhi think was the solution to ending cow slaughter?\n                            A: Gandhi believed that knowledge, education, and kindness towards cows could end cow slaughter.\n                            Q: What were Gandhi's suggestions for improving the condition of cows in India?\n                            A: Gandhi suggested performing duty towards cows, learning cattle breeding, replacing cruel castration methods, and reforming Pinjrapoles.\n                            Q: What was Gandhi's vision for genetic improvement of cattle?\n                            A: Gandhi believed in scientific practicality and suggested cattle development to ensure a good supply of milk.\n                            Q: What breed of cattle did Gandhi use for his herd in 1948?\n                            A: Gandhi used the local Gir breed for his herd in 1948.\n                            Q: What was the outcome of Gandhi's herd improvement efforts?\n                            A: The herd made excellent progress, and from 1957 to 1962, the cows won first and second prizes for highest milk yield in the country.\n                            Q: What organization did Manibhai Desai found based on Gandhi's cattle development work?\n                            A: Manibhai Desai founded the Bharatiya Agro-Industries Foundation (BAIF) based on Gandhi's cattle development work.\n                            Q: What was the name of the milk cooperative started by Gandhi in 1931?\n                            A: Gosanwardhan Goras Bhandar}",
    "{ Q: What is the Gosanwardhan Goras Bhandar?\n                            A: Gosanwardhan Goras Bhandar is a milk cooperative that operates based on Gandhiji's principles.\n                            Q: How many societies and farmers are associated with the milk cooperative?\n                            A: The milk cooperative has formed 15 societies comprising about 1,000 farmers.\n                            Q: How much milk is collected daily from farmers by the cooperative?\n                            A: On average, 12,000-13,000 litres of cow milk is collected daily from farmers.\n                            Q: What is the procurement price of milk offered by the cooperative?\n                            A: The cooperative offers a procurement price of Rs. 36 per litre of milk to dairy farmers.\n                            Q: How does the cooperative process milk and milk products?\n                            A: The cooperative doesn't process milk but provides fresh milk to consumers, and prepares milk products manually using a furnace.\n                            Q: What is the Indigenous Breeds Project (IBP)?\n                            A: IBP is a project by ICAR-CIRC for the conservation and genetic improvement of important indigenous cattle breeds of India.\n                            Q: Which cattle breeds were initially taken up for improvement under the IBP?\n                            A: Hariana and Ongole breeds of cattle were initially taken up for improvement under the IBP.\n                            Q: How was the genetic improvement of Ongole cattle undertaken?\n                            A: The genetic improvement of Ongole cattle was undertaken in collaboration with Livestock Research Station at Lam under SVVU from 1988 to March 2014.\n                            Q: What is the draught power of Ongole cattle?\n                            A: The draught power of Ongole cattle varies from 0.60 to 0.72 HP among bulls.\n                            Q: Which organizations are involved in the genetic improvement of Hariana cattle?\n                            A: The genetic improvement of Hariana cattle was undertaken in collaboration with the CCS Haryana Agriculture University, Hisar (1989 to 2009).}",
    "{\nQ: What is the purpose of data recording for Gir, Kankrej, and Sahiwal cows?\nA: The purpose of data recording is to involve farmers and register their animals in the respective home tracts for breed improvement.\n\nQ: Where are the data recording units for Sahiwal breed located?\nA: The data recording units for Sahiwal breed are located at GADVASU, Ludhiana, LUVAS, Hisar, and GBPUA&T, Pantnagar.\n\nQ: How many Gir, Kankrej, and Sahiwal cows have been registered for data recording?\nA: 13557 Gir, 6200 Kankrej, and 813 Sahiwal cows have been registered for data recording.\n\nQ: How many frozen semen doses of Gir, Kankrej, and Sahiwal cattle have been produced?\nA: 219823 frozen semen doses of Gir, 143482 of Kankrej, and 174172 of Sahiwal cattle have been produced.\n\nQ: How many semen doses of Gir, Kankrej, and Sahiwal breeds are available for future breeding?\nA: 160708, 71436, and 88642 semen doses of Gir, Kankrej, and Sahiwal, respectively, are available for future breeding.\n\nQ: How many improved female calves of Gir, Kankrej, and Sahiwal breeds have been produced?\nA: 5490 improved female calves of Gir, 2743 of Kankrej, and 1003 of Sahiwal breeds have been produced.\n\nQ: What is the average lactation yield of elite females of Gir, Kankrej, and Sahiwal breeds?\nA: The average lactation yield of elite females is 3238 kg in Gir, 3553 kg in Kankrej, and 3393 kg in Sahiwal breeds.\n\nQ: What is the improvement in milk production of Frieswal cattle from 2014 to 2019?\nA: There was an improvement of 1.55% in milk production of Frieswal cattle from 3285 in 2014 to 3336 kg in 2019 in a standard lactation of 300 days.\n\nQ: What are the overall improvements in milk yields of Gir, Sahiwal, and Kankrej breeds during 2010 to 2019?\nA: The overall improvements in milk yields of Gir, Sahiwal, and Kankrej breeds during 2010 to 2019 were found to be 36.73, 24.33, and 20.02%, respectively.\n\nQ: What are the efforts being made for characterization and conservation of cattle genetic resources in India?\nA: Sustained efforts are being made by ICAR-National Bureau of Animal Genetic Resources (NBAGR), Karnal for characterization and conservation of the remaining cattle genetic resources of the country. The non-descript cattle of the country are being studied for their morphological, biochemical, and molecular characteristics for their recognition as breeds. As such, till date, 50 cattle breeds of the country have been characterized and gazette notified in The Gazette of Govt. of India. NBAGR is also working on the in-situ and ex-situ conservation of the endangered/critical/threatened cattle breeds. A national gene bank is also being maintained at NBAGR with semen from a large number of indigenous cattle breeds.\n}",
    "{ Q: What breeds have been conserved through semen cryopreservation?\n                            A: Rathi, Nagori, Ponwar, Kherigarh, Bargur breeds have been conserved through semen cryopreservation.\n                            Q: Which breeds have been conserved in situ?\n                            A: Tharparkar, Krishna Valley, and Ongole breeds have been conserved in situ.\n                            Q: How many semen doses have been cryopreserved at NBAGR gene bank?\n                            A: A total of 133608 semen doses of 24 indigenous cattle breeds have been cryopreserved.\n                            Q: What was the most remarkable achievement of the Network Project on AnGR?\n                            A: The revival of Krishna Valley cattle in Maharashtra and Karnataka was the most remarkable achievement.\n                            Q: What physico-chemical attributes were studied in Sahiwal, Tharparkar, and Gir breeds?\n                            A: The studied attributes included α-casein, β-casein, κ-casein, whey-protein fractions, fat, SNF, protein, and mineral content.\n                            Q: Were there any significant differences in compositional parameters between indigenous breeds and crossbred cattle?\n                            A: There were no significant differences in various compositional parameters between indigenous breeds and the HF crossbreed.\n                            Q: How many proteins were identified in the milk proteome of indigenous Sahiwal cattle?\n                            A: More than 6800 proteins were identified in the milk proteome of indigenous Sahiwal cattle.\n                            Q: What are the ARTs used for faster genetic improvement in animals?\n                            A: The ARTs include artificial insemination, multiple ovulation and embryo transfer, in vitro production of embryos, sperm sexing, and intracytoplasmic sperm injection.\n                            Q: When was the Embryo Transfer facility established at Sabarmati Ashram Gaushala?\n                            A: The Embryo Transfer facility was established at Sabarmati Ashram Gaushala in 1987.\n                            Q: How many embryos have been produced since the inception of the ET project in 1987?\n                            A: Since the inception of the project in 1987, 11584 embryos have been produced.}",
    "{ Q: What is the aim of the Rashtriya Gokul Mission?\n                            A: The aim of the Rashtriya Gokul Mission is to conserve and improve indigenous cattle breeds in India.\n                            Q: How has artificial insemination impacted the dairy industry?\n                            A: Artificial insemination has led to rapid improvement in the dairy industry through intense genetic selection of bulls.\n                            Q: Who performed the first successful insemination?\n                            A: The first successful insemination was performed by Spallanzani in 1784.\n                            Q: When was the artificial insemination program first started in India?\n                            A: The artificial insemination program was first started in India at the Palace Dairy Farm, Mysore in 1939.\n                            Q: Who invented the straw for packaging semen?\n                            A: Dr. Sørensen invented the straw for packaging semen in 1940.\n                            Q: When was the first buffalo calf born through AI in India?\n                            A: The first buffalo calf was born through AI in India in 1943.\n                            Q: How many AI centers are currently present in India?\n                            A: India currently has 71,341 AI centers.\n                            Q: What percentage of the total breedable cattle population is covered under the AI program in India?\n                            A: 35% of the total breedable cattle population is covered under the AI program in India.\n                            Q: What is the overall conception rate to artificial insemination in India?\n                            A: The overall conception rate to artificial insemination in India is approaching 40%.\n                            Q: What are the benefits of the indigenous breed improvement program (IBP) and field progeny testing program (FPT) taken up by ICAR-Central Institute for Research on Cattle, Meerut?\n                            A: The IBP and FPT programs exploit the benefits of artificial insemination for the improvement of indigenous cattle breeds.}",
    "{ Q: What is the purpose of the AI program for Indigenous cattle population?\n                            A: The AI program aims to genetically improve the Indigenous cattle population using semen from young bulls born through nominated mating.\n                            Q: How many artificial inseminations were carried out in Sahiwal, Gir, and Kankrej cattle in 2019?\n                            A: 6715 in Sahiwal, 28922 in Gir, and 18547 in Kankrej cattle.\n                            Q: What were the conception rates for Sahiwal, Gir, and Kankrej cattle in 2019?\n                            A: The conception rates were 38.64%, 47.98%, and 47.45%, respectively.\n                            Q: What is the Field Progeny Testing program, and what were its results?\n                            A: The program tests the progeny of selected bulls. In 2019, it resulted in conception rates of 48.5%, 43.9%, 45.0%, and 59.8% in GADVASU, Punjab, KVASU, Kerala, BAIF, Maharashtra, and GBPUAT, Uttarakhand, respectively.\n                            Q: What challenges need to be addressed for improving semen freezing protocols?\n                            A: Challenges include physiological differences in spermatozoa during cryopreservation and lack of knowledge regarding cryo-injuries during cooling semen to sub-zero temperatures.\n                            Q: What is MOET technology, and when was the first embryo transfer calf born in India?\n                            A: MOET is a technology for genetic improvement in livestock. The first embryo transfer calf was born in 1987 at the National Institute of Immunology, New Delhi.\n                            Q: What problems are associated with embryo transfer in indigenous cows?\n                            A: Problems include cervical hypertrophy and fibrosis in Rathi cows, limiting the passage of the catheter for embryo recovery or transfer.\n                            Q: How many embryos were transferred in 2017 according to DAHD and JK Tryst data?\n                            A: According to DAHD, 277 embryos were transferred, while JK Tryst data reports around 4000 embryos transferred.\n                            Q: What is the milk production of Red Sindhi cows at the Animal Breeding Farm of Kalsi?\n                            A: Red Sindhi cows at this farm have milk production of more than 4200 kg per lactation.}",
    "{ Q: What is OPU-IVF technology used for in agriculture?\n                            A: OPU-IVF technology is used for in-vitro embryo production and genetic improvement of indigenous cattle.\n                            Q: How does Ovum Pick-Up (OPU) work?\n                            A: OPU is a technique for collecting oocytes from live animals of known pedigree repeatedly over a long period.\n                            Q: What is the average rate of blastocyst formation using in-vitro procedures?\n                            A: The average rate of blastocyst formation using in-vitro procedures is around 30-40%.\n                            Q: What is the purpose of using OPU-IVF technology in clinically sub-fertile or aged cattle?\n                            A: The purpose is to obtain high-value oocytes for using in IVF and embryo production.\n                            Q: What was the outcome of the OPU-IVF study at NDRI, Karnal?\n                            A: Out of 73 oocytes collected, 24 reached the 2-4 cell stage at day 2 post-fertilization, with a cleavage rate of 33%.\n                            Q: When was India's first female Sahiwal calf named 'Holi' born using OPU-IVF technology?\n                            A: The calf was born in 2007 at ICAR-NDRI, Karnal.\n                            Q: What was the achievement of JK Bovagenix (JK Trust) using OPU-IVF technology?\n                            A: They established 94 IVF pregnancies from a Gir Donor cow 'GAURI' in a span of 16 months.\n                            Q: What is the purpose of semen sexing in agriculture?\n                            A: Semen sexing enhances milk production and limits the population of male cattle/stray cattle.\n                            Q: How many semen stations have been established in different states in India?\n                            A: A total of 12 semen stations have been established in different states in India.}",
    "{ Q: What is the claim made by india.com regarding sexed semen in India?\n                            A: India.com claims to make available sexed semen of Sahiwal, Gir, and Red Sindhi bulls in India.\n                            Q: Where are sperm cell sorters employed in India?\n                            A: Sperm cell sorters are employed in Bengal, Kerala, Maharashtra, and Uttarakhand.\n                            Q: Which Indian states are using sexed semen of exotic breeds?\n                            A: Punjab, Haryana, Kerala, and West Bengal are using sexed semen of exotic breeds.\n                            Q: What are the limiting factors for the wider use of sexed semen in India?\n                            A: High cost and poor pregnancy rates are the limiting factors for the wider use of sexed semen.\n                            Q: When was the Imperial Institute of Animal Husbandry and Dairying established?\n                            A: It was established in 1923.\n                            Q: What was the recommendation of the Royal Commission on Agriculture (RCA) in 1926?\n                            A: RCA suggested that the type of cow most suitable for the farmers in the villages would be the one which would produce a strong calf and yield around 1000 to 1500 pounds of milk per lactation.\n                            Q: Who were the animal husbandry experts invited by the Government in 1937 and 1938?\n                            A: Norman Wright (1937) and Oliver (1938) were invited by the Government.\n                            Q: What did Norman Wright and Oliver recommend for the improvement of indigenous stock?\n                            A: They recommended improvement of indigenous stock by means of selective breeding, better feeding, and improved management.\n                            Q: What was the objective of the Key Village Scheme (KVS) launched in 1952?\n                            A: The objective of KVS was the multiplication of superior germplasm from the established farms in selected areas in the breeding tracts of the breeds.}",
    "{ Q: What was the initial focus of the Key Village Block Scheme (KVS)?\n                            A: The KVS initially focused on feeding, disease control, and improved animal husbandry practices.\n                            Q: How did the Key Village Block Scheme (KVS) expand over time?\n                            A: The KVS expanded from 146 blocks in the 1st Five Year Plan to 197 blocks and 64 urban AI centers in the second five year plan.\n                            Q: What was the main objective of the Intensive Cattle Development Projects (ICDP)?\n                            A: The ICDP aimed to increase milk production to feed public sector dairy plants in urban areas.\n                            Q: How many breedable cows and buffaloes were targeted by the ICDP?\n                            A: The ICDP aimed to cover 1,00,000 breedable cows and buffaloes.\n                            Q: What was the expected increase in milk production by the ICDP over five years?\n                            A: The ICDP aimed to increase milk production by about 30% over five years.\n                            Q: What was the focus of the experimental breeding program under ICDP?\n                            A: The experimental breeding program focused on crossbreeding local animals with Jersey bulls imported from Australia and the USA.\n                            Q: What were some of the cross-breeding projects initiated during the ICDP period?\n                            A: Some projects included the Indo-Swiss project at Mattupatty, Indo-German projects at Palampur and Mandi, and the Indo-Danish Project at Hessarghatta.\n                            Q: What was Operation Flood, and who undertook it?\n                            A: Operation Flood was a dairy development program based on the Amul model, undertaken by the National Dairy Development Board (NDDB).\n                            Q: When was Operation Flood initiated?\n                            A: Operation Flood was initiated in 1970.\n                            Q: What was the role of Bhartiya Agro-Industries Foundation (BAIF) in crossbreeding projects?\n                            A: BAIF was involved in large-scale crossbreeding projects in different parts of the country.}",
    "{ Q: What are the three Operation Flood missions in India?\n                            A: Operation Flood I (1970-81), Operation Flood II (1981-85), and Operation Flood III (1985-94).\n                            Q: Who were the key players in Operation Flood?\n                            A: Small-holder milk producers, milk producer's cooperative societies, AI network of state/central government, and bull mother farms.\n                            Q: When did the National Livestock Mission commence?\n                            A: The National Livestock Mission commenced in 2014-15.\n                            Q: Which department manages the National Livestock Mission?\n                            A: Department of Animal Husbandry Dairying and Fisheries (Ministry of Agriculture).\n                            Q: What is the main objective of the National Programme for Bovine Breeding & Dairy Development (NPBBDD)?\n                            A: To improve the bovine breeding and dairy services of the country.\n                            Q: How many states participated in the National Programme for Bovine Breeding (NPBB)?\n                            A: 27 states participated in the National Programme for Bovine Breeding (NPBB).\n                            Q: What is the duration of the National Dairy Plan Phase I (NDP I)?\n                            A: The National Dairy Plan Phase I (NDP I) was from 2011-12 to 2018-19.\n                            Q: Which 14 states are the focus of the National Dairy Plan Phase I (NDP I)?\n                            A: Andhra Pradesh, Bihar, Gujarat, Haryana, Karnataka, Kerala, Madhya Pradesh, Maharashtra, Odisha, Punjab, Rajasthan, Tamil Nadu, Uttar Pradesh, and West Bengal.\n                            Q: What are the objectives of the Rashtriya Gokul Mission?\n                            A: To conserve and develop indigenous breeds, enhance milk production and productivity, and upgrade the genetic makeup of cattle.\n                            Q: What are the two components of the Rashtriya Gokul Mission?\n                            A: National Programme for Bovine Breeding and National Programme for Dairy Development.}",
    "{\nQ: What is the Rashtriya Gokul Mission (RGM)?\nA: RGM is a government initiative aimed at improving indigenous cattle breeds, enhancing milk production, upgrading nondescript breeds, and distributing disease-free high genetic merit bulls for natural service.\n\nQ: Who are the implementing agencies for RGM?\nA: The implementing agencies for RGM are State Implementing Agencies (SIA) such as Livestock Development Boards and State Goseva Aayogs, along with other organizations like CFSPTI, CCBFs, ICAR, universities, NGOs, Cooperative Societies, and Gaushalas.\n\nQ: What are the main objectives of RGM?\nA: The main objectives of RGM are to undertake breed improvement programs, enhance milk production, upgrade nondescript breeds using elite indigenous breeds, and distribute disease-free high genetic merit bulls.\n\nQ: Which indigenous breeds are used for upgrading nondescript breeds under RGM?\nA: Elite indigenous breeds like Gir, Sahiwal, Rathi, Deoni, Tharparkar, and Red Sindhi are used for upgrading nondescript breeds under RGM.\n\nQ: What is the plan for establishing the National Kamdhenu Breeding Centre?\nA: The plan is to establish the National Kamdhenu Breeding Centre in two states.\n\nQ: What role does ICAR play in cattle germplasm characterization?\nA: ICAR is determined to characterize the remaining 73% of cattle germplasm, which is essential for sustained growth in the dairy sector.\n\nQ: How have genetic improvement programs contributed to milk production in India?\nA: Genetic improvement programs under AICRP and government-run schemes have significantly increased milk production in the country through the improvement of indigenous breeds and development of crossbreds using exotic breeds.\n\nQ: What technologies have improved the productivity of cattle germplasm?\nA: Artificial insemination, embryo transfer technology (ETT), and genetic selection have improved the productivity of cattle germplasm.\n\nQ: What potential impact do new technologies like OPU-IVF and cloning have on indigenous elite cattle population enhancement?\nA: OPU-IVF and cloning have the potential to greatly impact the enhancement of the indigenous elite cattle population.\n\nQ: How does the high-density SNP chip-based genomic selection contribute to achieving self-sufficiency in the country?\nA: The high-density SNP chip-based genomic selection may prove to be a vital tool for achieving the goal of self-sufficiency in the country by improving the genetic makeup of indigenous cattle breeds.\n}",
    "{ Q: What is the significance of the livestock sector in India?\n                            A: The livestock sector contributed Rs10.44 lakh crores (33.25% of the agricultural and allied sector) to the Indian economy in 2017-18 and employs 164.4 lakh workers.\n                            Q: How does livestock farming support Indian farmers?\n                            A: It acts as a safety valve against income shocks during crop farming and natural calamities.\n                            Q: What is India's global ranking in milk production?\n                            A: India has been the largest milk producer in the world since 1998.\n                            Q: What is the current goat population in India?\n                            A: As per the 20th livestock census in 2019, the goat population in India is 148.88 million.\n                            Q: What is India's global ranking in goat milk, meat, and skin production?\n                            A: India ranks first in goat milk production and second in goat meat and skin production.\n                            Q: How much does the goat sector contribute to the Indian economy?\n                            A: The goat sector contributed Rs.38,590 crores (9% of the total value of output from the livestock sector) to the Indian economy in 2010-11.\n                            Q: Who primarily rear goats in India?\n                            A: More than 75% of goats are reared by marginal and landless households with less than 2.0 ha of land.\n                            Q: What are the primary uses of sheep and goats?\n                            A: Sheep and goats are primarily reared for meat, wool, hides, and milk.\n                            Q: What is the global demand trend for livestock products?\n                            A: The demand for livestock products, particularly chevon and mutton, is rising globally due to increasing per capita income in developing countries.\n                            Q: How does sustainable goat production align with Mahatma Gandhi's vision?\n                            A: Sustainable goat production supports Gandhiji's vision of self-reliant rural India by utilizing local resources and strengthening the rural economy.}",
    "{\nQ: What is the significance of goats in rural India?\nA: Goats play a key role in self-sufficiency and sustainable rural development by fulfilling basic needs like food and clothing, especially for marginal and small farmers.\n\nQ: How many goat breeds are there in India?\nA: There are 34 goat breeds in India, distributed across different ecologies and performing well in their habitats.\n\nQ: Who primarily owns and rears goats in India?\nA: Goats are primarily owned and reared by marginal and small farmers in India.\n\nQ: What is the demand trend for goat meat/mutton?\nA: The demand for goat meat/mutton has increased with the rise in per capita income and other associated factors.\n\nQ: What is the contribution of goat milk to the central milk pool?\nA: Goat milk contributes 4% to the central milk pool.\n\nQ: How has goat ownership changed between 2001 and 2007?\nA: The share of goat ownership with the marginal category increased by 2% between 2001 and 2007.\n\nQ: How has the flock size per goat rearing household changed between 2002 and 2013?\nA: The flock size per goat rearing household has shown an increasing trend among all land holding categories between 2002 and 2013.\n\nQ: What is the growth trend in the goat population in India between 1982 and 2019?\nA: The goat population in India increased from 95 to 148.88 million between 1982 and 2019, with the highest increase of 16% recorded between 1982 and 1987.\n\nQ: What is the primary factor driving the growth in goat population?\nA: The growth in goat population is demand-driven, with urban areas experiencing a faster rise in demand for livestock products as income increases.\n\nQ: What is the extensive system of goat management in India?\nA: The extensive system of goat management in India involves rearing goats under an extensive production system, primarily depending on common resources like permanent pastures and grazing lands.}",
    "{ Q: What are the three main goat rearing systems?\n                            A: The three main goat rearing systems are extensive, semi-intensive, and intensive.\n                            Q: What is the primary characteristic of the extensive goat rearing system?\n                            A: The extensive system is based on low resource input and low productivity.\n                            Q: How does the semi-intensive system improve goat productivity?\n                            A: The semi-intensive system combines limited free-range grazing and stall-feeding, resulting in better nutrition and improved body weight gains, milk yield, wool yield, and prolificacy.\n                            Q: What does the intensive goat rearing system involve?\n                            A: The intensive system includes grazing on developed pastures and/or complete stall-feeding on cultivated fresh or conserved fodders, crop residues, and concentrates.\n                            Q: How many registered goat breeds are there in India?\n                            A: There are 34 registered breeds of goats in India.\n                            Q: What are the main goat breeds in the Northern Temperate Region of India?\n                            A: Chegu, Changthangi, and Gaddi are the main breeds in the Northern Temperate Region.\n                            Q: What are the main goat breeds in the North-Western Region of India?\n                            A: The main breeds in the North-Western Region are Beetal, Jamunapari, Barbari, Sirohi, Marwari, Jakhrana, Surti, Gohilwadi, Kutchi, Zalawadi, and Mehsana.\n                            Q: What are the main goat breeds in the Southern Region of India?\n                            A: Sangamneri, Osmanabadi, Kanna-aidu, Malabari, KonkanKanyal, Berari, and Black Attapady are the main breeds in the Southern Region.\n                            Q: What is the main goat breed in the Eastern Region of India?\n                            A: Black Bengal is the main breed in the Eastern Region.\n                            Q: What was Mahatma Gandhi's involvement with goat rearing?\n                            A: Mahatma Gandhi had a vision of agriculture that included goat rearing, and he was photographed tending goats in May 1946.}",
    "{ Q: What are the different classifications of Indian goat breeds?\n                            A: Indian goat breeds are classified as high milk producers (Beetal, Jamunapari, Jakharana, Surti), dual purpose-a (meat and milk) (Sirohi, Kutchi, Malabari, Marwari, Mehsana, Zalawadi, Gohilwadi, Sangamneri, Barbari), dual purpose-b (meat and fiber) (Changthangi, Chegu, Gaddi), and meat producers (Black Bengal, Osmanabadi, Kannai-adu, KonkanKanyal, Berari Black, Attapady, Ganjam).\n                            Q: How has goat milk production changed between 2012-13 and 2017-18?\n                            A: Goat milk production increased by 14% between 2012-13 and 2017-18.\n                            Q: How has goat meat production changed between 2012-13 and 2018-19?\n                            A: Goat meat production increased from 0.94 to 1.08 million tons between 2012-13 and 2018-19.\n                            Q: What is the country's status in goat meat export?\n                            A: The country is the largest exporter of sheep and goat meat.\n                            Q: How much goat meat was exported during 2019-20?\n                            A: The country exported 14,128.85 tonnes of sheep and goat meat worth Rs. 646.69 Crores during 2019-20.\n                            Q: What are the major export destinations for goat meat?\n                            A: The major export destinations are UAE, Qatar, Kuwait, Saudi Arabia, Oman, Maldives, and Bahrain.\n                            Q: What is the AICRP on Goat's objective?\n                            A: The AICRP on Goat aims to enhance genetic improvement utilizing the genetic variations in native breeds.\n                            Q: How many breeds and genotypes are covered under the AICRP on Goat?\n                            A: A total of fifteen breeds and three local genotypes are covered through 21 centers across the country.\n                            Q: Which institute coordinates the AICRP on Goat?\n                            A: The Central Institute for Research on Goats (CIRG) coordinates the project.\n                            Q: What has been the impact of the AICRP on Goat?\n                            A: The project has significantly contributed to increasing goat population, body growth, and milk production of goat populations.}",
    "{ Q: What is the main objective of the AICRP on goat improvement project?\n                            A: The project aims to increase the income of goat farmers and enhance food security by implementing a genetic improvement program for goats in different agro-climatic zones.\n                            Q: How many villages and farmers were covered under the AICRP on goat improvement project?\n                            A: A total of 461 villages with 2277 farmers were covered under the project.\n                            Q: How many goat breeds were included in the genetic evaluations under the AICRP project?\n                            A: 15 goat breeds were included in the genetic evaluations.\n                            Q: What are the farm-based units working as best models for in-situ conservation in the natural home tract of the breed?\n                            A: Jamunapari, Barbari, and Sirohi are the farm-based units working as best models for in-situ conservation.\n                            Q: How many elite germplasm of goat breeds were distributed during the last 10 years under the AICRP project?\n                            A: A total of 6030 elite germplasm of Barbari, Jamunapari, Sirohi, and Jakharana goat breeds were distributed during the last 10 years.\n                            Q: What impact did the AICRP project have on the income of goat farmers?\n                            A: The project increased the income of goat farmers by about 30-40%.\n                            Q: What improvement was observed in production and lactation traits by using selected bucks in the AICRP project?\n                            A: There was an improvement of 2-3% in production and lactation traits by using selected bucks.\n                            Q: What significant improvement was recorded in the average body weight gain and milk production in farmers' flocks under the AICRP project?\n                            A: A significant improvement of 5-20% in average body weight gain and 15-30% in milk production was recorded in farmers' flocks.\n                            Q: What goat breeds were facilitated for in situ and ex-situ conservation under the AICRP project?\n                            A: Barbari, Jamunapari, Sangamneri, and Surti threatened goat breeds were facilitated for in situ and ex-situ conservation.\n                            Q: What technological interventions significantly improved survival rates with significant reduction in morbidity in the AICRP project?\n                            A: The technological interventions that significantly improved survival rates with a significant reduction in morbidity were not specified in the given text.}",
    "{ Q: What is the significance of AICRP units in goat rearing?\n                            A: AICRP units create awareness among goat keepers about increasing income through improved management and using weights of sale kids to bargain with traders.\n                            Q: What is the primary source of income for the Gola tribe in Ganjam district, Odisha?\n                            A: Goat rearing contributes 61.5% of the annual income for the Gola tribe.\n                            Q: What role does goat husbandry play in rural India?\n                            A: Goat husbandry is an instrument for social and economic transformation in rural India, developing into a sustainable eco-friendly enterprise.\n                            Q: What are some commercially viable technologies developed by CIRG for goat improvement?\n                            A: CIRG has developed diagnostic kits, herbal products, goat production technologies, and value-added goat products.\n                            Q: What are the benefits of goat milk over cow milk?\n                            A: Goat milk has better digestibility, nutrition, amino acid profile, and is rich in fats (MCT and CLA). It also has smaller fat globules and higher oligosaccharide content.\n                            Q: How does goat milk benefit individuals with mal-absorption syndromes?\n                            A: Goat milk provides instant energy and is useful in mal-absorption syndromes, hyperlipoproteinemia, intestinal resection, infant malnutrition, and premature infant feeding.\n                            Q: What are the advantages of goat meat over other meats?\n                            A: Goat meat has higher thiamine (Vitamin B1) and riboflavin (Vitamin B2) and lower fat content compared to meats from other food animals.\n                            Q: How does the saturated fat content in goat meat compare to other meats?\n                            A: Goat meat has 40% less saturated fat than chicken (without skin) and is significantly lower than beef, pork, and lamb.\n                            Q: What are some value-added goat products developed by CIRG?\n                            A: CIRG has developed goat meat pickles, nuggets, sausages, patties, shami kebabs, murukku, nimkee, and meat/milk biscuits.}",
    "{ Q: What is the protein content of mutton and beef?\n                            A: The protein contents of mutton and beef are almost similar.\n                            Q: What are the benefits of medium chain triglycerides (MCT) in goat fat?\n                            A: MCT can be directly absorbed via the intestine for energy and do not require emulsification or digestion.\n                            Q: What makes goat meat a healthy choice for consumers?\n                            A: Goat meat has a healthful fatty acid profile, containing 60-80% desired fatty acids (DFA).\n                            Q: How does ICAR-CIRG support capacity building in goat farming?\n                            A: ICAR-CIRG organizes national and sponsored training programs on commercial/scientific goat farming.\n                            Q: What topics are covered in the capacity building programs for goat farmers?\n                            A: Topics include goat breeding, feeding, health, housing, reproduction, value addition, economics, and marketing.\n                            Q: How many farmers are trained annually by ICAR-CIRG on scientific goat farming?\n                            A: About 700 farmers are trained annually on different aspects of scientific goat farming.\n                            Q: What are some specialized training programs offered by ICAR-CIRG?\n                            A: Specialized training programs include artificial insemination (AI) in goats and value addition of goat milk and meat products.\n                            Q: How does promoting semi-intensive or strategic management systems benefit goat farming?\n                            A: It can yield double or more dividends compared to extensive systems, improving body weight, milk yield, survivability, and more.\n                            Q: How can the development of improved stock benefit goat-based breeding programs?\n                            A: Using high-quality pure-bred bucks can improve the genetic potential of goats, particularly in rural areas.\n                            Q: What is the purpose of establishing kids' nurseries in goat-based breeding programs?\n                            A: Kids' nurseries ensure a regular supply of breeding bucks to goat keepers for improving the genetic potential of goats.}",
    "{ Q: What is the impact of superior bucks on goat production?\n                            A: Superior bucks can increase production by 40-75% and fetch 25-40% higher market prices.\n                            Q: What diseases cause high economic losses in goat farming?\n                            A: Peste des petits ruminants (PPR), enterotoxaemia, goatpox, and foot and mouth disease (FMD) cause 30-60% goat mortality.\n                            Q: How can vaccination and deworming improve goat farming?\n                            A: They can reduce mortality to <10%, increase goat survival, and increase net income by Rs. 3500-4500/year with a unit of five goats.\n                            Q: How can fodder supplies in villages be improved?\n                            A: By increasing the productivity of traditional feed and fodder crops, inter-cropping, and promoting short duration leguminous forage crops.\n                            Q: What is the importance of credit for goat keepers?\n                            A: Credit helps goat keepers access technological interventions, improved housing, feed concentrate, and quality germplasm.\n                            Q: What are the improved management practices for goat keepers?\n                            A: Breeding calendar, health calendar, strategic feeding, smart marketing, value addition, avoiding over-crowding, and maintaining hygiene.\n                            Q: What is the impact of improved management practices on goat farming income?\n                            A: Farmers can earn an additional income of Rs. 18348/year with a 5 unit of goats by adopting improved management practices.\n                            Q: What is the importance of goat housing?\n                            A: Adequate goat housing is necessary due to scarcity of resources and to maintain hygiene and biosecurity.\n                            Q: What should be the design of a goat shed?\n                            A: A goat shed should have open and covered spaces, with the open space normally double the covered area.\n                            Q: What is the importance of silvi-pasture in goat farming?\n                            A: Silvi-pasture can convert degraded grazing lands and Common Property Resources (CPR) near villages into productive systems.}",
    "{ Q: What are the major constraints for goat keepers?\n                            A: Space and high input costs are the major constraints for most goat keepers.\n                            Q: How can value addition benefit goat products?\n                            A: Value addition can increase income and nutritional value through processing for better shelf stability, sensory quality, and convenience.\n                            Q: What do consumers look for in value-added products?\n                            A: Consumers seek variety, nutrients, and convenient ready-to-eat products.\n                            Q: How can value addition help farmers?\n                            A: Value addition may help farmers increase their net return.\n                            Q: How is goat meat production growing?\n                            A: Goat meat production mainly grows from an increasing number of animal slaughters rather than yield.\n                            Q: What improvements can lead to better goat productivity?\n                            A: Technologies and resource inputs related to healthcare, nutrition, breeding, and marketing can improve goat productivity.\n                            Q: What is the importance of transferring technologies for goat production?\n                            A: Transferring technologies through extension services can improve goat production and management practices, providing better access to resources, technologies, and markets.\n                            Q: What was Gandhiji's vision for Indian villages?\n                            A: Gandhiji believed that every Indian should possess a piece of land to grow their own food, be independent, and live with dignity.\n                            Q: What is the concept of 'Grama Swaraj'?\n                            A: 'Grama Swaraj' is a human-centered village with a non-exploiting and decentralized economy, providing equal opportunities and self-sufficiency in life's necessities.\n                            Q: How can integrated rural development be achieved?\n                            A: Integrated rural development can be achieved by incorporating agriculture, industry, and other economic activities, merging the principles of decentralization.}",
    "{ Q: What is the Gandhian Self-Reliance Model?\n                            A: The Gandhian Self-Reliance Model emphasizes decentralized democracy, social justice, and rural economic development through multi-purpose cooperatives covering agriculture and industries.\n                            Q: How can the Gandhian Self-Reliance Model address current economic challenges?\n                            A: By tapping rural knowledge and potential workforce through local management, the Gandhian Self-Reliance Model can address unemployment, poverty, and economic disparity.\n                            Q: What potential do aquaculture and fisheries have in strengthening the rural economy?\n                            A: Aquaculture and fisheries have immense potential to strengthen the rural economy as envisaged in Gandhiji's model of self-reliance due to India's vast coastline, EEZ, and freshwater resources.\n                            Q: What are India's key water resources for aquaculture and fisheries?\n                            A: India has a 8,118 km long coastline, 2.02 million sq km EEZ, 2.42 million ha of ponds and tanks, 0.2 million km rivers and canals, 3.12 million ha reservoirs, and 1.1 million ha of brackishwater area.\n                            Q: How have aquaculture developments impacted India's fish production?\n                            A: Aquaculture developments in the last four decades have significantly contributed to India's fish production, catering to domestic demand and sharing about 19% of the total agricultural export.\n                            Q: How is the fisheries sector integrated with other economic activities?\n                            A: The fisheries sector is integrated with agriculture, industry, and other economic allied activities, providing opportunities for self-reliant village models.\n                            Q: How has the Gandhian Self-Reliance Model benefited fisherman communities?\n                            A: The model has provided protection and elevated the position of fisherman communities, which otherwise represent marginalized and backward classes.\n                            Q: How can aquaculture aid in poverty eradication and livelihood improvement?\n                            A: Aquaculture is an economic activity that can aid in poverty eradication and livelihood improvement among the rural population by utilizing widely distributed water resources.\n                            Q: What role have government programs played in promoting aquaculture?\n                            A: Central and state governments have implemented various social welfare programs aiming for a 'Blue Revolution,' bringing remarkable changes in aquaculture development.\n                            Q: How has ICAR contributed to the development of the village economy?\n                            A: ICAR has initiated several programs to develop the village economy, employ the rural workforce, and promote aquaculture.}",
    "{ Q: What is the main goal of the ARYA and TSP initiatives in rural India?\n                            A: The goal is to attract and retain youth in agriculture and provide a dignified living with self-sustenance.\n                            Q: What was Gandhiji's view on development and ecological balance?\n                            A: Gandhiji believed that any development scheme should be centered on the man and maintain ecological balance.\n                            Q: What was Gandhiji's view on community-centered approach towards sustainability?\n                            A: He emphasized on 'betterment of human life' by avoiding exploitations and establishing human dignity.\n                            Q: What is ICAR's role in realizing Gandhian principles?\n                            A: ICAR spearheads research, education, and extension activities in Indian agriculture, focusing on rural development.\n                            Q: How has ICAR's approach to agriculture changed over time?\n                            A: ICAR has shifted from supplying basic food needs to providing adequate nutrients to promote health.\n                            Q: How has ICAR contributed to overcoming challenges in agriculture?\n                            A: ICAR has developed new technologies and innovations to overcome challenges and increase agricultural productivity.\n                            Q: How has India's fish production changed over the years?\n                            A: Fish production has increased 18-fold in the last 70 years, from 0.75 million tonnes to 13.76 million tonnes.\n                            Q: What is India's current position in global aquaculture production?\n                            A: India is the second-largest aquaculture producer and occupies the 3rd position in total fish production.\n                            Q: How has aquaculture in India evolved over the last four decades?\n                            A: Aquaculture has made a paradigm shift from homestead activity to a significant contributor to fish production.}"
]