[
    "```json\n[\n    {\n        \"question\": \"How should nitrogen be applied for onion cultivation?\",\n        \"answer\": \"Nitrogen should be given in top dressing in two split doses at 30 days and 45 days after transplanting.\"\n    },\n    {\n        \"question\": \"What is the recommended planting spacing for high yields in onions?\",\n        \"answer\": \"Close planting at 15 cm between rows and 7.5 cm between plants is most conducive for high yields.\"\n    },\n    {\n        \"question\": \"How much sulphur should be applied for optimum onion production?\",\n        \"answer\": \"Application of 15 kg sulphur/ha on soils with sulphur level above 25 kg/ha, while 30 kg sulphur/ha is needed for soils with sulphur level below 25 kg/ha.\"\n    },\n    {\n        \"question\": \"What is the recommended spray for controlling thrips in onions?\",\n        \"answer\": \"Spray Fipronil (Regenta) @30 ml/15lt water or Prophenophos @10ml/10lt water at 8-10 days interval.\"\n    },\n    {\n        \"question\": \"How can maggots' infestation in onions be controlled?\",\n        \"answer\": \"Control maggots by spraying Chlorpyriphos @2 lt/acre along with irrigation water or sand.\"\n    },\n    {\n        \"question\": \"What is the recommended spray for controlling purple blotch and stemphylium blight in onions?\",\n        \"answer\": \"Spray Propineb 70%WP @350 gm/acre/150 lt of water, twice at 10 days interval.\"\n    },\n    {\n        \"question\": \"What is the ideal temperature range for obtaining the best fruit color and quality in tomatoes?\",\n        \"answer\": \"The best fruit color and quality is obtained at a temperature range of 21-24째C.\"\n    },\n    {\n        \"question\": \"What is the recommended fertilizer dose for hybrid tomato varieties?\",\n        \"answer\": \"The recommended dose of fertilizer per hectare is 180 kg N, 100 kg P2O5, and 100 kg K2O.\"\n    },\n    {\n        \"question\": \"How should fertilizers be applied for hybrid tomato varieties?\",\n        \"answer\": \"Half dose of N, P, and K are given at the time of transplanting, the remaining quantities are top-dressed 30 days after transplanting, and a third dose of 60 kg N is applied 50 days after transplanting.\"\n    },\n    {\n        \"question\": \"What is the recommended spray for controlling whiteflies in tomatoes?\",\n        \"answer\": \"In case of severe infestation, spray Triazophos @250ml/200litre or Profenophos @200ml/200litre of water, and repeat the spray after 15 days.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the ideal pH range for soil in cauliflower cultivation?\",\n        \"answer\": \"The ideal pH range for soil in cauliflower cultivation is 6 to 7.\"\n    },\n    {\n        \"question\": \"What should be done if the soil pH is low in cauliflower cultivation?\",\n        \"answer\": \"Lime should be added to the soil if the pH is low.\"\n    },\n    {\n        \"question\": \"What are some early varieties of cauliflower mentioned?\",\n        \"answer\": \"Early varieties of cauliflower include Early Kunwari, Pant Gobhi, and Pusa Deepali.\"\n    },\n    {\n        \"question\": \"What is the recommended spacing and seed rate for cauliflower cultivation?\",\n        \"answer\": \"The recommended spacing is 45x45 cm, and the seed rate is 250 gm per acre.\"\n    },\n    {\n        \"question\": \"How much FYM (Farm Yard Manure) should be applied per hectare for cauliflower cultivation?\",\n        \"answer\": \"250-300 quintals of FYM should be applied per hectare.\"\n    },\n    {\n        \"question\": \"What causes 'Browning' or 'Brown Rot' in cauliflower, and how can it be controlled?\",\n        \"answer\": \"Browning is caused by boron deficiency and can be controlled by applying borax or sodium borate at 20 kg/ha.\"\n    },\n    {\n        \"question\": \"What is 'Buttoning' in cauliflower, and what causes it?\",\n        \"answer\": \"Buttoning is the development of small curds with inadequate foliage, caused by transplanting more than 6-week-old seedlings or planting early varieties late and vice versa.\"\n    },\n    {\n        \"question\": \"What is the optimum pH range for growing cabbage?\",\n        \"answer\": \"The optimum pH range for growing cabbage is 6.0-6.5.\"\n    },\n    {\n        \"question\": \"What are some recommended varieties of cabbage?\",\n        \"answer\": \"Recommended varieties of cabbage include Golden Acre, Pusa Drumhead, Pride of India, Pusa Mukta, Pusa Synthetic, Early Drumhead, Late Large Drum Head, and K-1.\"\n    },\n    {\n        \"question\": \"How much seed is required to raise a nursery for planting one hectare of cabbage?\",\n        \"answer\": \"About 300-500 grams of seeds are sufficient to raise a nursery for planting one hectare of cabbage.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"When should cabbage be harvested?\",\n        \"answer\": \"Cabbage should be harvested promptly when the heads are firm and mature, typically 90-120 days after planting.\"\n    },\n    {\n        \"question\": \"What is the average yield of early and late varieties of cabbage?\",\n        \"answer\": \"The average yield for early varieties is 25-30 t/ha, and for late varieties, it is 40-60 t/ha.\"\n    },\n    {\n        \"question\": \"How can cutworm infestation be prevented in cabbage?\",\n        \"answer\": \"As a preventive measure, apply Methyl Parathion or Malathion (5% dust) @10kg/acre in soil before sowing.\"\n    },\n    {\n        \"question\": \"What is the recommended treatment for leaf-eating caterpillars in cabbage?\",\n        \"answer\": \"Spray Dichlorvos@200ml/150Ltr water or Flubendiamide 48%S.C@0.5ml/3Ltr of water to control leaf-eating caterpillars.\"\n    },\n    {\n        \"question\": \"How should aphid and jassid infestations be managed in cabbage?\",\n        \"answer\": \"Spray Imidacloprid 17.8SL @ 60ml/acre using 150 Ltr water to control aphid and jassid infestations.\"\n    },\n    {\n        \"question\": \"What is the ideal pH range for growing vegetable peas?\",\n        \"answer\": \"Vegetable peas grow best in well-drained soil with a pH range of 6 to 7.5.\"\n    },\n    {\n        \"question\": \"What are the recommended varieties of vegetable peas?\",\n        \"answer\": \"Recommended varieties include Azad P1, Azad P3, Azad P4, Azad P5, and Arkel.\"\n    },\n    {\n        \"question\": \"How can wilt in vegetable peas be controlled?\",\n        \"answer\": \"Control wilt by treating seeds with Thiram@3gm/lt water, avoiding early sowing in affected areas, and practicing crop rotation.\"\n    },\n    {\n        \"question\": \"What is the ideal soil type for carrot cultivation?\",\n        \"answer\": \"Loamy or sandy loam soils with enough humus are well suited for carrot cultivation.\"\n    },\n    {\n        \"question\": \"What is the recommended fertilizer management for carrots?\",\n        \"answer\": \"Apply 20-30 tonnes of FYM/ha at the time of field preparation, along with 50 kg N, 50 kg P, and 100 kg K/ha.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What are some hybrid varieties of brinjal mentioned in the text?\",\n        \"answer\": \"Kusumkar, Arka Navneet (Hybrid), Arka Nidhi, Arka Keshav, Arka Neelkanth.\"\n    },\n    {\n        \"question\": \"How much seed is required for one hectare of brinjal cultivation?\",\n        \"answer\": \"370-500 grams of seed is required for one hectare.\"\n    },\n    {\n        \"question\": \"What is the recommended seed treatment for brinjal seeds?\",\n        \"answer\": \"Seed treatment with Trichoderma viridae/T. harzianum @ 2g/100g of seeds or Carboxyn 37.5% + Thiram 37.5%.\"\n    },\n    {\n        \"question\": \"What is the size of raised beds prepared for brinjal cultivation?\",\n        \"answer\": \"Raised beds of size 7.2 x 1.2 meters and 10-15 cm in height are prepared.\"\n    },\n    {\n        \"question\": \"How many raised beds are required for one hectare of brinjal cultivation?\",\n        \"answer\": \"10 raised beds are required for one hectare.\"\n    },\n    {\n        \"question\": \"What is the recommended spacing for transplanting long fruited varieties of brinjal?\",\n        \"answer\": \"Long fruited varieties are transplanted at 60 x 45 cm spacing.\"\n    },\n    {\n        \"question\": \"What is the recommended fertilizer application for optimum yield of brinjal?\",\n        \"answer\": \"Application of 150 kg N, 100 kg P2O5, and 50 kg K2O is recommended.\"\n    },\n    {\n        \"question\": \"How often is irrigation given to brinjal crops during winter?\",\n        \"answer\": \"Irrigation is given at an interval of 8-10 days during winter.\"\n    },\n    {\n        \"question\": \"What is the recommended method for controlling weeds in brinjal cultivation?\",\n        \"answer\": \"Pre-emergence application of Fluchloralin (1.5 kg a.i./ha) coupled with one hand weeding 30 days after transplanting.\"\n    },\n    {\n        \"question\": \"What is the average yield of brinjal per hectare?\",\n        \"answer\": \"The average yield of brinjal varies from 20-30 tons per hectare.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is added to sodic soil to improve its condition?\",\n        \"answer\": \"5-8 kg of Gypsum along with 20 kg of sand is added to sodic soil.\"\n    },\n    {\n        \"question\": \"How much Farmyard manure, N, P, and K should be given to one-year-old plants?\",\n        \"answer\": \"10 kg of Farmyard manure, 100g of N, 50g of P, and 100g of K should be given to one-year-old plants.\"\n    },\n    {\n        \"question\": \"What is the irrigation schedule for plants in dry summer?\",\n        \"answer\": \"Irrigation is provided at an interval of 15-20 days in dry summer.\"\n    },\n    {\n        \"question\": \"When is the first irrigation provided after manure and fertilizer application?\",\n        \"answer\": \"The first irrigation is provided just after manure and fertilizer application in January/February.\"\n    },\n    {\n        \"question\": \"What system is used for training the plants?\",\n        \"answer\": \"The plants are trained to a modified central leader system.\"\n    },\n    {\n        \"question\": \"What are the suitable crops for intercropping with Aonla?\",\n        \"answer\": \"Inter-cropping with vegetables, flowers, and a few medicinal/aromatic plants is well suited.\"\n    },\n    {\n        \"question\": \"What is the cost of intercropping per acre?\",\n        \"answer\": \"The cost of intercropping is Rs. 10,000/- per acre.\"\n    },\n    {\n        \"question\": \"What is the ideal soil type for papaya cultivation?\",\n        \"answer\": \"Well-drained sandy loam soil is ideal for the cultivation of papaya.\"\n    },\n    {\n        \"question\": \"What is the seed rate for papaya cultivation per hectare?\",\n        \"answer\": \"The seed rate for papaya cultivation is 250-300 g/ha.\"\n    },\n    {\n        \"question\": \"What is the recommended spacing for high-density planting of papaya?\",\n        \"answer\": \"The recommended spacing for high-density planting of papaya is 1.5 x 1.5 m, accommodating 6400 plants/ha.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What herbicides are recommended for pre-emergence weed control in papaya cultivation?\",\n        \"answer\": \"Fluchloralin, Alachlorin, or Butachlorine (2.0 g./ha.) are recommended for pre-emergence weed control.\"\n    },\n    {\n        \"question\": \"Why is intercropping with leguminous crops beneficial in papaya orchards?\",\n        \"answer\": \"Intercropping with shallow-rooted leguminous crops after non-leguminous crops is beneficial for soil health and nutrient management.\"\n    },\n    {\n        \"question\": \"What percentage of male plants is kept in papaya orchards for pollination?\",\n        \"answer\": \"About 10% of male plants are kept in papaya orchards for good pollination.\"\n    },\n    {\n        \"question\": \"Which insect pests are commonly observed in papaya cultivation?\",\n        \"answer\": \"Common insect pests include fruit flies (Bactrocera cucurbitae), grasshopper (Poekilocerus pictus), aphids (Aphis gossypii), red spider mite (Tetranychus cinnabarinus), stem borer (Dasyses rugosellus), and grey weevil (Myllocerus viridans).\"\n    },\n    {\n        \"question\": \"How is powdery mildew controlled in papaya plants?\",\n        \"answer\": \"Powdery mildew is controlled by applying wettable sulphur (1 g/l.), carbendazim/thiophanate methyl (1 g./l.), or Kavach/Mancozeb (2 g./l.).\"\n    },\n    {\n        \"question\": \"When are papaya fruits harvested?\",\n        \"answer\": \"Papaya fruits are harvested when they turn light green with a tinge of yellow at the apical end.\"\n    },\n    {\n        \"question\": \"What is the economic life of a papaya plant?\",\n        \"answer\": \"The economic life of a papaya plant is 3 to 4 years.\"\n    },\n    {\n        \"question\": \"What are the ideal storage conditions for papaya fruits?\",\n        \"answer\": \"Papaya fruits can be stored for 1-3 weeks at a temperature of 10-13째C and 85-90% relative humidity.\"\n    },\n    {\n        \"question\": \"What are the recommended fertilizers for guava cultivation?\",\n        \"answer\": \"For guava cultivation, 600 g. N and 400 g. K are recommended, applied in the first week of May for the rainy season and July for the winter season crop.\"\n    },\n    {\n        \"question\": \"How is weed control managed in guava orchards?\",\n        \"answer\": \"Weed control in guava orchards is managed using pre-emergence herbicides like diuron (1.6 kg./ha), oryzalin (1.67 litres/ha.), or simazine (1.6 kg/ha).\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the primary cause of fruit drop in guava?\",\n        \"A\": \"Fruit drop in guava is primarily caused by physiological and environmental factors, resulting in 45-65% loss.\"\n    },\n    {\n        \"Q\": \"How can fruit drop in guava be reduced?\",\n        \"A\": \"Fruit drop in guava can be reduced by spraying GA (Gibberellic Acid).\"\n    },\n    {\n        \"Q\": \"What foliar application helps reduce bronzing in guava?\",\n        \"A\": \"Foliar application of 0.5% diammonium phosphate and zinc sulphate in combination at weekly intervals for two months reduces bronzing in guava.\"\n    },\n    {\n        \"Q\": \"What pre-flowering sprays increase guava yield and fruit size?\",\n        \"A\": \"Pre-flowering sprays of 0.4% boric acid, 0.3% zinc sulphate, and 0.2-0.4% copper sulphate increase yield and fruit size in guava.\"\n    },\n    {\n        \"Q\": \"When do guava plants attain full bearing capacity?\",\n        \"A\": \"Guava plants attain full bearing capacity after 10 years, producing 100 to 150 kg of fruits annually.\"\n    },\n    {\n        \"Q\": \"What are the recommended harvesting periods for guava?\",\n        \"A\": \"The recommended harvesting periods for guava are August for the rainy season crop and November-December for the winter season crop.\"\n    },\n    {\n        \"Q\": \"How can the shelf life of guava be extended?\",\n        \"A\": \"The shelf life of guava can be extended up to 20 days by storing them at a low temperature of 5째C and 75-85% relative humidity.\"\n    },\n    {\n        \"Q\": \"What soil types are best for garlic cultivation?\",\n        \"A\": \"Garlic gives the best results when grown in sandy loam and silt loam soils rich in organic matter, with a soil pH range of 6 to 7.\"\n    },\n    {\n        \"Q\": \"How can damping off and smut diseases in garlic be controlled?\",\n        \"A\": \"Seed treatment with Thiram@2 gm/kg of seed + Benomyl 50WP@1 gm/liter water effectively controls damping off and smut diseases in garlic.\"\n    },\n    {\n        \"Q\": \"What are the recommended fertilizers for garlic cultivation?\",\n        \"A\": \"The recommended fertilizers for garlic cultivation are 125 kg N, 65 kg P, and 100 kg K/ha, along with 40 tonnes of FYM (Farm Yard Manure).\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the recommended solution for controlling Powdery Mildew in crops?\",\n        \"answer\": \"Spraying water soluble Sulphur@20gm/10Ltr or Propiconazole10EC (Topas) @200ml/acre in 200Ltr of water is recommended.\"\n    },\n    {\n        \"question\": \"What type of soil is best for growing Fenugreek?\",\n        \"answer\": \"Fenugreek gives the best results when grown in well-drained loamy or sandy loam soils.\"\n    },\n    {\n        \"question\": \"What is the ideal pH range for Fenugreek cultivation?\",\n        \"answer\": \"Fenugreek can tolerate a pH range of 5.3 to 8.2.\"\n    },\n    {\n        \"question\": \"What is the best time for sowing Fenugreek?\",\n        \"answer\": \"The last week of October and the first week of November is the best time for sowing Fenugreek.\"\n    },\n    {\n        \"question\": \"How much seed is required per hectare for Fenugreek cultivation?\",\n        \"answer\": \"18-25 Kg of seed per hectare is required for Fenugreek cultivation.\"\n    },\n    {\n        \"question\": \"What is the recommended treatment for Fenugreek seeds to enhance germination?\",\n        \"answer\": \"Seeds are soaked in water for 2 days prior to sowing and treated with Rhizobium culture.\"\n    },\n    {\n        \"question\": \"What is the recommended dose of Nitrogen, Phosphorus, and Potash for Fenugreek?\",\n        \"answer\": \"Nitrogen @20 kg/ha, Phosphorus @60 kg/ha, and Potash @40 kg/ha should be applied.\"\n    },\n    {\n        \"question\": \"How can Aphid infestation in Fenugreek be controlled?\",\n        \"answer\": \"Spray Imidacloprid@3ml/10Ltr or Thiamethoxam@4gm/10Ltr of water to control Aphid infestation.\"\n    },\n    {\n        \"question\": \"What is the preventive measure for root rot in Fenugreek?\",\n        \"answer\": \"Soil application of Neem Cake@60kg/acre and treating seeds with Trichoderma viride@4gm/kg of seed are recommended.\"\n    },\n    {\n        \"question\": \"What are the medicinal properties of Fennel?\",\n        \"answer\": \"Fennel is used for digestion, treating constipation, diarrhea, throat pain, headache, and other ailments.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the recommended treatment for aphid infestation in crops?\",\n        \"answer\": \"Spray Methyl demeton 25EC@2ml per litre of water.\"\n    },\n    {\n        \"question\": \"How can powdery mildew be controlled in plants?\",\n        \"answer\": \"Spray wettable Sulphur@2gm/ltr of water if infestation is observed.\"\n    },\n    {\n        \"question\": \"What are the active ingredients in food that promote human health?\",\n        \"answer\": \"Amino acids, fats, dietary fiber, antioxidants, pigments, vitamins, and minerals.\"\n    },\n    {\n        \"question\": \"Why are fruits and vegetables considered significant in human nutrition?\",\n        \"answer\": \"They are a source of vitamins, minerals, and dietary fiber.\"\n    },\n    {\n        \"question\": \"What are some examples of protective foods?\",\n        \"answer\": \"Carrots, tomatoes, potatoes, ginger, and green leafy vegetables.\"\n    },\n    {\n        \"question\": \"What is the importance of value addition in fruits and vegetables?\",\n        \"answer\": \"It ensures nutritional security and income generation.\"\n    },\n    {\n        \"question\": \"What makes tomatoes a popular protective food?\",\n        \"answer\": \"Their lycopene content, nutritive value, antioxidant properties, and medicinal properties.\"\n    },\n    {\n        \"question\": \"What are the key nutrients found in tomatoes?\",\n        \"answer\": \"Calcium, magnesium, phosphorous, iron, sodium, potassium, and vitamins A and C.\"\n    },\n    {\n        \"question\": \"What are the main antioxidants present in tomatoes?\",\n        \"answer\": \"Carotenoids (especially lycopene), ascorbic acid, and phenolic compounds.\"\n    },\n    {\n        \"question\": \"What are some value-added products that can be made from tomatoes?\",\n        \"answer\": \"Tomato pulp, puree, paste, flakes, canned tomatoes, ketchup, soup, sauce, powder, and dehydrated tomatoes.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the primary use of tomato powder in the processing sector?\",\n        \"answer\": \"Tomato powder can be used in processed products such as soup mixes and confectionery items, and it facilitates daily cuisines and preparation during the off season.\"\n    },\n    {\n        \"question\": \"What are the key nutrients found in carrots?\",\n        \"answer\": \"Carrots are rich in carotene, carotenoids, vitamins like ascorbic acid and tocopherol, and minerals.\"\n    },\n    {\n        \"question\": \"What is the significance of carotene in carrots?\",\n        \"answer\": \"Carotene is a precursor of vitamin A, an essential nutrient for maintaining health, and it helps prevent vitamin A deficiency.\"\n    },\n    {\n        \"question\": \"What are some nutraceutical properties of carrots?\",\n        \"answer\": \"Carrots possess anti-mutagenic, chemo-preventive, photo-protective, and immune-enhancing properties.\"\n    },\n    {\n        \"question\": \"How do carrots contribute to cancer prevention?\",\n        \"answer\": \"Carrots have a greater cytotoxic effect against cancer cells and reduce enzymes that promote the conversion of pre-carcinogens to carcinogens.\"\n    },\n    {\n        \"question\": \"What are some processed products made from carrots?\",\n        \"answer\": \"Processed carrot products include carrot juice, carrot powder, carrot flakes, canned carrot, carrot candy, carrot halwa, carrot grits, carrot soup, carrot Dalia, and fabricated baby foods.\"\n    },\n    {\n        \"question\": \"What is the benefit of processing carrots?\",\n        \"answer\": \"Processing carrots ensures their availability year-round and reduces the cost of transportation and storage.\"\n    },\n    {\n        \"question\": \"How is carrot powder used in traditional food products?\",\n        \"answer\": \"Carrot powder is incorporated into traditional food products like paratha, porridge, and laddu to enhance their nutritional value.\"\n    },\n    {\n        \"question\": \"What is ginger, and how is it commonly used?\",\n        \"answer\": \"Ginger is an underground stem of the zingiberous herbaceous plant, commonly used as a spice and food additive to impart its characteristic flavor.\"\n    },\n    {\n        \"question\": \"What are some properties attributed to ginger?\",\n        \"answer\": \"Ginger is attributed with antioxidant properties, proteolytic activity, and a tenderizing effect.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What are the antioxidant properties of ginger used for?\",\n        \"answer\": \"Ginger's antioxidant properties are used in the preservation of meat and meat products.\"\n    },\n    {\n        \"question\": \"How does ginger help in treating nausea and vomiting?\",\n        \"answer\": \"Ginger has therapeutic properties that effectively treat numerous types of nausea and vomiting.\"\n    },\n    {\n        \"question\": \"What are some therapeutic benefits of ginger?\",\n        \"answer\": \"Ginger stimulates blood circulation, removes toxins, cleans the bowels and kidneys, and nourishes the skin.\"\n    },\n    {\n        \"question\": \"What respiratory problems can ginger help treat?\",\n        \"answer\": \"Ginger is used to treat asthma, bronchitis, and other respiratory problems.\"\n    },\n    {\n        \"question\": \"What are some processed products made from ginger?\",\n        \"answer\": \"Processed ginger products include paste, candy, preserve, pickle, chocolates, beverages, powder, juice, ice cream, and oleoresin.\"\n    },\n    {\n        \"question\": \"Why is it necessary to process surplus ginger?\",\n        \"answer\": \"Processing surplus ginger is necessary to prevent damage from respiration and microbial spoilage and to make it available throughout the year.\"\n    },\n    {\n        \"question\": \"How are fenugreek leaves preserved?\",\n        \"answer\": \"Fenugreek leaves are preserved using blanching treatment to maintain their color and nutritional value.\"\n    },\n    {\n        \"question\": \"What are some uses of fenugreek leaf powder?\",\n        \"answer\": \"Fenugreek leaf powder is used to prepare paratha and saag.\"\n    },\n    {\n        \"question\": \"What are the nutritional benefits of potatoes?\",\n        \"answer\": \"Potatoes are a rich source of energy, contain good quality protein, dietary fiber, minerals, trace elements, essential vitamins, and little to no fat.\"\n    },\n    {\n        \"question\": \"What are some processed forms of sweet potatoes?\",\n        \"answer\": \"Sweet potatoes are processed into various forms such as flour, grits, flakes, granules, and cubes to extend storage life and increase supply in off-seasons.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What are the common uses of sweet potato flour?\",\n        \"A\": \"Sweet potato flour is used in biscuits, cakes, pudding, bread, hot cakes, gruel, noodles, candy, and as a stabilizing agent in ice-creams.\"\n    },\n    {\n        \"Q\": \"Why is sweet potato considered advantageous over other vegetables?\",\n        \"A\": \"Sweet potato has a shorter growth period and adverse weather conditions rarely cause a complete crop loss.\"\n    },\n    {\n        \"Q\": \"What are the processed products of sweet potato?\",\n        \"A\": \"The processed products of sweet potato include sweet potato flour, sweet potato granules, and canned sweet potatoes.\"\n    },\n    {\n        \"Q\": \"What nutrients are found in sweet potatoes?\",\n        \"A\": \"Sweet potatoes are a source of dietary protein, vitamins (Beta carotene, B complex, and vitamin C), minerals, trace elements, and have a high energy value.\"\n    },\n    {\n        \"Q\": \"What is the recommended time for sowing wheat in Bihar?\",\n        \"A\": \"The right time for sowing wheat in Bihar is the 1st week of November for timely sowing and by the 20th of December for late sowing.\"\n    },\n    {\n        \"Q\": \"What are the recommended wheat varieties for timely sowing in Bihar?\",\n        \"A\": \"Recommended varieties for timely sowing include DBW 187, HD 2967, K1317, HD 3226, DBW 39, K0307, HD 2824, HD 2402, CBW 38, PBW 343, and Sabour Samridhi.\"\n    },\n    {\n        \"Q\": \"What are the recommended wheat varieties for late sowing in Bihar?\",\n        \"A\": \"Recommended varieties for late sowing include HD 3118, HD 2985, HI 1563, DBW 107, DBW 14, HD 2643, HP 1633, HD 2307, DBW 173, PBW 752, HUW 234, PBW 373, and Sabour Shrestha.\"\n    },\n    {\n        \"Q\": \"What is the recommended row spacing for wheat cultivation in Bihar?\",\n        \"A\": \"For normal sown crops, maintain a row spacing of 20 cm, and for delayed sown conditions, maintain 18 cm between rows.\"\n    },\n    {\n        \"Q\": \"What is the recommended fertilizer application for wheat cultivation in Bihar?\",\n        \"A\": \"Apply 150-120 kg N, 60 kg P2O5, and 40 kg K2O per hectare for optimum productivity, with nitrogen applied in two split doses.\"\n    },\n    {\n        \"Q\": \"What are the critical irrigation stages for wheat cultivation in Bihar?\",\n        \"A\": \"Critical irrigation stages are at the CRI stage (20-25 DAS), late jointing stage (40-45 DAS), heading stage (65-70 DAS), and milking stage (90 DAS).\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What herbicides are recommended for controlling mixed weed flora in wheat fields?\",\n        \"answer\": \"Sulfosulfuron + metsulfuron @40g/ha or clodinofob + metsulfuron 400g/ha mixed with 500L of water applied after 25-30 DAS.\"\n    },\n    {\n        \"question\": \"When should metsulfuron be applied for controlling broadleaf weeds in wheat?\",\n        \"answer\": \"Metsulfuron @10g a.i./ha should be applied after 30-35 DAS.\"\n    },\n    {\n        \"question\": \"What is the recommended sowing period for maize?\",\n        \"answer\": \"Maize should be sown from mid-October to mid-November.\"\n    },\n    {\n        \"question\": \"What are the recommended hybrid varieties of maize for cultivation?\",\n        \"answer\": \"Ganga 11, DHM 103, DHM 105, Rajendra hybrid makka-1, ICI 705, Dhawal, Laxmi, Devaki, Saktiman 1, Saktiman 2, Saktiman 3, Saktiman 4.\"\n    },\n    {\n        \"question\": \"What is the recommended herbicide for weed control in maize before sowing?\",\n        \"answer\": \"Gramoxone 24 SL (paraquat) @1.25 L in 500 litres of water per hectare.\"\n    },\n    {\n        \"question\": \"What are the critical stages for irrigation in maize?\",\n        \"answer\": \"Seedling, knee height stage, flowering, and grain filling stages.\"\n    },\n    {\n        \"question\": \"How should fertilizers be applied for higher maize yield?\",\n        \"answer\": \"Apply full dose of phosphorous and potash and 1/3 N at sowing, 1/3 N at knee-high stage, and the remaining 1/3 at pre-tasselling stage.\"\n    },\n    {\n        \"question\": \"What is the recommended seed rate for small-seeded gram varieties?\",\n        \"answer\": \"75-80 kg/ha.\"\n    },\n    {\n        \"question\": \"How should gram seeds be treated before sowing?\",\n        \"answer\": \"Treat seeds with fungicide carbendazim @ 2g/kg seed, then insecticide chlorpyrifos 20EC @ 8ml/kg seed, and lastly with Rhizobium.\"\n    },\n    {\n        \"question\": \"What are the recommended spacing and depth for sowing gram crops?\",\n        \"answer\": \"Spacing of 30cm x 10cm for small seeds and 45cm x 10cm for bold seeds at a depth of 8-10cm.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the recommended dose of fertilizer for pulses at the time of sowing?\",\n        \"answer\": \"The recommended dose of fertilizer for pulses is 20 kg N (45 kg urea), 40 kg P2O5 (250 kg SSP), and 20 kg K (36 kg muriate of potash).\"\n    },\n    {\n        \"question\": \"When is the best time to sow lentil to ensure a good crop stand?\",\n        \"answer\": \"The best time to sow lentil is from mid-October to mid-November.\"\n    },\n    {\n        \"question\": \"What are the improved varieties of lentil recommended for cultivation?\",\n        \"answer\": \"Improved varieties of lentil include PL 406, PL 639, K 75 (Mallika), HUL 57, NDL 2, WBL 58, WBL 77, PL 777-12 (Arun), IPL 406, Narendra Masoor 1, BR 25, and KLS 218.\"\n    },\n    {\n        \"question\": \"What is the optimum seed rate for lentil in sole cropping?\",\n        \"answer\": \"The optimum seed rate for lentil in sole cropping is 30-35 kg/ha.\"\n    },\n    {\n        \"question\": \"How should lentil seeds be treated before sowing?\",\n        \"answer\": \"Lentil seeds should be treated with fungicide carbendazim @ 2g/kg seed, then with insecticide chlorpyriphos @ 2ml/kg seed, and lastly with Rhizobium culture @ 10g/kg seed 2-3 hours before sowing.\"\n    },\n    {\n        \"question\": \"When is irrigation required for lentil crops?\",\n        \"answer\": \"Irrigation is required at the pre-flowering stage (45 DAS) and, if needed, at the pod filling stage (75 DAS).\"\n    },\n    {\n        \"question\": \"What is the ideal time for sowing field pea?\",\n        \"answer\": \"The ideal time for sowing field pea is from mid-October to mid-November.\"\n    },\n    {\n        \"question\": \"What are some high-yielding varieties of field pea?\",\n        \"answer\": \"High-yielding varieties of field pea include Rachna, Aparna, Malviya Matar 15, Pusa Prabhat, VL matar 42, and Swarna Tripti.\"\n    },\n    {\n        \"question\": \"What is the recommended seed rate for long-duration field pea varieties?\",\n        \"answer\": \"The recommended seed rate for long-duration field pea varieties is 70-80 kg/ha.\"\n    },\n    {\n        \"question\": \"How much sulphur should be applied per hectare at the time of sowing for better yield in Lathyrus?\",\n        \"answer\": \"20 kg sulphur per hectare should be applied at the time of sowing for better yield in Lathyrus.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the recommended amount of urea to apply at the time of sowing for field pea?\",\n        \"answer\": \"45 kg urea is recommended at the time of sowing for field pea.\"\n    },\n    {\n        \"question\": \"When should the first irrigation be applied for field pea?\",\n        \"answer\": \"The first irrigation for field pea should be applied before flowering.\"\n    },\n    {\n        \"question\": \"What is the recommended spacing for sowing rapeseed/mustard?\",\n        \"answer\": \"Rapeseed/mustard should be sown at 30cm x 10-15cm spacing.\"\n    },\n    {\n        \"question\": \"How should seeds of rapeseed/mustard be treated before sowing?\",\n        \"answer\": \"Seeds should be treated with tricoderma@10g/kg of seed before sowing.\"\n    },\n    {\n        \"question\": \"What is the recommended basal dose of fertilizer for rapeseed/mustard?\",\n        \"answer\": \"The recommended basal dose is 60-90 kg N, 60 kg P2O5, and 40 kg K2O/ha.\"\n    },\n    {\n        \"question\": \"What is the optimal sowing period for linseed?\",\n        \"answer\": \"Linseed should be sown from the 1st week of October to the 1st week of November.\"\n    },\n    {\n        \"question\": \"What is the seed rate for normal sowing of linseed?\",\n        \"answer\": \"The seed rate for normal sowing of linseed is 20-30 kg/ha.\"\n    },\n    {\n        \"question\": \"What is the recommended fertilizer application for linseed under irrigated conditions?\",\n        \"answer\": \"Under irrigated conditions, apply 1/2 dose of nitrogen and full dose of phosphorus.\"\n    },\n    {\n        \"question\": \"What are the high-yielding varieties of linseed mentioned?\",\n        \"answer\": \"High-yielding varieties include Sabour Tisi1, Sabour Tisi2, Garima, Sweta, Subhra, Gaurav, and LCK-8528.\"\n    },\n    {\n        \"question\": \"What is the popular sowing method for linseed in rice fallow areas?\",\n        \"answer\": \"The popular sowing method in rice fallow areas is broadcasting in standing paddy crop, known as Paira cropping.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the recommended dose of nitrogen for unirrigated areas?\",\n        \"answer\": \"In unirrigated areas, the full dose of nitrogen and phosphorus should be applied.\"\n    },\n    {\n        \"question\": \"How much sulphur should be applied per hectare at the time of sowing for better yield?\",\n        \"answer\": \"Apply 20kg sulphur/ha at the time of sowing for better yield.\"\n    },\n    {\n        \"question\": \"When should the first irrigation be applied for good plant growth?\",\n        \"answer\": \"The first irrigation should be applied at 30 days after sowing (DAS).\"\n    },\n    {\n        \"question\": \"What is the recommended solution for controlling shoot gall psylla?\",\n        \"answer\": \"Spray a solution of thiamethoxam 1g/liter of water + profenophos 2ml/liter of water + sticker 1/2 ml/liter of water.\"\n    },\n    {\n        \"question\": \"How can papaya plants be protected from foot rot?\",\n        \"answer\": \"Plant papaya in raised beds with the application of Trichoderma.\"\n    },\n    {\n        \"question\": \"What is the recommended compost application per mango tree?\",\n        \"answer\": \"Apply 40-50kg of compost per plant on each mango tree.\"\n    },\n    {\n        \"question\": \"How can mealy bugs be managed in orchards?\",\n        \"answer\": \"Tie polythene banding around the tree trunk and apply grease at the lower end.\"\n    },\n    {\n        \"question\": \"What is the purpose of mulching fruit tree basins?\",\n        \"answer\": \"Mulching helps conserve soil moisture by using fallen leaves, dried weeds, and plant residues.\"\n    },\n    {\n        \"question\": \"What is the recommended solution for controlling shoot borer, thrips, and hoppers?\",\n        \"answer\": \"Spray Imidacloprid 17.8 SL (1 ml per liter of water).\"\n    },\n    {\n        \"question\": \"What fungicide is recommended for disease control in potato and vegetable crops?\",\n        \"answer\": \"Spray mancozeb at 0.25% followed by cymoxanil + mancozeb or metalaxyl 8 + mancozeb 64%WP (0.2%).\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the recommended fungicide spray for fungal diseases in peas?\",\n        \"answer\": \"Karathane at 0.1% should be sprayed during morning hours.\"\n    },\n    {\n        \"question\": \"How can new orchards be protected from frost?\",\n        \"answer\": \"Apply light irrigation to protect new orchards from frost.\"\n    },\n    {\n        \"question\": \"What should be done to control bark-eating insects in trees?\",\n        \"answer\": \"Clean the traps and holes, insert cotton soaked in kerosene oil, and plug with mud or dung.\"\n    },\n    {\n        \"question\": \"What is the recommended irrigation schedule for potatoes?\",\n        \"answer\": \"Irrigate potatoes after 10 to 15 days as per the need.\"\n    },\n    {\n        \"question\": \"What is the purpose of using PSB as a seedling treatment?\",\n        \"answer\": \"PSB is used as a seedling treatment to protect against bacterial diseases.\"\n    },\n    {\n        \"question\": \"When should irrigation be stopped for potato seed crops?\",\n        \"answer\": \"Irrigation should be stopped 15 days before digging of potato seed crops.\"\n    },\n    {\n        \"question\": \"What is the recommended spray for controlling fruit drop in mango and litchi?\",\n        \"answer\": \"Spray NAA 20 ppm by adding 0.5ml/L sticker to control fruit drop.\"\n    },\n    {\n        \"question\": \"What should be done to prevent internal tissue decay and black tip in fruits?\",\n        \"answer\": \"Foliar spray of 0.1% borax should be applied.\"\n    },\n    {\n        \"question\": \"What is the recommended spray for controlling scabies in plants?\",\n        \"answer\": \"Spray Karathane at 0.6% to control scabies.\"\n    },\n    {\n        \"question\": \"What is the recommended practice for managing midge infestations in orchards?\",\n        \"answer\": \"Cut and destroy the affected blossoms if the effect of midge is visible.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What should be done after the completion of the fruiting process?\",\n        \"answer\": \"After completion of the fruiting process, give one-third dose of nitrogen and potassium and maintain the moisture level by applying irrigation.\"\n    },\n    {\n        \"question\": \"Which crops are recommended for sowing in April?\",\n        \"answer\": \"Colocassia, Turmeric, and Elephant foot yam are recommended for sowing in April, either as sole crops or intercrops in litchi and mango orchards.\"\n    },\n    {\n        \"question\": \"How can black tip and internal tissue decay in crops be prevented?\",\n        \"answer\": \"Spray borax (0.8-1.0 percent) to prevent black tip and internal tissue decay.\"\n    },\n    {\n        \"question\": \"What is the purpose of installing wooden sex scent traps on trees?\",\n        \"answer\": \"Wooden sex scent traps are installed to monitor and control the number of fruit flies.\"\n    },\n    {\n        \"question\": \"How can water be saved in irrigation practices?\",\n        \"answer\": \"Install drip or sprinkler irrigation methods for water saving.\"\n    },\n    {\n        \"question\": \"What precautions should be taken for livestock during winter?\",\n        \"answer\": \"Livestock should be kept clean, dry, and warm with proper bedding material, and their houses should be protected from smoke and fully opened during the day for exposure to sunlight.\"\n    },\n    {\n        \"question\": \"What should be done to prevent pneumonia in livestock?\",\n        \"answer\": \"Protect animal houses from smoke and dust, which can increase the chances of developing pneumonia.\"\n    },\n    {\n        \"question\": \"How should new-born animals be protected from cold stress?\",\n        \"answer\": \"Provide new-born animals with jute coats until they start eating concentrate to protect them from cold stress.\"\n    },\n    {\n        \"question\": \"What is the recommended practice for poultry sheds during winter?\",\n        \"answer\": \"Poultry sheds should be preheated before introducing day-old chicks during winter.\"\n    },\n    {\n        \"question\": \"What is the recommended vaccination for kids above four months of age?\",\n        \"answer\": \"Kids above four months of age should be vaccinated with the PPR vaccine.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the recommended age for the first vaccination of cattle against FMD?\",\n        \"answer\": \"The recommended age for the first vaccination against FMD is 4-6 months.\"\n    },\n    {\n        \"question\": \"How often should cattle be vaccinated against Haemorrhagic Septicaemia and Black Quarter?\",\n        \"answer\": \"Cattle should be vaccinated annually against Haemorrhagic Septicaemia and Black Quarter.\"\n    },\n    {\n        \"question\": \"What is the recommended age for vaccinating female calves against brucellosis?\",\n        \"answer\": \"Female calves should be vaccinated against brucellosis at the age of 4-8 months.\"\n    },\n    {\n        \"question\": \"What is the purpose of adding coccidiostat to poultry and calf feed?\",\n        \"answer\": \"Coccidiostat is added to prevent problems of coccidiosis.\"\n    },\n    {\n        \"question\": \"How can mastitis in animals be prevented?\",\n        \"answer\": \"Mastitis can be prevented by following clean milk production practices.\"\n    },\n    {\n        \"question\": \"Why should animals not be allowed to graze near ponds and lakes?\",\n        \"answer\": \"Animals should not graze near ponds and lakes to protect them from internal parasitic infestation.\"\n    },\n    {\n        \"question\": \"What is the ideal depth for a fishpond?\",\n        \"answer\": \"The ideal depth for a fishpond is 1.5-2.5 meters.\"\n    },\n    {\n        \"question\": \"How can dissolved oxygen levels in fishponds be maintained during the Rabi season?\",\n        \"answer\": \"Dissolved oxygen levels can be maintained by aerating ponds with aerators or through water exchange using a submersible pump.\"\n    },\n    {\n        \"question\": \"What is the recommended stocking density for fishponds?\",\n        \"answer\": \"The recommended stocking density is between 7500-8000 fingerlings per hectare.\"\n    },\n    {\n        \"question\": \"What is the ratio for a six-species carp culture in Bihar?\",\n        \"answer\": \"The ratio for a six-species carp culture in Bihar is Catla: Rohu: Mrigal: Silver carp: Common carp: Grass carp at 1.5:2:1.5:1.5:1.5:2.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What are some candidate species for diversifying freshwater fish culture?\",\n        \"A\": \"Amur carp, Jayanti Rohu, Pacu, Mono sex Tilapia, Puntius gonionotus, Bighead carp, Magur, Pabda, and giant river prawn.\"\n    },\n    {\n        \"Q\": \"What is the purpose of constructing a polyhouse for prawn culture?\",\n        \"A\": \"A polyhouse helps maintain temperature when air temperature drops, which is beneficial for high-cost fishes like Macrobrachium rosenbergii (Giant river prawn).\"\n    },\n    {\n        \"Q\": \"What is the recommended water pH range for fish culture?\",\n        \"A\": \"The recommended water pH range is 6.5-7.5.\"\n    },\n    {\n        \"Q\": \"What should be done if the water pH in a fishpond is too low or too high?\",\n        \"A\": \"If the pH is too low, apply lime. If it is too high, apply gypsum.\"\n    },\n    {\n        \"Q\": \"Why should feeding be avoided when the temperature drops to 10째C?\",\n        \"A\": \"Fish growth minimizes from mid-November to February due to a lower metabolic rate, and feeding is not effective during this period.\"\n    },\n    {\n        \"Q\": \"What is the recommended treatment for fishponds before the onset of winters?\",\n        \"A\": \"Treat the pond with CIFAX @ 1l/ha, potassium permanganate @ 3-5 kg/ha, or limestone @ 150-200 kg/ha.\"\n    },\n    {\n        \"Q\": \"What is the benefit of duck-based fish farming in Bihar?\",\n        \"A\": \"Duck-based fish farming is considered the best model for income generation round the year, as ducks produce manure and serve as bio-aerators for fishponds.\"\n    },\n    {\n        \"Q\": \"What is biofloc farming, and which species are suitable for it?\",\n        \"A\": \"Biofloc farming is a minimal or zero water exchange system of fish farming that utilizes wastewater. Suitable species include Pangas, Magur, Kawai, Tilapia, and Common carp.\"\n    },\n    {\n        \"Q\": \"What is the major constraint in biofloc farming?\",\n        \"A\": \"The major constraint is the requirement of a 24X7 electricity connection.\"\n    },\n    {\n        \"Q\": \"What is the recommended practice for harvesting fish to prevent disease spread?\",\n        \"A\": \"Crafts used for fish catching must be washed with soap solution followed by a 5-minute dip treatment with 1% Sodi.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What solution is recommended for cleaning fish landing centres?\",\n        \"answer\": \"Bleaching powder (Calcium hypochlorite) or Sodium hypochlorite is recommended for cleaning fish landing centres.\"\n    },\n    {\n        \"question\": \"How many persons are allowed for fishing in freshwater bodies during craft operation?\",\n        \"answer\": \"A maximum of two persons are allowed for fishing in freshwater bodies during craft operation.\"\n    },\n    {\n        \"question\": \"What is the recommended safe distance for indigenous boats while fishing?\",\n        \"answer\": \"Indigenous boats should maintain a safe distance of 3 meters while fishing.\"\n    },\n    {\n        \"question\": \"What is Matsya Bandhu and its purpose?\",\n        \"answer\": \"Matsya Bandhu is a solar-based mobile refrigerated vehicle designed by Dr. Rajendra Prasad Central Agricultural University, Pusa, to help fish retailers avoid distress sales in late hours by selling fish hygienically at the doorstep.\"\n    },\n    {\n        \"question\": \"What are the general hygiene guidelines for fishermen and stakeholders?\",\n        \"answer\": \"The guidelines include wearing masks during all activities, washing hands with soap regularly, maintaining safe distance, and following a 14-day quarantine if tested COVID positive or if they are migrant workers from other states.\"\n    },\n    {\n        \"question\": \"What are the recommended wheat varieties for timely irrigated conditions in Jharkhand?\",\n        \"answer\": \"Recommended varieties include HD3249, HD3086, K1006, K0307, Birsa Gehu-3, HD2967, DBW39, HI1612, NW5052, Karan Bandana, DBW187, Raj 4120, NW5054, K9107, PBW443, HD2733, CBW 38, and HI 1556.\"\n    },\n    {\n        \"question\": \"What is the sowing time for wheat in rainfed conditions?\",\n        \"answer\": \"Wheat is generally sown from the last week of October to the first week of November in rainfed conditions.\"\n    },\n    {\n        \"question\": \"What is the seed requirement for timely sowing of wheat?\",\n        \"answer\": \"The seed requirement for timely sowing of wheat is 100 kg/ha.\"\n    },\n    {\n        \"question\": \"What is the recommended fertilizer application for timely irrigated wheat?\",\n        \"answer\": \"In timely irrigated conditions, 150:60:40 kg/ha (NPK) should be applied, with half of N and the entire dose of P & K given at sowing, and the remaining N in two equal doses at 21 DAS and 45 DAS.\"\n    },\n    {\n        \"question\": \"How many irrigations are recommended for wheat, and at what stages?\",\n        \"answer\": \"Six irrigations are recommended at 20-25 DAS (crown root initiation stage), 40-45 DAS (tillering stage), 70-75 DAS (late jointing stage), and other critical stages.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the recommended seed rate for wheat cultivation?\",\n        \"answer\": \"About 70 to 85 kg/ha seed is required depending on seed size.\"\n    },\n    {\n        \"question\": \"How should seeds be treated before sowing to prevent diseases in wheat?\",\n        \"answer\": \"Seed treatment with carbendazim 50 WP @ 2 gm/kg seed.\"\n    },\n    {\n        \"question\": \"What is the recommended spacing for sowing wheat seeds?\",\n        \"answer\": \"The seed should be placed 8-10 cm deep with 30X10 cm spacing.\"\n    },\n    {\n        \"question\": \"What is the basal dose of nutrients recommended for wheat cultivation?\",\n        \"answer\": \"25:50:25:20 Kg/ha (NPKS) as basal dose should be given at sowing time.\"\n    },\n    {\n        \"question\": \"How can weeds be controlled in wheat fields?\",\n        \"answer\": \"Apply pendimethalin 30 EC @ 1.5 litre/acre for pre-emergence, and spray 2,4-D @ 0.5 to 1 kg per hectare after 4-5 weeks of sowing.\"\n    },\n    {\n        \"question\": \"What are some improved varieties of gram mentioned in the text?\",\n        \"answer\": \"GNG 1958, KGP 59, KWR 108, Pusa 372, Pusa Chana 1021, HK4 (HK 05-169), HK 94-134, KAK-2, Birsa Chana-3, Pusa 256, GCP105, DCP92-3, PG-186 & BG1053.\"\n    },\n    {\n        \"question\": \"What is the recommended irrigation schedule for chickpea crops?\",\n        \"answer\": \"Give one irrigation at pre-flowering stage and one at pod development stage if winter rains fail.\"\n    },\n    {\n        \"question\": \"How can pod borer be managed in chickpea crops?\",\n        \"answer\": \"Spray spinosad 45 SC @ 0.1 ml/lit or indoxacarb 14.5 SC @ 0.3 ml/Lit or quinolphos @ 1.5 Liter/ha or flubendiamide 48 SC 0.1 ml/lit or Novacuron 10 EC 1 ml/lit of water.\"\n    },\n    {\n        \"question\": \"What is the recommended seed rate for lentil cultivation?\",\n        \"answer\": \"The optimum seed rate for normal crop is 30 kg/ha.\"\n    },\n    {\n        \"question\": \"What are some improved varieties of lentil mentioned in the text?\",\n        \"answer\": \"HUL 57; WBL77; KLS 218; PL 406; IPL 406; Mallik (K75); Arun (PL77-12); PL639; Narendra Masur-1; Shiwalik (L4076); BR25 and BR26.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the recommended seed rate for rapeseed-mustard when grown individually?\",\n        \"answer\": \"The recommended seed rate for rapeseed-mustard when grown individually is 3.75 kg per hectare, but the general recommendation is 5 kg/ha.\"\n    },\n    {\n        \"question\": \"How should seeds be treated before sowing to protect against seed-borne diseases?\",\n        \"answer\": \"Seeds should be treated with thiram @ 3g per kg of seeds before sowing to protect against seed-borne diseases.\"\n    },\n    {\n        \"question\": \"What is the optimum sowing time for mustard crop?\",\n        \"answer\": \"The optimum sowing time for mustard crop is between 15 October to 15 November.\"\n    },\n    {\n        \"question\": \"What is the recommended spacing for rapeseed-mustard cultivation?\",\n        \"answer\": \"The recommended spacing for rapeseed-mustard is 30 cm row to row and 10-15 cm plant to plant, with seeds sown at a depth of 2 cm.\"\n    },\n    {\n        \"question\": \"How can hairy caterpillar and semi-looper be controlled in lentil crops?\",\n        \"answer\": \"Hairy caterpillar and semi-looper can be controlled by spraying dimethoate 30EC @ 2 ml/litre of water.\"\n    },\n    {\n        \"question\": \"What is the recommended fertilizer application for Toria crop?\",\n        \"answer\": \"The recommended fertilizer application for Toria crop is 50:25:25:20 kg/ha (NPKS) on a soil test value basis.\"\n    },\n    {\n        \"question\": \"What is the critical period for weed competition in lentil crops?\",\n        \"answer\": \"The critical period for weed competition in lentil crops is 30 to 60 days after sowing.\"\n    },\n    {\n        \"question\": \"What irrigation schedule is recommended for lentil crops?\",\n        \"answer\": \"Lentil crops require 1-2 irrigations depending on rainfall, with the first irrigation given 25 to 30 days after sowing (DAS) and the second given 40-45 DAS.\"\n    },\n    {\n        \"question\": \"How can termites be controlled in lentil crops?\",\n        \"answer\": \"Termites can be controlled in lentil crops by spraying chlorpyriphos 20 EC @ 4 ml/litre of water.\"\n    },\n    {\n        \"question\": \"What soil types are suitable for mustard and rapeseed cultivation?\",\n        \"answer\": \"Light to heavy soil is good for mustard and rapeseed cultivation, with loam to heavy soil being suitable for toria crop.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the recommended pre-emergence spray for crops after sowing?\",\n        \"answer\": \"A pre-emergence spray of isoproturon @ 100g/500 liters of water per hectare should be applied within 2 days of sowing.\"\n    },\n    {\n        \"question\": \"How many irrigations are generally required for crops after sowing?\",\n        \"answer\": \"Crops generally require about three irrigations, applied at intervals of three weeks after sowing.\"\n    },\n    {\n        \"question\": \"What is the purpose of applying organic manures in soil?\",\n        \"answer\": \"Organic manures help conserve moisture in the soil and improve soil fertility.\"\n    },\n    {\n        \"question\": \"How can aphids be managed in crops?\",\n        \"answer\": \"Aphids can be managed by timely sowing, avoiding excessive use of nitrogenous fertilizers, and spraying thiamethoxam @ 80g or imidacloprid 17.8 SL 0.3ml/liter when infection is observed.\"\n    },\n    {\n        \"question\": \"What is the recommended treatment for white rust in crops?\",\n        \"answer\": \"Spray with Metalaxyl 8% + Mancozeb 64% @ 2g/liter of water or copper oxychloride @ 2.5g/liter of water twice at an interval of 10-15 days.\"\n    },\n    {\n        \"question\": \"What is the recommended planting distance for vegetable peas?\",\n        \"answer\": \"The planting distance for vegetable peas should be 30-35 cm row to row and 10-15 cm plant to plant on raised beds.\"\n    },\n    {\n        \"question\": \"What is the recommended seed rate for vegetable peas?\",\n        \"answer\": \"The seed rate for vegetable peas is about 50-60 kg per hectare.\"\n    },\n    {\n        \"question\": \"How should fertilizers be applied for vegetable peas?\",\n        \"answer\": \"Apply 쩍 dose of nitrogen at sowing and the remaining 쩍 dose after 35-40 days.\"\n    },\n    {\n        \"question\": \"What is the recommended seed treatment for Rhizoctonia solani and Fusarium spp.?\",\n        \"answer\": \"Treat seeds with Carbendazim and Mancozeb @ 3g per kg of seed to suppress Rhizoctonia solani and Fusarium spp.\"\n    },\n    {\n        \"question\": \"How can Spodoptera caterpillar infestation be prevented in cole crops?\",\n        \"answer\": \"Plant two rows of marigold or mustard (alternate host) after every 20 rows of cole crops to prevent Spodoptera caterpillar infestation.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the recommended interval for spraying Bavistin to control diseases in mango and litchi orchards?\",\n        \"answer\": \"The recommended interval is 10 days.\"\n    },\n    {\n        \"question\": \"What are the high-yielding varieties of onion mentioned for planting?\",\n        \"answer\": \"The high-yielding varieties are Pusa Red, Arka Niketan, Agrifound Dark Red, Patna White, and Bellary Red.\"\n    },\n    {\n        \"question\": \"What is the recommended spacing for planting onion seedlings?\",\n        \"answer\": \"The recommended spacing is 15 cm between rows and 10 cm between plants.\"\n    },\n    {\n        \"question\": \"How should rooted seedlings of tomato, brinjal, chillies, capsicum, and onion be treated before planting?\",\n        \"answer\": \"They should be dipped in Trichoderma solution (5g/L) for 5-6 hours before planting.\"\n    },\n    {\n        \"question\": \"What is the recommended fertilizer application rate per acre?\",\n        \"answer\": \"The recommended rate is urea 180 kg, DAP 50 kg, and MOP 40 kg per acre.\"\n    },\n    {\n        \"question\": \"What should be done if Fusarium wilt is observed in plants?\",\n        \"answer\": \"Affected plants should be removed from the field, and a recommended dose of potash fertilizer should be applied.\"\n    },\n    {\n        \"question\": \"What is the purpose of spraying zinc sulphate on mango and litchi plants?\",\n        \"answer\": \"It is sprayed to increase the number of female flowers per panicle.\"\n    },\n    {\n        \"question\": \"What is the recommended spacing for planting mid-season potato varieties?\",\n        \"answer\": \"The recommended spacing is 50 cm between rows and 20 cm between plants.\"\n    },\n    {\n        \"question\": \"How can powdery mildew in pea plants be controlled?\",\n        \"answer\": \"It can be controlled by spraying Karathane @ 1.5 ml/L of water or Sulfex @ 3 g/L of water.\"\n    },\n    {\n        \"question\": \"What measures can be taken to protect potato crops from frost?\",\n        \"answer\": \"Light irrigation and smoke can be applied during evening hours, and in extreme cases, spray Metalaxyl 4.0% + Mancozeb 64% W/W @ 2 ml/L of water.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"Q\": \"How often should irrigation be performed for crops?\",\n    \"A\": \"Irrigation should be given once every week and as per requirement.\"\n  },\n  {\n    \"Q\": \"What is the recommended method for cultivating summer vegetable seedlings?\",\n    \"A\": \"Farmers should culture the seedlings in a poly house or under straw mulching.\"\n  },\n  {\n    \"Q\": \"What should be done 15 days prior to digging up potatoes?\",\n    \"A\": \"Perform the halm cutting operation and remove top leaves to allow the tubers to harden.\"\n  },\n  {\n    \"Q\": \"How should potato tubers be graded for marketing?\",\n    \"A\": \"Potato tubers should be graded into four categories: <25 g, 25-50 g, 50-75 g, and >75 g.\"\n  },\n  {\n    \"Q\": \"What is the recommended planting distance for Chilli and Brinjal?\",\n    \"A\": \"The planting distance for Chilli and Brinjal should be 50X50 cm.\"\n  },\n  {\n    \"Q\": \"What solution should be used to dip the roots of seedlings before planting?\",\n    \"A\": \"Dip the roots of seedlings in Bavistein solution for half an hour before planting.\"\n  },\n  {\n    \"Q\": \"What are some high-yielding varieties of onion?\",\n    \"A\": \"High-yielding varieties of onion include Pusa red, Arka Niketan, Agrifound dark red, Patna white, and Bellary red.\"\n  },\n  {\n    \"Q\": \"How should onion seedlings be prepared before planting?\",\n    \"A\": \"Dip the roots of onion seedlings in Trichoderma solution (5 gm/L) for 5-6 hours before planting.\"\n  },\n  {\n    \"Q\": \"What should be done if Fusarium wilt is observed in plants?\",\n    \"A\": \"Apply the recommended dose of potash fertilizer and remove affected plants.\"\n  },\n  {\n    \"Q\": \"How can frost damage to new plants be minimized?\",\n    \"A\": \"Irrigation to new plants should be assured to minimize frost damage.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the recommended row-to-row and plant-to-plant spacing for cowpea?\",\n        \"answer\": \"The recommended spacing for cowpea is 30 cm row-to-row and 15 cm plant-to-plant.\"\n    },\n    {\n        \"question\": \"How much seed is required for sowing cowpea in one acre?\",\n        \"answer\": \"15 to 20 kg of seed is required for sowing cowpea in one acre.\"\n    },\n    {\n        \"question\": \"What are some high-yielding varieties of cowpea?\",\n        \"answer\": \"High-yielding varieties of cowpea include Swarn Mukut, Kashi Kanchan, Arka Garima, and Pusa Komal.\"\n    },\n    {\n        \"question\": \"What crops are suitable for cultivation in the present weather conditions?\",\n        \"answer\": \"Suitable crops include French bean, Brinjal, Tomato, Chilli, Pointed gourd, Watermelon, Cucumber, bush Cowpea, and Ladies finger.\"\n    },\n    {\n        \"question\": \"What are the high-yielding varieties of French bean?\",\n        \"answer\": \"High-yielding varieties of French bean are Swarna Lata and Swarna Priya.\"\n    },\n    {\n        \"question\": \"How should mango flowers infected by Midge insect be treated?\",\n        \"answer\": \"Infected mango flowers should be removed by cutting with a sharp knife.\"\n    },\n    {\n        \"question\": \"What is the recommended spacing for planting turmeric and ginger?\",\n        \"answer\": \"The recommended spacing is 20x50 cm for turmeric and 15x50 cm for ginger.\"\n    },\n    {\n        \"question\": \"What is the recommended fertilizer dose for one acre of ladies finger cultivation?\",\n        \"answer\": \"The recommended fertilizer dose is 40:20:20 kg of N:P:K for one acre.\"\n    },\n    {\n        \"question\": \"Why should insecticide spray be avoided during the flowering of litchi and mango?\",\n        \"answer\": \"Insecticide spray should be avoided because it can wash away pollen grains and kill pollinating insects.\"\n    },\n    {\n        \"question\": \"What measures should be taken to protect livestock during winter?\",\n        \"answer\": \"Livestock should be kept clean, dry, and warm with proper bedding, and their houses should be protected from smoke and properly ventilated.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What are some varieties of Berseem recommended for fodder cultivation?\",\n        \"answer\": \"Vardan, Mascavi, and BL-42 are recommended varieties of Berseem for fodder cultivation.\"\n    },\n    {\n        \"question\": \"When should Oat be sown to obtain maximum yield?\",\n        \"answer\": \"Oat should be sown in October to obtain maximum yield.\"\n    },\n    {\n        \"question\": \"How can surplus green fodder be preserved for lean periods?\",\n        \"answer\": \"Surplus green fodder can be dried in sunny days to make Hay, which can be used during lean periods.\"\n    },\n    {\n        \"question\": \"What is the recommended daily mineral mixture intake for cattle or buffalo?\",\n        \"answer\": \"Cattle or buffalo should be fed a mineral mixture at 50-60 g/day.\"\n    },\n    {\n        \"question\": \"At what age should kids be vaccinated with PPR vaccine?\",\n        \"answer\": \"Kids above four months of age should be vaccinated with PPR vaccine.\"\n    },\n    {\n        \"question\": \"What are some diseases that cattle and buffaloes should be vaccinated against?\",\n        \"answer\": \"Cattle and buffaloes should be vaccinated for FMD, Haemorrhagic Septicaemia, and Black Quarter.\"\n    },\n    {\n        \"question\": \"How often should FMD vaccination be repeated?\",\n        \"answer\": \"FMD vaccination should be repeated every six months.\"\n    },\n    {\n        \"question\": \"What is the recommended age for vaccinating female calves against brucellosis?\",\n        \"answer\": \"Female calves should be vaccinated once for brucellosis at the age of 4-8 months.\"\n    },\n    {\n        \"question\": \"What practices can prevent Mastitis in animals?\",\n        \"answer\": \"Mastitis in animals can be prevented by following clean milk production practices.\"\n    },\n    {\n        \"question\": \"What is the ideal depth and soil type for constructing new fishponds?\",\n        \"answer\": \"Rectangular ponds of clayey loam soil with a depth of 1.5-2.5m and a slope ratio of 2:1 are considered ideal.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the recommended stocking density for fish fingerlings per hectare?\",\n        \"answer\": \"The optimum stocking density varies between 7500-8000 fingerlings per hectare.\"\n    },\n    {\n        \"question\": \"What is the ratio of fish species recommended for composite fish culture in Bihar?\",\n        \"answer\": \"The ratio is Catla: Rohu: Mrigal: Silver carp: Common carp: Grass carp at 1.5:2:1.5:1.5:1.5:2.\"\n    },\n    {\n        \"question\": \"Why are small indigenous fishes like pothia and mola introduced in fishponds?\",\n        \"answer\": \"Because 1 kg of small indigenous fishes contains 1000-fold more vitamin content compared to large-sized culture fishes.\"\n    },\n    {\n        \"question\": \"What is the purpose of constructing a polyhouse for prawn culture?\",\n        \"answer\": \"Polyhouses help maintain temperature when air temperature drops, which is beneficial for high-cost fishes like Macrobrachium rosenbergii (Giant river prawn).\"\n    },\n    {\n        \"question\": \"What is the ideal water pH range for fish culture?\",\n        \"answer\": \"The ideal water pH range is 6.5-7.5.\"\n    },\n    {\n        \"question\": \"What should be done if the water pH in a fishpond is too low?\",\n        \"answer\": \"Lime should be applied to raise the pH level.\"\n    },\n    {\n        \"question\": \"What is the recommended treatment for fishponds before the onset of winters?\",\n        \"answer\": \"Treat the pond with CIFAX @ 1 liter per hectare, potassium permanganate @ 3-5 kg/ha, or limestone @ 150-200 kg/ha.\"\n    },\n    {\n        \"question\": \"What is the stocking density of ducks recommended for duck-based fish farming?\",\n        \"answer\": \"The recommended stocking density is 200-300 ducks per hectare.\"\n    },\n    {\n        \"question\": \"What is biofloc farming, and who is it suitable for?\",\n        \"answer\": \"Biofloc farming is a new technology suitable for farmers who do not possess land for pond construction, as it requires minimal or zero water exchange.\"\n    },\n    {\n        \"question\": \"What immediate action should be taken if fishes show irregular movement and gasping near the surface?\",\n        \"answer\": \"Immediate aeration is required, as this indicates low oxygen concentration in the fishpond.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"Which fish species are suitable for the exchange system of fish farming utilizing wastewater?\",\n        \"A\": \"Pangas, Magur, Kawai, Tilapia, and Common carp.\"\n    },\n    {\n        \"Q\": \"What is the estimated cost to construct a biofloc setup with 7 tanks of 4m diameter and 1.5m height?\",\n        \"A\": \"Rs. 7-8 lakh.\"\n    },\n    {\n        \"Q\": \"What is a major constraint in the biofloc fish farming technique?\",\n        \"A\": \"The requirement of a 24X7 electricity connection.\"\n    },\n    {\n        \"Q\": \"What are the conditions for promoting cage culture in large reservoirs?\",\n        \"A\": \"Places with a water depth of 10m round the year and a water spread area of 1000 ha or more.\"\n    },\n    {\n        \"Q\": \"How should harvesting crafts used for fish catching be treated?\",\n        \"A\": \"Washed with soap solution followed by a 5-minute dip treatment with 1% Sodium hypochlorite solution and left to dry.\"\n    },\n    {\n        \"Q\": \"What guidelines are provided for fish landing centres to maintain hygiene?\",\n        \"A\": \"Cleaning with bleaching powder (Calcium hypochlorite) or Sodium hypochlorite.\"\n    },\n    {\n        \"Q\": \"What is Matsya Bandhu, and what is its purpose?\",\n        \"A\": \"A solar-based mobile refrigerated vehicle designed by Dr. Rajendra Prasad Central Agricultural University, Pusa, to help fish retailers avoid distress sales by selling fish hygienically at the doorstep.\"\n    },\n    {\n        \"Q\": \"What rice varieties are recommended for the boro season in West Bengal?\",\n        \"A\": \"IET-4786 (Satabdi), Lalat, WGL-20471 (Lal minikit), IR-36, CR-126-42-1, IET-1444, IET-2233, and IET-4094 (Khitish).\"\n    },\n    {\n        \"Q\": \"What is the recommended fertilizer application for boro paddy cultivation?\",\n        \"A\": \"Apply 54.25 kg neem coated urea + 312.5 kg SSP + 63 kg MOP ha-1 as basal, then 108.5 kg neem coated urea ha-1 at maximum tillering stage, and another 54.25 kg neem coated urea + 20 kg MOP at panicle initiation stage.\"\n    },\n    {\n        \"Q\": \"What personal hygiene guidelines are advised for fishermen and stakeholders?\",\n        \"A\": \"Wearing masks, washing hands with soap regularly, maintaining safe distance, and following 14 days quarantine if tested COVID positive or if they have travelled from other states.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"How should seeds be treated before sowing to prevent fungal diseases?\",\n        \"answer\": \"Seeds should be treated with mancozeb + carbendazim 2 g or Trichoderma viridae 10 g by dissolving in 10-12 ml water per kg seed; make a paste of the fungicide solution and rub it on the seed.\"\n    },\n    {\n        \"question\": \"Which paddy varieties are recommended for saline-affected soils?\",\n        \"answer\": \"Mohan (CSR-4), CSR-36, CSR-43, CSR-46, Gosaba-5, and Gosaba-6 are recommended for saline-affected soils.\"\n    },\n    {\n        \"question\": \"What practices can help reduce soil salinity and improve soil health?\",\n        \"answer\": \"Applying 7-8 t/ha decomposed cowdung/FYM or 1.5-2.0 t/ha vermicompost during land preparation or practicing green manuring can help reduce soil salinity and improve soil health.\"\n    },\n    {\n        \"question\": \"What method of transplanting is recommended to avoid BPH pest load?\",\n        \"answer\": \"Transplanting should be done by following the skip row method to avoid BPH pest load.\"\n    },\n    {\n        \"question\": \"What is the recommended application of zinc sulphate monohydrate for better paddy yield?\",\n        \"answer\": \"Apply 15-20 kg of zinc sulphate monohydrate (33%) per hectare during puddling for better yield.\"\n    },\n    {\n        \"question\": \"What is the recommended planting geometry for maize in Rabi season?\",\n        \"answer\": \"The recommended planting geometry for maize is 60 cm  30 cm, maintaining an optimum plant population of 7 plants per square meter.\"\n    },\n    {\n        \"question\": \"What is the recommended basal fertilizer application for maize cultivation?\",\n        \"answer\": \"Apply 174 kg urea, 375 kg SSP, 120 kg MOP, and 25 kg ZnSO4 (Zinc Sulphate) per hectare as basal fertilizer for maize cultivation.\"\n    },\n    {\n        \"question\": \"When should lentil sowing be completed for sole cropping?\",\n        \"answer\": \"Sowing of lentil for sole cropping should be completed between 1st and 30th November.\"\n    },\n    {\n        \"question\": \"What is the recommended seed rate for lentil cultivation?\",\n        \"answer\": \"The recommended seed rate for lentil cultivation is 30 kg seed per hectare.\"\n    },\n    {\n        \"question\": \"What is the recommended time for sowing mustard in Rabi season?\",\n        \"answer\": \"Sowing of mustard should be completed within the 3rd week of October to the second week of November.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the recommended planting geometry for crops?\",\n        \"answer\": \"The recommended planting geometry is 20-25 cm  10 cm.\"\n    },\n    {\n        \"question\": \"How much FYM should be applied prior to sowing?\",\n        \"answer\": \"3-ton FYM ha-1 should be applied 10 days prior to sowing.\"\n    },\n    {\n        \"question\": \"What fertilizers are applied as basal, and in what quantities?\",\n        \"answer\": \"43.5 kg urea, 250 kg SSP, and 67 kg MOP ha-1 are applied as basal.\"\n    },\n    {\n        \"question\": \"When and how much urea should be top-dressed?\",\n        \"answer\": \"Urea should be top-dressed in two splits: 87 kg at the branching stage and 43.5 kg at the flowering stage.\"\n    },\n    {\n        \"question\": \"How many irrigations are recommended, and at which stages?\",\n        \"answer\": \"At least two irrigations are recommended at the branching and flowering stages.\"\n    },\n    {\n        \"question\": \"What should be applied in sulphur-deficient soil?\",\n        \"answer\": \"45 kg sulphur ha-1 should be applied in sulphur-deficient soil.\"\n    },\n    {\n        \"question\": \"Which greengram varieties are recommended for summer cultivation?\",\n        \"answer\": \"Short duration yellow mosaic virus resistant varieties like IPM-02-14 or IPM-205-7 are recommended.\"\n    },\n    {\n        \"question\": \"How should sunflower seeds be treated for better yield?\",\n        \"answer\": \"Two-time spray with micro nutrient (B) @ 2 g/lit of water during square formation and flowering stage is recommended.\"\n    },\n    {\n        \"question\": \"What is the recommended spacing for cotton sowing?\",\n        \"answer\": \"The recommended spacing for cotton sowing is 45cm  30 cm.\"\n    },\n    {\n        \"question\": \"Which vegetable crops are suggested for upland situations?\",\n        \"answer\": \"Cabbage, cauliflower, knolkhol, brinjal, beet, carrot, and radish are suggested for upland situations.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What are some salt-tolerant crops recommended for saline lands affected by YAAS?\",\n        \"answer\": \"Salt-tolerant crops include bitter gourd, ash gourd, beet, tomato, palak, cabbage, cauliflower, knolkhol, and dolichos bean.\"\n    },\n    {\n        \"question\": \"Why is dolichos bean considered a good choice for saline lands?\",\n        \"answer\": \"Dolichos bean is a good choice because it has a long cropping period, allowing for harvesting and marketing from October to February-March.\"\n    },\n    {\n        \"question\": \"What is the recommended seed priming method for better germination and crop resistance?\",\n        \"answer\": \"Seed priming using Chlormequat Chloride (Cycocel) @ 50 ppm for 8 hours or a 1% solution of KNO3 for 1-2 hours is recommended.\"\n    },\n    {\n        \"question\": \"How can farmers minimize input costs and increase net returns?\",\n        \"answer\": \"Farmers can minimize input costs by using homemade manure, neem pesticide, and bio-fungicides like Trichoderma.\"\n    },\n    {\n        \"question\": \"What is the recommended application of lime before land preparation?\",\n        \"answer\": \"Apply lime @ 2 kg/cottah to minimize soil-borne diseases, maintain soil pH, and enrich soil calcium content.\"\n    },\n    {\n        \"question\": \"What soluble fertilizer is recommended for healthy seedling growth of vegetables?\",\n        \"answer\": \"Spray soluble fertilizer 12:61:0 @ 3g/lt on 12-15 days old seedlings and repeat after 7 days.\"\n    },\n    {\n        \"question\": \"How can micronutrient management improve vegetable crop growth and yield?\",\n        \"answer\": \"Apply Mixed Micronutrient (Grade 5) @ 1.5 to 2 g/lt as a spray at 15 to 20 days intervals for better micronutrient management.\"\n    },\n    {\n        \"question\": \"What is the recommended spray to increase female flower count in cucurbit vegetables?\",\n        \"answer\": \"Spray Ethrel (or ethepon 39.5% SL) @ 0.4 ml/lt twice at the 2 and 4 true leaf stages.\"\n    },\n    {\n        \"question\": \"How can fruit drop in mango, guava, and litchi be managed?\",\n        \"answer\": \"Fruit drop can be managed by spraying NAA 4.5% W/W (Planofix) @ 0.3 ml/lt at 10-12 days intervals.\"\n    },\n    {\n        \"question\": \"What practice is recommended for better soil moisture in orchards?\",\n        \"answer\": \"Mulching with straw or grass is recommended to maintain sufficient soil moisture in orchard basins.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"When should fertilizers and manures be applied beneath the tree canopy in litchi cultivation?\",\n        \"A\": \"Fertilizers and manures should be applied during October and again in February.\"\n    },\n    {\n        \"Q\": \"What is a recommended practice to prevent fruit cracking in litchi during hot summer?\",\n        \"A\": \"Maintain sufficient moisture through regular watering and mulching with straw or grass around the tree basin.\"\n    },\n    {\n        \"Q\": \"How can fruit fly attack be prevented in guava?\",\n        \"A\": \"Individual fruit wrapping with transparent polythene packets and a paper piece inside to protect from direct sunlight.\"\n    },\n    {\n        \"Q\": \"What type of nitrogenous fertilizer is recommended for better fruit colour and quality in guava?\",\n        \"A\": \"Ammonium sulphate is recommended instead of urea.\"\n    },\n    {\n        \"Q\": \"What is the recommended interval for applying soluble fertilizers like 19:19:19 or 20:20:20 in guava cultivation?\",\n        \"A\": \"Apply at 10-12 days interval.\"\n    },\n    {\n        \"Q\": \"How can betelvine plants be protected from cold injury?\",\n        \"A\": \"Use plastic sheet protection towards the north and west sides of the boroz and 75% shade net as roofing.\"\n    },\n    {\n        \"Q\": \"What is the recommended spray to increase plant defense against disorders in betelvine?\",\n        \"A\": \"Spray 13:0:45 @ 3g/lt at 7-10 days interval.\"\n    },\n    {\n        \"Q\": \"What measures should be taken to protect newborn animals from cold stress in animal husbandry?\",\n        \"A\": \"Supply extra heat, maintain proper cleaning and ventilation, and provide bedding and extra heat.\"\n    },\n    {\n        \"Q\": \"What is the recommended practice for preventing winter stress in poultry?\",\n        \"A\": \"Hang gunny bags at places where cold air enters and provide 24 hours lighting inside the poultry shade.\"\n    },\n    {\n        \"Q\": \"What vaccinations are recommended for cattle in animal husbandry?\",\n        \"A\": \"Vaccinate for FMD, HS, and BQ.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the recommended seed rate for rabi rice?\",\n        \"answer\": \"The recommended seed rate for rabi rice is 20 kg/acre.\"\n    },\n    {\n        \"question\": \"How can feed costs in fish cultivation be reduced?\",\n        \"answer\": \"Feed costs can be reduced by preparing feed from low-cost, easily available local ingredients.\"\n    },\n    {\n        \"question\": \"What is the stocking density recommended for fish cultivation during winter?\",\n        \"answer\": \"The recommended stocking density during winter is about 20%.\"\n    },\n    {\n        \"question\": \"How should the pond be treated before the onset of winter to protect fish from diseases?\",\n        \"answer\": \"The pond should be treated with CIFAX @ 400 ml/acre, potassium permanganate @ 1-2 kg/acre, or limestone @ 50-100 kg/acre. Salt application @ 100 kg/acre is also recommended.\"\n    },\n    {\n        \"question\": \"What are some rice varieties recommended for rabi cultivation?\",\n        \"answer\": \"Recommended rice varieties for rabi cultivation include CR dhan 310, Hiranyamayee, improved Lalat, IR-36, Jogesh, Manaswini, MTU-101, MTU-1010, Naveen, Rajlaxmi (Hybrid), and Ajay (Hybrid).\"\n    },\n    {\n        \"question\": \"How can stem borer in paddy be managed?\",\n        \"answer\": \"Stem borer can be managed by applying Cartap Hydrochloride 4% G @ 8 kg/acre, Chlorantraniliprole 0.4% GR @ 4 kg/acre, or Imidacloprid 0.3% GR @ 6 kg/acre mixed with sand at a 1:1 ratio at the early crop stage.\"\n    },\n    {\n        \"question\": \"What is the recommended seed rate for rabi maize?\",\n        \"answer\": \"The recommended seed rate for rabi maize is 6-7 kg/acre.\"\n    },\n    {\n        \"question\": \"What is the recommended treatment for seeds to avoid fall army worm infestation in maize?\",\n        \"answer\": \"Seed treatment with (Cyantoaniliprone 19.8% + Thiamethoxam 19.8%) @ 4 ml per kg of seeds is recommended.\"\n    },\n    {\n        \"question\": \"What are some suitable varieties of green gram and black gram for higher productivity?\",\n        \"answer\": \"Suitable varieties include green gram IPM 02-14 and black gram PU-31.\"\n    },\n    {\n        \"question\": \"How can weed growth be suppressed in pulse crops like black gram?\",\n        \"answer\": \"Weed growth can be suppressed by inter-cropping black gram with maize.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is recommended for better germination and breaking seed dormancy in black gram and green gram?\",\n        \"answer\": \"Basal application of Zypmite Plus as a soil conditioner, use of Neem Oil, and vermicompost under Integrated Nutrient Management (INM).\"\n    },\n    {\n        \"question\": \"How should black gram and green gram be sown after rice harvesting?\",\n        \"answer\": \"Using a tractor-operated seed cum fertilizer drill with available soil moisture to reduce seed rate, labor cost, and time.\"\n    },\n    {\n        \"question\": \"What herbicide is recommended for pre-emergence weed control in black gram and green gram?\",\n        \"answer\": \"Pendimethalin @ 1.5 kg/ha.\"\n    },\n    {\n        \"question\": \"What is recommended for controlling Leaf eating caterpillar in black gram and green gram?\",\n        \"answer\": \"Spraying Emamectin Benzoate 5% SG @ 80 gm or Profenofos 40% EC + Cypermethrin 4% EC @ 400 ml in 200 litres of water per acre.\"\n    },\n    {\n        \"question\": \"How can Powdery mildew in green gram be controlled?\",\n        \"answer\": \"Spraying Sulphur 80% WP @ 800 gm per acre in 200 litres of water.\"\n    },\n    {\n        \"question\": \"What is the recommended method to control Yellow Vein Mosaic disease in green gram?\",\n        \"answer\": \"Wipe out all affected plants and spray Thiamethoxam 25% WG @ 66 gm per acre in 200 litres of water to control White fly vectors.\"\n    },\n    {\n        \"question\": \"What is advised for seed treatment in mustard for better germination?\",\n        \"answer\": \"Seed treatment with Mancozeb @ 3 grams per Kg of seeds.\"\n    },\n    {\n        \"question\": \"What is recommended to control Diamond back moth in mustard?\",\n        \"answer\": \"Spray Fipronil 5% SC @ 400 ml in 200 litres of water per acre.\"\n    },\n    {\n        \"question\": \"What type of soil is suitable for groundnut cultivation?\",\n        \"answer\": \"Light sandy soil with good drainage facility.\"\n    },\n    {\n        \"question\": \"What is the recommended fertilizer application for groundnut cultivation?\",\n        \"answer\": \"Application of 20 kg N and 40 kg each of P2O5 and K2O/ha in the furrows before sowing, mixed with the soil to avoid direct contact with seeds.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the recommended dosage of Spinosad 45% SC for thrips infestation?\",\n        \"answer\": \"Spinosad 45% SC is recommended at 80 ml in 200 litres of water per acre of land.\"\n    },\n    {\n        \"question\": \"Which chemical is recommended for thrips infestation in groundnut?\",\n        \"answer\": \"Fipronil 5% SC @ 400 ml in 200 litres of water per acre of land is recommended for thrips infestation in groundnut.\"\n    },\n    {\n        \"question\": \"What are some suitable onion varieties for the Rabi season?\",\n        \"answer\": \"Suitable onion varieties for the Rabi season include Nasik Red, N-53, Arka Kalyan, Arka Niketan, Arka Pragati, Agri Found Light Red, Bhima Red, Bhima Super, and Bhima Shakti.\"\n    },\n    {\n        \"question\": \"What is the seed rate for onion cultivation?\",\n        \"answer\": \"The seed rate for onion cultivation is 3-4 kg per acre.\"\n    },\n    {\n        \"question\": \"How should onion seeds be treated before planting?\",\n        \"answer\": \"Onion seeds should be treated with Thiram at 3g per kg of seed.\"\n    },\n    {\n        \"question\": \"What is the recommended fertilizer dose for onion cultivation?\",\n        \"answer\": \"The recommended fertilizer dose for onion cultivation is 20-25 t/Ha FYM along with NPK 120:60:60 kg/ha.\"\n    },\n    {\n        \"question\": \"What herbicide is recommended for onion cultivation within 3 days after transplanting?\",\n        \"answer\": \"Oxyflurofen (23.5% EC) @ 80 ml per acre is recommended within 3 days after transplanting.\"\n    },\n    {\n        \"question\": \"How should mango plants be treated during foggy or cloudy weather?\",\n        \"answer\": \"During foggy or cloudy weather, mango plants should be sprayed with wettable Sulphur at 3 gm per litre.\"\n    },\n    {\n        \"question\": \"What is the recommended application of Paclobutrazol for regular bearing in mango trees?\",\n        \"answer\": \"Paclobutrazol is recommended at 15 ml (for 7-15 years old plants) or 20 ml (for 16-25 years old plants) in 10 litres of water, applied in a ring 5 cm deep and 2-3 ft away from the trunk during September-October.\"\n    },\n    {\n        \"question\": \"What is the recommended seed treatment for cauliflower seeds?\",\n        \"answer\": \"Cauliflower seeds should be treated with Thiram at 3g per kg of seed.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What are the recommended chemicals for controlling Epilachna beetle in cucurbits?\",\n        \"answer\": \"Chlorpyriphos 20% EC @ 2 ml/litre of water, Profenophos 50% EC @ 2 ml/litre of water, or neem-based pesticide (Azadirachtin) 1500 PPM @ 3 ml/litre of water.\"\n    },\n    {\n        \"question\": \"What are some recommended potato varieties for cultivation?\",\n        \"answer\": \"Kufri Ashoka, Kufri Phukhraj, Kufri Jyoti, Kufri Lalima, Kufri Chipsona, Kufri Sinduri.\"\n    },\n    {\n        \"question\": \"What is the recommended planting distance for potatoes?\",\n        \"answer\": \"Row to Row 30 cm and Plant to plant 15 cm.\"\n    },\n    {\n        \"question\": \"How can early leaf blight in potato be managed?\",\n        \"answer\": \"Spraying Mancozeb 75% WP @ 600 gm/acre or (Carbendazim 12% + Mancozeb 63% W.P) @ 400 gm/acre in 200 litres of water.\"\n    },\n    {\n        \"question\": \"What is the recommended hybrid tomato variety that is triple disease resistant?\",\n        \"answer\": \"Arka rakshak.\"\n    },\n    {\n        \"question\": \"How can mite infestation in brinjal be controlled?\",\n        \"answer\": \"Spraying Propargite 57% EC @ 400 ml in 200 litres of water per acre.\"\n    },\n    {\n        \"question\": \"What is the recommended treatment for fungal wilt in tomato?\",\n        \"answer\": \"Soil drenching and spraying with Thiophanate methyl 70% WP @ 300 gm per acre in 200 litres of water.\"\n    },\n    {\n        \"question\": \"How can sucking pests like white flies be controlled in brinjal and other vegetables?\",\n        \"answer\": \"Spraying Thiamethoxam 25% WG @ 66 gm in 200 litres of water per acre.\"\n    },\n    {\n        \"question\": \"What are the recommended broccoli varieties for cultivation?\",\n        \"answer\": \"Palam Samruddhi and Pusa KTS-1.\"\n    },\n    {\n        \"question\": \"What is the recommended fertilizer dose for broccoli cultivation?\",\n        \"answer\": \"30:40:40 NPK/Ac.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What are the improved varieties of Bush type French Bean?\",\n        \"answer\": \"Improved varieties for Bush type French Bean include Arka Komal, Contender, Pusa Parbati, and Pant Anupama.\"\n    },\n    {\n        \"question\": \"What is the recommended NPK fertilizer dose for French Bean cultivation?\",\n        \"answer\": \"The recommended NPK fertilizer dose for French Bean is 8:20:20.\"\n    },\n    {\n        \"question\": \"How can Epizootic Ulcerative Syndrome in fish be controlled?\",\n        \"answer\": \"Epizootic Ulcerative Syndrome in fish can be controlled by applying CIFAX @ 1000ml per hectare per meter of water spread area.\"\n    },\n    {\n        \"question\": \"What is the recommended supplementary feed rate for fish culture?\",\n        \"answer\": \"The recommended supplementary feed rate is 2% of the total fish mass body weight, to be given at 2 pm.\"\n    },\n    {\n        \"question\": \"How should pond water depth be maintained in fish culture?\",\n        \"answer\": \"Pond water depth should be maintained up to 5 feet by adding water from a nearby source.\"\n    },\n    {\n        \"question\": \"What is the purpose of false netting in a fish culture pond?\",\n        \"answer\": \"False netting is used to access the health and growth of fishes in the culture pond.\"\n    },\n    {\n        \"question\": \"How can oxygen depletion in a fish pond be addressed?\",\n        \"answer\": \"Oxygen depletion in a fish pond can be addressed by aerating the pond water.\"\n    },\n    {\n        \"question\": \"What is the recommended stocking density for Silver carp in a fish culture pond?\",\n        \"answer\": \"The recommended stocking density for Silver carp is 300-400 advanced fingerlings per hectare per meter of water spread area.\"\n    },\n    {\n        \"question\": \"How often should KMnO4 be applied in a fish culture pond as a prophylactic measure?\",\n        \"answer\": \"KMnO4 should be applied every 3 months as a prophylactic measure in a fish culture pond.\"\n    },\n    {\n        \"question\": \"What temperature should be maintained during the first week of brooding in poultry?\",\n        \"answer\": \"During the first week of brooding in poultry, the temperature should be maintained at 35째C.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"When is the best time to disinfect a mushroom shed for Oyster mushroom cultivation?\",\n        \"A\": \"The first week of November.\"\n    },\n    {\n        \"Q\": \"What solution is used to disinfect the mushroom shed?\",\n        \"A\": \"200 ml of formalin in 6 litres of water.\"\n    },\n    {\n        \"Q\": \"How long should the mushroom shed be closed after disinfection?\",\n        \"A\": \"Two days.\"\n    },\n    {\n        \"Q\": \"What is the recommended treatment for paddy straw used in Oyster mushroom cultivation?\",\n        \"A\": \"Soak in 1% lime water for 10-12 hours, followed by steam sterilization and shade drying to 65% moisture content.\"\n    },\n    {\n        \"Q\": \"What should be done if flies or larvae are seen in the mushroom bed?\",\n        \"A\": \"Spray 1-1.5 ml of Dichlorovos or 1.5-2 ml of Malathion per litre of water around the bed and close the shed for one day.\"\n    },\n    {\n        \"Q\": \"What value-added products are recommended to avoid distress sale of Oyster Mushroom?\",\n        \"A\": \"Mushroom powder, pickle, and sauce.\"\n    },\n    {\n        \"Q\": \"What is the seed hardening process for green gram or black gram seeds in dry land ecosystems?\",\n        \"A\": \"Treat seeds with 100 ppm MnSO4 for 3 hours at a 1:0.3 ratio and dry back to original seed moisture content (8-9%) under shade.\"\n    },\n    {\n        \"Q\": \"What is the recommended seed rate for maize cultivation?\",\n        \"A\": \"20 kg/ha.\"\n    },\n    {\n        \"Q\": \"What is the best season for groundnut sowing in island conditions?\",\n        \"A\": \"The second fortnight of December to the second fortnight of January.\"\n    },\n    {\n        \"Q\": \"What is the recommended foliar application for groundnut to improve pod filling?\",\n        \"A\": \"Spray a combined nutrient solution (DAP 2.5 kg, Ammonium sulphate 1 kg, and borax 0.5 kg) on the 25th and 35th days after sowing.\"\n    }\n]\n```",
    "```json\n[\n  {\n    \"question\": \"What should be done to prevent diseases in livestock?\",\n    \"answer\": \"A vaccination schedule should be followed as per the recommendations of the state Veterinary Department, such as vaccination for swine fever in pigs and FMD for livestock.\"\n  },\n  {\n    \"question\": \"How can livestock be protected from extreme stress due to hot and humid conditions?\",\n    \"answer\": \"Proper housing with ventilation should be provided to protect livestock from extreme stress due to hot and humid conditions.\"\n  },\n  {\n    \"question\": \"What are some bio-security measures for livestock farms?\",\n    \"answer\": \"Strict bio-security procedures should be followed, including providing a foot bath at the entrance with phenyl, Dettol, or Savlon, and cleaning and disinfecting the surrounding area with hypochloride solutions, phenol solutions, or lime.\"\n  },\n  {\n    \"question\": \"What should be done to ensure clean milk production?\",\n    \"answer\": \"Clean milk production practices should be followed during milking, storing, transporting, and marketing to prevent contamination of milk with dust and microbes.\"\n  },\n  {\n    \"question\": \"How can low-cost feed be formulated for livestock?\",\n    \"answer\": \"Low-cost feed can be formulated from locally available ingredients such as broken rice, rice bran, coconut cake, chunni (pulse), till cake, and Azolla.\"\n  },\n  {\n    \"question\": \"What should be done to prevent early piglet mortality during winter?\",\n    \"answer\": \"Artificial heat should be provided to newborn piglets to avoid early piglet mortality during winter.\"\n  },\n  {\n    \"question\": \"How can farmers ensure year-round availability of nutritious fodder?\",\n    \"answer\": \"Farmers should sow fodder seeds or cuttings like Paragrass, Guinea grass, Hybrid Napier, and Sorghum, and harvest excess fodder to convert it into haylage or silage for future use.\"\n  },\n  {\n    \"question\": \"Why is mineral mixture supplementation important for livestock?\",\n    \"answer\": \"Supplementation of mineral mixture (50g for cattle, 25g for goats and pigs) improves productivity and reproductive performance in livestock.\"\n  },\n  {\n    \"question\": \"What precautions should be taken in poultry farms to prevent diseases?\",\n    \"answer\": \"Poultry should be dewormed for internal parasites and dipped/dusted for external parasites. A vaccination schedule should be followed for diseases like Ranikhet, IBD, and Mareks as per the state Veterinary Departments recommendations.\"\n  },\n  {\n    \"question\": \"How can dampening and fungal growth in poultry sheds be prevented?\",\n    \"answer\": \"Deep litter should be frequently turned and mixed with lime to prevent dampening and cake formation, which can lead to fungal growth.\"\n  }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What solutions can be used for disinfecting empty poultry sheds?\",\n        \"answer\": \"Empty poultry sheds can be disinfected by fumigating with formalin and potassium permanganate or spraying with a 10% formalin solution.\"\n    },\n    {\n        \"question\": \"What are some locally available ingredients for formulating low-cost poultry feed?\",\n        \"answer\": \"Locally available ingredients for low-cost poultry feed include broken rice, rice bran, coconut cake, chunni (pulse), till cake, fishmeal, azolla, and shell grits.\"\n    },\n    {\n        \"question\": \"How should poultry feed be stored to prevent spoilage?\",\n        \"answer\": \"Poultry feed should be stored in a dry and cool place to prevent dampening and moulding.\"\n    },\n    {\n        \"question\": \"Why is artificial brooding important for chicks?\",\n        \"answer\": \"Artificial brooding is important for healthy growth and to reduce mortality in chicks up to 4-6 weeks of age.\"\n    },\n    {\n        \"question\": \"What should be done to combat heat stress in poultry?\",\n        \"answer\": \"Electrolytes should be provided to poultry to combat heat stress.\"\n    },\n    {\n        \"question\": \"Why is it important to avoid herding different species in the same premises?\",\n        \"answer\": \"Herding different species in the same premises can lead to disease transmission and other health issues.\"\n    },\n    {\n        \"question\": \"What measures should be taken to maintain hygiene in farms and marketplaces?\",\n        \"answer\": \"Always wear a mask, use sanitizer, wash hands with soap, and maintain social distancing in farms and marketplaces.\"\n    },\n    {\n        \"question\": \"How can the impact of high temperatures on fish ponds be mitigated?\",\n        \"answer\": \"The impact of high temperatures can be mitigated by maintaining a water depth of 5-6 feet and providing partial shading with non-deciduous trees.\"\n    },\n    {\n        \"question\": \"What should be done if fish come to the surface to gasp for air?\",\n        \"answer\": \"If fish come to the surface to gasp for air, provide aeration and suspend manuring and feeding.\"\n    },\n    {\n        \"question\": \"How can the toxicity of ammonia in fish ponds be reduced?\",\n        \"answer\": \"The toxicity of ammonia can be reduced by keeping the ponds well-aerated and adding a dose of gypsum or alum as per expert advice.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the recommended feeding practice for fish?\",\n        \"A\": \"Feed fish daily with good quality feed having 25% crude protein @ 1.5-2.0% of the fish body weight after sunrise (between 9-11 a.m.), preferably by bag feeding.\"\n    },\n    {\n        \"Q\": \"When should feeding be suspended for fish?\",\n        \"A\": \"Feeding should be suspended if fish come to the surface for gasping atmospheric air or if disease is observed.\"\n    },\n    {\n        \"Q\": \"What are the recommended prophylactic measures for fish farming?\",\n        \"A\": \"Recommended prophylactic measures include liming and potassium permanganate application.\"\n    },\n    {\n        \"Q\": \"What should be done in case of disease occurrence in fish?\",\n        \"A\": \"Consult an expert from KVKs, ICAR-CIARI, Port Blair, or the Department of Fisheries.\"\n    },\n    {\n        \"Q\": \"What are the recommended practices for brinjal cultivation?\",\n        \"A\": \"Select high-yield round fruited varieties as per local market demand and follow Integrated Pest Management practices for control of fruit and shoot borer.\"\n    },\n    {\n        \"Q\": \"What are the wilt-resistant brinjal varieties mentioned?\",\n        \"A\": \"CARI brinjal-1, CARI brinjal-2, and other local private company varieties.\"\n    },\n    {\n        \"Q\": \"What is the recommended lime application for tomato cultivation?\",\n        \"A\": \"Apply lime @ 100kg/acre before transplanting of seedlings.\"\n    },\n    {\n        \"Q\": \"What are the wilt-resistant tomato varieties mentioned?\",\n        \"A\": \"Arka Rashak Laxmi, Utkal Raja, and Utkal Urbasi.\"\n    },\n    {\n        \"Q\": \"What type of soil is recommended for root crops like radish and carrot?\",\n        \"A\": \"Sandy loam loose soil is recommended for root crops.\"\n    },\n    {\n        \"Q\": \"What are the recommended practices for controlling viral diseases in chilies?\",\n        \"A\": \"Control white fly population by spraying imdachlorophid 1ml/liter water, followed by spraying 0.05% Dimethoate (Rogor), and apply neem manure or carbofuran @1.5kg/ha.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the recommended treatment for controlling Anthracnose in cucurbit vegetables?\",\n        \"A\": \"Repeat spraying of mancozeb or Zeneb (Dithane-Z-78).\"\n    },\n    {\n        \"Q\": \"How can downy mildew in cucurbits be controlled?\",\n        \"A\": \"By spraying cupperoxichloride (Blitox) or Mancozeb during the early stage of infection.\"\n    },\n    {\n        \"Q\": \"What is the suggested method to manage powdery mildew in cucurbits?\",\n        \"A\": \"Spraying of Dinocap (karathane 0.03%) and dusting of sulphur dust.\"\n    },\n    {\n        \"Q\": \"How can leaf mosaic viruses in bitter gourd be controlled?\",\n        \"A\": \"By controlling the insect vector.\"\n    },\n    {\n        \"Q\": \"What are the control measures for fruit fly and red pumpkin beetle in cucurbits?\",\n        \"A\": \"Follow the control measures for fusarium wilt, remove excess water logging, and apply TIBA 25ppm, MH 50ppm + GA 25ppm, boron, and calcium @20ppm.\"\n    },\n    {\n        \"Q\": \"What is the recommended practice for controlling YMV in okra?\",\n        \"A\": \"Grow YMV-resistant varieties and spray Dimethoate (Rogor) at intervals of 10 days.\"\n    },\n    {\n        \"Q\": \"How can spotted bollworm in okra be managed?\",\n        \"A\": \"Remove infected fruits and apply soil application of carbaryl or neem manures.\"\n    },\n    {\n        \"Q\": \"What is the suggested method for preparing vermicompost from coconut waste?\",\n        \"A\": \"Use coconut leaves, flower sheaths, and other organic materials for vermicomposting.\"\n    },\n    {\n        \"Q\": \"How can mango fruit fly be controlled during late March-April-May?\",\n        \"A\": \"Install sex pheromones and spray Dimethoate 0.045% + molasses 0.1%.\"\n    },\n    {\n        \"Q\": \"What is the recommended practice for controlling fusarium wilt in guava?\",\n        \"A\": \"Apply tricoderma powder in the root zone of guava.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What type of soils are preferred for nursery management?\",\n        \"answer\": \"Heavy to medium textured soils are preferred for nursery management.\"\n    },\n    {\n        \"question\": \"How should seeds be prepared before sowing in the nursery bed?\",\n        \"answer\": \"Seeds should be put in plain water, stirred well, and floated ones are to be discarded.\"\n    },\n    {\n        \"question\": \"When should seeds be sown in the nursery bed?\",\n        \"answer\": \"Seeds should be sown in the nursery bed during mid-February.\"\n    },\n    {\n        \"question\": \"What is the recommended spacing for transplanting semi-dwarf varieties?\",\n        \"answer\": \"The recommended spacing for transplanting semi-dwarf varieties is 20 cm x 15 cm.\"\n    },\n    {\n        \"question\": \"What is the recommended fertilizer dose for semi-dwarf varieties per hectare?\",\n        \"answer\": \"The recommended fertilizer dose for semi-dwarf varieties is 40 kg N, 20 kg P2O5, and 20 kg K2O per hectare.\"\n    },\n    {\n        \"question\": \"What type of soil is suitable for wheat cultivation?\",\n        \"answer\": \"Sandy loam to silty loam soils, rich in organic matter, are suitable for wheat cultivation.\"\n    },\n    {\n        \"question\": \"What is the recommended seed rate for wheat per hectare?\",\n        \"answer\": \"The recommended seed rate for wheat is 100-120 kg/ha.\"\n    },\n    {\n        \"question\": \"When should the first irrigation be applied for wheat crops?\",\n        \"answer\": \"The first irrigation for wheat crops should be applied at the crown root initiation stage (20-25 days after sowing).\"\n    },\n    {\n        \"question\": \"What is the optimum time for sowing maize?\",\n        \"answer\": \"The optimum time for sowing maize is from the middle of September to the middle of November.\"\n    },\n    {\n        \"question\": \"What type of soil is recommended for maize cultivation?\",\n        \"answer\": \"Well-drained sandy loam soil is recommended for maize cultivation.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the optimum time for sowing Buckwheat in the Upper Brahmaputra Valley Zone?\",\n        \"A\": \"The optimum time for sowing Buckwheat in the Upper Brahmaputra Valley Zone is September-October.\"\n    },\n    {\n        \"Q\": \"What is the recommended seed rate for Foxtail millet under broadcast sowing?\",\n        \"A\": \"The recommended seed rate for Foxtail millet under broadcast sowing is 15 kg/ha.\"\n    },\n    {\n        \"Q\": \"What are the newly recommended varieties of Lentil?\",\n        \"A\": \"The newly recommended varieties of Lentil are HUL 57, Axom Masur 1 (SL 2-24), and Axom Masur 2 (SL 2-28).\"\n    },\n    {\n        \"Q\": \"What is the recommended seed rate for Rapeseed and Mustard in the Hills Zone as a pure crop?\",\n        \"A\": \"The recommended seed rate for Rapeseed and Mustard in the Hills Zone as a pure crop is 6-8 kg/ha.\"\n    },\n    {\n        \"Q\": \"What is the optimum time of sowing for Rapeseed and Mustard?\",\n        \"A\": \"The optimum time of sowing for Rapeseed and Mustard is from the middle of October to the middle of November.\"\n    },\n    {\n        \"Q\": \"What is the recommended spacing for Linseed?\",\n        \"A\": \"The recommended spacing for Linseed is 25 cm between rows and 10 cm between plants.\"\n    },\n    {\n        \"Q\": \"What is the seed rate for Niger in line sowing?\",\n        \"A\": \"The seed rate for Niger in line sowing is 8 kg/ha.\"\n    },\n    {\n        \"Q\": \"What is the recommended spacing for Foxtail millet?\",\n        \"A\": \"The recommended spacing for Foxtail millet is 25 cm between rows.\"\n    },\n    {\n        \"Q\": \"What is the seed rate for Lentil?\",\n        \"A\": \"The seed rate for Lentil is 30 kg/ha or 4 kg/bigha.\"\n    },\n    {\n        \"Q\": \"What is the recommended seed proportion for toria + lentil mixed crop in the Hills Zone?\",\n        \"A\": \"The recommended seed proportion for toria + lentil mixed crop in the Hills Zone is 75:25.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What type of soil is suitable for agriculture as mentioned in the text?\",\n        \"answer\": \"Well-drained sandy loam and loam soils rich in organic matter are suitable.\"\n    },\n    {\n        \"question\": \"Why should a pulse crop be included in the rotation?\",\n        \"answer\": \"A pulse crop should be included in the rotation to improve the soil condition.\"\n    },\n    {\n        \"question\": \"What is the ideal size of tubers for planting?\",\n        \"answer\": \"The ideal size of tubers for planting is about 2.5 cm in diameter (25-40 g).\"\n    },\n    {\n        \"question\": \"How should cut seeds be treated before planting?\",\n        \"answer\": \"Cut seeds should be dipped in Mancozeb @ 5 g in 1 litre of water for about 10 minutes, then dried under shade for 48 hours or covered with moist gunny bags for 2-3 days for suberization.\"\n    },\n    {\n        \"question\": \"What is the recommended seed requirement per hectare?\",\n        \"answer\": \"The seed requirement is 22.5-25 q/ha when the size of the tubers is about 2.5 cm in diameter.\"\n    },\n    {\n        \"question\": \"What is the optimum time for planting?\",\n        \"answer\": \"The optimum time for planting is mid-October to mid-November.\"\n    },\n    {\n        \"question\": \"How should irrigation be managed for tuber crops?\",\n        \"answer\": \"Three irrigations should be applied: first at 25 days (stolon formation stage), second at 60 days (tuber formation stage), and third at 80 days (tuber development stage) after emergence of sprouts.\"\n    },\n    {\n        \"question\": \"What precautions should be taken during irrigation?\",\n        \"answer\": \"Care should be taken not to submerge the ridges completely during irrigation.\"\n    },\n    {\n        \"question\": \"What are some important varieties of strawberry mentioned?\",\n        \"answer\": \"Important varieties of strawberry include 'Sweet Charlie', 'Festival', and 'Chandler'.\"\n    },\n    {\n        \"question\": \"How should livestock sheds be prepared for winter?\",\n        \"answer\": \"Livestock sheds should be repaired, sides covered with polythene sheet or gunny cloth, and shady trees trimmed to protect livestock from inclement weather.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What are the key activities included in agriculture?\",\n        \"A\": \"Agriculture includes crop cultivation, animal husbandry, fisheries, and forestry.\"\n    },\n    {\n        \"Q\": \"How does modern agriculture improve productivity?\",\n        \"A\": \"Modern agriculture uses precision farming, genetically modified crops, and sustainable irrigation techniques.\"\n    },\n    {\n        \"Q\": \"Why is soil health important in agriculture?\",\n        \"A\": \"Soil health is crucial for maintaining agricultural productivity by providing essential nutrients to crops.\"\n    },\n    {\n        \"Q\": \"What methods are used to maintain soil fertility?\",\n        \"A\": \"Farmers use fertilizers, crop rotation, and organic farming techniques.\"\n    },\n    {\n        \"Q\": \"How does water management help agriculture?\",\n        \"A\": \"Irrigation and rainwater harvesting ensure consistent crop yields, especially in drought-prone areas.\"\n    },\n    {\n        \"Q\": \"What are the major challenges faced in agriculture?\",\n        \"A\": \"Major challenges include pests, diseases, climate change, and unpredictable weather patterns.\"\n    },\n    {\n        \"Q\": \"How do farmers protect crops from pests?\",\n        \"A\": \"They use pesticides, biological control methods, and integrated pest management strategies.\"\n    },\n    {\n        \"Q\": \"How does climate change affect agriculture?\",\n        \"A\": \"It causes unpredictable weather, rising temperatures, droughts, and floods, impacting crop yields.\"\n    },\n    {\n        \"Q\": \"How do governments support agriculture?\",\n        \"A\": \"Governments provide subsidies, research funding, and policies promoting sustainable farming.\"\n    },\n    {\n        \"Q\": \"Why are agricultural markets and supply chains important?\",\n        \"A\": \"They ensure fair prices for farmers and affordable food for consumers.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the recommended time for sowing Rajmash seeds to achieve maximum yield?\",\n        \"A\": \"The last week of August.\"\n    },\n    {\n        \"Q\": \"What are some recommended varieties of Rajmash?\",\n        \"A\": \"Sikkim Rajma-1, Jwala, and Tripura Rajmash Selection 1.\"\n    },\n    {\n        \"Q\": \"Why should Rajmash be sown on ridges?\",\n        \"A\": \"To avoid seed deterioration due to waterlogging from continuous rain and ensure proper drainage.\"\n    },\n    {\n        \"Q\": \"What is the recommended seed rate and spacing for Rajmash?\",\n        \"A\": \"Seed rate is 70-80 kg/ha with spacing of 30 cm x 10 cm.\"\n    },\n    {\n        \"Q\": \"What is the recommended preparation for Rapeseed and Mustard fields?\",\n        \"A\": \"The field should be prepared with 2-3 times ploughing in October-November and apply FYM @ 5 t/ha, vermicompost @ 2 t/ha, and rock phosphate @ 100-120 kg/ha.\"\n    },\n    {\n        \"Q\": \"What is the recommended sowing period for Rapeseed and Mustard?\",\n        \"A\": \"From the last week of October to December.\"\n    },\n    {\n        \"Q\": \"What is the recommended seed rate and treatment for Rapeseed and Mustard?\",\n        \"A\": \"Seed rate is 6-8 kg/ha treated with PSB @ 20g/kg of seed.\"\n    },\n    {\n        \"Q\": \"What is the recommended sowing period for Buckwheat?\",\n        \"A\": \"From the second fortnight of October to the first week of November.\"\n    },\n    {\n        \"Q\": \"What precautions should be taken during the fruiting stage of orange and kiwifruit?\",\n        \"A\": \"Utmost precaution should be taken during field operations to avoid root damage.\"\n    },\n    {\n        \"Q\": \"What is the recommended application of FYM for orange plants?\",\n        \"A\": \"FYM @ 20 kg/plant should be applied in the month of April-May every year.\"\n    }\n]\n```"
]