[
    "{ Q: What is the ratio of female to male ure for spawning?\n                            A: The ratio of female to male ure for spawning is 1:2.\n                            Q: How are ure females and males injected with hormones?\n                            A: Females are injected with 0.6 ml/kg body weight of Ovatide/Gonopro FH, while males receive 0.3 ml/kg body weight.\n                            Q: Where are the injected ures kept for spawning?\n                            A: They are kept in spawning tanks of the circular hatchery.\n                            Q: How long does it take for ure spawning to occur?\n                            A: Spawning occurs 8-10 hours after injection.\n                            Q: What are the characteristics of ure eggs?\n                            A: Ure eggs are transparent, non-adhesive, semi-buoyant, and round, with a diameter of 2.6-3.4 mm.\n                            Q: What is the fertilization rate of ure eggs?\n                            A: The fertilization rate of ure eggs is generally 80-95%.\n                            Q: How many eggs does a female ure lay per kg of body weight?\n                            A: A female ure lays 1.8 to 2.0 lakh eggs per kg of body weight.\n                            Q: At what temperature are ure eggs incubated?\n                            A: Ure eggs are incubated at 18-22°C water temperature.\n                            Q: Where is ure seed production mainly practiced?\n                            A: Ure seed production is mainly practiced in Uttarakhand and Uttar Pradesh for conservation.}",
    "{ Q: What is Reba and why is it popular?\n                            A: Reba is a minor carp species that is popular as a food fish in many parts of India.\n                            Q: What is the weight range of mature Reba fish?\n                            A: Reba grows to about 500 g in weight.\n                            Q: When does Reba breed in rivers?\n                            A: Reba breeds in rivers during May to August.\n                            Q: How are Reba brooders raised and matured?\n                            A: Brooders are raised in earthen ponds along with other carp species, where they mature in a year.\n                            Q: How are sexes distinguished in Reba fish?\n                            A: Males are identified by oozing milt and females by the bulging belly and reddish vent.\n                            Q: How is induced breeding of Reba undertaken?\n                            A: Induced breeding is undertaken in hapa/hatchery using commercial formulations like Ovaprim/Ovatide/Gonopro FH.\n                            Q: How many eggs does a female Reba lay per kg body weight?\n                            A: A female lays 3-4 lakh eggs/kg body weight.\n                            Q: How long does it take for Reba eggs to hatch?\n                            A: Hatching occurs in 18-22 h.\n                            Q: How long does it take for Reba spawn to grow to 25 mm?\n                            A: Spawn is reared in outdoor nursery ponds/concrete tanks for raising fry, where they grow to 25 mm in 25-30 days.\n                            Q: Where is the technology of Reba seed production largely adopted?\n                            A: The technology of seed production is largely adopted in West Bengal, Odisha, Assam, and Uttar Pradesh.}",
    "{ Q: What is the breeding period for Chaguni?\n                            A: Chaguni breeds during April to June in flowing waters.\n                            Q: Where is Chaguni distributed?\n                            A: Chaguni is distributed in the Ganga and Brahmaputra drainages of north and north-eastern India, Nepal, and Bangladesh.\n                            Q: What is the average size of Chaguni?\n                            A: Chaguni grows to about 50 cm in length.\n                            Q: How does Chaguni breed in captivity?\n                            A: Induced breeding is undertaken in small tanks/aquaria by simulating water current, arranging sand gravel bed, and regular filtration of water.\n                            Q: What is the size and color of Chaguni eggs?\n                            A: Fertilized eggs are pale yellow with a diameter of 1.8-2.2 mm.\n                            Q: How long does embryonic development take for Chaguni?\n                            A: Embryonic development takes 4-5 days at a temperature of 20-22°C.\n                            Q: What is the purpose of breeding Chaguni in Uttarakhand?\n                            A: Chaguni is bred in Uttarakhand for conservation of stocks.\n                            Q: Where is Kalaban distributed?\n                            A: Kalaban is widely distributed in the Indian sub-continent and Afghanistan to Iran.\n                            Q: What is the breeding season for Kalaban?\n                            A: Kalaban breeds during the monsoon in flowing waters.}",
    "{ Q: What is the ideal temperature for rearing carp hatchlings?\n                            A: The ideal temperature for rearing carp hatchlings is 18-22°C.\n                            Q: How long does it take for the yolk-sac of carp hatchlings to be absorbed?\n                            A: The yolk-sac of carp hatchlings is absorbed in 70-84 hours.\n                            Q: What is the average survival rate of carp spawn?\n                            A: The average survival rate of carp spawn is 60-80%.\n                            Q: How are carp spawn reared to fry size?\n                            A: Carp spawn are reared in outdoor concrete tanks at a stocking density of 10 million/ha for 1 month.\n                            Q: What is Pengba, and where is it distributed?\n                            A: Pengba is a popular food fish in North East India, and it is distributed in India, Myanmar, and China.\n                            Q: When does Pengba reach maturity, and how much do males and females weigh?\n                            A: Pengba reaches maturity at 2+ years of age when males weigh 0.6-0.8 kg, and females weigh 0.8-1.0 kg.\n                            Q: How are Pengba brooders raised and distinguished by sex?\n                            A: Pengba brooders are raised in earthen ponds with other carps at a biomass of 1500-2000 kg/ha, and sexes are distinguished by females having a bulged abdomen and males oozing milt when their belly is pressed.\n                            Q: How is Pengba spawning induced, and how many spawn are obtained per kg of female body weight?\n                            A: Pengba spawning is induced with a single injection of Ovaprim/Ovatide, and around 0.70-1.0 lakh spawn are obtained per kg of female body weight.\n                            Q: What is the significance of Golden Mahseer in the Himalayan sub-continent?\n                            A: Golden Mahseer is an ",
    "{ Q: What is the color of Chocolate Mahseer's ova?\n                            A: The ova of Chocolate Mahseer are lemon yellow/brownish-golden.\n                            Q: What is the diameter of fully swollen Chocolate Mahseer eggs?\n                            A: Fully swollen Chocolate Mahseer eggs have a diameter of 2.0-2.5 mm.\n                            Q: What is the fecundity range of Chocolate Mahseer?\n                            A: The fecundity of Chocolate Mahseer ranges from 3,000-9,000 eggs/kg female body weight.\n                            Q: How long does it take for Chocolate Mahseer eggs to hatch?\n                            A: Chocolate Mahseer eggs hatch in 80-96 hours at 22-24°C.\n                            Q: How long does it take for Chocolate Mahseer yolk-sac to be absorbed?\n                            A: The yolk-sac of Chocolate Mahseer is absorbed in 11-13 days.\n                            Q: Where is the breeding technology of Chocolate Mahseer largely adopted?\n                            A: The breeding technology of Chocolate Mahseer is largely adopted in Himachal Pradesh, Uttarakhand, Sikkim, Nagaland, Assam, and Arunachal Pradesh.\n                            Q: What is the conservation status of Chocolate Mahseer?\n                            A: Chocolate Mahseer is listed under threatened species.\n                            Q: What is the breeding season of Chocolate Mahseer?\n                            A: Chocolate Mahseer breeds during January-February and May-September in flowing waters.\n                            Q: What is the spawning behavior of Dark Mahseer?\n                            A: Dark Mahseer is a batch spawner and lays eggs under the gravel.\n                            Q: What is the conservation status of Dark Mahseer?\n                            A: Dark Mahseer is a critically endangered fish species.}",
    "{ Q: What is the purpose of gravel and filtration in captive breeding tanks?\n                            A: Gravel provides a natural environment for fish to breed, while filtration ensures clean water.\n                            Q: When do fish breed naturally in captive breeding tanks?\n                            A: Fish breed naturally in November-December and March-April.\n                            Q: How many eggs does a female fish lay on average?\n                            A: A female fish lays 800-1,000 eggs on average.\n                            Q: How long does it take for fertilized eggs to hatch?\n                            A: It takes 60-70 hours for hatching at 20-22°C.\n                            Q: What is the length of hatchlings when they become free-swimming?\n                            A: Hatchlings are 8-12 mm in length when they become free-swimming.\n                            Q: What is the survival rate from spawn to fry stage in captive breeding?\n                            A: With good water quality management, survivals of 70-80% are achieved.\n                            Q: Where is snow trout found in India?\n                            A: Snow trout is found in upland streams of Jammu and Kashmir, Uttarakhand, Assam, Sikkim, and Nagaland.\n                            Q: How often does snow trout breed in a year?\n                            A: Snow trout breeds twice in a year, during February-May and August-October.\n                            Q: How many eggs does a female snow trout lay per kg of body weight?\n                            A: A female snow trout lays about 16,000-18,000 eggs per kg of body weight.\n                            Q: What is the hatching rate and survival level of snow trout eggs?\n                            A: Eggs hatch in 5-7 days with hatching levels of 60-75%, and sac-fry develop to swim-up fry with survival levels of 30-45%.}",
    "{ Q: What is the stocking density for Magur Clarias magur captive broodstock?\n                            A: The stocking density for Magur Clarias magur captive broodstock is 2-3 nos/m2.\n                            Q: What is the water flow rate for Magur Clarias magur fry production?\n                            A: The water flow rate for Magur Clarias magur fry production is 3-4 l/m.\n                            Q: What is the protein content in the feed for Magur Clarias magur broodstock?\n                            A: The protein content in the feed for Magur Clarias magur broodstock is 30-35%.\n                            Q: How are Magur Clarias magur females induced for spawning?\n                            A: Magur Clarias magur females are injected with Ovaprim/Ovatide/Wova-FH/GonoproFH @ 1.0-1.5 ml/kg body weight for spawning.\n                            Q: How many eggs does a 100 g Magur Clarias magur female produce?\n                            A: A 100 g Magur Clarias magur female produces 4,000-5,000 eggs.\n                            Q: How long does it take for Magur Clarias magur eggs to hatch?\n                            A: Magur Clarias magur eggs hatch in 24-26 h.\n                            Q: How long does it take for Magur Clarias magur yolk-sac to be absorbed?\n                            A: Magur Clarias magur yolk-sac is absorbed in 70-80 h.\n                            Q: What is the survival rate of Magur Clarias magur larvae at the fry stage?\n                            A: The survival rate of Magur Clarias magur larvae at the fry stage is 80%.\n                            Q: What is the distribution of Valencienne’s Clarid?\n                            A: Valencienne’s Clarid is endemic to Western Ghats and distributed in limited locations in the rivers of Peninsular India.\n                            Q: What is the protein content in the feed for Valencienne’s Clarid broodstock?\n                            A: The protein content in the feed for Valencienne’s Clarid broodstock is 30-35%. }",
    "{ Q: What are the newly hatched larvae fed for the first two days?\n                            A: The newly hatched larvae are fed with chicken egg yolk suspension for the first two days.\n                            Q: What is the feeding schedule for larvae after the first two days?\n                            A: From the third day, larvae are fed ad lib with freshly hatched Artemia nauplii for at least 10 days.\n                            Q: When is inert feed introduced in the larval diet?\n                            A: Inert feed in the form of thick paste is started from the 10th day onwards.\n                            Q: What is the water depth requirement for larval rearing?\n                            A: The water depth for larval rearing should be 10-12 cm in shallow trays or tanks.\n                            Q: What is the survival rate achieved at the fry stage with good management practices?\n                            A: With good management practices, a survival rate of 30-50% is achieved at the fry stage.\n                            Q: Where has the breeding technology been mainly extended?\n                            A: The breeding technology has been mainly extended to the state of Kerala.\n                            Q: What is Singi or stinging catfish, and why is it important?\n                            A: Singi or stinging catfish is a potential high-value species available all along the Indian subcontinent, regarded as important for aquaculture diversification.\n                            Q: What is the size of a fully grown Singi or stinging catfish?\n                            A: A fully grown Singi or stinging catfish can reach a size of 200g.\n                            Q: What is the breeding season for Singi or stinging catfish?\n                            A: Singi or stinging catfish breeds in captivity during the monsoon season.\n                            Q: How are mature females identified for breeding purposes?\n                            A: Mature females are identified by their bulged abdomen and round vent.}",
    "{ Q: What is the suitable weight for induced breeding in the species mentioned?\n                            A: Ripe brooders weighing above 80 g males and 120 g females are suitable for induced breeding.\n                            Q: What is the ratio of females to males for induced breeding?\n                            A: A ratio of 1:2 female to male is taken for induced breeding.\n                            Q: What hormone is used for induced breeding and in what dosage?\n                            A: Ovatide/Wova-FH is used for induced breeding, with 1.5-2.0 ml/kg body weight for females and 0.5-1.0 ml/kg for males.\n                            Q: How many eggs can be obtained from a female of 100 g?\n                            A: Around 20,000-25,000 eggs can be obtained from a female of 100 g.\n                            Q: What is the hatching time and temperature for the species?\n                            A: Hatching occurs within 18-23 h of fertilization at a water temperature of 27-29°C.\n                            Q: What is the feeding pattern for the larvae of the species?\n                            A: Larvae are given small-size live feed from the second day and fed ad lib. with a heterogeneous mixture of live zooplankton, tubifex worms, and egg custard.\n                            Q: When is fry size attained in the species?\n                            A: Fry size is attained after 3-4 weeks.\n                            Q: Which states in India have largely adopted the breeding technology for the species?\n                            A: West Bengal, Odisha, Assam, Tripura, and Uttar Pradesh have largely adopted the breeding technology.\n                            Q: What is the maturity and breeding period for Pabdah catfish?\n                            A: Pabdah catfish attains maturity in the first year and breeds during June-August.}",
    "{ Q: What is Pangas Catfish?\n                            A: Pangas Catfish is a large-size popular catfish found in large rivers of north, central and southern India.\n                            Q: When does Pangas Catfish breed?\n                            A: Pangas Catfish breeds in flowing waters during the monsoon season.\n                            Q: How are Pangas Catfish brooders raised?\n                            A: Pangas Catfish brooders are raised in earthen ponds along with other fishes.\n                            Q: How are sexes differentiated in Pangas Catfish?\n                            A: Females have a bulged abdomen and males ooze white-milt on pressing the belly.\n                            Q: How is Pangas Catfish spawning induced?\n                            A: Females are injected with synthetic hormone viz., Ovatide/Ovaprim @ 1.0-1.5 ml/kg body weight.\n                            Q: How many eggs does a female Pangas Catfish lay?\n                            A: A female Pangas Catfish lays 1.2-1.4 lakh eggs/kg body weight.\n                            Q: How are Pangas Catfish larvae fed?\n                            A: Larvae are fed with small zooplankton, obtained from repeated sieving or Artemia nauplii or tubifex worms.\n                            Q: How long does it take for Pangas Catfish larvae to become early-fry?\n                            A: Within 15-20 days, larvae attain an average weight of 30-40 mg and become early-fry.\n                            Q: How is the breeding technology for Pangas Catfish being adopted?\n                            A: The breeding technology is being adopted in the state of Odisha.}",
    "{ Q: What is the temperature range for hatching of Long Whiskers Catfish eggs?\n                            A: Hatching occurs within 14-18 hours at 28±1°C.\n                            Q: How are Long Whiskers Catfish hatchlings fed?\n                            A: They are fed with zooplankton and cut pieces of insect larvae from the 2nd day.\n                            Q: When is the yolk-sac absorbed in Long Whiskers Catfish?\n                            A: The yolk-sac is absorbed on the 4th day.\n                            Q: What is the survival rate of Long Whiskers Catfish at the fry stage?\n                            A: Survival is generally poor, 10-20% at the fry stage.\n                            Q: Where has the Long Whiskers Catfish been successfully bred?\n                            A: The species has been successfully bred in Odisha and Uttar Pradesh.\n                            Q: What is the habitat of the Long Whiskers Catfish?\n                            A: It is euryhaline in nature and thrives well both in fresh and brackish water.\n                            Q: When does the Long Whiskers Catfish spawn?\n                            A: Spawning occurs during June-August.\n                            Q: How are Long Whiskers Catfish brooders selected for breeding?\n                            A: Fully ripe females weighing above 80g and mature males weighing above 50g are selected.\n                            Q: How long does it take for Long Whiskers Catfish eggs to hatch?\n                            A: Eggs hatch in 18-22 hours at 27-29°C.\n                            Q: How are Long Whiskers Catfish larvae reared?\n                            A: They are reared in indoor tanks and fed with cladocerans, copepods, and live tubifex.}",
    "{ Q: What is the habitat of Mahanadi rita?\n                            A: Mahanadi rita is found in the river Mahanadi and its tributaries in Odisha and Madhya Pradesh.\n                            Q: How does Mahanadi rita breed?\n                            A: It breeds in running water during the monsoon season.\n                            Q: What is the ideal weight of Mahanadi rita brooders for captive breeding?\n                            A: Brooders of 80-140 g are ideal for captive breeding.\n                            Q: How are Mahanadi rita females induced for spawning?\n                            A: Females are induced with Ovatide@ 1 ml/kg body weight and become ready for spawning in 13-15 h.\n                            Q: How many eggs does a female Mahanadi rita lay?\n                            A: A female of 80-140 g spawns around 12,000-14,000 free-floating eggs of 1.3-1.4 mm diameter.\n                            Q: How long does it take for Mahanadi rita eggs to hatch?\n                            A: Eggs hatch after 20 h.\n                            Q: How are Mahanadi rita larvae reared?\n                            A: Larvae are reared at a stocking density of 2 nos/litre and fed Artemia nauplii and mixed zooplankton.\n                            Q: How long does it take for Mahanadi rita larvae to reach 50-60 mg in weight?\n                            A: They grow to 50-60 mg in weight during 3-4 weeks of rearing.\n                            Q: Where is the breeding technology for Mahanadi rita being extended?\n                            A: The breeding technology is being extended in Odisha.\n                            Q: What is the importance of yellow catfish?\n                            A: Yellow catfish or sun catfish is a medium-sized catfish of food and ornamental importance.}",
    "{ Q: What is the feeding method for mature males and females in the given text?\n                            A: Mature males and females are fed with pellet feed containing 30% protein.\n                            Q: How are sexes distinguished in the given species?\n                            A: Mature females have a bulged abdomen, and males ooze free-flowing white milt with slight pressure.\n                            Q: What hormonal injection is given to fully mature females?\n                            A: Ovaprim/Ovatide/Wova-FH @ 1.5 ml/kg body weight is given to fully mature females.\n                            Q: How is spawning undertaken in the given species?\n                            A: Spawning is undertaken by the dry method of stripping after 12-13 h of injection.\n                            Q: How many eggs does a female lay per 100 g body weight?\n                            A: A female lays 15,000-18,000 eggs per 100 g body weight.\n                            Q: How long does it take for hatching to occur?\n                            A: Hatching occurs in 22-23 h.\n                            Q: When do larvae start accepting live feed?\n                            A: Larvae start accepting live feed in three days after the yolk-sac is absorbed.\n                            Q: What is the survival rate during indoor rearing?\n                            A: The survival rate during indoor rearing is 70-80%.\n                            Q: Where has the breeding and seed production technology been mainly adopted?\n                            A: The breeding and seed production technology has been mainly adopted in the state of Kerala.\n                            Q: What is the distribution of Striped Murrel?\n                            A: Striped Murrel is widely distributed in the Indian sub-continent and South-east Asian countries.}",
    "{ Q: What is the feed composition for fry rearing in outdoor tanks?\n                            A: The feed composition is a mixture of powdered fish meal and soya flour (3:1) @ 5-10% of their body weight.\n                            Q: What is the average survival rate of fry with regular grading of shooters?\n                            A: The average survival rate of fry with regular grading of shooters is 25-30%.\n                            Q: What is the breeding and seed production technology adopted for giant murrel?\n                            A: The breeding and seed production technology for giant murrel is adopted in West Bengal, Odisha, Telangana, Andhra Pradesh, Tamil Nadu, Uttar Pradesh, and Chattisgarh.\n                            Q: What is the importance of the giant murrel?\n                            A: The giant murrel is an important air-breathing high-valued food fish distributed from the Indian sub-continent to many countries in South-east Asia.\n                            Q: How are broodstocks developed for giant murrel?\n                            A: Broodstocks for giant murrel are developed either in earthen ponds or concrete tanks.\n                            Q: How are matured brooders identified in giant murrel?\n                            A: Matured brooders are observed from March to October months, with females exhibiting a slightly bulged abdomen, round-reddish vent, and males exhibiting a pale vent, small and slender anal papilla.\n                            Q: How is induced breeding carried out in giant murrel?\n                            A: Induced breeding in giant murrel is carried out by giving two injections of human chorionic gonadotropin (HCG) @ 2000 IU/kg body weight and @ 1500-2000 IU/kg body weight after 24 h interval to both sexes.\n                            Q: How many eggs does a female giant murrel lay, and what is their fertilization rate?\n                            A: A female giant murrel lays 8,000-12,000 eggs/kg, with fertilization rates generally high, 85-90%.\n                            Q: How are the larvae of giant murrel reared, and what is their survival rate?\n                            A: The larvae of giant murrel are reared in small tanks and fed ad libitum with either zooplanktons or Artemia nauplii, achieving a survival rate of 50-60% with good management practices.\n                            Q: What is the importance of spotted murrel?\n                            A: Spotted murrel is an important air-breathing fish of the Indian sub-continent, in great demand due to its taste, medicinal importance, and high market price.}",
    "{ Q: What is the appearance of the male fish mentioned in the text?\n                            A: The male fish has a blackish-brown body with reddish vent and several black pin-head size spots below the lateral line, along with a small-sized anal papilla.\n                            Q: How is captive spawning undertaken for this fish species?\n                            A: Captive spawning is done in shallow concrete/FRP tanks with water depth 15-20 cm, where aquatic weed like Hydrilla is uniformly spread.\n                            Q: What is the ratio of female to male brooders kept in the spawning tank?\n                            A: The ratio of female to male brooders kept in the spawning tank is 1:2.\n                            Q: How many eggs does a female fish lay at one place between aquatic weeds?\n                            A: A female fish lays 500-1,000 eggs per spawning at one place between aquatic weeds.\n                            Q: What is the color and hatching time of the eggs?\n                            A: The eggs are spherical, non-adhesive, free floating, and light yellow in color, and they hatch in 24-26 h.\n                            Q: What do the larvae feed on from the 4th day onwards?\n                            A: The larvae are fed with Artemia nauplii/small-size plankton 3-4 times in a day for 15 days from the 4th day onwards.\n                            Q: What is the size of the larvae after one month of feeding?\n                            A: The larvae grow to about 15-20 mm in size with 50-60% survival after one month of feeding.\n                            Q: What do fry feed on during rearing in outdoor tanks?\n                            A: Fry are fed with aquatic insects, tubifex, chopped earthworms, powdered fish meal, and soya flour (3:1) @ 5-10% of their body weight twice a day in addition to live feed during rearing in outdoor tanks.\n                            Q: In which states has the technology been extended for this fish species?\n                            A: The technology has been extended to West Bengal, Odisha, Assam, and Uttar Pradesh.}",
    "{ Q: What is the common name for Anabas testudineus?\n                            A: The common name for Anabas testudineus is climbing perch.\n                            Q: Where is the climbing perch found?\n                            A: The climbing perch is found in India and South-east Asia.\n                            Q: How does the climbing perch reproduce?\n                            A: The climbing perch reproduces by spawning during April-August, with peak during monsoon.\n                            Q: How are climbing perch brooders bred?\n                            A: Brooders are induced bred with commercial hormone injection.\n                            Q: What is the size of climbing perch eggs?\n                            A: Climbing perch eggs have a diameter of 70-85 µm.\n                            Q: How are climbing perch eggs incubated?\n                            A: Eggs are incubated in plastic tubs/FRP tanks where they hatch out in 12-15 hrs at 26-28ºC.\n                            Q: How are climbing perch larvae reared?\n                            A: Larvae are reared in indoor FRP/concrete tanks with water depth of 50-60 cm.\n                            Q: What challenges occur during climbing perch seed rearing?\n                            A: Size heterogeneity and cannibalism occur during seed rearing, requiring routine grading for higher survival.\n                            Q: Where is the climbing perch technology being adopted?\n                            A: The technology is being adopted in West Bengal, Assam, Tripura, and Odisha.\n                            Q: What is the common name for Lates calcarifer?\n                            A: The common name for Lates calcarifer is Asian seabass.}",
    "{ Q: What is the diameter of seabass fry hatchlings?\n                            A: The diameter of seabass fry hatchlings is around 0.78 mm.\n                            Q: How long does it take for seabass hatching to occur?\n                            A: Seabass hatching takes place at 17 hours post-spawning.\n                            Q: What is the length of newly hatched seabass larvae?\n                            A: Newly hatched seabass larvae are 1.7 mm in length.\n                            Q: How are seabass fry fed in the early stages?\n                            A: Seabass fry are fed rotifer from the 2nd day post-hatch and Artemia nauplii from the 9th day.\n                            Q: When do seabass fry start receiving artificial feed?\n                            A: Seabass fry start receiving artificial feed from the 17th day post-hatch.\n                            Q: What size do seabass fry reach at 30 days post-hatch?\n                            A: Seabass fry reach a size of 1.0-1.2 cm at 30 days post-hatch.\n                            Q: What is the average survival rate of seabass fry?\n                            A: The average survival rate of seabass fry is 40-45%.\n                            Q: Where is the breeding and seed production technology of seabass mainly confined?\n                            A: The technology is mainly confined to Tamil Nadu and Andhra Pradesh.\n                            Q: What is the preferred environment for milkfish farming?\n                            A: Milkfish is preferred for farming in ponds and pens in brackish water.\n                            Q: How often does milkfish spawn in a year?\n                            A: Milkfish spawns twice a year, during January to April and October to November in the wild.}",
    "{ Q: What is the method used for captive breeding of pearl spot?\n                            A: Captive breeding of pearl spot is done in re-circulatory modular tanks and net cages.\n                            Q: How are broodstocks developed for pearl spot breeding?\n                            A: Broodstocks are developed in small net cages fixed in ponds or open waters.\n                            Q: How can gravid brooders be identified in pearl spot breeding?\n                            A: Gravid brooders can be identified by pink to red genital papilla, pointed in males and enlarged ovipositor in females.\n                            Q: What is the Modular System of Pearl Spot Seed Production (MSPS)?\n                            A: MSPS is a system where each tank is provided with a small rectangular plastic tray containing clay soil to facilitate monitoring of pair formation and breeding.\n                            Q: How can readiness for breeding be observed in pearl spot?\n                            A: Readiness for breeding can be observed through increased aggression and territorial defense.\n                            Q: How are eggs laid and hatched in pearl spot breeding?\n                            A: Eggs are laid on hard vertical surfaces and hatch after 70-72 hours.\n                            Q: How is larval rearing conducted in pearl spot breeding?\n                            A: Larval rearing is conducted in plastic or FRP tanks with live rotifer or Artemia nauplii feeding.\n                            Q: How long does it take for pearl spot larvae to attain 300 mg weight?\n                            A: Larvae attain 300 mg weight on co-feeding with live and inert feeds in 40 days.\n                            Q: Where is the technology of pearl spot breeding largely adopted in India?\n                            A: The technology is largely adopted in Kerala and Tamil Nadu.}\n\n{ Q: What is Spotted Scat or 'Butter fish'?\n                            A: Spotted Scat or 'Butter fish' is an important food and ornamental fish distributed in the Indo-Pacific region.\n                            Q: What is the nature of Spotted Scat?\n                            A: Spotted Scat is euryhaline in nature and found in coastal and mangrove regions in India.\n                            Q: What are the breeding seasons for Spotted Scat?\n                            A: Spotted Scat breeds during June-December with two protracted seasons.\n                            Q: How are mature males and females identified during the breeding season?\n                            A: Mature males (> 80 g body weight) and females (> 150 g body weight) can be identified with oozing milt and distended belly respectively.\n                            Q: How is spawning induced in Spotted Scat?\n                            A: Fully mature females are induced to spawn with administration of hormones (HCG and LHRH-a) followed by stripping of eggs and mixing with milt for fertilization.\n                            Q: What is the fecundity and egg size of Spotted Scat?\n                            A: Fecundity ranges from 1.15-1.50 lakh/kg body weight, and eggs are pelagic with a single oil globule and diameter of 750 μm.\n                            Q: How long does hatching take in Spotted Scat?\n                            A: Hatching takes place in 16-17 hours.\n                            Q: How are the larvae reared in Spotted Scat breeding?\n                            A: The larvae are reared in indoor/semi-outdoor larval rearing tanks with green water and fed with rotifers and Artemia nauplii followed by weaning on microparticulate feeding regime.\n                            Q: How big does the fry reach after a month of larval rearing in the hatchery?\n                            A: The fry reaches a size of about one cm after a month of larval rearing in the hatchery.}",
    "{\nQ: What is the common name for Terapon jarbua (Forsskal, 1775)?\nA: Crescent Perch or Target fish\nQ: Where is the Crescent Perch distributed?\nA: Indo-Pacific region from Red Sea and East Africa to Australia\nQ: What is the salinity tolerance of Crescent Perch?\nA: Euryhaline, can tolerate fresh to seawater salinity\nQ: How do Crescent Perch reproduce?\nA: Spawn in the sea and juveniles migrate into freshwater for growth\nQ: How are broodstocks of Crescent Perch developed?\nA: In small net cages (2 m x1 m x1 m) in ponds or open-water bodies at 100 nos/cage\nQ: How many eggs does a 100 g female Crescent Perch release?\nA: 80,000-1,00,000 eggs\nQ: How long does it take for Crescent Perch larvae to hatch?\nA: 16-18 h\nQ: How are Crescent Perch larvae reared?\nA: In 10 ton FRP tanks with addition of green algae, Chlorella salina and rotifer, Brachionus plicatilis as initial feed and later with Artemia salina nauplii\nQ: How big do Crescent Perch larvae grow in 45 days?\nA: 2.0 cm and weigh 300-400 mg\n}\n\n{\nQ: What is Cobia?\nA: A high-value marine migratory pelagic finfish\nQ: Where is Cobia distributed?\nA: Worldwide in tropical, subtropical and warm-temperate waters\nQ: How are Cobia broodstocks developed?\nA: Wild caught sub-adults (5-6 kg) are developed into broodstock in sea cages\nQ: How are gravid Cobia males and females identified?\nA: Through cannulation and tagging\nQ: How is spawning induced in Cobia?\nA: Through single injection of HCG@ 500 IU/kg body weight for female and 250 IU/kg body weight for males\nQ: How many eggs does a Cobia lay?\nA: 0.5-2.5 million eggs\nQ: How long does it take for Cobia eggs to hatch?\nA: 18-22 h\nQ: How are Cobia larvae reared?\nA: In 2-5 tonne capacity tanks at stocking density of 5-10 nos/litre with mild aeration and green water culture technique\nQ: How big do Cobia larvae grow in 60-72 h?\nA: Develop to larvae in 60-72 h\n}",
    "{ Q: What is the purpose of size grading in rotifer culture?\n                            A: Size grading is done every third day to avoid/reduce cannibalism.\n                            Q: How long does it take for the metamorphosis of rotifer larvae?\n                            A: The metamorphosis of rotifer larvae takes 18-21 days.\n                            Q: What is the importance of silver pompano in aquaculture?\n                            A: Silver pompano is a commercially important high-priced marine finfish and an important candidate for cage aquaculture.\n                            Q: How are brooders prepared for final oocyte maturation in silver pompano breeding?\n                            A: Brooders are transferred to an FRP tank with a photoperiod of 15L h at 2000 Lux and a temperature of 27-32°C for final oocyte maturation.\n                            Q: How is spawning induced in silver pompano?\n                            A: Spawning is induced using HCG @ 350 IU/kg body weight or GnRH @ 150 µg/kg body weight.\n                            Q: How many eggs does a single female silver pompano lay, and what is the fertilization rate?\n                            A: A single female silver pompano lays 50,000 to 250,000 eggs with fertilization rates of 75-90%.\n                            Q: What is the ideal tank capacity and stocking density for silver pompano larviculture?\n                            A: Tanks of 5 tonne capacity are ideal for larviculture with a maximum stocking density of 10-15 nos./litre.\n                            Q: What live feeds are used during silver pompano larviculture?\n                            A: Brachionus and Artemia nauplii are used as live feeds.\n                            Q: How long does it take for Indian pompano larvae to metamorphose into silvery-white ones?\n                            A: The black colour larvae metamorphose to silvery-white ones in 18-21 days.}",
    "{ Q: What is the breeding technology for the orange-spotted grouper mainly confined to?\n                            A: The breeding technology for the orange-spotted grouper is mainly confined to the states of Tamil Nadu and Andhra Pradesh.\n                            Q: How long does it take for the orange-spotted grouper larvae to metamorphose?\n                            A: The metamorphosis of the orange-spotted grouper larvae starts on the 17th day post-hatch and is completed by the 22nd day post-hatch.\n                            Q: What is the average size of a newly hatched orange-spotted grouper larva?\n                            A: A newly hatched orange-spotted grouper larva measures 1.2-1.6 mm in total length.\n                            Q: What is the breeding season for the orange-spotted grouper?\n                            A: The orange-spotted grouper breeds during October - November and March - April.\n                            Q: How are male orange-spotted groupers obtained for breeding?\n                            A: Sex reversal for getting males is carried out by hormonal implantation using a combination of 17-α methyl testosterone and letrozole at 5 mg and 0.2 mg/kg body weight, respectively.\n                            Q: How long does it take for the pink-ear emperor larvae to metamorphose?\n                            A: The pink-ear emperor larvae metamorphose to juveniles at about 33-37 days post-hatch.\n                            Q: What is the average size of a newly hatched pink-ear emperor larva?\n                            A: A newly hatched pink-ear emperor larva measures 1.2-1.6 mm in total length.\n                            Q: How is broodstock developed for the pink-ear emperor?\n                            A: Broodstock for the pink-ear emperor can be developed by stocking wild caught fishes of 500 g-1 kg in a 10 tonne Recirculation Aquaculture System (RAS) @ 1kg/m3 and rearing for a period of 4-5 months.\n                            Q: What is the feeding regimen for the broodstock of the pink-ear emperor?\n                            A: The broodstock of the pink-ear emperor is fed ad libitum with fishes like sardine, mackerel or anchovies, and squid supplemented with vitamins and minerals. They also have to be fed intermittently with compound feed.}",
    "{ Q: What is the recommended feeding rate for improving egg quality?\n                            A: Feed semi-moist feed at the rate of 2% of body weight.\n                            Q: What is the reproductive characteristic of the fish species mentioned?\n                            A: The fish is a protogynous hermaphrodite, and spawning occurs in a re-circulatory aquaculture system (RAS).\n                            Q: What is the size and appearance of the fertilized eggs?\n                            A: Fertilized eggs are transparent, pelagic, non-adhesive, and have a diameter of 700-740 µ.\n                            Q: What is the size of the newly hatched larvae?\n                            A: The newly hatched larvae measure 1.35-1.54 mm.\n                            Q: What is the feeding protocol for the larvae from the 3rd day to the 16th day post-hatch?\n                            A: Nauplii of copepod species like Acartia sp. and Pseudodiaptomus serricaudatus are used as first food from the 3rd day, and rotifers are provided from the 5th to the 16th day at a density of 4-6 nos/ml.\n                            Q: When can Artemia and pellet feed be introduced to the larvae?\n                            A: Artemia can be given from the 15th day post-hatch, and weaning on pellet feed can start from the 20th day.\n                            Q: When do the larvae become benthic, and what size do they attain in 45-50 days post-hatch?\n                            A: Larvae become benthic from 25-30 days post-hatch and attain a size of 27-28 mm and 0.26-0.28 g in 45-50 days.\n                            Q: Where is the technology for Grass Carp aquaculture being extended?\n                            A: The technology is being extended in Tamil Nadu, Andhra Pradesh, and Kerala.\n                            Q: What is the origin and compatibility of Silver Carp in aquaculture?\n                            A: Silver Carp is native to Asia, from China to Eastern Siberia, and is cultured worldwide due to its compatibility in polyculture systems.}",
    "{ Q: What is the recommended stocking density for concrete tanks in silver carp breeding?\n                            A: The recommended stocking density for concrete tanks in silver carp breeding is 1000-2000 spawn/m3.\n                            Q: What is the survival rate of silver carp in concrete tanks?\n                            A: The survival rate of silver carp in concrete tanks is 50-80%.\n                            Q: What is the age of maturity for silver carp in India?\n                            A: Silver carp matures in two years of age in India.\n                            Q: How are brooders of silver carp raised?\n                            A: Brooders of 2+ year-classes are raised in earthen ponds along with other carps.\n                            Q: When is induced spawning undertaken for silver carp?\n                            A: Induced spawning is undertaken during monsoon months.\n                            Q: How are silver carp spawned in captivity?\n                            A: Captive spawning is undertaken either in hapa or hatchery with a sex ratio of 1:1.\n                            Q: What hormones are used for induced spawning in silver carp?\n                            A: Pituitary extract (PE) or commercially available synthetic gonadotropin hormones (CH) such as Ovaprim/ Ovatide/ Ovulin/ Gonopro/ WOVA-FH are used.\n                            Q: How many eggs does a female silver carp lay?\n                            A: One kg female silver carp lays around 0.8-1.0 lakh eggs.\n                            Q: What is the hatching rate of silver carp eggs?\n                            A: The hatching rate of silver carp eggs is generally 50-60%.\n                            Q: How long does it take for the yolk-sac of silver carp hatchlings to be absorbed?\n                            A: The yolk-sac of silver carp hatchlings is absorbed in 65-76 h at a water temperature of 28-30ºC.}",
    "{ Q: What is the sex ratio maintained in hapa breeding and circular hatchery?\n                            A: A sex ratio of 1:1 female to male ratio is maintained in both hapa breeding and circular hatchery.\n                            Q: How are brooders induced for breeding?\n                            A: Brooders are induced by injecting either pituitary extract (PE) or commercial hormone (CH) in mild doses.\n                            Q: What is the dosage of hormones given to female and male brooders?\n                            A: Females are induced with a single dose of PG extract @ 2-3 mg or CH @ 0.1-0.2 ml/kg and males injected with PE @ 2 mg or CH @ 0.1 ml/kg.\n                            Q: How many eggs does one kg female lay?\n                            A: One kg female lays around 1.5 lakh eggs.\n                            Q: What is the rate of fertilization in common carp breeding?\n                            A: The rate of fertilization is generally 80-95%.\n                            Q: What is the purpose of using salt carbamide or cream milk method in common carp breeding?\n                            A: To remove the stickiness of eggs and enable proper handling and successful hatching.\n                            Q: How long does it take for common carp eggs to hatch?\n                            A: Common carp eggs hatch within 36-48 h.\n                            Q: How long does it take for the yolk-sac of the hatchling to get absorbed?\n                            A: The yolk-sac of the hatchling gets absorbed in 72 h.\n                            Q: How long are spawn reared in nursery ponds or concrete tanks?\n                            A: Spawn are reared in nursery ponds or concrete tanks for 15 days for raising fry.\n                            Q: What is the origin of Silver Barb?\n                            A: Silver Barb is an exotic barb of south-east Asia, domesticated in India for culture in seasonal ponds and as a component in carp polyculture system.}",
    "{ Q: What is the purpose of using a small mesh filter cloth in the hatching tank?\n                            A: The small mesh filter cloth (1/80 mesh size) is used in the central overflow outlet of the hatching tank to prevent the escape of spawn.\n                            Q: How long are spawn reared in tanks to obtain fry?\n                            A: Spawn are reared for 40-45 days in tanks to obtain fry.\n                            Q: What are the feeds used for rearing spawn in tanks?\n                            A: Concentrated feeds such as milk powder, soya milk, egg custard, and a mixture of finely powdered oil cake, rice bran, and fish meal are used for rearing spawn.\n                            Q: Where is the technology of spawn rearing widely adopted?\n                            A: The technology is widely adopted in West Bengal, Odisha, Tripura, and Assam.\n                            Q: What is Rainbow Trout, and why is it promising for freshwater aquaculture?\n                            A: Rainbow Trout is a high-value freshwater cultivable food fish of cold water with considerable scope for expansion in upland regions.\n                            Q: What are the conditions required for captive broodstock development of Rainbow Trout?\n                            A: Cold (9-14°C), clean, highly oxygenated water (>7 mg/l), and good feed with 45-50% protein are required for captive broodstock development of Rainbow Trout.\n                            Q: How are Rainbow Trout eggs fertilized and incubated?\n                            A: Fertilization of Rainbow Trout eggs is done by the dry method of stripping, and they are incubated in meshed trays with flowing water.\n                            Q: How long does it take for Rainbow Trout eggs to hatch, and what are they called after hatching?\n                            A: Rainbow Trout eggs hatch in 40-60 days and are called sac-fry or alevin due to the large yolk-sac attached to them.\n                            Q: What is the feeding frequency for free-swimming Rainbow Trout fry?\n                            A: Free-swimming Rainbow Trout fry are fed 10 times a day @ 5-10% of biomass with starter feed, which is reduced to 3-4 times a day after one week.\n                            Q: Where is the technology of Rainbow Trout culture practiced in India?\n                            A: The technology is practiced in the states of Jammu and Kashmir, Himachal Pradesh, Uttarakhand, Sikkim, and Arunachal Pradesh.}",
    "{ Q: What is the breeding season for Indian river prawns?\n                            A: The breeding season for Indian river prawns coincides with the monsoon season, from June to September.\n                            Q: How does fertilization occur in Indian river prawns?\n                            A: Fertilization is external, and the fertilized eggs are carried by the female in a brood chamber under the abdomen.\n                            Q: How long does the incubation period last for Indian river prawn eggs?\n                            A: The incubation period lasts for 10-15 days, during which the color of the eggs changes from orange to grey.\n                            Q: How are Indian river prawn larvae reared in captivity?\n                            A: The larvae are reared in larval tanks with low salinity water, gradually increased to 10-12%, for 11 larval stages.\n                            Q: What is the recommended stocking density for Indian river prawn larvae?\n                            A: Two-phase clear water larval rearing methodology is recommended, with 100 larvae/l in the first phase and 40 larvae/l in the second phase.\n                            Q: What do Indian river prawn larvae eat during their larval cycle?\n                            A: The larvae are fed freshly hatched brine shrimp nauplii (BSN) 3-4 times a day, gradually replaced with egg-custard.\n                            Q: How long does it take for Indian river prawn larvae to complete their larval cycle?\n                            A: It takes about 35 days for the larvae to complete their larval cycle and metamorphose into post-larvae (PL).\n                            Q: How are Indian river prawn post-larvae acclimatized to freshwater?\n                            A: The post-larvae are shifted to another tank and gradually acclimatized to freshwater, where they are reared for 10-15 days before shifting to nursery tanks.\n                            Q: What is the survival rate achieved at the post-larvae (PL) stage for Indian river prawns?\n                            A: A survival rate of 35% is achieved at the post-larvae (PL) stage for Indian river prawns.}",
    "{ Q: What is the larval stage duration for egg custard?\n                            A: The larval stages (zoea-I to zoea-XI) take 40-60 days.\n                            Q: How long are post larvae acclimatized to freshwater?\n                            A: Post larvae are acclimatized to freshwater for 10 days.\n                            Q: Where is the seed production technology for egg custard mainly adopted?\n                            A: The technology is adopted in Odisha and Andhra Pradesh.\n                            Q: What is the Ganga river prawn's weight range?\n                            A: The Ganga river prawn grows up to 100 g in weight.\n                            Q: How do male and female Ganga river prawns differ in appearance?\n                            A: Males have a larger head and longer, more robust second walking legs than females.\n                            Q: What is the breeding season for Ganga river prawns?\n                            A: The breeding season extends from May to October.\n                            Q: How long are fertilized eggs incubated in the brood chamber of the female Ganga river prawn?\n                            A: The fertilized eggs are incubated for 18-21 days.\n                            Q: What is the salinity requirement for Ganga river prawn larvae?\n                            A: The larvae require brackish water with a salinity of 10-12%.\n                            Q: How long does it take for Ganga river prawn larvae to metamorphose to post larvae?\n                            A: The larvae metamorphose to post larvae within 22-30 days.\n                            Q: What is the adoption status of the seed production technology developed by CIFA?\n                            A: The technology is yet to be adopted on a commercial scale.}",
    "{ Q: What is the process of spawning in shrimp farming?\n                            A: Ready to spawn females are transferred to the spawning tank. After spawning, the females are removed, and eggs are incubated for hatching after rinsing with clean seawater.\n                            Q: How long does it take for shrimp eggs to hatch?\n                            A: Eggs hatch in 12-17 hours.\n                            Q: What are the stages of shrimp larval development?\n                            A: Nauplii (6 stages), protozoea (3 stages), and mysis (3 stages).\n                            Q: How are protozoea and mysis stages fed in shrimp farming?\n                            A: They are fed with live algae like Chaetoceros and Skeletonema.\n                            Q: What is the survival rate of shrimp larvae till harvest?\n                            A: The survival rate is 30-40%.\n                            Q: How long are post-larvae reared in the hatchery before stocking in ponds?\n                            A: Post-larvae are reared in the hatchery for another 15-20 days before stocking in ponds.\n                            Q: How is maturity induced in Indian white shrimp?\n                            A: Maturity is induced through unilateral eye-stalk ablation (ESA) and rearing in captivity up to gravid condition.\n                            Q: What is the fecundity observed from a female Indian white shrimp?\n                            A: Fecundity of 1.0-3.5 lakh is observed from a female size of 35-80 g.\n                            Q: What is the hatching rate obtained in optimum conditions for Indian white shrimp?\n                            A: In optimum conditions, a hatching rate of 85-90% is obtained.\n                            Q: How are shrimp larvae fed during PL1-PL20 stages?\n                            A: Live Artemia nauplii (4-5 nos/PL) and microencapsulated particulate diet are given during PL1-PL20 stages.}",
    "{ Q: What is the distribution of Banana Shrimp?\n                            A: Banana Shrimp is widely distributed in the Indo-West Pacific region in both tropical and subtropical waters.\n                            Q: How are broodstocks selected for Banana Shrimp hatchery production?\n                            A: Females above 25 g and males above 20 g are used for Banana Shrimp hatchery seed production.\n                            Q: How is maturation induced in adult female Banana Shrimp?\n                            A: Maturation can be induced in adult female Banana Shrimp by unilateral eyestalk ablation.\n                            Q: What is the hatching rate of Banana Shrimp eggs?\n                            A: The hatching rate of Banana Shrimp eggs is 80 to 90%.\n                            Q: What are the larval stages of Banana Shrimp?\n                            A: Banana Shrimp larvae pass through 3 stages of protozoea, 3 stages of mysis, and then to post-larvae.\n                            Q: What is the feeding protocol during the commercial production cycle of Banana Shrimp?\n                            A: An antibiotics-free protocol with probiotics/bioremediation is followed during Banana Shrimp commercial production.\n                            Q: What is the survival rate of Banana Shrimp larvae from Nauplius to PL 5 stage?\n                            A: A larval survival of 40-50% is achievable from Nauplius to PL 5 stage in Banana Shrimp.\n                            Q: What is the distribution of Kuruma Shrimp?\n                            A: Kuruma Shrimp is distributed in the Indo-west Pacific region, from South East Africa to south-east Asia to north Australia.\n                            Q: How are broodstocks selected for Kuruma Shrimp hatchery production?\n                            A: Broodstocks of an average weight above 40 g for female and above 20 g for males are recruited for Kuruma Shrimp hatchery production.\n                            Q: How is maturation induced in adult female Kuruma Shrimp?\n                            A: Induced maturation is practiced by unilateral eye-stalk ablation and/or hormonal treatment in hatchery conditions for Kuruma Shrimp.}",
    "{ Q: What is the duration of larval rearing for shrimp?\n                            A: Larval rearing is completed within 10-11 days.\n                            Q: What is the feeding regime during protozoea and mysis stages?\n                            A: Microalgae like diatoms maintained at 80,000-1,30,000 cell/ml are given.\n                            Q: What is given to shrimp during PL1 to PL20 stages?\n                            A: Live Artemia nauplius (4-5 nos/PL) and microencapsulated particulate diet are given.\n                            Q: What is the importance of health checks in hatchery management?\n                            A: Health checks help in assessing the health of the larvae and maintaining good hatchery practices.\n                            Q: What is the commercial importance of Green Tiger Prawn?\n                            A: It is a commercially important penaeid shrimp species, dominant in the coastal waters of Tamil Nadu.\n                            Q: What is the size of Green Tiger Prawn in case of males and females?\n                            A: Males grow to 230 mm and females grow to 270 mm in TL.\n                            Q: How many eggs does a female Green Tiger Prawn lay?\n                            A: A female lays 2-4 lakh eggs.\n                            Q: What are the larval stages of Green Tiger Prawn?\n                            A: Larval stages comprise six naupliar stages (NI-VI), three protozoea stages (PZI-III), and three mysis stages (M I-III).\n                            Q: What is the survival rate of Green Tiger Prawn larvae from N-I to PL-20?\n                            A: The survival rate is around 32%.\n                            Q: What is the ideal salinity range for larval rearing of Green Tiger Prawn?\n                            A: The ideal salinity range is 32 to 35 ppt.}",
    "{ Q: What is the color of the genital opening in female mud crabs?\n                            A: The genital opening in female mud crabs is coloured.\n                            Q: What are the conditions for female mud crab maturation?\n                            A: Females mature in a rearing system with 12:12 D:L photoperiod at 26-28ºC.\n                            Q: How many eggs does a mature female mud crab lay?\n                            A: A 60-102 mm CL female lays 20,000-60,000 eggs.\n                            Q: How long does it take for mud crab eggs to incubate?\n                            A: The eggs incubate for about 5 weeks, changing color from orange to blackish.\n                            Q: What is the feeding schedule for day-one hatch phyllosoma larvae?\n                            A: They start feeding in 3 hours and are fed every 6 hours with live feeds or particulate diets.\n                            Q: How many phyllosomal stages are there in the mud crab life cycle?\n                            A: There are four phyllosomal stages, each taking nearly 4-5 days to moult and grow.\n                            Q: What is the salinity requirement for mud crab seed production?\n                            A: The seed production cycle is completed in 26 days in water salinity of 35-37 ppt.\n                            Q: Where is the Indo-Pacific mud crab distributed?\n                            A: It is distributed in the Indo-West Pacific region, from East and South Africa to southeast and east Asia.\n                            Q: How are mature female mud crabs obtained for hatcheries?\n                            A: They are obtained from estuarine/coastal waters or from brackishwater ponds.\n                            Q: How long does it take for mud crab eggs to hatch?\n                            A: Hatching occurs within 10-12 days after spawning.}",
    "{ Q: What is the stocking density for megalopa in net cages?\n                            A: The stocking density for megalopa in net cages is 50 no/m2.\n                            Q: What are megalopa fed in the net cages?\n                            A: Megalopa are fed with minced fish and clam meat.\n                            Q: When are crab instars 2-3 harvested?\n                            A: Crab instars 2-3 are harvested within 7 days.\n                            Q: Which Indian states mainly adopt seed production technology?\n                            A: Andhra Pradesh and Tamil Nadu mainly adopt seed production technology.\n                            Q: What is the maximum size of male and female blue swimmer crabs?\n                            A: Males grow to a maximum size of 650 g, and females grow to 550 g.\n                            Q: How are captive broodstocks raised for blue swimmer crabs?\n                            A: They are raised through hatchery-raised crab instars or wild-collected juvenile crabs in recirculation systems.\n                            Q: How many eggs can a female blue swimmer crab lay per spawning?\n                            A: A female blue swimmer crab can lay 0.06-1.90 million eggs per spawning.\n                            Q: What are the larval stages of blue swimmer crabs?\n                            A: The larval stages include four zoeal stages (Zoea I-IV) and a megalopa stage.\n                            Q: How long does it take for blue swimmer crab larvae to reach the crab stage?\n                            A: It takes an average of 17 days for the larvae to reach the crab stage (Crab Instar-I).}",
    "{ Q: Who is the contributor for Cirrhinus reba?\n                            A: Dr. Sudhir Raizada, ICAR-NBFGR, Lucknow, U.P.\n                            Q: Who contributed information on Puntius sarana?\n                            A: Dr. Pratap Chandra Das, ICAR-CIFA, Bhubaneswar, Odisha\n                            Q: Who contributed information on Chagunius chagunius?\n                            A: Dr. S. G. S. Zaidi and Dr. D. Sarma, ICAR-DCFR, Bhimtal, U.K.\n                            Q: Who contributed information on Bangana dero?\n                            A: Dr. N. N. Pandey and Dr. D. Sarma, ICAR-DCFR, Bhimtal, U.K.\n                            Q: Who contributed information on Osteobrama belangari?\n                            A: Dr. Pratap Chandra Das, ICAR-CIFA, Bhubaneswar, Odisha\n                            Q: Who contributed information on Tor putitora?\n                            A: Dr. D. Sarma and Dr. M. S. Akhtar, ICAR-DCFR, Bhimtal, U.K.\n                            Q: Who contributed information on Neolissochilus hexagonolepis?\n                            A: Dr. S.G.S. Zaidi and Dr. Debajit Sarma, ICAR-DCFR, Bhimtal, U.K.\n                            Q: Who contributed information on Naziritor chelynoides?\n                            A: Dr. S.G.S. Zaidi and Dr. D. Sarma, ICAR-DCFR, Bhimtal, U.K.\n                            Q: Who contributed information on Schizothorax richardsonii?\n                            A: Dr. Suresh Chandra, Dr. N. N. Pandey and Dr A. K. Giri, ICAR-DCFR, Bhimtal, U.K.\n                            Q: Who contributed information on Clarias magur?\n                            A: Dr. S.K. Sahoo and Dr. S. Ferosekhan, ICAR-CIFA, Bhubaneswar, Odisha}",
    "{ Q: Who are the contributors for Anabas testudineus?\n                            A: Dr. Rajesh Kumar from ICAR-CIFA, Bhubaneswar, Odisha.\n                            Q: Who contributed to the research on Lates calcarifer?\n                            A: Dr. M. Kailasam, Dr. R. Subburaj, and Dr. Prem Kumar from ICAR-CIBA, Chennai, Tamil Nadu.\n                            Q: Who worked on Chanos chanos?\n                            A: Dr. Aritra Bera, Dr. M. Kailasam, and Dr. K.K. Vijayan from ICAR-CIBA, Chennai, Tamil Nadu.\n                            Q: Who researched Etroplus suratensis?\n                            A: Dr. Krishna Sukumaran, Dr. Dani Thomas, and Dr. K.K. Vijayan from ICAR-CIBA, Chennai, Tamil Nadu.\n                            Q: Who studied Scatophagus argus?\n                            A: Dr. Babita Mandal, Dr. Tanveer Hussain, and Dr. M. Kailasam from ICAR-CIBA, Chennai, Tamil Nadu.\n                            Q: Who are the contributors for Terapon jarbua?\n                            A: Dr. S.N. Sethi, Dr. M.U. Rekha, and Dr. M. Kailasam from ICAR-CIBA, Chennai, Tamil Nadu.\n                            Q: Who researched Rachycentron canadum?\n                            A: Dr. A.K. Abdul Nazar from ICAR-CMFRI, Kochi, Kerala.\n                            Q: Who worked on Trachinotus blochii?\n                            A: Dr. A.K. Abdul Nazar from ICAR-CMFRI, Kochi, Kerala.\n                            Q: Who studied Trachinotus mookalee?\n                            A: Dr. Ritesh Ranjan from ICAR-CMFRI, Kochi, Kerala.}",
    "{ Q: Who are the authors associated with Penaeus semisulcatus?\n                            A: Dr. G. Maheswarudu and Dr. A.K. Abdul Nazar from ICAR-CMFRI, Kochi, Kerala.\n                            Q: Who is the author associated with Thenus unimaculatus?\n                            A: Dr. Joe K. Kizhakudan from ICAR-CMFRI, Kochi, Kerala.\n                            Q: Who are the authors associated with Scylla serrata?\n                            A: Dr. C.P. Balasubramanian, Mr. Antony Jose, and Mr. R. Aravind from ICAR-CIBA, Chennai, Tamil Nadu.\n                            Q: Who is the author associated with Portunus pelagicus?\n                            A: Dr. Josileen Jose from ICAR-CMFRI, Kochi, Kerala.\n                            Q: What is the purpose of the Intellectual Property and Technology Management Unit (IPTM Unit) of ICAR?\n                            A: The IPTM Unit of ICAR was constituted to assimilate IPR dimensions in research management in R&D institutions.\n                            Q: What is the vision of ICAR-National Academy of Agricultural Research Management (NAARM)?\n                            A: The vision of NAARM is to enable National Agricultural Research and Education System (NARES) adapt to change through continuous innovation.\n                            Q: What is the role of the Directorate of Knowledge Management in Agriculture (DKMA)?\n                            A: DKMA promotes ICT-driven technology and information dissemination systems for quick, effectual, and cost-effective delivery of messages to all stakeholders in agriculture.\n                            Q: What is the purpose of Agri-Startups: Reflection of ICAR Technologies in Market AgRIM?\n                            A: The purpose of Agri-Startups is to reflect ICAR technologies in the market and contribute to the development of an IP environment in ICAR.\n                            Q: Who is the guiding authority for Agri-Startups: Reflection of ICAR Technologies in Market AgRIM?\n                            A: Dr. T. Mohapatra, Secretary, DARE & DG, (ICAR) Indian Council of Agricultural Research, New Delhi.\n                            Q: What are the authors' names associated with the citation provided?\n                            A: K. Srinivas, Gerard, M., Singh, V., Gupta, M., Soam, S. K., Arunachalam, A.}",
    "{ Q: What is the title of the publication?\n                            A: Agri-Startups: Reflection of ICAR Technologies in Market\n                            Q: Who published the document?\n                            A: Indian Council of Agricultural Research, Ministry of Agriculture and Farmers Welfare\n                            Q: What is the year of publication?\n                            A: 2018\n                            Q: Who designed and developed the publication?\n                            A: P. Namdev, ICAR-NAARM and D. Bhoomaiah, ICAR-CIFE\n                            Q: What is the focus of Section 2.1 in the publication?\n                            A: Agril Engineering Machines/Tools\n                            Q: Which companies are listed under Section 2.1.1?\n                            A: Nexgen Drying Systems Pvt. Ltd.\n                            Q: What is the focus of Section 2.2?\n                            A: Bio-pesticides and Crop Nutrition\n                            Q: Which companies are listed under Section 2.2.1?\n                            A: A & N Traders\n                            Q: What is the focus of Section 2.3?\n                            A: Crop Protection and Production Processes\n                            Q: Which companies are listed under Section 2.3.1?\n                            A: Arundhathi Farms}",
    "{Q: What is the role of ICAR in agricultural innovation?\nA: ICAR is the apex public research organization that plays a key role in innovation processes concerning agriculture.\nQ: What has been ICAR's traditional role in technology development and dissemination?\nA: ICAR has traditionally developed and demonstrated technologies in KVKs as an outreach activity.\nQ: Why is it important to commercialize potential agricultural technologies?\nA: Commercializing potential agricultural technologies enables first-generation entrepreneurs to take up agri-startups, accelerating the goal of doubling farmers' income by 2022.\nQ: What initiatives does the Government of India have for promoting innovation in agriculture?\nA: The Government of India has initiatives such as the National Intellectual Property Rights Policy and the Atal Innovation Mission.\nQ: What is the purpose of the publication \"Agri startups: Reflection of ICAR Technologies in Market\"?\nA: The publication showcases the success stories of startups nurtured by ICAR research institutes to foster a culture of innovation and entrepreneurship in the agriculture sector.\nQ: Who is Radha Mohan Singh, and what is his message in the publication?\nA: Radha Mohan Singh is the Hon'ble Union Minister of Agriculture and Farmers Welfare, Government of India. He congratulates ICAR for developing a comprehensive strategy and wishes success to all the startups.\nQ: Who is Gajendra Singh Shekhawat, and what is his message in the publication?\nA: Gajendra Singh Shekhawat is the Hon'ble Union Minister of State for Agriculture and Farmers Welfare, Government of India. He acknowledges the evolution of agriculture research and the importance of incubating new/existing technologies.\nQ: What is the significance of the publication for young entrepreneurs?\nA: The publication encourages young entrepreneurs to innovate and commercially promote viable products and services in the agriculture sector.\nQ: What is the importance of the publication for the agriculture sector?\nA: The publication fosters a culture of innovation and entrepreneurship in the agriculture sector, encouraging the development of new technologies and services.\nQ: What is the ultimate goal of the efforts reflected in the publication?\nA: The ultimate goal is to accelerate the goal of doubling farmers' income by 2022.}",
    "{ Q: What is the importance of improved agricultural delivery methods?\n                            A: Improved delivery methods reduce costs, conserve resources, and promote sustainable utilization of natural resources.\n                            Q: How is ICAR promoting agri-startups in India?\n                            A: ICAR is engaging its R&D labs to promote agri-startups and document successful cases.\n                            Q: What is the goal of ICAR's agri-startup initiatives?\n                            A: The goal is to double farmers' income by 2022 through new products, services, and systems.\n                            Q: How can agriculture research contribute to economic growth?\n                            A: By creating value through new products, services, and systems, agriculture research can fuel the entire economy.\n                            Q: What is the role of incubation in promoting agri-startups?\n                            A: Incubation provides support and nurturing to techno-entrepreneurs, helping them develop their ventures.\n                            Q: How does ICAR support agribusiness incubation?\n                            A: ICAR has established Agribusiness Incubation Centres in 24 institutes and provides funding through the National Agriculture Innovation Fund.\n                            Q: What is the purpose of the \"National Agriculture Innovation Fund\"?\n                            A: The fund supports technology transfer and commercialization in agriculture.\n                            Q: How does the Startup India initiative impact agri-business incubators?\n                            A: Startup India provides a stimulus to agri-business incubators, encouraging innovation and startups.\n                            Q: How has ICAR supported 100 agri-startups?\n                            A: ICAR has provided support through technology licensing, incubation, training, and IP filing.}",
    "{ Q: Who initiated the study on Agri-Startups in India?\n                            A: The study was initiated by the Government of India.\n                            Q: Which organizations conducted the study on Agri-Startups?\n                            A: IP&TM Unit and NAARM conducted the study.\n                            Q: How many Agribusiness Incubators are there in India?\n                            A: There are about 24 Agribusiness Incubators in India.\n                            Q: What is the role of IP&TM unit in Agri-Startups?\n                            A: IP&TM unit supports Agri-Startups in all institutions.\n                            Q: How many technologies have been transferred since 2006?\n                            A: More than 1250 technologies have been transferred since 2006.\n                            Q: Who are the stakeholders involved in technology transfer?\n                            A: MNCs, Indian Companies, SMEs, Government organizations, Non-Government organizations, and Startup Entrepreneurs are the stakeholders.\n                            Q: What is the objective of the publication \"Agri-startups: Reflection of ICAR Technologies in Market\"?\n                            A: The objective is to inspire the youth to join the agricultural sector.\n                            Q: Who provided inputs for the successful compilation of the document?\n                            A: Directors of various ICAR Institutes and start-up companies provided inputs.\n                            Q: What is the full form of ABI?\n                            A: ABI stands for Agri Business Incubator.\n                            Q: Who is Dr. T. Mohapatra?\n                            A: Dr. T. Mohapatra is the Secretary (DARE) & DG, ICAR, Ministry of Agriculture and Farmers Welfare, Government of India.}",
    "{ Q: What is the full form of NC?\n                            A: NC stands for Multi National Company.\n                            Q: What is the role of NARES in agricultural research?\n                            A: NARES is a major stakeholder in agricultural research, focusing on technology creation and delivery.\n                            Q: What does NPD stand for in agriculture?\n                            A: NPD stands for New Product Development in agriculture.\n                            Q: What is the purpose of technology business incubators in agriculture?\n                            A: They help in speedy commercialization of innovations and research outputs.\n                            Q: How do incubators support agri-entrepreneurs?\n                            A: They provide technology refining, validation, business services, IP services, and help in finding funds.\n                            Q: What is the full form of NRC?\n                            A: NRC stands for National Research Centre.\n                            Q: What is the role of NGOs in agriculture?\n                            A: NGOs play a role in promoting agri-based innovations and addressing the needs of consumers.\n                            Q: What is the full form of UAV?\n                            A: UAV stands for Unmanned Aerial Vehicle.\n                            Q: How is NARES transforming to meet current needs?\n                            A: NARES is transforming into a more pluralistic innovation system, focusing on demand-driven and market-led agriculture.\n                            Q: What is the role of agri incubators in attracting agri-entrepreneurs?\n                            A: Agri incubators attract agri-entrepreneurs by providing support services for start-ups and helping in the commercialization of innovations.}",
    "{ Q: What is the role of agribusiness incubators in the agriculture and food sector?\n                            A: Agribusiness incubators play a crucial role in promoting innovation, technology transfer, and entrepreneurship in the agriculture and food sector.\n                            Q: What was the impact of the Bayh-Dole Act of 1980 on technology transfer?\n                            A: The Bayh-Dole Act allowed claiming ownership of intellectual property on research funded by the U.S. Government, leading to increased technology transfer from academic institutions to industry.\n                            Q: How did the Indian Council of Agricultural Research (ICAR) promote technology commercialization?\n                            A: ICAR established Institute Technology Management Units (ITMUs) across all its institutes and launched the IP&TM scheme in 2008 to promote technology commercialization.\n                            Q: What was the impact of the ITMU scheme on the IP ecosystem in the NARES?\n                            A: The ITMU scheme led to the building of a vibrant IP ecosystem in the NARES, with a significant increase in the number of filings under various IP categories.\n                            Q: What was the objective of establishing Business Planning and Development (BPD) units in the NARES?\n                            A: The objective of establishing BPD units was to initiate a new mode of incubation in the NARS and internalize its scope into the system.\n                            Q: What services did the BPD units provide to entrepreneurs and technology seekers?\n                            A: The BPD units provided a wide range of services, including incubation facilities, research support, business services, access to ICT services, and advisories on management, marketing, technical, legal, and financial issues.\n                            Q: How did the BPD units promote partnerships between NARES institutes and technology seeking companies?\n                            A: The BPD units facilitated new partnerships between NARES institutes and technology seeking companies through technology validation, technology transfer, and enterprise development processes.\n                            Q: What was the impact of the BPD units on entrepreneurship development and technology commercialization?\n                            A: The BPD units helped nurture and develop the skills of entrepreneurs, leading to the graduation of 91 incubates and the commercialization of technologies.\n                            Q: How did the success of the ITMU scheme and BPD units lead to the development of the National Agricultural Innovation Fund (NAIF)?\n                            A: The success of the ITMU scheme and BPD units laid the basis for providing a continuum in the NARES for technology commercialization, incubation, and entrepreneurship development, leading to the development of the NAIF.\n                            Q: What is the objective of the National Agricultural Innovation Fund (NAIF)?\n                            A: The objective of the NAIF is to provide a continuum for early-stage work in technology commercialization, incubation, and entrepreneurship development in the NARES.}",
    "{ Q: What is the target number of agribusiness incubators envisaged?\n                            A: The target number of agribusiness incubators envisaged is 50.\n                            Q: How many Agri-Business Incubators (ABIs) have been granted so far?\n                            A: 24 ABIs have been granted till date.\n                            Q: How many agri-entrepreneurs have been helped by these incubators?\n                            A: These incubators have helped more than 150 agri-entrepreneurs.\n                            Q: How many agri-startups are supported by ICAR Agri-business incubation centers?\n                            A: About 100 agri-startups are supported by ICAR Agri-business incubation centers.\n                            Q: What is the purpose of the AgRIM compendium?\n                            A: The AgRIM compendium provides an overview of the efforts of 24 Agri-Business Incubators to bring startups to the market.\n                            Q: What is the expected outcome of the AgRIM compendium?\n                            A: The AgRIM compendium is expected to create more network across the canvas of emerging agri-startups.\n                            Q: How does consolidation of efforts across diverse centers benefit the agri-startups?\n                            A: Consolidation of efforts encourages cross learning within each sector.\n                            Q: How many technologies has CIPHET, Ludhiana licensed?\n                            A: CIPHET, Ludhiana has licensed two technologies.\n                            Q: What is the technology description of the automatic machine for scooping out pulp from custard apple fruits?\n                            A: It is a fully automatic machine assisted with pneumatic power and electronically controlled with 94% pulp recovery and 6% pulp wastage.\n                            Q: What is the technology description of the double jacketed auto stirrer cooker for virgin coconut oil production?\n                            A: It is a double jacketed auto stirrer cooker with an output capacity of 125 lts/batch/6 hr for virgin coconut oil production by hot process.}",
    "{ Q: What is the technology licensed by Padmatech Industries Pvt. Ltd.?\n                            A: CIPHET-Pomegranate Aril Extractor\n                            Q: Who is the founder of Prob Products?\n                            A: Mr. Nagaraj\n                            Q: What is the technology licensed by Sickle Innovations Pvt. Ltd.?\n                            A: Cotton Picking Machine\n                            Q: Who is the founder of WS Telematics Pvt. Ltd.?\n                            A: Mr. Wazir Singh Dahiya\n                            Q: What is the technology licensed by A&N Traders?\n                            A: A micronutrient composition for cardamom and a process for its preparation\n                            Q: Who is the founder of Agpulse Pvt. Ltd.?\n                            A: Mr. Rajeev Ranjan\n                            Q: What is the technology licensed by Agpulse Pvt. Ltd.?\n                            A: Ayurvedic plant medicine to control pest and diseases in crops\n                            Q: What is the licensing term for the technology licensed by Padmatech Industries Pvt. Ltd.?\n                            A: Non-exclusive\n                            Q: What is the licensing term for the technology licensed by A&N Traders?\n                            A: Non-exclusive\n                            Q: What is the licensing term for the technology licensed by Agpulse Pvt. Ltd.?\n                            A: Incubation support}",
    "{ Q: What is the technology licensed by IISR, Calicut?\n                            A: Trichoderma based formulation for disease management in black pepper, cardamom, and ginger.\n                            Q: What is the production capacity of IISR, Calicut's licensed technology?\n                            A: 5 Tonnes/Month.\n                            Q: What is the technology licensed by Codagu Agritech?\n                            A: Biocapsule technology for nematode control and Trichoderma formulation for Phytophthora foot rot in black pepper.\n                            Q: What is the production capacity of Codagu Agritech's licensed technology?\n                            A: 5000 Capsules/Week.\n                            Q: What is the technology licensed by Hi7 Agri Bio Solutions?\n                            A: Micronutrient formulations for mango, banana, and vegetables.\n                            Q: What is the production capacity of Hi7 Agri Bio Solutions' licensed technology?\n                            A: 2 Tonnes/Month.\n                            Q: What is the technology licensed by Jai Biotech Research Centre?\n                            A: Phosphate solubilizing bacteria based biofertilizer technology.\n                            Q: What is the production capacity of Jai Biotech Research Centre's licensed technology?\n                            A: 50 Metric Tonnes/Year.\n                            Q: What is the technology licensed by Jayvions Agritech Industries?\n                            A: Low-cost multiplication technology of salt-tolerant bio-growth enhancers for sodic soils.\n                            Q: What is the production capacity of Jayvions Agritech Industries' licensed technology?\n                            A: Less than 1 Tonne.}",
    "{ Q: What is the Nutrition Technology described in the text?\n                            A: The Nutrition Technology described is about marketing and supply chain efficiency by integrating the backward supply chain.\n                            Q: When was the Nutrition Technology developed?\n                            A: The Nutrition Technology was developed in 2012.\n                            Q: What is the production capacity of the Nutrition Technology?\n                            A: The production capacity of the Nutrition Technology is 200-300 Metric Tonnes/Year.\n                            Q: What is the annual turnover of the Nutrition Technology?\n                            A: The annual turnover of the Nutrition Technology is 10 Lakhs.\n                            Q: Who is the founder of the Nutrition Technology?\n                            A: The founder of the Nutrition Technology is Mr. Gunajit Brahma.\n                            Q: What is the contact information for the founder of the Nutrition Technology?\n                            A: The contact information for the founder of the Nutrition Technology is 9867451400 and gun@jeevenksh.com.\n                            Q: What is the industry of the technology licensed by IIHR, Bengaluru?\n                            A: The industry of the technology licensed by IIHR, Bengaluru is Biopesticides and Crop Nutrition.\n                            Q: What is the technology description of the technology licensed by IIHR, Bengaluru?\n                            A: The technology description of the technology licensed by IIHR, Bengaluru is Mass Production of Biopesticides.\n                            Q: What is the production capacity of the technology licensed by IIHR, Bengaluru?\n                            A: The production capacity of the technology licensed by IIHR, Bengaluru is 3 to 5 Tonnes/month.\n                            Q: Who is the founder of the technology licensed by IIHR, Bengaluru?\n                            A: The founder of the technology licensed by IIHR, Bengaluru is Mr. Sabu Thomas.}",
    "{ Q: What is the name of the first company in the provided text?\n                            A: Suma Agro India Pvt. Ltd.\n                            Q: What technology does Suma Agro India Pvt. Ltd. specialize in?\n                            A: Enriched Humic Acid Technology.\n                            Q: What is the production capacity of Suma Agro India Pvt. Ltd.?\n                            A: 1.2 Million Litres/Year.\n                            Q: What is the name of the second company in the provided text?\n                            A: Arundhathi Farms.\n                            Q: What technology does Arundhathi Farms specialize in?\n                            A: Cultivation of Floriculture Crops under Polyhouse.\n                            Q: What is the production capacity of Arundhathi Farms?\n                            A: 3000 Nos/day.\n                            Q: What is the name of the third company in the provided text?\n                            A: Bharatrohan Airborne Innovations Pvt. Ltd.\n                            Q: What technology does Bharatrohan Airborne Innovations Pvt. Ltd. specialize in?\n                            A: Developing proprietary Spectral Disease Indices (SDIs) to predict pest attacks and disease outbreaks in crops using UAV/Drone based Hyperspectral Imaging.\n                            Q: What is the licensing term for the technology of Bharatrohan Airborne Innovations Pvt. Ltd.?\n                            A: Incubation support.\n                            Q: What is the name of the fourth company in the provided text?\n                            A: Ceyon Healthcare Pvt. Ltd.}",
    "{ Q: What is the technology offered by Soil Applicant-Address?\n                            A: The technology addresses problems of salinity, sodicity, and alkalinity in soil and irrigation water.\n                            Q: What is the product offered by Bio repellent?\n                            A: Bio repellent offers a repellent for wild boar, nilgai, and birds.\n                            Q: What is the technology offered by Homecrop?\n                            A: Homecrop provides modular garden kits and vegetable gardening services.\n                            Q: What is the technology offered by Niranthara?\n                            A: Niranthara offers a process of drying orchid flowers to increase their shelf life for decorative purposes.\n                            Q: What is the technology offered by Padmavati & VARI Agro Services Pvt. Ltd.?\n                            A: The company provides better market information to farmers and consumers for agricultural products.\n                            Q: What is the technology offered by Sekhon Biotech Pvt. Ltd.?\n                            A: Sekhon Biotech offers a process of growing plants in an air-mist environment without soil or an aggregate medium.\n                            Q: What is the technology offered by Silage Agro Pvt. Ltd.?\n                            A: Silage Agro manufactures Corn Silage 'Nutrimeal'- high energy fodder for dairy animals.\n                            Q: How many employees does Soil Applicant-Address have?\n                            A: Soil Applicant-Address has 31 employees.\n                            Q: How many employees does Homecrop have?\n                            A: Homecrop has 5 to 10 employees.\n                            Q: How many employees does Padmavati & VARI Agro Services Pvt. Ltd. have?\n                            A: The company has 101 employees.}",
    "{ Q: What is Crop Terrain?\n                            A: Crop Terrain is a mobile and browser-based application that streamlines information flow between field-level activities and management.\n                            Q: Who developed Crop Terrain?\n                            A: Crop Terrain was developed by StampIT Business Solutions.\n                            Q: What services does StellarGene Technologies offer?\n                            A: StellarGene Technologies offers genomic tests and services to Agri-scientists.\n                            Q: What is the DNA-based nested-PCR diagnostic kit for?\n                            A: It is used for the detection of the lethal shrimp pathogen White Spot Syndrome Virus (WSSV).\n                            Q: Who developed the advanced WSSV detection technology?\n                            A: Aura Biotechnologies Pvt. Ltd. developed the advanced WSSV detection technology.\n                            Q: What are the kits offered by Biometta for?\n                            A: Biometta offers kits for detecting different parameters in aquaculture and related aquatic environments.\n                            Q: What is the solution portfolio of Growyield Tech Solutions Pvt. Ltd.?\n                            A: It has the capacity to monitor aquafarms by sensing water parameters.\n                            Q: What is the licensing term for Crop Terrain?\n                            A: The licensing term for Crop Terrain is incubation support.\n                            Q: What is the licensing term for StellarGene Technologies' genomic services?\n                            A: The licensing term for StellarGene Technologies' genomic services is incubation support.\n                            Q: What is the licensing term for the DNA-based nested-PCR diagnostic kit?\n                            A: The licensing term for the DNA-based nested-PCR diagnostic kit is non-exclusive.}",
    "{ Q: What is the technology developed by CIBA, Chennai?\n                            A: CIBA, Chennai has developed organic feed for shrimp culture and cost-effective processing of shrimp feed.\n                            Q: Who is the founder of Growyi and what is their contact information?\n                            A: The founder of Growyi is Mr. Sudeesh Thatha, who can be contacted at sudeesh@growyi.com or 9845222647.\n                            Q: What is the technology developed by Jass Ventures Pvt. Ltd.?\n                            A: Jass Ventures Pvt. Ltd. has developed organic shrimp feed.\n                            Q: Who is the founder of Odaku Online Services Pvt. Ltd. and what is their contact information?\n                            A: The founder of Odaku Online Services Pvt. Ltd. is Mr. Xavier Lawrance, who can be contacted at info@odaku.in or 9443216829.\n                            Q: What is the technology developed by Revelations Biotech Pvt. Ltd.?\n                            A: Revelations Biotech Pvt. Ltd. has developed next-generation shrimp feed technology.\n                            Q: Who is the founder of Sai Aqua Feeds and what is their contact information?\n                            A: The founder of Sai Aqua Feeds is Mr. Vijay Marutha Varma, who can be contacted at manthenakaruna@yahoo.in or 9440703033.\n                            Q: What is the technology developed by San Isidro?\n                            A: San Isidro has developed organic manure from fish waste.\n                            Q: Who is the founder of San Isidro and what is their contact information?\n                            A: The founder of San Isidro is Mr. Jeffin Jose, who can be contacted at jeffinlucky7@gmail.com or 7736211536.\n                            Q: What is the technology developed by CIFT, Kochi?\n                            A: CIFT, Kochi has developed technology for the production of organic manure utilizing fish waste.\n                            Q: What is the technology developed by NAARM, Hyderabad?\n                            A: NAARM, Hyderabad has developed technology for seafood traceability for efficient fishing using integrated technologies.}"
]