[
    "```json\n[\n    {\n        \"question\": \"What is the shelf life of figs when stored at 32° to 35°F?\",\n        \"answer\": \"Figs can remain in good condition for 30 days when stored at 32° to 35°F.\"\n    },\n    {\n        \"question\": \"How long can figs be kept at 50°F and 85% relative humidity?\",\n        \"answer\": \"Figs can be kept no longer than 21 days at 50°F and 85% relative humidity.\"\n    },\n    {\n        \"question\": \"What is the shelf life of figs when removed from storage?\",\n        \"answer\": \"Figs have a shelf life of only 1 to 2 days when removed from storage.\"\n    },\n    {\n        \"question\": \"How long can figs be maintained if frozen whole?\",\n        \"answer\": \"Figs can be maintained for several months if frozen whole.\"\n    },\n    {\n        \"question\": \"What are some improved technologies to increase the shelf life of fresh fruits?\",\n        \"answer\": \"Improved technologies include modified atmospheric storage, cold storage, and controlled atmospheric storage conditions.\"\n    },\n    {\n        \"question\": \"What is the aim of the study on vermicomposting of palm oil waste?\",\n        \"answer\": \"The aim of the study was to investigate the characteristics and physico-chemical changes of vermicompost during composting of palm oil processed by epigeic earthworm (E. eugeniae).\"\n    },\n    {\n        \"question\": \"What is the potential area for oil palm cultivation in India?\",\n        \"answer\": \"An area of 19.33 lakh hectares in 18 states is identified as potential for oil palm cultivation in India.\"\n    },\n    {\n        \"question\": \"How much crude palm oil and palm kernel oil can oil palm produce per hectare per year?\",\n        \"answer\": \"Oil palm can produce 4 to 6 tonnes of crude palm oil and 0.4 to 0.6 tonnes of palm kernel oil per hectare per year from the 4th to the 30th year of its productive life span.\"\n    },\n    {\n        \"question\": \"What are the waste products from oil palm processing?\",\n        \"answer\": \"Waste products include oil palm trunks (OPT), oil palm fronds (OPF), empty fruit bunches (EFB), palm pressed fibres (PPF), palm kernel shells, palm kernel cake, and palm oil mill effluent (POME).\"\n    },\n    {\n        \"question\": \"How much fresh fruit bunches are required to produce 1 tonne of crude palm oil?\",\n        \"answer\": \"The production of 1 tonne of crude palm oil requires 5 tonnes of fresh fruit bunches.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What traits were considered for selecting Kabuli chickpea lines at FLRP, Amlaha?\",\n        \"A\": \"Early maturity (105-115 days), tall, non-lodging and erect growth habit, bold seed (>50 gms/100-seeds), higher podding intensity, and yield potential.\"\n    },\n    {\n        \"Q\": \"Which institutes received the selected Kabuli chickpea lines from FLRP, Amlaha?\",\n        \"A\": \"IARI, PAU, JNKVV, RLBCAU, RAK College, BCKV, and OUAT.\"\n    },\n    {\n        \"Q\": \"What are the key characteristics of the selected grass pea lines at FLRP?\",\n        \"A\": \"Early maturity (<120 days), high biomass (up to 6.5 t/ha), and seed yield (1.39-1.67 t/ha).\"\n    },\n    {\n        \"Q\": \"Which institutes were the selected grass pea lines shared with?\",\n        \"A\": \"IIPR, IGKVV, BCKV, NBPGR, and OUAT.\"\n    },\n    {\n        \"Q\": \"What traits were considered for selecting lentil lines at FLRP?\",\n        \"A\": \"Tall, non-lodging and erect growth habit, suitability to machine harvest, herbicide tolerance, earliness (<105 days), Stemphylium blight resistance, heat and salinity tolerance.\"\n    },\n    {\n        \"Q\": \"Which institutes received the selected lentil lines from FLRP?\",\n        \"A\": \"IIPR, IARI, NBPGR, BCKV, OUAT, RAK College, CAU-Imphal, and ICAR-Barapani.\"\n    },\n    {\n        \"Q\": \"What is the significance of the lentil variety PDL-1 released by IARI?\",\n        \"A\": \"It is adapted to saline and sodic soils and is resistant to certain stresses.\"\n    },\n    {\n        \"Q\": \"What traits were evaluated for selecting faba bean lines at FLRP?\",\n        \"A\": \"Early to medium maturity (115-120 days) and seed yield.\"\n    },\n    {\n        \"Q\": \"Which institutes received the selected faba bean lines from FLRP?\",\n        \"A\": \"OUAT and BCKV.\"\n    },\n    {\n        \"Q\": \"What conditions were considered for selecting barley lines at FLRP?\",\n        \"A\": \"2-row high input, 6-row high input, and 6-row low input conditions.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"How many awareness programmes on Natural Farming were organized by KVKs?\",\n        \"A\": \"KVKs organized 418 training programmes on different aspects of Natural Farming.\"\n    },\n    {\n        \"Q\": \"How many farmers were trained in Natural Farming by KVKs?\",\n        \"A\": \"KVKs trained 19,363 farmers in Natural Farming.\"\n    },\n    {\n        \"Q\": \"How many demonstrations on Natural Farming were conducted by KVKs?\",\n        \"A\": \"KVKs organized 3,325 demonstrations on Natural Farming at farmers’ fields.\"\n    },\n    {\n        \"Q\": \"What is the purpose of the Agri-Drone project initiated by ICAR?\",\n        \"A\": \"The Agri-Drone project aims to create awareness among farmers and demonstrate the use of drones in agriculture.\"\n    },\n    {\n        \"Q\": \"How many Agri-Drone demonstrations were carried out by the institutions?\",\n        \"A\": \"Institutions carried out 15,075 Agri-Drone demonstrations.\"\n    },\n    {\n        \"Q\": \"How many farmers participated in the Agri-Drone demonstrations?\",\n        \"A\": \"A total of 90,953 farmers participated in the Agri-Drone demonstrations.\"\n    },\n    {\n        \"Q\": \"What are the advantages of using drones in agriculture?\",\n        \"A\": \"Advantages include high field capacity and efficiency, reduced wastage of pesticides and fertilizers, water saving, cost reduction, and minimized human exposure to hazardous chemicals.\"\n    },\n    {\n        \"Q\": \"How many Agri-Drones were procured under the Agri-Drone project?\",\n        \"A\": \"263 Agri-Drones were procured under the Agri-Drone project.\"\n    },\n    {\n        \"Q\": \"Which institutions were involved in the Agri-Drone project?\",\n        \"A\": \"193 Institutions, including 67 ICAR Institutes, 33 Agricultural Universities, and 93 KVKs, were involved.\"\n    },\n    {\n        \"Q\": \"What technologies are transforming Indian agriculture from traditional to precision agriculture?\",\n        \"A\": \"Technologies such as sensors, drones, robotics, Internet of Things, Artificial Intelligence, Machine Learning, and geo-informatics are driving this transformation.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What does organic agriculture aim to preserve?\",\n        \"A\": \"Organic agriculture aims to preserve the ecosystem and prevent farmers from overexposure to harmful chemicals.\"\n    },\n    {\n        \"Q\": \"What is the significance of Asangraha in agriculture?\",\n        \"A\": \"Asangraha emphasizes that waste is a sin against nature and advocates recognizing nature’s cycle with ecological humility.\"\n    },\n    {\n        \"Q\": \"What did Gandhiji advocate for in agriculture?\",\n        \"A\": \"Gandhiji advocated for integration and cohesion, symbolized by Yagna, meaning the replenishment of soil and nature.\"\n    },\n    {\n        \"Q\": \"What are the principles of organic farming?\",\n        \"A\": \"The principles of organic farming emphasize health, ecology, fairness, and care.\"\n    },\n    {\n        \"Q\": \"When was the Network Project on Organic Farming (NPOF) initiated?\",\n        \"A\": \"The Network Project on Organic Farming (NPOF) was initiated during 2004-05.\"\n    },\n    {\n        \"Q\": \"What was the mandate of the NPOF project?\",\n        \"A\": \"The mandate of the NPOF project was to develop scientifically validated organic farming approaches and location-specific management protocols.\"\n    },\n    {\n        \"Q\": \"How many centers were included in the All India Network Programme on Organic Farming in 2015-16?\",\n        \"A\": \"The number of centers increased from 13 to 20 in 2015-16.\"\n    },\n    {\n        \"Q\": \"What are some technologies developed under the organic farming scheme?\",\n        \"A\": \"Technologies include package of practices for cropping systems, identification of varieties, and integrated organic farming systems.\"\n    },\n    {\n        \"Q\": \"What is the productivity of coarse rice under developed organic farming practices?\",\n        \"A\": \"The productivity of coarse rice is 3.9 t ha-1 under developed organic farming practices.\"\n    },\n    {\n        \"Q\": \"How does the productivity of crops under organic farming compare to traditional practices?\",\n        \"A\": \"The productivity of crops under scientific organic farming packages is generally higher than traditional or indigenous practices.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the total budget estimate for IARI, New Delhi in 2018-19?\",\n        \"answer\": \"The total budget estimate for IARI, New Delhi in 2018-19 is 441.40 lakhs.\"\n    },\n    {\n        \"question\": \"What is the total budget estimate for IARI Types Deemed University, Assam in 2018-19?\",\n        \"answer\": \"The total budget estimate for IARI Types Deemed University, Assam in 2018-19 is 3156.00 lakhs.\"\n    },\n    {\n        \"question\": \"What is the total budget estimate for IARI Types Deemed University, Jharkhand in 2018-19?\",\n        \"answer\": \"The total budget estimate for IARI Types Deemed University, Jharkhand in 2018-19 is 5435.80 lakhs.\"\n    },\n    {\n        \"question\": \"What is the total budget estimate for IGFRI, Jhansi in 2018-19?\",\n        \"answer\": \"The total budget estimate for IGFRI, Jhansi in 2018-19 is 4381.15 lakhs.\"\n    },\n    {\n        \"question\": \"What is the total budget estimate for AICRP on Forage Crops and Utilization, IGFRI, Jhansi in 2018-19?\",\n        \"answer\": \"The total budget estimate for AICRP on Forage Crops and Utilization, IGFRI, Jhansi in 2018-19 is 909.00 lakhs.\"\n    },\n    {\n        \"question\": \"What is the total budget estimate for IIPR, Kanpur in 2018-19?\",\n        \"answer\": \"The total budget estimate for IIPR, Kanpur in 2018-19 is 4308.00 lakhs.\"\n    },\n    {\n        \"question\": \"What is the total budget estimate for AICRP on Chickpea, IIPR, Kanpur in 2018-19?\",\n        \"answer\": \"The total budget estimate for AICRP on Chickpea, IIPR, Kanpur in 2018-19 is 1097.00 lakhs.\"\n    },\n    {\n        \"question\": \"What is the total budget estimate for AICRP on Mullarp, IIPR, Kanpur in 2018-19?\",\n        \"answer\": \"The total budget estimate for AICRP on Mullarp, IIPR, Kanpur in 2018-19 is 1159.00 lakhs.\"\n    },\n    {\n        \"question\": \"What is the total budget estimate for AICRP on Pigeonpea, IIPR, Kanpur in 2018-19?\",\n        \"answer\": \"The total budget estimate for AICRP on Pigeonpea, IIPR, Kanpur in 2018-19 is 978.00 lakhs.\"\n    },\n    {\n        \"question\": \"What is the total budget estimate for AICRP on Arid Legumes, IIPR Kanpur in 2018-19?\",\n        \"answer\": \"The total budget estimate for AICRP on Arid Legumes, IIPR Kanpur in 2018-19 is 317.00 lakhs.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What are the benefits of crop diversification in India?\",\n        \"A\": \"Crop diversification helps in employment generation, self-reliance in critical crop products, earning foreign exchange, and minimizing risk in farming.\"\n    },\n    {\n        \"Q\": \"Why is crop diversification practiced in rainfed areas?\",\n        \"A\": \"Crop diversification is practiced in rainfed areas to reduce the risk of crop failures due to drought.\"\n    },\n    {\n        \"Q\": \"What is the Technology Mission on Oilseeds (TMO)?\",\n        \"A\": \"The Technology Mission on Oilseeds (TMO) was created to give thrust on oilseed production as a national need to reduce imports.\"\n    },\n    {\n        \"Q\": \"How many annual oilseed crops are cultivated in India?\",\n        \"A\": \"India cultivates nine annual oilseed crops, including groundnut, rapeseed-mustard, soybean, sunflower, sesame, safflower, niger, castor, and linseed.\"\n    },\n    {\n        \"Q\": \"What percentage of oilseed cultivation in India is rainfed?\",\n        \"A\": \"76% of the oilseed cultivation area in India is rainfed, contributing to 80% of total production.\"\n    },\n    {\n        \"Q\": \"Which states are the major oilseed producers in India?\",\n        \"A\": \"Rajasthan, Madhya Pradesh, Gujarat, and Maharashtra are the major oilseed-producing states, contributing to more than 77% of total production.\"\n    },\n    {\n        \"Q\": \"What are the top three oilseeds contributing to India's total oilseed production?\",\n        \"A\": \"Soybean (34%), rapeseed & mustard (31%), and groundnut (27%) contribute to more than 92% of India's total oilseed production.\"\n    },\n    {\n        \"Q\": \"What was India's oilseed production in 2022-23?\",\n        \"A\": \"India's oilseed production reached a new high of 41.35 million tonnes (MT) in 2022-23.\"\n    },\n    {\n        \"Q\": \"Why is achieving self-sufficiency in edible oils important for India?\",\n        \"A\": \"Achieving self-sufficiency in edible oils is important to reduce dependence on imports and meet domestic demand.\"\n    },\n    {\n        \"Q\": \"What role does sunflower play in contingency cropping plans?\",\n        \"A\": \"Sunflower, due to its photo-insensitivity and adaptability to soil types, is suitable for late planting in Kharif and can be planted if the Kharif crop fails due to delayed rains.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is rhizosphere hybridization?\",\n        \"answer\": \"Rhizosphere hybridization is a new concept aimed at modifying the rhizosphere ecology to create an optimum environment for harnessing the benefits of nutrient-microbe synergy.\"\n    },\n    {\n        \"question\": \"What is the purpose of rhizosphere hybridization?\",\n        \"answer\": \"The purpose of rhizosphere hybridization is to ensure rhizosphere microbial diversity, which is a prerequisite for production sustainability.\"\n    },\n    {\n        \"question\": \"How can rhizosphere hybridization be implemented in the field?\",\n        \"answer\": \"It can be implemented by collecting rhizosphere soil from healthy trees and injecting it into weaker trees to rationalize the distribution of microbes across the field or orchard.\"\n    },\n    {\n        \"question\": \"What are the key trees studied in the context of rhizosphere hybridization?\",\n        \"answer\": \"The key trees studied are Ficus racemosa L. (Umber tree), Ficus benghalensis L. (Banyan tree), and Ficus religiosa L. (Pipal tree).\"\n    },\n    {\n        \"question\": \"What role do agroecological applications play in carbon storage?\",\n        \"answer\": \"Agroecological applications help in storing carbon in the vegetative framework of plants, which is a promising alternative to conventional soil carbon sequestration.\"\n    },\n    {\n        \"question\": \"How much CO2 can fruit crops sequester per hectare?\",\n        \"answer\": \"Fruit crops can sequester 24–109 tons of CO2 per hectare, depending on factors like age, planting distance, soil types, and agrotechniques.\"\n    },\n    {\n        \"question\": \"What is the significance of soil microbial ecology in carbon storage?\",\n        \"answer\": \"Soil microbial ecology plays a pivotal role in the response of fruit crops to elevated CO2 conditions and influences carbon storage in plants.\"\n    },\n    {\n        \"question\": \"How does carbon stored in fruit crops compare to carbon stored in soil?\",\n        \"answer\": \"Carbon stored in the woody fabric of fruit crops is more stable and less vulnerable to decomposition compared to carbon stored in soil.\"\n    },\n    {\n        \"question\": \"What are the challenges to long-term carbon storage in trees?\",\n        \"answer\": \"The carbon stored in trees faces challenges from soil micro-communities' respiration, which can release it back into the atmosphere.\"\n    },\n    {\n        \"question\": \"What are the economic implications of carbon storage in fruit crops?\",\n        \"answer\": \"Carbon storage in fruit crops provides additional ecosystem services and computable economic outcomes due to the distribution of organic compounds in various plant parts.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the mandate of the Indian Council of Agricultural Research (ICAR)?\",\n        \"answer\": \"The mandate of ICAR includes planning, undertaking, coordinating, and promoting research and technology development for sustainable agriculture, aiding and coordinating agricultural education, frontline extension for technology application, and providing policy, cooperation, and consultancy in agricultural research, education, and extension.\"\n    },\n    {\n        \"question\": \"Who visited the Visakhapatnam Research Centre of ICAR-Central Institute of Fisheries Technology on 7 December 2020?\",\n        \"answer\": \"The Vice President of India, Shri M. Venkaiah Naidu, accompanied by Shri Muttamsetti Srinivasa Rao, Minister for Tourism, Culture and Youth Advancement, Government of Andhra Pradesh, visited the Visakhapatnam Research Centre of ICAR-Central Institute of Fisheries Technology.\"\n    },\n    {\n        \"question\": \"What did Vice President Shri M. Venkaiah Naidu emphasize during his visit to ICAR-CIFT?\",\n        \"answer\": \"Shri M. Venkaiah Naidu emphasized the role of Indian fisheries as a major contributor to food and nutritional security, the health benefits of fish consumption, and the need for need-based research and innovative modern research for the well-being of fishers.\"\n    },\n    {\n        \"question\": \"How many varieties/hybrids were notified and released for commercial cultivation during 2020-21?\",\n        \"answer\": \"A total of 172 varieties/hybrids, including 17 biofortified varieties, were notified and released for commercial cultivation during 2020-21.\"\n    },\n    {\n        \"question\": \"What are the categories of crops for which high-yielding varieties were released in 2020-21?\",\n        \"answer\": \"The high-yielding varieties released in 2020-21 included 62 varieties of cereals, 23 of oilseeds, 33 of pulses, 39 of commercial crops, 15 of forage crops, and other crops.\"\n    },\n    {\n        \"question\": \"What is the significance of the lipoxygenase-2 free soybean variety NRC 132?\",\n        \"answer\": \"The lipoxygenase-2 free soybean variety NRC 132 was developed using a marker-assisted selection strategy, which is significant for improving soybean quality.\"\n    },\n    {\n        \"question\": \"What new freshwater fish species was identified in the Brahmaputra drainage?\",\n        \"answer\": \"A new freshwater fish species, Barilius torsai, was identified from the Torsa river in the Brahmaputra drainage.\"\n    },\n    {\n        \"question\": \"What animal genetic resources were strengthened in 2020?\",\n        \"answer\": \"Genetic resources were strengthened with fibroblast cell lines from Jaisalmeri and Bikaneri camel, Halari donkey, and Zanskari horse, with at least five samples from each.\"\n    },\n    {\n        \"question\": \"What are the key areas of focus in the ICAR Annual Report 2020?\",\n        \"answer\": \"The ICAR Annual Report 2020 focuses on soil and water productivity, climate change and resilient agriculture, genetic resources, and crop improvement.\"\n    },\n    {\n        \"question\": \"What is the role of ICAR in agricultural education?\",\n        \"answer\": \"ICAR aids, imparts, and coordinates agricultural education to enable quality human resource development.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What was the antibody titre (SP antibody) comparison between FMD-CP states and other states?\",\n        \"answer\": \"The antibody titre (SP antibody) in serum samples from FMD-CP states was higher compared to other states.\"\n    },\n    {\n        \"question\": \"How many pre- and post-vaccinated serum samples were tested under the FMD Control Programme (FMDCP)?\",\n        \"answer\": \"191,402 pre- and post-vaccinated serum samples were tested under the FMD Control Programme (FMDCP).\"\n    },\n    {\n        \"question\": \"What percentage of animals in the initial FMDCP districts (2003-04) had protective antibody levels against serotype O?\",\n        \"answer\": \"89% of animals in the initial FMDCP districts had protective antibody levels against serotype O.\"\n    },\n    {\n        \"question\": \"Where were H5N8 avian influenza viruses first isolated in India in 2016?\",\n        \"answer\": \"H5N8 avian influenza viruses were first isolated in Delhi, Madhya Pradesh, Punjab, and Kerala in October 2016.\"\n    },\n    {\n        \"question\": \"What genetic feature categorizes the H5N8 virus as highly pathogenic to poultry?\",\n        \"answer\": \"The presence of a multibasic cleavage site (PLREKRRKR/GLF) in the haemagglutinin (HA) gene categorizes the H5N8 virus as highly pathogenic to poultry.\"\n    },\n    {\n        \"question\": \"What phylogenetic clade do the H5N8 viruses isolated in India belong to?\",\n        \"answer\": \"The H5N8 viruses belong to the new phylogenetic clade 2.3.4.4.\"\n    },\n    {\n        \"question\": \"How many H5N1 isolates were selected for antigenic analysis in India?\",\n        \"answer\": \"Seven H5N1 isolates were selected for antigenic analysis in India.\"\n    },\n    {\n        \"question\": \"What was the observed antigenic divergence between clades 2.3.2.1a and 2.3.2.1c?\",\n        \"answer\": \"The antigenic divergence between clades 2.3.2.1a and 2.3.2.1c was a 6-21 fold reduction in cross-reactivity.\"\n    },\n    {\n        \"question\": \"What type of avian influenza virus was isolated from healthy ducks in Asom in 2015?\",\n        \"answer\": \"An H6N2 avian influenza virus was isolated from healthy ducks in Asom in 2015.\"\n    },\n    {\n        \"question\": \"What was the relationship of the Kerala H6N2 virus isolated in 2014?\",\n        \"answer\": \"The Kerala H6N2 virus isolated in 2014 displayed a close relationship with the H6N6 virus isolated from a duck in Japan in 2014.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the sensitivity and specificity of the assay developed against SARS-CoV-2 in canines?\",\n        \"answer\": \"The assay is 95.66% sensitive and 93% specific.\"\n    },\n    {\n        \"question\": \"How were phytochemical conjugated silver nanoparticles (AgNPs) encapsulated for targeted delivery?\",\n        \"answer\": \"They were encapsulated using chitosan-alginate polymers by the ionic gelation method.\"\n    },\n    {\n        \"question\": \"What were the findings regarding selenium in the diet of male growing goats under endotoxin-induced stress conditions?\",\n        \"answer\": \"Crude protein digestibility tended to be high in higher selenium-fed animals, but no effects on growth, nutrient intake, and digestibility were reported.\"\n    },\n    {\n        \"question\": \"What dendritic cell platforms were generated for cattle studies?\",\n        \"answer\": \"Dendritic cell platforms for in vitro and in vivo studies of antigen processing and presentation using FMD virus and Pasteurella multocida as models were generated.\"\n    },\n    {\n        \"question\": \"What was the purpose of synthesizing mesoporous silica nanoparticles (MSN) in relation to the PPR vaccine virus (PPRV)?\",\n        \"answer\": \"They were synthesized to exploit their adjuvant potential and thermo-stabilize the PPR vaccine virus (PPRV).\"\n    },\n    {\n        \"question\": \"Where were captive brood stocks of hilsa, Tenualosa ilisha, developed?\",\n        \"answer\": \"They were developed at three locations: fresh water system at Rahara, intermediate water system at Kolaghat, and brackish water system at Kakdwip.\"\n    },\n    {\n        \"question\": \"What was the difference in reproductive maturity between captive and wild male hilsa?\",\n        \"answer\": \"Captive males showed advanced maturation (GSI 2.24 ± 0.025) compared to wild males in the maturing phase (GSI 0.768 ± 0.002).\"\n    },\n    {\n        \"question\": \"What was the purpose of developing an automated anesthetic device for hilsa?\",\n        \"answer\": \"It was developed for safe handling and performing procedures related to reproductive interventions under stress conditions.\"\n    },\n    {\n        \"question\": \"What were the findings of the qRT-PCR assays targeting TiLV genome segments 1 and 10?\",\n        \"answer\": \"The assays detected higher viral load in the liver than in the spleen and brain at all-time points post-infection, with an increasing trend in the early stages and a steady decline in the later stages.\"\n    },\n    {\n        \"question\": \"What was the purpose of the android mobile application CIBA ShrimpKrishiApp?\",\n        \"answer\": \"It was developed to handhold shrimp farmers in making real-time informed decisions at the farm level.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What was the status of India's food production in 1950?\",\n        \"answer\": \"India was a food-scarce nation in 1950.\"\n    },\n    {\n        \"question\": \"What is the current status of India's food production as of 2010 onwards?\",\n        \"answer\": \"India has become a food-surplus nation from 2010 onwards.\"\n    },\n    {\n        \"question\": \"How much did the production of food grains increase from 1950-51 to 2021-22?\",\n        \"answer\": \"The production of food grains increased from 51 million tonnes in 1950-51 to 314 million tonnes in 2021-22, a 6.2 times increase.\"\n    },\n    {\n        \"question\": \"What was the production of milk in 1950-51 and how much did it increase by 2021-22?\",\n        \"answer\": \"The production of milk was 17 million tonnes in 1950-51 and increased to 210 million tonnes in 2021-22, a 12.4 times increase.\"\n    },\n    {\n        \"question\": \"What was the earliest domestication of animals in pre-independent India?\",\n        \"answer\": \"The earliest domestication was of sheep and goat around 9000 BC.\"\n    },\n    {\n        \"question\": \"When was rice cultivation first reported in India?\",\n        \"answer\": \"The first report of rice cultivation was found in Lothal, Gujarat around 2300 BC.\"\n    },\n    {\n        \"question\": \"What crops were cultivated during the Harappan civilization?\",\n        \"answer\": \"Crops cultivated during the Harappan civilization included wheat, barley, mustard, chickpea, cotton, date, lotus, coconut, pomegranate, lemon, and melon.\"\n    },\n    {\n        \"question\": \"What did Kautilya’s Arthasastra discuss in relation to agriculture?\",\n        \"answer\": \"Kautilya’s Arthasastra discussed meteorological aspects of agriculture.\"\n    },\n    {\n        \"question\": \"What was the significance of the Grand Anicut masonry weir?\",\n        \"answer\": \"The Grand Anicut masonry weir was an ancient irrigation works on the River Cauvery, described in Manusmriti.\"\n    },\n    {\n        \"question\": \"What crops were introduced to India by Portuguese travellers in 1510?\",\n        \"answer\": \"Portuguese travellers introduced groundnut, tobacco, potato, chilli, and Amaranth to India in 1510.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the method used to prevent rat attacks in citrus fruits in Pithoragarh district?\",\n        \"A\": \"Pine needles are tied on the trunk of the citrus tree at 1.5 to 2 feet above the ground to prevent rats from climbing and damaging the fruits.\"\n    },\n    {\n        \"Q\": \"How do farmers in village Narkuda increase productivity in custard apple trees?\",\n        \"A\": \"Farmers apply leaves of pongamia @ 10 kg/custard apple tree in tree basins to enhance productivity, conserve moisture, and control weeds.\"\n    },\n    {\n        \"Q\": \"What is the benefit of using pongamia leaves in custard apple cultivation?\",\n        \"A\": \"Pongamia leaves help in conserving moisture, controlling weeds, and acting as manure, leading to healthier plants and bigger fruits.\"\n    },\n    {\n        \"Q\": \"How is fruit-borer controlled in vegetable crops in Tamil Nadu?\",\n        \"A\": \"Mixed cropping of sorghum and cumbu is used as trap crops to attract birds that feed on the fruit borer.\"\n    },\n    {\n        \"Q\": \"What is the role of castor plants in controlling fruit-borer in orchards?\",\n        \"A\": \"Castor plants are grown as trap crops because fruit borer (Spodoptera litura) prefers castor, and young larvae stuck in castor leaves are removed.\"\n    },\n    {\n        \"Q\": \"What are the keywords associated with the ITK for preventing rat attacks in citrus fruits?\",\n        \"A\": \"The keywords are citrus, rodent, and pine.\"\n    },\n    {\n        \"Q\": \"What are the keywords associated with the ITK for using pongamia leaves in custard apple cultivation?\",\n        \"A\": \"The keywords are pongamia, weed, and manure.\"\n    },\n    {\n        \"Q\": \"What are the keywords associated with the ITK for controlling fruit-borer in vegetable crops?\",\n        \"A\": \"The keywords are fruit borers, vegetable crops, mixed crop, sorghum, and cumbu.\"\n    },\n    {\n        \"Q\": \"What is the purpose of using sorghum and cumbu as trap crops?\",\n        \"A\": \"Sorghum and cumbu attract birds that feed on the fruit borer, thereby controlling the pest in vegetable crops.\"\n    },\n    {\n        \"Q\": \"Where is the ITK for preventing rat attacks in citrus fruits practiced?\",\n        \"A\": \"This ITK is practiced in village Agaion of district Pithoragarh in Uttaranchal.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What should Dr. Katageri have done to ensure the project's correctness?\",\n        \"A\": \"Dr. Katageri should have had the necessary corrections made in the project proposal or contacted Dr. Kumar or other experts for scientific guidance.\"\n    },\n    {\n        \"Q\": \"What crucial observations did Dr. Kranthi make in 2005 and 2008?\",\n        \"A\": \"Dr. Kranthi suspected that the samples given to him had MON531.\"\n    },\n    {\n        \"Q\": \"When did Dr. Kranthi put his views on paper?\",\n        \"A\": \"Dr. Kranthi put his views on paper in October 2009 after it became public knowledge that BNBt had been contaminated with MON531.\"\n    },\n    {\n        \"Q\": \"What did Drs. Khadi and Katageri fail to do in the breeding process?\",\n        \"A\": \"They failed to conduct selection for the event (BNLA106) by testing each generation, particularly when another event (MON531) was present.\"\n    },\n    {\n        \"Q\": \"Where did the contamination with MON531 likely occur?\",\n        \"A\": \"The contamination likely occurred at UAS, Dharwad.\"\n    },\n    {\n        \"Q\": \"What was the state of the seeds Dr. Khadi took to CICR in May 2005?\",\n        \"A\": \"The seeds Dr. Khadi took to CICR were already contaminated with MON531.\"\n    },\n    {\n        \"Q\": \"What was the result of the purification process of BNBt at UAS?\",\n        \"A\": \"Most of the progeny lines carried MON531, and only 5 out of 135 had only BNBt.\"\n    },\n    {\n        \"Q\": \"What is the fifth term of reference for the Committee?\",\n        \"A\": \"The fifth term of reference is to advise steps and methods to ensure the purity of process in developing genetically modified crop plants.\"\n    },\n    {\n        \"Q\": \"What is the responsibility of the P.I. in a project?\",\n        \"A\": \"The P.I. needs to be alert to plug loopholes and ensure the project is planned and executed with utmost care.\"\n    },\n    {\n        \"Q\": \"What is the goal of ensuring the purity of process in genetically modified crop development?\",\n        \"A\": \"The goal is to have a foolproof system that puts the veracity of scientific claims beyond doubt.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What are the symptoms of potassium (K) deficiency in plants?\",\n        \"answer\": \"Symptoms include reduced fruit size with a very thin peel, premature shedding of fruits, leaf scorching, resinous yellow spots, and shoots turning S-shaped.\"\n    },\n    {\n        \"question\": \"How does calcium (Ca) deficiency manifest in plants?\",\n        \"answer\": \"Calcium deficiency is characterized by fading of chlorophyll along leaf margins and between main veins, especially during winter, and the development of small necrotic spots in the faded areas.\"\n    },\n    {\n        \"question\": \"What are the signs of magnesium (Mg) deficiency in mature leaves?\",\n        \"answer\": \"Signs include the formation of yellow areas that gradually enlarge until only the tip and base of the leaves remain green, showing an inverted V-shaped area pointed on the mid-rib.\"\n    },\n    {\n        \"question\": \"What is the primary symptom of iron (Fe) deficiency in young leaves?\",\n        \"answer\": \"The primary symptom is interveinal white chlorosis, which first appears on young leaves and can lead to reduced leaf size, fragility, and early shedding in acute cases.\"\n    },\n    {\n        \"question\": \"How does manganese (Mn) deficiency affect leaves?\",\n        \"answer\": \"Manganese deficiency causes mottled chlorosis with green veins and yellow or white leaf web tissue, first appearing on younger leaves and then spreading to older leaves.\"\n    },\n    {\n        \"question\": \"What are the symptoms of copper (Cu) deficiency in plants?\",\n        \"answer\": \"Symptoms include wilting of terminal shoots, frequently followed by leaf death, and fading of leaf color due to reduced pigments.\"\n    },\n    {\n        \"question\": \"What are the leaf nutrient indices for nitrogen (N) in Khasi Mandarin?\",\n        \"answer\": \"Deficient: < 1.67%, Low: 1.67 – 1.96%, Optimum: 1.97 - 2.56%, High: 2.57 - 2.85%, Excess: > 2.85%.\"\n    },\n    {\n        \"question\": \"What is the optimum range for phosphorus (P) in Khasi Mandarin leaves?\",\n        \"answer\": \"The optimum range for phosphorus is 0.09 - 0.10%.\"\n    },\n    {\n        \"question\": \"What are the symptoms of zinc (Zn) deficiency in young leaves?\",\n        \"answer\": \"Symptoms include irregular green bands along the mid-rib and main vein on a background of light yellow to almost white, and in acute cases, leaves turn abnormally narrow and pointed.\"\n    },\n    {\n        \"question\": \"What are the yield categories for Khasi Mandarin trees?\",\n        \"answer\": \"Deficient: < 19.1 kg/tree, Low: 19.1 - 31.5 kg/tree, Optimum: 31.6 - 56.3 kg/tree, High: 56.4 - 68.8 kg/tree, Excess: > 68.8 kg/tree.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the recommended area for nursery management for one hectare of transplanting?\",\n        \"answer\": \"An area of 100 m² is sufficient for one hectare of transplanting.\"\n    },\n    {\n        \"question\": \"What fertilizers and quantities are recommended for nursery beds?\",\n        \"answer\": \"For nursery beds, incorporate 15-20 FYM, 2 kg DAP, 500 g urea, and 500 g folidol powder per bed.\"\n    },\n    {\n        \"question\": \"When should seeds be sown for transplanting?\",\n        \"answer\": \"Seeds should be sown between the 15th of July to 15th August.\"\n    },\n    {\n        \"question\": \"How many irrigations are recommended after sowing or transplanting?\",\n        \"answer\": \"6-8 irrigations should be applied at 15-25 days’ interval after sowing or transplanting.\"\n    },\n    {\n        \"question\": \"What is the recommended interculture practice for crop management?\",\n        \"answer\": \"Two interculture operations (hoeing and weeding) are required: the first at 25-30 DAS and the second 60 days after sowing or transplanting.\"\n    },\n    {\n        \"question\": \"How can Spodoptera be managed in crops?\",\n        \"answer\": \"Growing castor or marigold as a trap crop can help manage Spodoptera.\"\n    },\n    {\n        \"question\": \"What is the recommended treatment for aphid and thrips management?\",\n        \"answer\": \"Install yellow and blue sticky traps @ 10-12 traps/ha each, followed by foliar spray with neem oil 3000 ppm @4ml/lit. water, NSKE 5%, Imidacloprid 17.8 SL @ 0.3ml/lit., or acephate 75 SP @ 1.5 ml/lit. water.\"\n    },\n    {\n        \"question\": \"How can powdery mildew be controlled in crops?\",\n        \"answer\": \"Dust with Sulphur dust @ 20-25 kg/ha in the morning, followed by foliar spray with Kerathan (Dinocap) @ 1ml/lit. water at 10-15 days’ interval.\"\n    },\n    {\n        \"question\": \"What is the recommended frost management practice for sensitive crops?\",\n        \"answer\": \"Apply light irrigation and foliar spray with sulfuric acid 0.1% at midnight to protect the crop from frost.\"\n    },\n    {\n        \"question\": \"What moisture level should seeds be maintained at for long-term storage?\",\n        \"answer\": \"The moisture level of seeds should be maintained below 8.5-9 percent for long-term storage.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"How many species of medicinal and aromatic plants are maintained at ICAR-DMAPR?\",\n        \"answer\": \"About 220 species of medicinal and aromatic plants are maintained.\"\n    },\n    {\n        \"question\": \"What is the vision of ICAR-DMAPR?\",\n        \"answer\": \"The vision is to provide 'Medicinal and aromatic plants for health and wellbeing of all' to the ever-increasing world population through ensuring quality raw drug production and supply.\"\n    },\n    {\n        \"question\": \"What is the mission of ICAR-DMAPR?\",\n        \"answer\": \"The mission is to contribute to the sustainable production of quality medicinal and aromatic plants (MAPs) through the development of new varieties, good agricultural practices, quality assessment methodologies, and standard products using cutting-edge technologies like IT and Biotechnology.\"\n    },\n    {\n        \"question\": \"When did the ICAR-AICRP on Medicinal and Aromatic Plants and Betelvine begin?\",\n        \"answer\": \"It began in the Fourth Five Year Plan (1967-72).\"\n    },\n    {\n        \"question\": \"Where is the headquarters of ICAR-AICRP on Medicinal and Aromatic Plants and Betelvine located?\",\n        \"answer\": \"The headquarters is located at ICAR-DMAPR, Anand.\"\n    },\n    {\n        \"question\": \"How many centers are coordinated under ICAR-AICRP on Medicinal and Aromatic Plants and Betelvine?\",\n        \"answer\": \"There are 23 centers coordinated from ICAR-DMAPR, Anand.\"\n    },\n    {\n        \"question\": \"What are some of the sophisticated equipment available at ICAR-DMAPR?\",\n        \"answer\": \"The equipment includes GLC, HPL, HPTLC, Poly Ploidy Analyzer, LC-MS, GC-MS, Supercritical Fluid Extractor, FTIR spectrophotometer, Atomic Absorption Spectrophotometer, UPLC, and Inverted Microscope.\"\n    },\n    {\n        \"question\": \"What are the seating capacities of the seminar hall and conference hall at ICAR-DMAPR?\",\n        \"answer\": \"The seminar hall has a seating capacity of 100, and the conference hall has a seating capacity of 25.\"\n    },\n    {\n        \"question\": \"What are some of the mandate crops at ICAR-DMAPR?\",\n        \"answer\": \"Mandate crops include Aloe, Guggal, Senna, Kalmegh, Satavari, Salparni, Lemongrass, Palmarosa, Isabgol, Safed musli, and Ashwagandha.\"\n    },\n    {\n        \"question\": \"What facilities are available at the guest house of ICAR-DMAPR?\",\n        \"answer\": \"The guest house comprises 2 VIP suites, 8 air-conditioned double rooms, and other necessary amenities.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What was the plant species used in the study?\",\n        \"A\": \"The plant species used was cotton (Gossypium hirsutum L.).\"\n    },\n    {\n        \"Q\": \"What type of explants were used for genetic transformation?\",\n        \"A\": \"Shoot apical meristems isolated from seedlings were used as explants.\"\n    },\n    {\n        \"Q\": \"Which gene was introduced into the cotton plant?\",\n        \"A\": \"A synthetic gene encoding CrylAc δ-endotoxin of Bacillus thuringiensis was introduced.\"\n    },\n    {\n        \"Q\": \"What method was used for the genetic transformation of cotton?\",\n        \"A\": \"Agrobacterium tumefaciens (strain EHA 105) was used for co-cultivation with the explants.\"\n    },\n    {\n        \"Q\": \"What selection marker was used in the transformation process?\",\n        \"A\": \"Kanamycin (100 mg/l) was used as a selection marker.\"\n    },\n    {\n        \"Q\": \"How was the expression of CrylAc detected in transgenic plants?\",\n        \"A\": \"Expression of CrylAc was detected using Xpress strips and quantified by Quan-T ELISA kits.\"\n    },\n    {\n        \"Q\": \"What insect was used for bioassays to test the transgenic cotton?\",\n        \"A\": \"The larvae of cotton bollworm (Helicoverpa armigera) were used for bioassays.\"\n    },\n    {\n        \"Q\": \"What were the results of the field tests for the transgenic cotton?\",\n        \"A\": \"The field tests showed significant potential of the transgenic cotton for resistance against cotton bollworm.\"\n    },\n    {\n        \"Q\": \"Why was Bikaneri Nerma selected for the study?\",\n        \"A\": \"Bikaneri Nerma was selected because of its high commercial value and its role as the female parent of the popular cotton hybrid NHH-44.\"\n    },\n    {\n        \"Q\": \"What is one major limitation in developing pest-resistant cotton lines?\",\n        \"A\": \"The limited genetic variability for bollworm resistance in cotton landraces and wild races is a major limitation.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the recommended pre-emergence application for Pendimethalin?\",\n        \"answer\": \"Pendimethalin 38.7 CS @ 1 Kg active ingredient in 500 litres water.\"\n    },\n    {\n        \"question\": \"How can Collar rot disease in seeds be managed?\",\n        \"answer\": \"Treat the seed before sowing with Trichoderma powder or liquid suspension.\"\n    },\n    {\n        \"question\": \"What is the recommended method for managing pod borer in chickpea?\",\n        \"answer\": \"Spray 250 L.E. HaNPV 5% NSKE followed by 1.25 liter Indoxacarb/ha and install 7-10 pheromone traps per hectare.\"\n    },\n    {\n        \"question\": \"What are the improved varieties of barley mentioned?\",\n        \"answer\": \"RD-2035, RD-2052, RD-2503, RD-2552, RD-2668, RD-2715, RD-2786, RD-2794, RD-2849.\"\n    },\n    {\n        \"question\": \"What is the seed rate and sowing time for barley?\",\n        \"answer\": \"Seed rate is 80-100 Kg/ha, and sowing time is mid-October to mid-November.\"\n    },\n    {\n        \"question\": \"How can fungal diseases in seeds be managed?\",\n        \"answer\": \"Treat the seed with Vitavax power @ 2 g/kg seed.\"\n    },\n    {\n        \"question\": \"What is the recommended fertilizer application for barley if soil testing is not available?\",\n        \"answer\": \"Apply 100 Kg N, 40 Kg P, and 20 Kg potash/ha, with 25 kg Zinc Sulphate in zinc-deficient areas.\"\n    },\n    {\n        \"question\": \"What are the improved varieties of wheat mentioned?\",\n        \"answer\": \"Raj-1482, Raj-3765, Raj-3777, Raj-4037, Raj-4120, Raj-4079, Raj-4238, KRL-210, BWD-303, DWD-48.\"\n    },\n    {\n        \"question\": \"What is the seed rate and sowing time for wheat?\",\n        \"answer\": \"Seed rate is 100-120 kg/ha, and sowing time is November.\"\n    },\n    {\n        \"question\": \"What are the improved varieties of fenugreek (Methi) mentioned?\",\n        \"answer\": \"RMt-1, RMt-305, AFg-1, AFg-3.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"Why are farmers not opting for certain linkages to get better income for their produce?\",\n        \"answer\": \"Farmers are not opting for such linkages due to a lack of awareness about the concept.\"\n    },\n    {\n        \"question\": \"What was the focus of the survey conducted among consumers in Palakkad urban town?\",\n        \"answer\": \"The survey focused on understanding the perception of consumers regarding organic fruits and vegetables.\"\n    },\n    {\n        \"question\": \"Why do consumers prefer organic produce over normal produce?\",\n        \"answer\": \"Consumers prefer organic produce because they are more health-conscious.\"\n    },\n    {\n        \"question\": \"What event increased consumer consciousness about organic produce?\",\n        \"answer\": \"The Kasargode Endosulphan issue increased consumer consciousness about organic produce.\"\n    },\n    {\n        \"question\": \"Are consumers willing to pay a premium price for organic produce?\",\n        \"answer\": \"Yes, consumers are willing to pay a premium price for organic produce.\"\n    },\n    {\n        \"question\": \"What is the opinion of consumers regarding certified organic and by virtue organic produce?\",\n        \"answer\": \"Consumers have mixed opinions about certified organic and by virtue organic produce.\"\n    },\n    {\n        \"question\": \"What is the demographic profile of the respondents in the consumer survey?\",\n        \"answer\": \"The respondents were from the elite class and upper middle class, including youngsters and middle-aged people.\"\n    },\n    {\n        \"question\": \"What is the consumers' opinion about the certification of organic produce?\",\n        \"answer\": \"Consumers believe that organic produce should be certified.\"\n    },\n    {\n        \"question\": \"What is the importance of traceability in organic produce according to consumers?\",\n        \"answer\": \"Consumers believe that traceability ensures the quality of organic produce.\"\n    },\n    {\n        \"question\": \"What elements of the marketing mix were analyzed in the survey of organic farmers and consumers?\",\n        \"answer\": \"The survey analyzed elements of the marketing mix such as product and price.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What are the two backgrounds in which Bt transgenic rice was developed?\",\n        \"A\": \"Bt transgenic rice was developed in IR 64 and Pusa Basmati backgrounds.\"\n    },\n    {\n        \"Q\": \"Which gene was used in the development of Bt transgenic rice?\",\n        \"A\": \"The cry 1AC gene was used in the development of Bt transgenic rice.\"\n    },\n    {\n        \"Q\": \"What is the International Rice Genome Sequencing Project (IRGSP)?\",\n        \"A\": \"The IRGSP is a global consortium consisting of 11 countries, including the US, Japan, and China, aimed at sequencing the rice genome.\"\n    },\n    {\n        \"Q\": \"Which Indian organization participates in the International Rice Genome Sequencing Project?\",\n        \"A\": \"The NRC on Plant Biotechnology is the Indian organization participating in the IRGSP.\"\n    },\n    {\n        \"Q\": \"Which rice varieties are suitable for irrigated areas of Punjab, Haryana, Delhi, and Uttaranchal?\",\n        \"A\": \"Pusa Sugandh 2 (IET 16310) and Pusa Sugandh 3 (IET 16313) are suitable for these regions.\"\n    },\n    {\n        \"Q\": \"What is the grain type of the rice variety Pant Dhan 16?\",\n        \"A\": \"The grain type of Pant Dhan 16 is short bold (SB).\"\n    },\n    {\n        \"Q\": \"Which rice hybrid is recommended for irrigated areas of southern, eastern, and western regions?\",\n        \"A\": \"HRI 120 (Hybrid) is recommended for these regions.\"\n    },\n    {\n        \"Q\": \"What does the abbreviation 'MR' stand for in the context of rice varieties?\",\n        \"A\": \"MR stands for 'Moderately Resistant' in the context of rice varieties.\"\n    },\n    {\n        \"Q\": \"Which rice variety is recommended for upland direct-sowing situations in the hill zone of Karnataka?\",\n        \"A\": \"KHP 5 is recommended for upland direct-sowing situations in the hill zone of Karnataka.\"\n    },\n    {\n        \"Q\": \"What is the most promising thermo-genetic male sterile (TGMS) line for developing two-line rice hybrids?\",\n        \"A\": \"Rice MLTG 4 is the most promising thermo-genetic male sterile (TGMS) line for developing two-line rice hybrids.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the name of the broodstock feed developed by ICAR-CIFA for early breeding of Indian major carps?\",\n        \"answer\": \"The broodstock feed developed by ICAR-CIFA is called CIFABROODTH.\"\n    },\n    {\n        \"question\": \"How did the use of CIFABROODTH impact the breeding period of rohu and catla?\",\n        \"answer\": \"The use of CIFABROODTH advanced the breeding period of rohu and catla, allowing them to breed from April and May, respectively, instead of the usual mid-June to September period.\"\n    },\n    {\n        \"question\": \"What is the major advantage of early breeding of Indian major carps?\",\n        \"answer\": \"The major advantage is the early availability of seeds for stocking in grow-out culture.\"\n    },\n    {\n        \"question\": \"What percentage of the catch was realized from the marine sector in the current year?\",\n        \"answer\": \"98.6% of the catch was realized from the marine sector.\"\n    },\n    {\n        \"question\": \"What is the range of catch per unit effort (CPUE) for multiday gillnetters during peak fishing months?\",\n        \"answer\": \"The CPUE for multiday gillnetters during peak fishing months (July-September) ranged from 37.5 to 260 kg/boat/day.\"\n    },\n    {\n        \"question\": \"What does the exploitation ratio of 0.77 indicate?\",\n        \"answer\": \"An exploitation ratio of 0.77 indicates over-exploitation of the fish population.\"\n    },\n    {\n        \"question\": \"What is the estimated spawning stock biomass (SSB) as a percentage of the virgin stock?\",\n        \"answer\": \"The estimated SSB is 23.7% of the virgin stock, indicating it is at the minimum sustainable level.\"\n    },\n    {\n        \"question\": \"What is the purpose of the 'β-Noda detect' kit developed by ICAR-CMFRI?\",\n        \"answer\": \"The 'β-Noda detect' kit is used for the rapid and sensitive detection of beta noda virus in marine broodstock fishes.\"\n    },\n    {\n        \"question\": \"How does farm mechanization benefit agricultural practices?\",\n        \"answer\": \"Farm mechanization saves time and labor, reduces drudgery, cuts production costs, reduces post-harvest losses, and boosts crop output and farm income.\"\n    },\n    {\n        \"question\": \"What is the field capacity of the tractor-drawn five-row seed-cum-fertilizer drill?\",\n        \"answer\": \"The field capacity of the tractor-drawn five-row seed-cum-fertilizer drill is 0.5 ha/h.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the yield of Kalinga Dhan 1204 and where is it suitable?\",\n        \"answer\": \"The yield of Kalinga Dhan 1204 is 43.2 q/ha, and it is suitable for aerobic and irrigated medium land.\"\n    },\n    {\n        \"question\": \"What are the key features of Karjat Shatabdi (BM-4)?\",\n        \"answer\": \"Karjat Shatabdi (BM-4) is suitable for scented beaten rice (Poha), has a yield of 39.4 q/ha, matures in 125–130 days, is non-lodging, dwarf, and moderately resistant to stem-borer, bacterial leaf blight, and leaf blast.\"\n    },\n    {\n        \"question\": \"What is the maturity period of Jal Bhawani (NDGR 702)?\",\n        \"answer\": \"The maturity period of Jal Bhawani (NDGR 702) is 140–145 days.\"\n    },\n    {\n        \"question\": \"What are the resistance traits of Sikkim Dhan 1?\",\n        \"answer\": \"Sikkim Dhan 1 is resistant to leaf and neck blast and moderately resistant to sheath blight, bacterial leaf blight, and brown spot.\"\n    },\n    {\n        \"question\": \"What is the yield of Sikkim Dhan 3 under irrigated conditions?\",\n        \"answer\": \"The yield of Sikkim Dhan 3 under irrigated conditions is 55–60 q/ha.\"\n    },\n    {\n        \"question\": \"What is the yield and maturity period of CG Tejaswi Dhan?\",\n        \"answer\": \"CG Tejaswi Dhan has a yield of 58.0–60.0 q/ha and a maturity period of 125–130 days.\"\n    },\n    {\n        \"question\": \"What pests is Kalinga Dhan 1205 tolerant to?\",\n        \"answer\": \"Kalinga Dhan 1205 is tolerant to leaf folder, gundhi bug, and stem-borer.\"\n    },\n    {\n        \"question\": \"What is the yield of Sava 300 and what conditions is it suitable for?\",\n        \"answer\": \"Sava 300 has a yield of 64.4 q/ha and is suitable for irrigated, early stress conditions.\"\n    },\n    {\n        \"question\": \"What is the yield and maturity period of Sava 200?\",\n        \"answer\": \"Sava 200 has a yield of 76.5 q/ha and a maturity period of 100–110 days.\"\n    },\n    {\n        \"question\": \"What are the resistance traits of ADT 56?\",\n        \"answer\": \"ADT 56 is moderately resistant to leaf blast, grain discolouration, RTD, stem-borer, and leaf folder.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What are the key priorities for reimagining Indian agriculture?\",\n        \"answer\": \"The key priorities include enhancing farmers' income by 200%, reducing fertilizer use by 25%, reducing water use by 20%, increasing renewable energy use by 50%, reducing greenhouse gas emission intensity by 45%, and rehabilitating 26 million hectares of degraded land.\"\n    },\n    {\n        \"question\": \"What international commitments has India made related to agriculture?\",\n        \"answer\": \"India has committed to Panchamrit and carbon neutrality, land degradation neutrality, biodiversity conservation, regional agricultural development, and Sustainable Development Goals (SDGs).\"\n    },\n    {\n        \"question\": \"What strategies are proposed to realize the full potential of Indian farming?\",\n        \"answer\": \"Strategies include integration, diversification, intensification, customization, farm mechanization, value addition, and market access, with a focus on profitable commercialization, ecosystem approaches, sustainable agri-food systems, and engaging youth and women.\"\n    },\n    {\n        \"question\": \"What role do ICAR and NAREES play in Indian agriculture?\",\n        \"answer\": \"The Indian Council of Agricultural Research (ICAR) and the National Agricultural Research, Education and Extension System (NAREES) aim to harness advances in science and technology to improve agriculture and ensure societal welfare.\"\n    },\n    {\n        \"question\": \"What is the significance of agriculture in India's economy?\",\n        \"answer\": \"Agriculture engages 49.6% of the workforce and contributes about 17% to India's Gross Domestic Product (GDP), making it a critical sector for sustainable and inclusive economic growth.\"\n    },\n    {\n        \"question\": \"How much of India's geographical area is cultivated?\",\n        \"answer\": \"About 50% of India's total geographical area is cultivated, ranking it among the top users of land for agriculture.\"\n    },\n    {\n        \"question\": \"What challenges does Indian agriculture face?\",\n        \"answer\": \"Indian agriculture faces challenges such as depletion of natural resources, climate change, reduced farm income, and the need for sustainable practices.\"\n    },\n    {\n        \"question\": \"What is the historical significance of Indian agriculture?\",\n        \"answer\": \"Indian agriculture began as early as 11,000 BP with the domestication of animals and early cultivation of plants, as evidenced in ancient literature like the Bhagavad Gita, Rig Veda, and Atharva Veda.\"\n    },\n    {\n        \"question\": \"What is the projected population growth of India?\",\n        \"answer\": \"India, with a population of 1.39 billion, is projected to become the most populous country by 2027-30, surpassing China.\"\n    },\n    {\n        \"question\": \"What are the climatic and soil characteristics of India?\",\n        \"answer\": \"India experiences all 15 prominent climates and has 46 out of 60 soil types found on Earth, making its agricultural system diverse and heterogeneous.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What training did VK, Banswara receive under the ARYA Project?\",\n        \"answer\": \"VK, Banswara received vocational training on commercial poultry production.\"\n    },\n    {\n        \"question\": \"What techniques did VK, Banswara learn in poultry production?\",\n        \"answer\": \"He learned techniques such as vaccination, weighing, cleaning, and feeding.\"\n    },\n    {\n        \"question\": \"How many chicks did VK, Banswara start his poultry farming operation with in 2022?\",\n        \"answer\": \"He started with 1,800 chicks.\"\n    },\n    {\n        \"question\": \"What support did VK, Banswara receive from KVK, Banswara initially?\",\n        \"answer\": \"He received 100 Kadaknath chicks (6 weeks old), a cage, a feeder, and a water drinker.\"\n    },\n    {\n        \"question\": \"What was the net profit achieved by VK, Banswara from his poultry venture?\",\n        \"answer\": \"He achieved a net profit of ₹3,94,000.\"\n    },\n    {\n        \"question\": \"What inspired three other young individuals from VK, Banswara's village?\",\n        \"answer\": \"They were inspired to establish their own poultry units after witnessing his success.\"\n    },\n    {\n        \"question\": \"What training did Shri Dinesh Jaiswal receive at KVK Chitrakoot?\",\n        \"answer\": \"He received training on composite fish farming techniques, pre and post stocking management, and related practices.\"\n    },\n    {\n        \"question\": \"What was the size of the pond excavated by Shri Dinesh Jaiswal for fish farming?\",\n        \"answer\": \"He excavated a pond of 2,500 m2.\"\n    },\n    {\n        \"question\": \"What fish varieties did Shri Dinesh Jaiswal stock in his pond?\",\n        \"answer\": \"He stocked Catla, Rohu, Nain, and Pungasius fingerlings.\"\n    },\n    {\n        \"question\": \"What was the fish yield achieved by Shri Dinesh Jaiswal per hectare?\",\n        \"answer\": \"He achieved a fish yield of 118.40 quintals per hectare.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the primary purpose of agriculture as described in the text?\",\n        \"answer\": \"The primary purpose of agriculture is to cultivate crop plants and domesticate animals to meet the food requirement of humans.\"\n    },\n    {\n        \"question\": \"How has agriculture evolved to meet human needs over time?\",\n        \"answer\": \"Agriculture has evolved to not only provide food but also meet other needs such as fodder, fibre, fruit, and flower.\"\n    },\n    {\n        \"question\": \"What challenges do farmers face in modern agriculture?\",\n        \"answer\": \"Farmers face challenges such as adverse weather conditions, degraded soil, and the need to adopt modern scientific methods of cultivation.\"\n    },\n    {\n        \"question\": \"What did Gandhiji emphasize regarding natural resources?\",\n        \"answer\": \"Gandhiji emphasized the importance of natural resources and their conservation, stating that nature has never failed him and serves as his inspiration.\"\n    },\n    {\n        \"question\": \"What are the consequences of overexploitation of natural resources in agriculture?\",\n        \"answer\": \"Overexploitation of natural resources leads to depletion of resources, pollution of air, water, and soil, and irreparable damage to the planet.\"\n    },\n    {\n        \"question\": \"What are some man-made factors causing environmental damage?\",\n        \"answer\": \"Man-made factors include population explosion, mass poverty, overutilization of renewable resources, imbalance use of fertilizers, desert formation, deforestation, and global warming.\"\n    },\n    {\n        \"question\": \"How has globalization impacted agriculture?\",\n        \"answer\": \"Globalization has made agriculture global through the exchange and free entry of synthetic chemicals for plant protection, genetically modified crops, and the adoption of new farming skills.\"\n    },\n    {\n        \"question\": \"What is the economic state of today's farmers compared to earlier generations?\",\n        \"answer\": \"The economic state of today's farmers is much better compared to earlier generations due to improved farming practices and increased demand for agricultural goods.\"\n    },\n    {\n        \"question\": \"What is the focus of the Indian Institute of Farming Systems Research?\",\n        \"answer\": \"The Indian Institute of Farming Systems Research focuses on developing tailor-made cropping and farming systems to address the needs of small and marginal farmers.\"\n    },\n    {\n        \"question\": \"Why is it important to focus on small and marginal farmers?\",\n        \"answer\": \"It is important to focus on small and marginal farmers because more than 85% of land holdings fall under this category, and their livelihood and economic security need to be improved.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the total budget estimate for NRC on Pig, Guwahati in 2018-19?\",\n        \"answer\": \"The total budget estimate for NRC on Pig, Guwahati in 2018-19 is 1295.00 lakhs.\"\n    },\n    {\n        \"question\": \"What is the Grant in Aid component for AICRP on Pig, NRC on Pig, Guwahati?\",\n        \"answer\": \"The Grant in Aid component for AICRP on Pig, NRC on Pig, Guwahati is 150.00 lakhs.\"\n    },\n    {\n        \"question\": \"What is the total budget estimate for Mega seed on Pig, NRC on Pig, Guwahati?\",\n        \"answer\": \"The total budget estimate for Mega seed on Pig, NRC on Pig, Guwahati is 378.00 lakhs.\"\n    },\n    {\n        \"question\": \"What is the total budget estimate for NRC on Yak, Dirang?\",\n        \"answer\": \"The total budget estimate for NRC on Yak, Dirang is 1125.50 lakhs.\"\n    },\n    {\n        \"question\": \"What is the total budget estimate for NIVEDI, Bengalore?\",\n        \"answer\": \"The total budget estimate for NIVEDI, Bengalore is 1519.00 lakhs.\"\n    },\n    {\n        \"question\": \"What is the total budget estimate for CIRC, Meerut?\",\n        \"answer\": \"The total budget estimate for CIRC, Meerut is 1295.00 lakhs.\"\n    },\n    {\n        \"question\": \"What is the total budget estimate for AICRP on Cattle, CIRC, Meerut?\",\n        \"answer\": \"The total budget estimate for AICRP on Cattle, CIRC, Meerut is 769.80 lakhs.\"\n    },\n    {\n        \"question\": \"What is the total budget estimate for Dte. Of Foot & Mouth Disease, Mukteswar?\",\n        \"answer\": \"The total budget estimate for Dte. Of Foot & Mouth Disease, Mukteswar is 3722.80 lakhs.\"\n    },\n    {\n        \"question\": \"What is the total budget estimate for Dte. Of Poultry Research, Hyderabad?\",\n        \"answer\": \"The total budget estimate for Dte. Of Poultry Research, Hyderabad is 2303.50 lakhs.\"\n    },\n    {\n        \"question\": \"What is the total budget estimate for AICRP on Poultry, Dte. Of Poultry Research, Hyderabad?\",\n        \"answer\": \"The total budget estimate for AICRP on Poultry, Dte. Of Poultry Research, Hyderabad is 593.50 lakhs.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"How does IoT help in identifying sick animals in a herd?\",\n        \"A\": \"IoT helps in identifying sick animals so they can be separated from the herd, preventing the spread of disease.\"\n    },\n    {\n        \"Q\": \"What is the role of IoT-based sensors in cattle management?\",\n        \"A\": \"IoT-based sensors help ranchers locate their cattle, lowering labor costs.\"\n    },\n    {\n        \"Q\": \"What is a smart greenhouse, and how does it function?\",\n        \"A\": \"A smart greenhouse uses IoT to intelligently monitor and control the climate, eliminating the need for manual intervention.\"\n    },\n    {\n        \"Q\": \"How are environmental parameters controlled in a smart greenhouse?\",\n        \"A\": \"Sensors measure environmental parameters according to plant requirements and control actuators automatically through a WiFi signal.\"\n    },\n    {\n        \"Q\": \"What is the purpose of predictive analytics in smart farming?\",\n        \"A\": \"Predictive analytics helps farmers decide future plans regarding crop production, storage, marketing, and risk management.\"\n    },\n    {\n        \"Q\": \"How does AI assist in weather forecasting for farmers?\",\n        \"A\": \"AI helps farmers analyze weather conditions using weather forecasting, enabling them to plan crop types and sowing times.\"\n    },\n    {\n        \"Q\": \"How does AI-based soil and crop health monitoring work?\",\n        \"A\": \"AI-based applications identify nutrient deficiencies, pests, and diseases in soil, helping farmers use fertilizers to improve harvest quality.\"\n    },\n    {\n        \"Q\": \"What is Blockchain technology, and how is it defined?\",\n        \"A\": \"Blockchain is a decentralized, distributed ledger that records the origins of a digital asset, defined as a chain of blocks containing information.\"\n    },\n    {\n        \"Q\": \"How does Blockchain technology improve food supply chains?\",\n        \"A\": \"Blockchain tracks the provenance of food, creating trustworthy supply chains and building trust between producers and consumers.\"\n    },\n    {\n        \"Q\": \"What are the benefits of combining Blockchain with data-driven technologies in agriculture?\",\n        \"A\": \"Blockchain, combined with data-driven technologies, makes farming smarter by providing a trusted way of storing and using data.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What methods were used to develop the variety described in the text?\",\n        \"A\": \"Selfing and individual plant selections were carried out to purify the material and develop the variety.\"\n    },\n    {\n        \"Q\": \"What are the characteristics of the research plants mentioned?\",\n        \"A\": \"The research plants are annual, bushy, monoecious, and pubescent with an upright and open habit.\"\n    },\n    {\n        \"Q\": \"What is the shape and weight of the young fruits described?\",\n        \"A\": \"The young fruits are flattish round in shape and weigh 70-80 g.\"\n    },\n    {\n        \"Q\": \"How long does it take for the first harvest after sowing during the spring-summer season?\",\n        \"A\": \"It is ready for first harvesting in 45-50 days after sowing during the spring-summer season.\"\n    },\n    {\n        \"Q\": \"What is the average yield of the variety under open field conditions?\",\n        \"A\": \"The average yield is 16.0 t/ha under open field conditions.\"\n    },\n    {\n        \"Q\": \"How does the yield of Pusa Pasand compare to the local check under open field conditions?\",\n        \"A\": \"Pusa Pasand yielded 16.01 t/ha, which was 40.93% higher than the local check.\"\n    },\n    {\n        \"Q\": \"What is the yield of Pusa Pasand under naturally ventilated polyhouse conditions?\",\n        \"A\": \"The yield is 24.5 t/ha under naturally ventilated polyhouse conditions.\"\n    },\n    {\n        \"Q\": \"How does Pusa Pasand perform under plastic low tunnel conditions?\",\n        \"A\": \"Pusa Pasand yielded 22.8 t/ha under plastic low tunnel conditions, which is 64.38% higher than the local check.\"\n    },\n    {\n        \"Q\": \"What is the heat tolerance of the described variety?\",\n        \"A\": \"The variety has good heat tolerance and can produce seeds from April to May under open conditions in North Indian plains.\"\n    },\n    {\n        \"Q\": \"What was the yield increase of Pusa Pasand over the local check during multilocation testing?\",\n        \"A\": \"Pusa Pasand showed a 36.97% higher yield over the local check during multilocation testing under open field conditions.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the purpose of using single seed descent (SSD) in groundnut cultivation?\",\n        \"A\": \"Single seed descent (SSD) is ideal for large populations to ensure early flowering and seed harvest.\"\n    },\n    {\n        \"Q\": \"What were the temperature and photoperiod conditions set for groundnut cultivation?\",\n        \"A\": \"The conditions were set at 28/25 °C (day/night) temperature and a photoperiod of 12 hours.\"\n    },\n    {\n        \"Q\": \"How long did it take for groundnut plants to enter the reproductive phase when treated with PGRs?\",\n        \"A\": \"Within 32 to 36 days, 50-100% of the plants entered the reproductive phase.\"\n    },\n    {\n        \"Q\": \"What is the main focus of the sub-project on New Breeding Techniques (NBTs) for pearl millet?\",\n        \"A\": \"The sub-project focuses on addressing rancidity in pearl millet to enhance flour shelf life.\"\n    },\n    {\n        \"Q\": \"What storage conditions were used to analyze rancidity in pearl millet lines?\",\n        \"A\": \"The lines were stored at accelerated conditions of 35°C and 70% relative humidity for 21 days.\"\n    },\n    {\n        \"Q\": \"What changes were observed in pearl millet flour as it became rancid?\",\n        \"A\": \"There were significant changes in flour odour and taste, with variations in humidity, temperature, and genetic background.\"\n    },\n    {\n        \"Q\": \"What was the purpose of analyzing lipase genes in pearl millet?\",\n        \"A\": \"The analysis aimed to assess their affinity for fatty acid ligands and understand their role in rancidity.\"\n    },\n    {\n        \"Q\": \"What tissues were used for expression analysis of candidate genes in pearl millet?\",\n        \"A\": \"Expression analysis was done in leaf, root, germinating seed, and various stages of seed development.\"\n    },\n    {\n        \"Q\": \"What explants are being used to standardize high throughput transformation in pearl millet?\",\n        \"A\": \"Immature embryo and leaf segment explants are being used.\"\n    },\n    {\n        \"Q\": \"What was the focus of the 15-day international hands-on training program on gene editing technologies?\",\n        \"A\": \"The program focused on training ICAR scientists in gene editing technologies.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is AWD and what are its primary benefits?\",\n        \"answer\": \"AWD (Alternate Wetting and Drying) is a water management technique for rice cultivation that reduces greenhouse gas emissions, water use, and pump costs while maintaining or increasing rice yields.\"\n    },\n    {\n        \"question\": \"How does AWD improve soil health?\",\n        \"answer\": \"AWD increases soil microbial and invertebrate activity in the root zone, enhancing nutrient cycling, biological tillage, and the physicochemical characteristics of the soil.\"\n    },\n    {\n        \"question\": \"What role do earthworms play in AWD systems?\",\n        \"answer\": \"Earthworms, promoted by decreased flooding in AWD systems, enhance the physicochemical characteristics of the soil.\"\n    },\n    {\n        \"question\": \"How does AWD help in phytotoxin removal?\",\n        \"answer\": \"AWD increases aerobic periods, preventing the accumulation of phytotoxins like phenolic acids, hydrogen sulphide, and excessive iron and manganese.\"\n    },\n    {\n        \"question\": \"What is the impact of AWD on soil fertility and quality?\",\n        \"answer\": \"AWD increases organic matter decomposition, reducing the need for comprehensive agricultural residue removal and improving soil quality.\"\n    },\n    {\n        \"question\": \"How does AWD contribute to reducing methane emissions?\",\n        \"answer\": \"AWD or highland crop rotations in more aerobic soils reduce methane emissions compared to continuously flooded rice fields.\"\n    },\n    {\n        \"question\": \"What are the co-benefits of AWD in rice production?\",\n        \"answer\": \"AWD enhances socio-economic, environmental, and agronomic aspects of rice production, including water conservation, soil health, and reduced emissions.\"\n    },\n    {\n        \"question\": \"What factors influence the successful adoption of AWD?\",\n        \"answer\": \"Site-specific factors such as climate, soil type, pests, crop rotation, and irrigation access influence the successful adoption of AWD.\"\n    },\n    {\n        \"question\": \"What additional research is needed on AWD?\",\n        \"answer\": \"Research is needed on the effects of AWD on biodiversity, ecosystem services, human health, labour productivity, gender equity, yield differences, soil organic carbon decomposition, pest management, and long-term soil salinity.\"\n    },\n    {\n        \"question\": \"Why is AWD considered essential for smart agricultural production systems?\",\n        \"answer\": \"AWD is essential for adapting to potential water shortages, enhancing land productivity through crop rotation and mechanization, and reducing greenhouse gas emissions in rice production.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the projected global temperature rise by 2030 to 2050?\",\n        \"answer\": \"The global temperature is projected to rise to 1.5 °C between 2030 and 2050.\"\n    },\n    {\n        \"question\": \"Why is India considered vulnerable to climate change?\",\n        \"answer\": \"India is considered vulnerable due to its diverse agro-climatic settings and the likelihood of significant impacts on agriculture and farm livelihoods.\"\n    },\n    {\n        \"question\": \"What are the major impacts of climate change on agriculture in India?\",\n        \"answer\": \"Increased temperatures, altered rainfall patterns, and more frequent and severe floods and droughts affect food production.\"\n    },\n    {\n        \"question\": \"What is the National Innovations on Climate Resilient Agriculture (NICRA)?\",\n        \"answer\": \"NICRA is a mega-project initiated by ICAR to reduce the impacts of climate change on agriculture.\"\n    },\n    {\n        \"question\": \"What are some options for mitigating methane emissions in agriculture?\",\n        \"answer\": \"Options include water and nutrient management in crops and efficient fodder management for livestock.\"\n    },\n    {\n        \"question\": \"How can nitrous oxide emissions be reduced in agriculture?\",\n        \"answer\": \"Reducing nitrous oxide emissions can be achieved through soil-test and leaf-colour chart-based nitrogen application, slow-release fertilizers, and nitrification inhibitors like neem-coated urea.\"\n    },\n    {\n        \"question\": \"What are the co-benefits of emission reduction strategies in agriculture?\",\n        \"answer\": \"Co-benefits include cost savings, increased productivity, improved soil quality, and reduced pollution.\"\n    },\n    {\n        \"question\": \"What are contingent crop plans developed by ICAR?\",\n        \"answer\": \"Contingent crop plans provide technological solutions for 623 districts to overcome weather disasters in crop, horticulture, animal husbandry, poultry farming, fisheries, and other fields.\"\n    },\n    {\n        \"question\": \"What is agri-voltaic solar farming?\",\n        \"answer\": \"Agri-voltaic solar farming is a system developed by ICAR that enables growing crops under solar panels, generating income from both agriculture and electricity.\"\n    },\n    {\n        \"question\": \"What are some solar devices developed by ICAR for agricultural applications?\",\n        \"answer\": \"Solar devices include solar photovoltaic (PV) pumps, PV mobile units, PV winnower cum dryers, PV dusters, dryers, and cookers for domestic and small agricultural applications.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the focus of the study mentioned in the text?\",\n        \"answer\": \"The study focuses on performing a comprehensive assessment of drought risks and impacts on agriculture.\"\n    },\n    {\n        \"question\": \"Why is the agricultural community considered vulnerable in the GRB?\",\n        \"answer\": \"The agricultural community is considered vulnerable in the GRB due to uneven rainfall distribution, making it difficult for farmers to understand the drought situation and its impacts.\"\n    },\n    {\n        \"question\": \"What method was used to assess drought risk in the study?\",\n        \"answer\": \"The study used a comprehensive drought risk assessment approach based on geospatial data.\"\n    },\n    {\n        \"question\": \"What conceptual approach was used for the drought risk assessment?\",\n        \"answer\": \"The conceptual approach proposed by the United Nations Development Program was used for the drought risk assessment.\"\n    },\n    {\n        \"question\": \"What are the three components combined to determine drought risk?\",\n        \"answer\": \"The three components are hazard, exposure, and societal vulnerability.\"\n    },\n    {\n        \"question\": \"Which years faced the highest frequency of drought events in the GRB?\",\n        \"answer\": \"The years 2012 and 2009 faced the highest frequency of drought events, with 57 and 56 events, respectively.\"\n    },\n    {\n        \"question\": \"What index was used to identify drought-related stress on vegetation?\",\n        \"answer\": \"The Normalized Difference Vegetation Index (NDVI) was used to identify drought-related stress on vegetation.\"\n    },\n    {\n        \"question\": \"What does a low NDVI value indicate in the context of drought?\",\n        \"answer\": \"A low NDVI value indicates areas affected by drought.\"\n    },\n    {\n        \"question\": \"What does a high NDVI value represent in the context of drought?\",\n        \"answer\": \"A high NDVI value represents areas less affected by drought.\"\n    },\n    {\n        \"question\": \"What data source was used to derive NDVI values in the study?\",\n        \"answer\": \"NDVI values were derived using MODIS-16-day composites from https://modis.gsfc.nasa.gov/.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the symbiotic relationship of Azolla?\",\n        \"answer\": \"Azolla has a symbiotic relationship with blue-green algae, Anabaena azollae, which fixes and assimilates atmospheric nitrogen.\"\n    },\n    {\n        \"question\": \"Why is Azolla gaining popularity among livestock keepers?\",\n        \"answer\": \"Azolla is gaining popularity due to its easy cultivation, good nutritive value, and high biomass yield.\"\n    },\n    {\n        \"question\": \"What nutrients are found in Azolla?\",\n        \"answer\": \"Azolla is a good source of protein, essential amino acids, minerals, β-carotene (vitamin A precursor), and vitamin B12.\"\n    },\n    {\n        \"question\": \"What is the dry weight composition of Azolla?\",\n        \"answer\": \"On a dry weight basis, Azolla contains approximately 75% organic matter, 25% protein, 15% crude fibre, and 10% amino acids.\"\n    },\n    {\n        \"question\": \"How much Azolla can be included in the diet of dairy cows?\",\n        \"answer\": \"Up to 15 to 20% of Azolla can be included in the diet of dairy cows as a replacement to concentrate.\"\n    },\n    {\n        \"question\": \"What is the water use efficiency of Thornless Cactus?\",\n        \"answer\": \"Thornless Cactus has higher water use efficiency (WUE) because it is a CAM (Crassulacean Acid Metabolism) plant.\"\n    },\n    {\n        \"question\": \"What is the digestibility of Thornless Cactus fodder?\",\n        \"answer\": \"Thornless Cactus fodder has a dry matter digestibility of 70%.\"\n    },\n    {\n        \"question\": \"What is the potential yield of Fodder Beet?\",\n        \"answer\": \"Fodder Beet has the potential to produce 150 to over 200 tonnes of green fodder (root + foliage) per hectare in about 4 months.\"\n    },\n    {\n        \"question\": \"What is the protein content in Moringa fodder?\",\n        \"answer\": \"Moringa fodder contains approximately 16-20% protein.\"\n    },\n    {\n        \"question\": \"What is hydroponics fodder production?\",\n        \"answer\": \"Hydroponics is a soil-less fodder production technique used to address seasonal and regional imbalances in fodder availability.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the main advantage of the surface seeding method in wheat cultivation?\",\n        \"answer\": \"The surface seeding method provides complete mulching over the soil surface, saving the crop from terminal heat stress during high temperatures.\"\n    },\n    {\n        \"question\": \"How does surface seeding reduce the cost of cultivation compared to conventional farming?\",\n        \"answer\": \"Surface seeding reduces costs by minimizing field preparation expenses and reducing dependence on costly herbicide inputs.\"\n    },\n    {\n        \"question\": \"What is the impact of surface seeding on weed management?\",\n        \"answer\": \"Surface seeding ensures a weed-free crop or very less weed incidence, reducing the need for costly herbicides.\"\n    },\n    {\n        \"question\": \"How does surface seeding affect the root system of wheat plants?\",\n        \"answer\": \"Surface seeding promotes the development of more fibrous roots near the soil surface, which helps in nutrient capture and protects the plants from lodging.\"\n    },\n    {\n        \"question\": \"What is the economic comparison between conventional farming and surface seeding for wheat cultivation?\",\n        \"answer\": \"The total cost of cultivation for conventional farming is ₹14,100 per acre, while for surface seeding, it is ₹12,050 per acre.\"\n    },\n    {\n        \"question\": \"Who is S. Gurbachan Singh, and what is his contribution to agriculture?\",\n        \"answer\": \"S. Gurbachan Singh is a farmer from district Tarn Taran, known for adopting surface seeding-cum-mulching technique for wheat and was mentioned by the Hon’ble Prime Minister of India in Mann ki Baat for crop residue management.\"\n    },\n    {\n        \"question\": \"How does surface seeding help in managing crop residue?\",\n        \"answer\": \"Surface seeding ensures in-situ crop residue management, which maintains a healthy and porous soil system.\"\n    },\n    {\n        \"question\": \"What is the impact of surface seeding on crop yield compared to other methods?\",\n        \"answer\": \"The crop yield from surface seeding is at par with other crop residue management approaches.\"\n    },\n    {\n        \"question\": \"How does surface seeding protect wheat crops from harsh weather conditions?\",\n        \"answer\": \"Surface seeding protects wheat crops from harsh weather conditions by promoting the development of fibrous roots near the soil surface, which helps in nutrient capture and stability.\"\n    },\n    {\n        \"question\": \"What is the role of fertilizer placement in surface seeding?\",\n        \"answer\": \"In surface seeding, fertilizer is broadcast at a proper distance from the seed, which encourages the development of more fibrous roots to capture nutrients effectively.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the size of the trays used in the tunnel dryer?\",\n        \"answer\": \"The trays are 40 cm × 80 cm in size.\"\n    },\n    {\n        \"question\": \"How many trays are packed onto a single trolley?\",\n        \"answer\": \"Twenty-four trays are packed onto a single trolley.\"\n    },\n    {\n        \"question\": \"How much material is loaded into the tunnel dryer in the morning?\",\n        \"answer\": \"Ten trolleys containing 1.5 tonnes of material are loaded into the tunnel dryer.\"\n    },\n    {\n        \"question\": \"What is the drying time for the tunnel dryer?\",\n        \"answer\": \"The drying time varies between 2 and 3 solar days depending on solar insulation.\"\n    },\n    {\n        \"question\": \"What is the average electricity consumption for drying one batch in the tunnel dryer?\",\n        \"answer\": \"On average, 4–6 kW of electricity is consumed for drying one batch.\"\n    },\n    {\n        \"question\": \"What is the total cost of materials and labor for the tunnel dryer?\",\n        \"answer\": \"The total cost is around Rs 50,000.\"\n    },\n    {\n        \"question\": \"What is the average cost of drying one batch of 1.5 tonnes of DCP in the solar tunnel dryer?\",\n        \"answer\": \"The average cost is Rs 470.\"\n    },\n    {\n        \"question\": \"How does the cost of drying in the solar tunnel dryer compare to the diesel-based tray dryer?\",\n        \"answer\": \"The cost in the solar tunnel dryer is Rs 470, while the diesel-based tray dryer costs Rs 1,739 for the same quantity.\"\n    },\n    {\n        \"question\": \"What is the payback period for the solar tunnel dryer?\",\n        \"answer\": \"The payback period is 100 working days.\"\n    },\n    {\n        \"question\": \"What is the diameter of the corrugated perforated PVC pipe used in the SSD system?\",\n        \"answer\": \"The PVC pipe has a diameter of 72/80 mm.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"Who is the President of the Society for Agriculture and Farmers Welfare?\",\n        \"A\": \"Shri Narendra Singh Tomar, Minister of Agriculture & Farmers Welfare, Government of India.\"\n    },\n    {\n        \"Q\": \"Who serves as the Vice President of the Society for Agriculture and Farmers Welfare?\",\n        \"A\": \"Shri Kailash Choudhary, Minister of State for Agriculture & Farmers Welfare, Government of India.\"\n    },\n    {\n        \"Q\": \"Which minister holds the portfolio of Finance and Corporate Affairs in the Union Cabinet?\",\n        \"A\": \"Smt. Nirmala Sitharaman.\"\n    },\n    {\n        \"Q\": \"Who is the Minister of State for Planning, Statistics & Programme Implementation?\",\n        \"A\": \"Shri Rao Inderjit Singh.\"\n    },\n    {\n        \"Q\": \"Which minister is responsible for Science & Technology and Earth Sciences?\",\n        \"A\": \"Dr Jitendra Singh.\"\n    },\n    {\n        \"Q\": \"Who is the Minister of Education, Skill Development and Entrepreneurship?\",\n        \"A\": \"Shri Dharmendra Pradhan.\"\n    },\n    {\n        \"Q\": \"Who is the Minister of Commerce & Industry in the Union Cabinet?\",\n        \"A\": \"Shri Piyush Goyal.\"\n    },\n    {\n        \"Q\": \"Who is the Senior Vice-President of the Society for Fisheries, Animal Husbandry and Dairying?\",\n        \"A\": \"Shri Parshottam Rupala, Minister of Fisheries, Animal Husbandry and Dairying.\"\n    },\n    {\n        \"Q\": \"Who is the Minister for Agriculture and Cooperation in Andhra Pradesh?\",\n        \"A\": \"Shri Kurasala Kannababu.\"\n    },\n    {\n        \"Q\": \"Who is the Minister for Animal Husbandry & Fisheries in Andhra Pradesh?\",\n        \"A\": \"Dr Seediri Appalaraju.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the purpose of the Centre for Advanced Faculty Training (CAFT)?\",\n        \"A\": \"The purpose of CAFT is to enhance the competency level of agricultural faculty, modernize infrastructure for research, teaching, and training, and provide quality education to agricultural students.\"\n    },\n    {\n        \"Q\": \"Who established the Centres for Advanced Studies (CAS) in India?\",\n        \"A\": \"The Centres for Advanced Studies (CAS) were established by the Indian Council of Agricultural Research (ICAR) with the support of UNDP.\"\n    },\n    {\n        \"Q\": \"What was the primary goal of the CAS centres?\",\n        \"A\": \"The primary goal of the CAS centres was to encourage excellence through collaboration among scientists and accelerate the attainment of international standards in agricultural research and education.\"\n    },\n    {\n        \"Q\": \"How many Centres of Advanced Studies (CAS) were functioning as of 1994-95?\",\n        \"A\": \"As of 1994-95, there were 35 Centres of Advanced Studies (CAS) functioning in various fields of agricultural sciences.\"\n    },\n    {\n        \"Q\": \"What led to the restructuring of CAS centres into CAFT centres?\",\n        \"A\": \"The restructuring of CAS centres into CAFT centres was based on the recommendations of a review conducted by ICAR in 2008, emphasizing competency building of faculty in Agricultural Universities.\"\n    },\n    {\n        \"Q\": \"How many CAFT programmes were organized during the XI plan period?\",\n        \"A\": \"A total of 203 CAFT programmes were organized during the XI plan period.\"\n    },\n    {\n        \"Q\": \"What were some of the cutting-edge areas covered in CAFT programmes?\",\n        \"A\": \"Cutting-edge areas included precision farming, transgenics, genomics, molecular breeding, nanotechnology, bioinformatics, climate change mitigation, GIS applications, and technology forecasting.\"\n    },\n    {\n        \"Q\": \"How many scientists from NARS institutes benefited from CAFT programmes during the XI plan period?\",\n        \"A\": \"More than 3400 scientists from NARS institutes benefited from CAFT programmes during the XI plan period.\"\n    },\n    {\n        \"Q\": \"What was the average number of participants per CAFT programme during the XI plan period?\",\n        \"A\": \"The average number of participants per CAFT programme during the XI plan period was 110 trainees.\"\n    },\n    {\n        \"Q\": \"Which CAFT centre organized the most programmes during the XI plan period?\",\n        \"A\": \"The CAFT centres for Agronomy in Coimbatore and Plant Pathology in New Delhi each organized 8 programmes, the highest number during the XI plan period.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What are the medicinal uses of Holarrhena?\",\n        \"answer\": \"Holarrhena is used as an astringent, febrifuge, anthelmintic, bitter tonic, antibacterial, and for treating dysentery, intestinal worms, amoebiasis, and mucus colitis.\"\n    },\n    {\n        \"question\": \"What active compounds are found in Holarrhena?\",\n        \"answer\": \"Holarrhena contains alkaloids such as conessine, kurchine, kurchcine, holarramine, conarrhimine, conamine, conessimine, isocondessimine, conessidine, condkurchine, and kurchincine.\"\n    },\n    {\n        \"question\": \"What are the medicinal uses of Ficus glomerata and F. racemosa?\",\n        \"answer\": \"They are used in controlling rinder pest, dysentery, diabetes, bilious affections, menorrhoea, haemoptyxis, piles, and diarrhoea.\"\n    },\n    {\n        \"question\": \"What compounds are found in Ficus glomerata and F. racemosa?\",\n        \"answer\": \"They contain tannin, wax, caouhouc, ash, silica, and phosphoric acid.\"\n    },\n    {\n        \"question\": \"What are the medicinal uses of Hyoscyamus niger?\",\n        \"answer\": \"Hyoscyamus niger is used as a sedative, narcotic, anodyne, antiseptic, digestive, astringent, anthelmintic, antispasmodic, mydriatic, and for treating cough, haemoptyxis, urinary disorders, asthma, whooping cough, and dry cough.\"\n    },\n    {\n        \"question\": \"What active compounds are found in Hyoscyamus niger?\",\n        \"answer\": \"Hyoscyamus niger contains alkaloids such as hyoscamine, scopalamine, and hyosrypikrin.\"\n    },\n    {\n        \"question\": \"What are the medicinal uses of Swallow wart?\",\n        \"answer\": \"Swallow wart is used as a caustic, astringent, cardiac tonic, antispasmodic, expectorant, rubifacient, and for treating leprosy, constitutional syphilis, chronic rheumatism, skin diseases, tympany-bloat, foot and mouth disease, and dengue fever.\"\n    },\n    {\n        \"question\": \"What active compounds are found in Swallow wart?\",\n        \"answer\": \"Swallow wart contains mudarine, glucosides such as calotripine, usenarine, and calotoxin.\"\n    },\n    {\n        \"question\": \"What are the medicinal uses of Indigofera tinctoria?\",\n        \"answer\": \"Indigofera tinctoria is used as a stimulant, alterative, deobstruent, purgative, antiseptic, astringent, and for treating whooping cough, asthma, palpitation of the heart, lung disease, dropsy, calculus, maintenance of pregnancy, hepatitis, and scorpion stings.\"\n    },\n    {\n        \"question\": \"What active compounds are found in Indigofera tinctoria?\",\n        \"answer\": \"Indigofera tinctoria contains luc-indigo and indigotin.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the traditional treatment for animal injuries in village Nawada (Ban) of Bareilly district?\",\n        \"A\": \"The traditional treatment involves applying a paste of rakatpindi, turmeric (ambia), chotchaji, honey, and tajgeru on the injured organ.\"\n    },\n    {\n        \"Q\": \"What ingredients are used to treat cuts in animals in village Pachhomi of Bareilly district?\",\n        \"A\": \"A paste of chitchita, meuri, and bichuwa leaves (each 100 g) is applied on the cut part of the animal's body.\"\n    },\n    {\n        \"Q\": \"How do cattle owners in Bishesharpur village treat cuts in animals?\",\n        \"A\": \"They prepare a paste of red chilli (25 g) and vinegar (50 g) and apply it on the cut place.\"\n    },\n    {\n        \"Q\": \"What is the traditional method for treating cuts in animals in village Gotia (Larpur) of Bareilly district?\",\n        \"A\": \"About 10 g of katira is immersed in water to prepare a paste, which is then applied on the cut or injured part.\"\n    },\n    {\n        \"Q\": \"How is lime used to treat cuts in animals in village Khiraka of Bareilly district?\",\n        \"A\": \"Lime (chuna) is applied on the cut place, bandaged, and lime-water is sprinkled over it to cure the wound.\"\n    },\n    {\n        \"Q\": \"What is the traditional treatment for cuts in animals using guma flowers in village Sundyaba of Bareilly district?\",\n        \"A\": \"A paste of 8-10 guma flowers is prepared and applied on the cut part with a bandage.\"\n    },\n    {\n        \"Q\": \"How do people in village Gotia treat animal injuries using salt and vinegar?\",\n        \"A\": \"They mix 5 g of salt with 50 ml of vinegar and apply it on the injured part twice daily.\"\n    },\n    {\n        \"Q\": \"What is the traditional method for treating animal injuries using miuri and akash bel in village Gotia (Larpur)?\",\n        \"A\": \"About 50 g of miuri and 100 g of akash bel are boiled, cooled, and applied on the injury, which is then bandaged.\"\n    },\n    {\n        \"Q\": \"Who disclosed the traditional treatment for cuts in animals using katira in village Gotia (Larpur)?\",\n        \"A\": \"Shri Surendra Pal, S/O Liladhar, from Gotia (Larpur), Bareilly district, disclosed this treatment.\"\n    },\n    {\n        \"Q\": \"Who is associated with the traditional treatment of cuts in animals using lime in village Khiraka?\",\n        \"A\": \"Shri Bhup Ram, S/O Shri Sohan Lai, from village Khiraka, Bareilly district, is associated with this treatment.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What should be done if zinc deficiency is noticed in the growing crop?\",\n        \"answer\": \"Apply zinc sulphate as soon as possible.\"\n    },\n    {\n        \"question\": \"Why should farmers adopt Direct Seeded Rice (DSR)?\",\n        \"answer\": \"DSR saves water and solves the scarcity of labor during the rice transplanting season.\"\n    },\n    {\n        \"question\": \"What type of soils are suitable for Direct Seeded Rice (DSR)?\",\n        \"answer\": \"Medium to heavy textured soils are suitable for DSR.\"\n    },\n    {\n        \"question\": \"Why is DSR not successful in light textured soils?\",\n        \"answer\": \"It is not successful due to severe iron deficiency and lower crop yields.\"\n    },\n    {\n        \"question\": \"What is the recommended time for sowing rice in the first fortnight of June?\",\n        \"answer\": \"Sowing should be done in the first fortnight of June.\"\n    },\n    {\n        \"question\": \"What are the suitable rice varieties for sowing in June?\",\n        \"answer\": \"PR 126, PR 114, PR 121, PR 122, and PR 127 are suitable varieties.\"\n    },\n    {\n        \"question\": \"How should rice seeds be treated before sowing?\",\n        \"answer\": \"Treat rice seeds with 3 g Sprint 75 WS (mencozeb + carbendazim) by dissolving in 10-12 ml water per kg seed and rub the paste on the seeds.\"\n    },\n    {\n        \"question\": \"What is the recommended herbicide for weed control in rice crops?\",\n        \"answer\": \"Spray 2.5 liters per hectare of pendimethalin 30 EC in 500 liters of water within two days of sowing.\"\n    },\n    {\n        \"question\": \"How should urea be applied in Direct Seeded Rice (DSR)?\",\n        \"answer\": \"Apply 130 kg urea/acre in three equal splits at 4, 6, and 9 weeks after sowing.\"\n    },\n    {\n        \"question\": \"What should be done if chlorosis (iron deficiency) appears in the crop?\",\n        \"answer\": \"Start giving copious irrigations and apply 2 or 3 sprays of one percent ferrous sulphate solution at weekly intervals.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What initiatives contributed to the bumper production of horticulture produce in India and the Northeast region?\",\n        \"answer\": \"The initiatives include the Horticulture Mission for North East and Himalayan States (HMNEH) and the National Horticulture Mission (NHM) during the 11th Plan.\"\n    },\n    {\n        \"question\": \"What role does horticulture play in India's economy?\",\n        \"answer\": \"Horticulture accelerates economic growth, contributes to nutritional security, poverty alleviation, and employment generation.\"\n    },\n    {\n        \"question\": \"How much horticulture produce is India currently producing?\",\n        \"answer\": \"India is currently producing 350 million tonnes of horticulture produce.\"\n    },\n    {\n        \"question\": \"What is the area under horticulture crops in India as of 2022-23?\",\n        \"answer\": \"The area under horticulture crops in India is 28.10 million hectares as of 2022-23.\"\n    },\n    {\n        \"question\": \"How has the productivity of horticulture crops changed from 2004-05 to 2022-23?\",\n        \"answer\": \"Productivity increased from 9.05 tonnes per hectare in 2004-05 to 12.19 tonnes per hectare in 2022-23.\"\n    },\n    {\n        \"question\": \"Which states comprise the Northeastern Region of India?\",\n        \"answer\": \"The Northeastern Region comprises Arunachal Pradesh, Assam, Manipur, Meghalaya, Mizoram, Nagaland, Sikkim, and Tripura.\"\n    },\n    {\n        \"question\": \"What percentage of India's total geographical area does the Northeastern Region cover?\",\n        \"answer\": \"The Northeastern Region covers 7.7% of India's total geographical area.\"\n    },\n    {\n        \"question\": \"What makes the Northeastern Region suitable for horticulture?\",\n        \"answer\": \"The region's diverse agro-climatic conditions, high precipitation, and varied soil types support a wide variety of horticultural crops.\"\n    },\n    {\n        \"question\": \"Why is the Northeastern Region's horticulture produce considered organic?\",\n        \"answer\": \"Most fruits, vegetables, flowers, and spices in the region are organic due to the natural farming practices and biodiversity.\"\n    },\n    {\n        \"question\": \"What are the key climatic features of the Northeastern Region that impact horticulture?\",\n        \"answer\": \"The region has tropical, sub-tropical, and temperate climates, with high precipitation and varied soil types, which support diverse horticultural crops.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What was the primary goal of the project conducted at 13 centres?\",\n        \"answer\": \"The goal was to address issues such as comparative evaluation of organic, inorganic, and integrated crop management practices, nutrient application methods, and pest, disease, and weed management in various crops/cropping systems.\"\n    },\n    {\n        \"question\": \"What was the mandate of the project?\",\n        \"answer\": \"The mandate was to infuse scientifically validated organic farming approaches and develop location/region-specific management protocols for organic farming.\"\n    },\n    {\n        \"question\": \"When was the Directorate renamed as ICAR-Indian Institute of Farming Systems Research?\",\n        \"answer\": \"The Directorate was renamed in 2014-15.\"\n    },\n    {\n        \"question\": \"How was the organic farming programme strengthened in 2015-16?\",\n        \"answer\": \"The programme was strengthened by increasing the number of centres under the All India Network Programme on Organic Farming from 13 to 20.\"\n    },\n    {\n        \"question\": \"What technologies were developed under the organic farming scheme?\",\n        \"answer\": \"Technologies developed include package of practices for cropping systems, identification of varieties, and integrated organic farming systems.\"\n    },\n    {\n        \"question\": \"How many cropping systems were covered by the scientific package of practices (PoPs)?\",\n        \"answer\": \"Scientific package of practices were developed for 51 cropping systems suitable for 12 states.\"\n    },\n    {\n        \"question\": \"What are some examples of crop productivity achieved with developed PoPs?\",\n        \"answer\": \"Productivity achieved includes 3.9 t ha-1 in coarse rice, 3.2 t ha-1 in basmati rice, 4.1 t ha-1 in wheat, and 22.3 t ha-1 in potato.\"\n    },\n    {\n        \"question\": \"How have the developed packages been shared for up-scaling?\",\n        \"answer\": \"The packages have been shared with the Department of Agriculture, Cooperation and Farmers Welfare for up-scaling through government schemes like Paramparagat Krishi Vikas Yojana (PKVY) and Mission Organic Value Chain Development in North Eastern hill region.\"\n    },\n    {\n        \"question\": \"How many farmers and hectares have been federated under MOVCD-NER?\",\n        \"answer\": \"Around 1 lakh farmers with 70,000 hectares have been federated into 130 FPOs under MOVCD-NER.\"\n    },\n    {\n        \"question\": \"What does the yield ratio of organic and inorganic production systems indicate?\",\n        \"answer\": \"The yield ratio indicates that many crops reacted positively to organic management, yielding higher or comparable results compared to inorganic management.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"Who is the Project Co-ordinator for Post-Harvest Technology at the Central Institute of Post-Harvest Technology in Ludhiana?\",\n        \"answer\": \"Dr S M Ilyas\"\n    },\n    {\n        \"question\": \"What is the role of Dr R K Verma at the Central Institute of Agricultural Engineering in Bhopal?\",\n        \"answer\": \"Project Co-ordinator (Power Tillers)\"\n    },\n    {\n        \"question\": \"Which institute is Dr Jaswant Singh associated with, and what is his role?\",\n        \"answer\": \"Dr Jaswant Singh is associated with the Indian Institute of Sugarcane Research in Lucknow as the Project Co-ordinator for Processing, Handling, and Storage of Jaggery and Khandsari.\"\n    },\n    {\n        \"question\": \"What is the focus of Dr M Shyam's work at the Central Institute of Agricultural Engineering in Bhopal?\",\n        \"answer\": \"Dr M Shyam focuses on Renewable Energy Sources.\"\n    },\n    {\n        \"question\": \"Who is the Project Co-ordinator for Utilization of Animal Energy at the Central Institute of Agricultural Engineering in Bhopal?\",\n        \"answer\": \"Dr G C Yadav\"\n    },\n    {\n        \"question\": \"What is the role of Dr Gurmej Singh at the National Bureau of Animal Genetic Resources in Karnal?\",\n        \"answer\": \"Project Co-ordinator (Animal Genetic Resources)\"\n    },\n    {\n        \"question\": \"Which institute is Dr R K Sethi associated with, and what is his role?\",\n        \"answer\": \"Dr R K Sethi is associated with the Central Institute for Research on Buffaloes in Hisar as the Project Co-ordinator for Buffalo Breeding.\"\n    },\n    {\n        \"question\": \"What is the focus of Dr Nagendra Sharma's work at the Central Institute for Research on Goat in Mathura?\",\n        \"answer\": \"Dr Nagendra Sharma focuses on Crop Based Animal Production Systems.\"\n    },\n    {\n        \"question\": \"Who is the Project Co-ordinator for Embryo Transfer at the Indian Council of Agricultural Research in New Delhi?\",\n        \"answer\": \"Dr Arun Varma\"\n    },\n    {\n        \"question\": \"What is the role of Dr A K Chhabra at the Indian Veterinary Research Institute in Izatnagar?\",\n        \"answer\": \"Project Co-ordinator (Pigs)\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What was the percentage increase in yield observed in coriander (Arka Isha)?\",\n        \"answer\": \"The yield increase in coriander (Arka Isha) was as high as 179.1%.\"\n    },\n    {\n        \"question\": \"How many demonstrations were conducted on improved tools and farm implements?\",\n        \"answer\": \"5,040 demonstrations were conducted on improved tools and farm implements.\"\n    },\n    {\n        \"question\": \"What was the total area covered by demonstrations on farm mechanization?\",\n        \"answer\": \"The demonstrations on farm mechanization covered an area of 1,814 hectares.\"\n    },\n    {\n        \"question\": \"How many demonstrations were conducted in the livestock and fisheries sector?\",\n        \"answer\": \"7,513 demonstrations were conducted in the livestock and fisheries sector.\"\n    },\n    {\n        \"question\": \"How many units of prawn cultivation were covered in the demonstrations?\",\n        \"answer\": \"8,193 units of prawn cultivation were covered in the demonstrations.\"\n    },\n    {\n        \"question\": \"What was the total number of training programmes organized for capacity development?\",\n        \"answer\": \"49,768 training programmes were organized for capacity development.\"\n    },\n    {\n        \"question\": \"How many farmers and farm women participated in the training courses?\",\n        \"answer\": \"11.31 lakh farmers and farm women participated in the training courses.\"\n    },\n    {\n        \"question\": \"What percentage of training courses focused on productivity enhancement of field crops?\",\n        \"answer\": \"22.55% of the training courses focused on productivity enhancement of field crops.\"\n    },\n    {\n        \"question\": \"How many rural youth participated in skill-oriented training courses?\",\n        \"answer\": \"1.75 lakh rural youth participated in skill-oriented training courses.\"\n    },\n    {\n        \"question\": \"What percentage of training courses for rural youth focused on mushroom production?\",\n        \"answer\": \"9% of the training courses for rural youth focused on mushroom production.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the income increase per hectare in the first year of adopting genetically improved carps and scientific management?\",\n        \"answer\": \"The income increase is Rs.3,50,000/ha.\"\n    },\n    {\n        \"question\": \"What is the income increase per hectare in the fourth year of adopting high-value catfish culture like murrel, Magur, and pabda?\",\n        \"answer\": \"The income increase is Rs.10,00,000/ha.\"\n    },\n    {\n        \"question\": \"What is the percentage increase in income by 2022 for intensive pangasius culture?\",\n        \"answer\": \"The increase in income is 100%.\"\n    },\n    {\n        \"question\": \"What is the income from mushroom cultivation using Var. OSM11 in the first year?\",\n        \"answer\": \"The income is Rs.1000 for 0.12 quintals.\"\n    },\n    {\n        \"question\": \"What is the income from mushroom cultivation in the third year using presoaked paddy straw with 2% CaCO3?\",\n        \"answer\": \"The income is Rs.1600 for 0.53 quintals.\"\n    },\n    {\n        \"question\": \"What is the percentage increase in income for homestead paddy straw introduction by 2022?\",\n        \"answer\": \"The increase in income is 60%.\"\n    },\n    {\n        \"question\": \"What is the milk yield per day in the third year of adopting Azolla and feed preparation for dairy cows?\",\n        \"answer\": \"The milk yield is 6.5 liters/day.\"\n    },\n    {\n        \"question\": \"What is the net profit per year for goat farming in the third year after deworming and PPR vaccination?\",\n        \"answer\": \"The net profit is Rs.23000.\"\n    },\n    {\n        \"question\": \"What is the average increase in income over 5 years for the mentioned agricultural practices?\",\n        \"answer\": \"The average increase in income is 141.65%.\"\n    },\n    {\n        \"question\": \"What are the key recommendations to increase agricultural productivity and farmers' income in Odisha?\",\n        \"answer\": \"The recommendations include improving the quality and judicious use of inputs like water, seeds, fertilizer, and pesticides, efficient use of modern technology, and diversification of enterprises.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"When was the laboratory shifted to Mukteswar?\",\n        \"answer\": \"The laboratory was shifted to Mukteswar in 1893.\"\n    },\n    {\n        \"question\": \"What was the institute renamed as in 1930?\",\n        \"answer\": \"The institute was renamed as Imperial Serum Institute in 1930.\"\n    },\n    {\n        \"question\": \"What was the final name given to the institute post-independence?\",\n        \"answer\": \"Post-independence, the institute was finally renamed as Indian Veterinary Research Institute (IVRI).\"\n    },\n    {\n        \"question\": \"What are the two animal health institutes established from IVRI?\",\n        \"answer\": \"The two animal health institutes established from IVRI are ICAR-Directorate of FMD (DFMD) and ICAR-National Institute of High Security Animal Diseases (NIHSAD).\"\n    },\n    {\n        \"question\": \"What is the main objective of ICAR-NIHSAD?\",\n        \"answer\": \"The main objective of ICAR-NIHSAD is to deal with emerging exotic animal diseases and bio-risk management.\"\n    },\n    {\n        \"question\": \"When was the AICRP on FMD upgraded to Project Directorate on FMD (PDFMD)?\",\n        \"answer\": \"The AICRP on FMD was upgraded to Project Directorate on FMD (PDFMD) in 2001.\"\n    },\n    {\n        \"question\": \"What is the significance of ICAR-DFMD in the global context?\",\n        \"answer\": \"ICAR-DFMD is a member of the Global FAO/OIE network of FMD reference laboratories and functions as the FAO-FMD Reference Center and SAARC Regional Leading Diagnostic Laboratory for FMD.\"\n    },\n    {\n        \"question\": \"What facility does ICAR-NIHSAD have for research on exotic pathogens?\",\n        \"answer\": \"ICAR-NIHSAD has a Biosafety Level 3+ (BSL-3+) bio-containment facility for research on exotic and high-risk pathogens.\"\n    },\n    {\n        \"question\": \"What was the purpose of the ad-hoc scheme initiated by ICAR in 1943?\",\n        \"answer\": \"The ad-hoc scheme initiated by ICAR in 1943 was entitled 'Vaccination of Indian cattle against foot-and-mouth disease'.\"\n    },\n    {\n        \"question\": \"What is the role of the state-of-the-art FMD research centre (ICFMD) established at Bhubaneswar?\",\n        \"answer\": \"The state-of-the-art FMD research centre (ICFMD) at Bhubaneswar meets the major requirements of the FMD Control Programme (FMDCP) as stipulated by OIE/FAO.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the main concern regarding the use of pesticides in farming?\",\n        \"answer\": \"Injudicious use of pesticides poses serious risks to the environment, soil health, human beings, and animals.\"\n    },\n    {\n        \"question\": \"What is natural farming, and how does it differ from chemical farming?\",\n        \"answer\": \"Natural farming is a low-input and climate-resilient farming system that uses low-cost locally-sourced inputs and eliminates artificial fertilizers and industrial pesticides, unlike chemical farming.\"\n    },\n    {\n        \"question\": \"Who is Shri Madan Gopal, and what is his contribution to natural farming?\",\n        \"answer\": \"Shri Madan Gopal is a progressive farmer from Solan district, Himachal Pradesh, who practices natural farming and has achieved higher net returns compared to chemical farming.\"\n    },\n    {\n        \"question\": \"What challenges did Shri Madan Gopal face initially in natural farming?\",\n        \"answer\": \"Initially, he faced severe losses in vegetable production due to a lack of proper knowledge about natural farming.\"\n    },\n    {\n        \"question\": \"How did Shri Madan Gopal transition to natural farming successfully?\",\n        \"answer\": \"He received training from KVK Solan and the Department of Agriculture (ATMA) and adopted natural farming practices with the guidance of scientists.\"\n    },\n    {\n        \"question\": \"What are some natural farming formulations prepared by Shri Madan Gopal?\",\n        \"answer\": \"He prepares and supplies Beejamrit, Jeevamrit, Dashparni Ark, Agniastra, Brahmastra, and vermicompost.\"\n    },\n    {\n        \"question\": \"How does natural farming improve soil health?\",\n        \"answer\": \"Natural farming improves soil structure and fertility through practices like using Jeevamrit, mulching, crop rotation, and N-fixing crops.\"\n    },\n    {\n        \"question\": \"What are the principles of natural farming adopted by Shri Madan Gopal?\",\n        \"answer\": \"The principles include no tillage, no chemical fertilizers or pesticides, and maintaining the natural structure of the soil.\"\n    },\n    {\n        \"question\": \"What role does vermicompost play in natural farming?\",\n        \"answer\": \"Vermicompost is a natural fertilizer that enhances soil fertility and supports sustainable farming practices.\"\n    },\n    {\n        \"question\": \"How does natural farming contribute to pest control?\",\n        \"answer\": \"Natural farming promotes natural pest control practices instead of relying on synthetic pesticides.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the email address of the Sugarcane Breeding Institute in Coimbatore?\",\n        \"A\": \"sbi-coi@x400nicgw.nic.in\"\n    },\n    {\n        \"Q\": \"Where is the Central Avian Research Institute located?\",\n        \"A\": \"Izatnagar, Uttar Pradesh\"\n    },\n    {\n        \"Q\": \"What is the email address of the Central Institute of Brackishwater Aquaculture?\",\n        \"A\": \"ciba@x400nicgw.nic.in\"\n    },\n    {\n        \"Q\": \"Where is the Central Institute of Fisheries Technology located?\",\n        \"A\": \"Willingdon Island, Kochi, Kerala\"\n    },\n    {\n        \"Q\": \"What is the email address of the Central Institute for Research on Buffaloes?\",\n        \"A\": \"cirb@x400nicgw.nic.in\"\n    },\n    {\n        \"Q\": \"Where is the National Institute of Animal Nutrition and Physiology located?\",\n        \"A\": \"Bangalore, Karnataka\"\n    },\n    {\n        \"Q\": \"What is the email address of the National Bureau of Plant Genetic Resources?\",\n        \"A\": \"nbpgr@x400nicgw.nic.in\"\n    },\n    {\n        \"Q\": \"Where is the National Bureau of Soil Survey and Land Use Planning located?\",\n        \"A\": \"Nagpur, Maharashtra\"\n    },\n    {\n        \"Q\": \"What is the email address of the Directorate of Cropping Systems Research?\",\n        \"A\": \"pdcsr@x400nicgw.nic.in\"\n    },\n    {\n        \"Q\": \"Where is the Directorate of Oilseeds Research located?\",\n        \"A\": \"Hyderabad, Andhra Pradesh\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the annual rainfall range in the arid zone of Barmer and Jodhpur districts?\",\n        \"A\": \"The annual rainfall ranges from 216 to 496 mm.\"\n    },\n    {\n        \"Q\": \"What is the net area sown as a percentage of the reporting area in the arid zone?\",\n        \"A\": \"The net area sown is 58% of the reporting area.\"\n    },\n    {\n        \"Q\": \"What percentage of irrigation in the arid zone is through groundwater?\",\n        \"A\": \"98% of irrigation is through groundwater.\"\n    },\n    {\n        \"Q\": \"What are the major crops grown in the arid zone of Rajasthan?\",\n        \"A\": \"Major crops include pearl millet, clusterbean, moth bean, mung bean, rapeseed & mustard, wheat, castor seed, groundnut, sorghum, sesame, cotton, and onion.\"\n    },\n    {\n        \"Q\": \"What percentage of annual rainfall is received during the monsoon season in the arid zone?\",\n        \"A\": \"About 80-90% of annual rainfall is received during the monsoon season.\"\n    },\n    {\n        \"Q\": \"What are the major soil-related challenges in the arid zone?\",\n        \"A\": \"Soils are light textured, have poor fertility, low water holding capacity, high infiltration rate, and soil organic carbon is less than 0.2%.\"\n    },\n    {\n        \"Q\": \"What is a major problem faced in the arid areas of Rajasthan?\",\n        \"A\": \"Wind erosion is a major problem in arid areas.\"\n    },\n    {\n        \"Q\": \"What is the issue with groundwater in the arid zone?\",\n        \"A\": \"Groundwater is deep, often brackish, and over-exploitation is becoming a major challenge for sustainable resource use.\"\n    },\n    {\n        \"Q\": \"What is the problem of secondary salinization in the arid zone?\",\n        \"A\": \"Secondary salinization is emerging in irrigated tracts due to poor water management or irrigation with poor quality water.\"\n    },\n    {\n        \"Q\": \"What is a major challenge for farmers during drought years in the arid zone?\",\n        \"A\": \"Fodder scarcity poses a strong challenge for farmers during drought years.\"\n    }\n]\n```"
]