[
    "```json\n[\n    {\n        \"question\": \"What are some examples of vegetables mentioned in the text?\",\n        \"answer\": \"Peas, capsicum, beans, cole crops, and cucurbits.\"\n    },\n    {\n        \"question\": \"Which flowers are highlighted in the text?\",\n        \"answer\": \"Rose, carnation, chrysanthemum, Gerbera, marigold, and gladiolus.\"\n    },\n    {\n        \"question\": \"What are some agroforestry species mentioned?\",\n        \"answer\": \"Grevia, mulberry, poplar, and willow.\"\n    },\n    {\n        \"question\": \"What medicinal plants are listed in the text?\",\n        \"answer\": \"Valeriana jatamansi, Viola odorata, Picorrhiza kurroa, Amla, and grafted Harar.\"\n    },\n    {\n        \"question\": \"What are some hybrid seeds mentioned for vegetables?\",\n        \"answer\": \"Okra, tomato, radish, carrot, cauliflower, bell pepper chilies, cabbage, and beetroot.\"\n    },\n    {\n        \"question\": \"What practices are recommended for mango cultivation in Zone I?\",\n        \"answer\": \"Regular bearing and frost-tolerant varieties, along with cultural management practices to regulate plant growth and fruit bearing for high productivity.\"\n    },\n    {\n        \"question\": \"How can potato yields be increased according to the text?\",\n        \"answer\": \"By varietal shift to Kufri Himalini, cultural management practices (potato - French bean system), and effective white grub management, which can increase yields by 17%.\"\n    },\n    {\n        \"question\": \"What is the suggested approach for maize cultivation?\",\n        \"answer\": \"Mixed cropping with pulses.\"\n    },\n    {\n        \"question\": \"How can milk production be increased through cooperative societies?\",\n        \"answer\": \"By promoting improved pasture and grassland management, agroforestry, and cultivation of sweet stalk sorghum, maize, and pearl millet.\"\n    },\n    {\n        \"question\": \"What strategies are recommended for reducing post-harvest and in-transit losses?\",\n        \"answer\": \"Developing a chain of cold stores, reefer trucks in strategic alliance with agribusiness cooperatives, strengthening roads, timely availability of transport vehicles, market intelligence, cold storages, warehouses, processing units, and promoting grower societies and auction yards.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the purpose of post-harvest technology in agriculture?\",\n        \"A\": \"Post-harvest technology is used for value addition and creating value-added products from crops like ginger, mango, citrus, garlic, and vegetables.\"\n    },\n    {\n        \"Q\": \"Why is land fragmentation a concern in agriculture?\",\n        \"A\": \"Land fragmentation disrupts economies of scale, making it necessary to define the minimum size of economically viable land holdings.\"\n    },\n    {\n        \"Q\": \"How can stray cattle and wild animals be controlled in agricultural areas?\",\n        \"A\": \"They can be controlled through policies or legislation that mandate the cultivation of arable lands.\"\n    },\n    {\n        \"Q\": \"What is the role of public-private partnerships in agriculture?\",\n        \"A\": \"Public-private partnerships are promoted to support agricultural development and innovation.\"\n    },\n    {\n        \"Q\": \"How can quality standards for crop produce benefit farmers?\",\n        \"A\": \"Linking quality standards to prices ensures farmers receive fair compensation for their produce.\"\n    },\n    {\n        \"Q\": \"What mechanisms are suggested to reduce on-farm losses?\",\n        \"A\": \"Minimum support price and buy-back mechanisms are recommended to reduce on-farm losses.\"\n    },\n    {\n        \"Q\": \"Why is e-trading promoted in agriculture?\",\n        \"A\": \"E-trading is promoted for both agricultural inputs and crop produce to streamline transactions and improve market access.\"\n    },\n    {\n        \"Q\": \"How can import/export policies support farming?\",\n        \"A\": \"Reforming import/export policies can promote farming by creating favorable trade conditions.\"\n    },\n    {\n        \"Q\": \"What is the significance of crop insurance schemes for farmers?\",\n        \"A\": \"Crop insurance schemes mitigate the risks of crop failures, providing financial security to farmers.\"\n    },\n    {\n        \"Q\": \"What is the purpose of allocating \"Nautaur land\" to small farmers?\",\n        \"A\": \"Allocating \"Nautaur land\" from ceiling-surplus and wastelands increases the size of land holdings for small farmers, especially in tribal areas.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What are the major threats to farming systems in Himachal Pradesh?\",\n        \"answer\": \"Floods, prolonged droughts, pest outbreaks, hailstorms, low chilling in high hills, and frost damage in the lower Shivalik Hills.\"\n    },\n    {\n        \"question\": \"Why are people in Himachal Pradesh giving up farming?\",\n        \"answer\": \"Due to the availability of food grains at cheaper rates in the public distribution system, youth aspirations for white-collar jobs, and crop damage by stray cattle and wild animals.\"\n    },\n    {\n        \"question\": \"What percentage of arable land in Himachal Pradesh is lying vacant?\",\n        \"answer\": \"Nearly 50% of the arable land is lying vacant.\"\n    },\n    {\n        \"question\": \"What is the proposed solution to attract youth to farming in Himachal Pradesh?\",\n        \"answer\": \"Developing cost-effective alternative farming systems to increase farmers’ income.\"\n    },\n    {\n        \"question\": \"What is the target for improving irrigation coverage in Himachal Pradesh?\",\n        \"answer\": \"To increase irrigation coverage from 19% to over 50% of the area under cultivation through check dams and tanks.\"\n    },\n    {\n        \"question\": \"How can productivity of fruit crops be increased in Himachal Pradesh?\",\n        \"answer\": \"By adopting high or ultra-high-density planting of fruit crops.\"\n    },\n    {\n        \"question\": \"What are some ways to diversify farm income in Himachal Pradesh?\",\n        \"answer\": \"Through crop-livestock farming, beekeeping, sericulture, fisheries, mushroom cultivation, agro-forestry, floriculture, and aromatic and medicinal plants.\"\n    },\n    {\n        \"question\": \"What is the significance of indigenous cows in dairy farming in Himachal Pradesh?\",\n        \"answer\": \"Indigenous cows produce A2 milk, which is considered more health-promoting, and their urine and farmyard manure are useful for organic farming.\"\n    },\n    {\n        \"question\": \"What is the potential income from selling certified A2 milk in Himachal Pradesh?\",\n        \"answer\": \"Rs 6,00,000 per year from selling certified A2 milk at Rs 60 per liter, with an average production of 2,000 liters per animal per year for 5 cows.\"\n    },\n    {\n        \"question\": \"What are the fixed costs for starting a dairy with indigenous cows in Himachal Pradesh?\",\n        \"answer\": \"Rs 2,50,000 for 5 indigenous cows at Rs 50,000 each, Rs 1,00,000 for shelter/housing, and Rs 35,000 per year for depreciation.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the net income per annum for the farm mentioned?\",\n        \"answer\": \"The net income per annum is Rs 3,45,000.\"\n    },\n    {\n        \"question\": \"Where is NICRA village Lagga located?\",\n        \"answer\": \"NICRA village Lagga is located in District Chamba at a height of 1500-2000 meters above mean sea level.\"\n    },\n    {\n        \"question\": \"What is the annual average rainfall in NICRA village Lagga?\",\n        \"answer\": \"The annual average rainfall is about 1,100 mm.\"\n    },\n    {\n        \"question\": \"What are the major crops grown in NICRA village Lagga?\",\n        \"answer\": \"The major crops grown are maize, cabbage, cauliflower, apple, beans, and potato.\"\n    },\n    {\n        \"question\": \"What was the problem faced by farmers in NICRA village Lagga before the NICRA project?\",\n        \"answer\": \"Farmers had very small land holdings without irrigation facilities and produced only small amounts of maize for domestic needs.\"\n    },\n    {\n        \"question\": \"What was done to address the water scarcity issue in NICRA village Lagga?\",\n        \"answer\": \"11 water harvesting structures with a storage capacity of 60,000-80,000 liters were constructed to augment irrigation.\"\n    },\n    {\n        \"question\": \"What is the significance of polyhouses in NICRA village Lagga?\",\n        \"answer\": \"Polyhouses were constructed for protected cultivation, enabling farmers to grow vegetables and increase their income.\"\n    },\n    {\n        \"question\": \"How many farmers were trained for protected cultivation in 2017?\",\n        \"answer\": \"3,000 farmers were trained in 200 training programs organized in 2017.\"\n    },\n    {\n        \"question\": \"What is the income increase for farmers cultivating vegetable crops in NICRA village Lagga?\",\n        \"answer\": \"Farmers have seen an income increase of Rs 5-6 lakhs per farmer in a single cropping season.\"\n    },\n    {\n        \"question\": \"What is the percentage decrease in the area under maize cultivation after the NICRA project?\",\n        \"answer\": \"The area under maize cultivation decreased by 39.30%.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the percentage increase in the price of apples?\",\n        \"answer\": \"The percentage increase in the price of apples is 251%.\"\n    },\n    {\n        \"question\": \"What is the percentage increase in the price of cabbage?\",\n        \"answer\": \"The percentage increase in the price of cabbage is 2566%.\"\n    },\n    {\n        \"question\": \"What is the percentage increase in the price of cauliflower?\",\n        \"answer\": \"The percentage increase in the price of cauliflower is 1,400%.\"\n    },\n    {\n        \"question\": \"Where is the state of Jammu and Kashmir located?\",\n        \"answer\": \"Jammu and Kashmir is located in the northern part of the Indian subcontinent, near the Karakoram and westernmost Himalayan mountain ranges.\"\n    },\n    {\n        \"question\": \"What are the seven physiographic zones of Jammu and Kashmir?\",\n        \"answer\": \"The seven physiographic zones are the plains, the foothills, the Pir Panjal Range, the Vale of Kashmir, the Great Himalayas zone, the upper Indus River valley, and the Karakoram Range.\"\n    },\n    {\n        \"question\": \"What is the average annual precipitation in the alpine area of Jammu and Kashmir?\",\n        \"answer\": \"The average annual precipitation in the alpine area is about 3 inches (75 mm).\"\n    },\n    {\n        \"question\": \"What is the average annual precipitation in the subtropical zone around Jammu?\",\n        \"answer\": \"The average annual precipitation in the subtropical zone around Jammu is about 45 inches (1,150 mm).\"\n    },\n    {\n        \"question\": \"What are the four distinct climatic zones of Jammu and Kashmir?\",\n        \"answer\": \"The four distinct climatic zones are the cold arid desert zone (Ladakh region), temperate zone (Kashmir valley and Pir Panjal region), sub-tropical temperate transitional zone (Punch, Bhadarwah, and Kishtwar regions), and low altitude humid sub-tropical zone (foot-hill plains and Siwalik hills of Jammu region).\"\n    },\n    {\n        \"question\": \"What is the staple crop of Jammu and Kashmir?\",\n        \"answer\": \"The staple crop of Jammu and Kashmir is rice.\"\n    },\n    {\n        \"question\": \"What are the main summer crops grown in Jammu and Kashmir?\",\n        \"answer\": \"The main summer crops are rice, corn, millet, pulses (legumes such as peas, beans, and lentils), cotton, and tobacco.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What are the chief spring crops mentioned in the text?\",\n        \"answer\": \"Wheat and barley are the chief spring crops.\"\n    },\n    {\n        \"question\": \"Which region is the sole producer of saffron in the Indian subcontinent?\",\n        \"answer\": \"The Vale of Kashmir is the sole producer of saffron in the Indian subcontinent.\"\n    },\n    {\n        \"question\": \"What types of fruits are grown in the large orchards of the Vale of Kashmir?\",\n        \"answer\": \"Apples, pears, peaches, walnuts, almonds, and cherries are grown in the large orchards of the Vale of Kashmir.\"\n    },\n    {\n        \"question\": \"What is sericulture?\",\n        \"answer\": \"Sericulture is the cultivation of silk.\"\n    },\n    {\n        \"question\": \"What are the main crops cultivated in the valleys of Ladakh?\",\n        \"answer\": \"Barley, buckwheat, turnips, and mustard are the main crops cultivated in the valleys of Ladakh.\"\n    },\n    {\n        \"question\": \"What is a major constraint in the fish industry in J&K?\",\n        \"answer\": \"A major constraint in the fish industry in J&K is the lack of training for fish farmers.\"\n    },\n    {\n        \"question\": \"What percentage of cultivated area in J&K is rainfed?\",\n        \"answer\": \"Around 58% of the cultivated area in J&K is rainfed.\"\n    },\n    {\n        \"question\": \"What is the significance of pastoralism in Ladakh?\",\n        \"answer\": \"Pastoralism, notably yak herding, has long been a vital feature of the Ladakh economy.\"\n    },\n    {\n        \"question\": \"What is transhumance, and which communities practice it in the region?\",\n        \"answer\": \"Transhumance is the seasonal migration of livestock, practiced by some Gujjar and Gaddi communities in the region.\"\n    },\n    {\n        \"question\": \"What are the major constraints for agriculture in J&K mentioned in the text?\",\n        \"answer\": \"Major constraints include no law on minimum land ceiling, lack of focus on increasing cropping intensity, less credit flow, lesser emphasis on post-harvest technologies, lack of insurance cover, lack of adoption of improved technologies, and lack of training for fish farmers.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the primary reason for low and unstable agricultural productivity in the state?\",\n        \"answer\": \"The primary reason is the unharnessed potential of the state's agricultural sector.\"\n    },\n    {\n        \"question\": \"What is the most important constraint for the animal and sheep husbandry sector in the winter season?\",\n        \"answer\": \"The most important constraint is the problem of fodder availability, particularly in the Valley.\"\n    },\n    {\n        \"question\": \"What are some ecology and hygiene-related diseases affecting domestic animals in the state?\",\n        \"answer\": \"Some diseases include liver fluke in domestic animals and mastitis.\"\n    },\n    {\n        \"question\": \"What is a major constraint in maximizing farmers’ profits?\",\n        \"answer\": \"Marketing is a major constraint, especially due to lack of storage facilities, value addition infrastructure, and regulated markets.\"\n    },\n    {\n        \"question\": \"What is the strategy for productivity enhancement in agriculture in Jammu?\",\n        \"answer\": \"The strategy includes establishing Special Agricultural Zones, promoting balanced use of fertilizers and pesticides, and adopting drip irrigation and protected cultivation.\"\n    },\n    {\n        \"question\": \"What is the focus of seed management in agriculture?\",\n        \"answer\": \"The focus is on sustaining continuous growth in productivity through seed replacement rate (SRR) and development of seed banks/stores.\"\n    },\n    {\n        \"question\": \"What techniques are promoted for water management in agriculture?\",\n        \"answer\": \"Techniques include water harvesting, rejuvenation of traditional water bodies, micro-irrigation, and water conservation methods like mulch, sprinkler, and drip irrigation.\"\n    },\n    {\n        \"question\": \"How is farm mechanization being promoted in Jammu & Kashmir?\",\n        \"answer\": \"Farm mechanization is promoted by providing prototypes, subsidizing equipment, and developing custom hiring centers.\"\n    },\n    {\n        \"question\": \"What is the Integrated Farming System (IFS) being promoted in agriculture?\",\n        \"answer\": \"IFS includes combining poultry, livestock, horticulture, composting, fisheries, dairy, and protected cultivation.\"\n    },\n    {\n        \"question\": \"What crops are promoted for diversification and value addition in horticulture?\",\n        \"answer\": \"High-value crops like mango, guava, olive, strawberry, floriculture, and medicinal & aromatic plants are promoted.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What are some high-value and labor-intensive commodities that can benefit small-scale farmers?\",\n        \"answer\": \"High-value and labor-intensive commodities can provide adequate income and employment to farmers dependent on small-sized farms.\"\n    },\n    {\n        \"question\": \"What techniques are used for intensive cultivation in agriculture?\",\n        \"answer\": \"Techniques like High Density Plantation (HDP), intercropping, and multiple cropping are used for intensive cultivation.\"\n    },\n    {\n        \"question\": \"Why is the production of quality planting material important?\",\n        \"answer\": \"Quality planting material, bud-wood, and rootstocks are essential for high-density planting and improving crop yields.\"\n    },\n    {\n        \"question\": \"What is the significance of canopy management in horticulture?\",\n        \"answer\": \"Canopy management and plant architectural engineering help optimize plant growth and productivity.\"\n    },\n    {\n        \"question\": \"How does hi-tech horticulture contribute to nutritional security?\",\n        \"answer\": \"Hi-tech horticulture focuses on breeding for health traits, high-altitude research, and value-added plant propagation to ensure nutritional security.\"\n    },\n    {\n        \"question\": \"What is the purpose of rejuvenating old and senile orchards?\",\n        \"answer\": \"Rejuvenation and revival of old orchards, including traditional varieties like Ambri apple, aim to restore productivity through breeding, selection, and orchard management.\"\n    },\n    {\n        \"question\": \"What facilities are included in hi-tech nurseries?\",\n        \"answer\": \"Hi-tech nurseries include virus indexing, bud wood/root stock banks, and other advanced facilities for quality plant production.\"\n    },\n    {\n        \"question\": \"How is irrigation managed in regions dependent on monsoon rainfall?\",\n        \"answer\": \"Irrigation networks and systems, such as those under PMKSY, and micro-irrigation models are established to augment irrigation assets in monsoon-dependent areas.\"\n    },\n    {\n        \"question\": \"What is the role of pollination management in horticulture?\",\n        \"answer\": \"Pollination management ensures efficient pollination in horticultural crops, especially in high-density planting systems.\"\n    },\n    {\n        \"question\": \"What crops are suitable for cultivation in the Jammu region?\",\n        \"answer\": \"In Jammu, crops like mango, citrus, guava, ber, loquat, aonla, and cash crops like grapes and strawberry are suitable for cultivation in its sub-tropical climate.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"Which regions in Jammu and Kashmir are suitable for temperate fruit crops?\",\n        \"answer\": \"Kishtawar, Doda, Ramban, and Poonch are suitable for temperate fruit crops.\"\n    },\n    {\n        \"question\": \"What are some of the recommended temperate fruit crops for Kishtawar, Doda, Ramban, and Poonch?\",\n        \"answer\": \"Recommended temperate fruit crops include apple, pear, walnut, pecan nut, and stone fruits.\"\n    },\n    {\n        \"question\": \"What is the purpose of establishing Fodder Banks in Rajouri, Poonch, and Doda?\",\n        \"answer\": \"Fodder Banks are established to meet the fodder requirements of the area.\"\n    },\n    {\n        \"question\": \"Where are milk chilling plants proposed to be established?\",\n        \"answer\": \"Milk chilling plants are proposed to be established in Jammu, Udhampur, Reasi, and Rajouri districts.\"\n    },\n    {\n        \"question\": \"What is the objective of establishing elite mutton type stud rams mother farms?\",\n        \"answer\": \"The objective is to produce superior rams that can be distributed in niche belts suited for mutton production.\"\n    },\n    {\n        \"question\": \"What is the focus of the Rural Backyard Poultry Development Scheme?\",\n        \"answer\": \"The focus is on increasing egg production through improved varieties of backyard poultry.\"\n    },\n    {\n        \"question\": \"What are some strategies to ensure the availability of quality fodder?\",\n        \"answer\": \"Strategies include reclamation of wasteland and the use of hydroponics.\"\n    },\n    {\n        \"question\": \"What is the goal of developing Recreational Fisheries in Jammu?\",\n        \"answer\": \"The goal is to develop Sport and Ornamental Fisheries in the region.\"\n    },\n    {\n        \"question\": \"What is the purpose of establishing wholesale/retail fish markets?\",\n        \"answer\": \"The purpose is to develop marketing facilities for fish and fish products.\"\n    },\n    {\n        \"question\": \"What is one of the strategies to improve farmers' access to markets?\",\n        \"answer\": \"One strategy is the development of a cold chain system for fruits and vegetables.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the purpose of establishing procurement and collection centers at the panchayat level?\",\n        \"A\": \"To manage agricultural surplus with proper labelling.\"\n    },\n    {\n        \"Q\": \"What is one of the strategies to support farmers through policy amendments?\",\n        \"A\": \"Amendment of APMC (Agricultural Produce Market Committee).\"\n    },\n    {\n        \"Q\": \"How does the strategy aim to support small and marginal farmers institutionally?\",\n        \"A\": \"By providing subsidies and incentives.\"\n    },\n    {\n        \"Q\": \"What is the significance of labelling organic inputs and certification mechanisms?\",\n        \"A\": \"To ensure authenticity and quality of organic crops.\"\n    },\n    {\n        \"Q\": \"What is the role of the Soil Health Card Scheme in agricultural strategy?\",\n        \"A\": \"To provide farmers with information on soil health for better crop management.\"\n    },\n    {\n        \"Q\": \"What infrastructural development is suggested for agricultural preservation and processing?\",\n        \"A\": \"Creation of modern infrastructure for preservation and processing of agricultural produces.\"\n    },\n    {\n        \"Q\": \"Why is private investment in agriculture considered slow and what is the proposed solution?\",\n        \"A\": \"Private investment has been slow, and it is suggested to stimulate it through appropriate policies.\"\n    },\n    {\n        \"Q\": \"What is the importance of skill development training in agriculture according to the strategy?\",\n        \"A\": \"It is crucial for enhancing farmers' income and is part of the government's flagship programs.\"\n    },\n    {\n        \"Q\": \"What are the proposed measures to improve road connectivity and power supply in agricultural areas?\",\n        \"A\": \"Strengthening road connectivity and provision of uninterrupted power supply.\"\n    },\n    {\n        \"Q\": \"How does the strategy propose to handle natural calamities affecting farmers?\",\n        \"A\": \"By providing forewarning about natural calamities and immediate relief to affected farmers.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the role of the Agriculture Skill Council of India (ASCI)?\",\n        \"answer\": \"The Agriculture Skill Council of India (ASCI) was established to enhance skills in the agricultural sector.\"\n    },\n    {\n        \"question\": \"Why is the use of ICT important in agricultural extension?\",\n        \"answer\": \"ICT is essential for the rapid dissemination of customized information to farmers, increasing the adoption rate of innovations.\"\n    },\n    {\n        \"question\": \"What is Farmers to Farmer Extension (F2FE)?\",\n        \"answer\": \"Farmers to Farmer Extension (F2FE) involves farmers seeking advice and information related to agriculture from fellow farmers.\"\n    },\n    {\n        \"question\": \"What percentage of farmers had access to information on modern technology according to NSSO data?\",\n        \"answer\": \"Only 40 per cent of farmers had access to any source of information on modern technology.\"\n    },\n    {\n        \"question\": \"What is the purpose of establishing Village Knowledge Centres?\",\n        \"answer\": \"Village Knowledge Centres are established to provide farmers with access to modern technologies at the village level.\"\n    },\n    {\n        \"question\": \"What is the goal of strengthening convergence in agriculture?\",\n        \"answer\": \"Strengthening convergence aims to integrate resources and expertise from KVK, ATMA, line departments, banks, and cooperatives.\"\n    },\n    {\n        \"question\": \"What are some strategies for waste land development?\",\n        \"answer\": \"Strategies include contour making, afforestation, promotion of horticultural crops, and construction of water storage tanks.\"\n    },\n    {\n        \"question\": \"How can cultivation costs be reduced?\",\n        \"answer\": \"Cultivation costs can be reduced through deficit fertilization, use of power tillers, line sowing, and promotion of organic farming.\"\n    },\n    {\n        \"question\": \"What are some off-farm income strategies for farmers?\",\n        \"answer\": \"Strategies include creating SHGs, promoting value-added products, skill development, and encouraging micro-entrepreneurship.\"\n    },\n    {\n        \"question\": \"Why is online management and evaluation important in agriculture?\",\n        \"answer\": \"Online management and evaluation are important as information underpins future progress and prosperity in agriculture.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What technologies are used for mapping natural and agricultural resources?\",\n        \"A\": \"Remote sensing and GIS technologies are used for mapping natural and agricultural resources.\"\n    },\n    {\n        \"Q\": \"How can mobile apps and software assist farmers and agricultural departments?\",\n        \"A\": \"Mobile apps and software facilitate online management, evaluation, monitoring, feedback, and reading for farmers, state agriculture departments, and KVKs.\"\n    },\n    {\n        \"Q\": \"What is the purpose of developing e-Marketing and kiosks at the district level?\",\n        \"A\": \"e-Marketing and kiosks provide information on surplus commodities at the block level.\"\n    },\n    {\n        \"Q\": \"What is the focus of Strategy 10 in the text?\",\n        \"A\": \"Strategy 10 focuses on empowering marginal and small farmers.\"\n    },\n    {\n        \"Q\": \"What are the objectives of prioritizing the livestock sector?\",\n        \"A\": \"The objectives include diversifying agriculture, raising income, and meeting the nutritional security of poor farm households.\"\n    },\n    {\n        \"Q\": \"What is the significance of watershed development and water-saving techniques?\",\n        \"A\": \"They have far-reaching implications in increasing agricultural production and raising calorie intake in rainfed areas.\"\n    },\n    {\n        \"Q\": \"What is the role of co-operatives in rural development?\",\n        \"A\": \"Co-operatives can create rural centres of production and processing by masses.\"\n    },\n    {\n        \"Q\": \"What is the purpose of establishing Special Agricultural Zones?\",\n        \"A\": \"Special Agricultural Zones are established based on climate/physiographic factors and niches to enhance productivity.\"\n    },\n    {\n        \"Q\": \"How can small-mechanised tools benefit farmers?\",\n        \"A\": \"They can minimize drudgery without reducing employment and enhance labour productivity.\"\n    },\n    {\n        \"Q\": \"What is the goal of organizing monthly review meetings at the district level?\",\n        \"A\": \"The goal is to solve problems related to farmers.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"Which crops should be promoted in the Gurez region of Bandipora district?\",\n        \"answer\": \"Kala zeera and potato should be promoted in the Gurez region of Bandipora district.\"\n    },\n    {\n        \"question\": \"What is the focus of vegetable promotion in the Narakara area of Budgam?\",\n        \"answer\": \"Vegetable promotion is emphasized in the Narakara area of Budgam.\"\n    },\n    {\n        \"question\": \"Which district is known for saffron cultivation in Kashmir?\",\n        \"answer\": \"Pulwama is known for saffron cultivation in Kashmir.\"\n    },\n    {\n        \"question\": \"What is the recommended approach for replacing old and traditional varieties of fruit crops?\",\n        \"answer\": \"Old and traditional varieties should be replaced with high-yielding varieties in crops like apple, pear, walnut, apricot, cherry, peach, and plum.\"\n    },\n    {\n        \"question\": \"How can the quality of planting material and seeds be assured?\",\n        \"answer\": \"Quality seeds and planting material can be assured through registered nurseries, institutions, and departments, along with the development of seed banks.\"\n    },\n    {\n        \"question\": \"What techniques are suggested for increasing fertilizer efficiency?\",\n        \"answer\": \"Techniques like the use of manure, bio-fertilizers, and fertigation are suggested to increase fertilizer efficiency.\"\n    },\n    {\n        \"question\": \"What are the key components of water management in agriculture?\",\n        \"answer\": \"Water management includes water harvesting, rejuvenation of traditional water bodies, micro-irrigation, fertigation, and promotion of water conservation techniques like mulch, sprinkler, and drip irrigation.\"\n    },\n    {\n        \"question\": \"How can farm efficiency be increased through mechanization?\",\n        \"answer\": \"Farm efficiency can be increased by providing prototypes, subsidizing machinery, and developing custom hiring centers.\"\n    },\n    {\n        \"question\": \"What is the Integrated Farming System (IFS) and its benefits?\",\n        \"answer\": \"The Integrated Farming System (IFS) combines activities like poultry, livestock, horticulture, composting, fisheries, and dairy to enhance productivity and sustainability.\"\n    },\n    {\n        \"question\": \"What are some high-value crops suggested for crop diversification?\",\n        \"answer\": \"High-value crops like apple, pear, peach, plum, apricot, cherry, almond, walnut, olive, kiwi fruit, hazel nut, and strawberry are suggested for crop diversification.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the purpose of promoting soil amendments in agriculture?\",\n        \"answer\": \"To reclaim problematic and degraded soil in some regions of the valley.\"\n    },\n    {\n        \"question\": \"How is genetic resource management achieved in animal husbandry?\",\n        \"answer\": \"By adopting central herd registration and progeny testing.\"\n    },\n    {\n        \"question\": \"What is the objective of establishing genetic resource pools in cattle?\",\n        \"answer\": \"To make available elite germplasm for achieving desirable levels of upgradation in cattle.\"\n    },\n    {\n        \"question\": \"Why is it important to limit exotic blood proportion in cattle breeding?\",\n        \"answer\": \"Exceeding 60% exotic blood reduces hybrid vigour.\"\n    },\n    {\n        \"question\": \"What is the significance of establishing Fodder Banks in specific districts?\",\n        \"answer\": \"To meet the fodder requirements of the area.\"\n    },\n    {\n        \"question\": \"What is the benefit of popularizing the dual-purpose poultry breed 'Kashmir Commercial Layer'?\",\n        \"answer\": \"It produces 150-180 eggs/year and attains a weight of up to 2 kgs in 6 months, increasing economic benefits.\"\n    },\n    {\n        \"question\": \"Why is the development of hatcheries in Kashmir division important?\",\n        \"answer\": \"To avoid financial costs of importing one-day-old chicks, which can amount to Rs 30 lakh/month.\"\n    },\n    {\n        \"question\": \"What is the goal of increasing egg production through improved backyard poultry varieties?\",\n        \"answer\": \"To make the backyard poultry sector an effective tool for poultry meat production in the state.\"\n    },\n    {\n        \"question\": \"What is the focus of cold water fisheries development?\",\n        \"answer\": \"Fish farming and the use of high-nutrition fish feeds.\"\n    },\n    {\n        \"question\": \"What is the purpose of developing recreational fisheries in Kashmir?\",\n        \"answer\": \"To promote sport and ornamental fisheries in the region.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the purpose of establishing wholesale/retail fish markets?\",\n        \"A\": \"To improve facilities for fish and fish product marketing and maintain hygiene.\"\n    },\n    {\n        \"Q\": \"Which districts in Kashmir are prioritized for cold chain system development?\",\n        \"A\": \"Baramulla, Shopian, Pulwama, and Kulgam.\"\n    },\n    {\n        \"Q\": \"What is the role of Farmer Producer Organizations (FPOs)?\",\n        \"A\": \"To promote better market access and realization of farmers' produce.\"\n    },\n    {\n        \"Q\": \"How are farmers connected to e-markets?\",\n        \"A\": \"Through the establishment of platforms that link farmers to e-markets.\"\n    },\n    {\n        \"Q\": \"What is the significance of cool chain vans at the block level?\",\n        \"A\": \"They provide better transportation facilities for perishable goods.\"\n    },\n    {\n        \"Q\": \"What is the objective of establishing procurement and collection centers at the panchayat level?\",\n        \"A\": \"To manage agricultural surplus with proper labeling and improve market access.\"\n    },\n    {\n        \"Q\": \"Why is the installation of mini grading machines at the village level important?\",\n        \"A\": \"To ensure quality grading of agricultural produce at the local level.\"\n    },\n    {\n        \"Q\": \"What is the purpose of establishing mandatory meteorological/observatory stations at the block level?\",\n        \"A\": \"To provide first-hand information on climatic changes.\"\n    },\n    {\n        \"Q\": \"How does the Soil Health Card Scheme benefit farmers?\",\n        \"A\": \"It provides farmers with information on soil health to improve productivity.\"\n    },\n    {\n        \"Q\": \"What is the focus of strengthening R&D activities in farm universities/institutions?\",\n        \"A\": \"To provide site-specific technical support to farm developmental agencies.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the focus of the 'Kaushal Vikas Se Krishi Vikas' program?\",\n        \"answer\": \"The program focuses on enhancing farmers' income by imparting skill development training in agriculture.\"\n    },\n    {\n        \"question\": \"Why was the Agriculture Skill Council of India (ASCI) established?\",\n        \"answer\": \"ASCI was established to emphasize the importance of skill development training in agriculture.\"\n    },\n    {\n        \"question\": \"How does the use of ICT benefit farmers in agriculture?\",\n        \"answer\": \"ICT helps in the rapid dissemination of customized information to farmers, increasing the adoption rate of innovations.\"\n    },\n    {\n        \"question\": \"What is Farmers to Farmer Extension (F2FE)?\",\n        \"answer\": \"F2FE is a method where farmers seek advice and information related to agriculture from fellow farmers.\"\n    },\n    {\n        \"question\": \"What percentage of farmers had access to information on modern technology according to NSSO data?\",\n        \"answer\": \"Only 40% of farmers had access to information on modern technology.\"\n    },\n    {\n        \"question\": \"What is the purpose of establishing Village Knowledge Centres?\",\n        \"answer\": \"Village Knowledge Centres provide farmers with access to modern technologies at the village level.\"\n    },\n    {\n        \"question\": \"What is the goal of contour making in waste land development?\",\n        \"answer\": \"Contour making is aimed at making waste land in hilly areas suitable for arable purposes.\"\n    },\n    {\n        \"question\": \"What is the significance of promoting organic farming?\",\n        \"answer\": \"Organic farming helps maintain soil moisture, reduce intercultural operation costs, and minimize the use of chemical fertilizers.\"\n    },\n    {\n        \"question\": \"How can off-farm income be increased for farmers?\",\n        \"answer\": \"Off-farm income can be increased by promoting occupations like silkworm rearing, beekeeping, poultry, fish farming, and mushroom cultivation.\"\n    },\n    {\n        \"question\": \"What role do mobile apps play in agriculture management?\",\n        \"answer\": \"Mobile apps like Nutrient Diagnoser and Manager, and Predictor and Planner for Almond cultivation help in online management and evaluation of agricultural practices.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the role of e-Marketing and kiosks at the district level in agriculture?\",\n        \"answer\": \"They provide information about surplus commodities at the block level.\"\n    },\n    {\n        \"question\": \"How are monthly review meetings at the district level beneficial for farmers?\",\n        \"answer\": \"They help solve problems related to farmers.\"\n    },\n    {\n        \"question\": \"What methods are promoted for effective implementation of agricultural programs?\",\n        \"answer\": \"Use of radio, TV talks, and WhatsApp.\"\n    },\n    {\n        \"question\": \"Why is Ladakh suitable for organic farming?\",\n        \"answer\": \"Ladakh's climatic conditions are highly suitable for sustainable organic farming of agriculture and horticultural crops.\"\n    },\n    {\n        \"question\": \"What has been the impact of vegetable-intensive production in Ladakh?\",\n        \"answer\": \"There has been a tremendous improvement in the diversity, quantity, and quality of cultivated crops, especially vegetables.\"\n    },\n    {\n        \"question\": \"How many types of vegetables can be grown in Ladakh?\",\n        \"answer\": \"Around 68 different kinds of vegetables (both European and Asiatic types) can be successfully grown in Ladakh.\"\n    },\n    {\n        \"question\": \"What percentage of the Army's fresh vegetable requirement is fulfilled by local farmers in Ladakh?\",\n        \"answer\": \"51% of the Army's total fresh vegetable requirement (7000 MT) is fulfilled by local farmers.\"\n    },\n    {\n        \"question\": \"What is the significance of greenhouse cultivation in Ladakh?\",\n        \"answer\": \"It allows farmers to grow fresh vegetables during winter months when temperatures drop below freezing levels.\"\n    },\n    {\n        \"question\": \"Why is Ladakh suitable for vegetable seed production?\",\n        \"answer\": \"The region has long photoperiods, high light intensity, low rainfall and humidity, and low disease and pest incidence.\"\n    },\n    {\n        \"question\": \"What practices are recommended to enhance fertilizer efficiency in Ladakh?\",\n        \"answer\": \"Use of manures, bio-fertilizers, and fertigation.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the significance of water management in Ladakh's agriculture?\",\n        \"answer\": \"Water management is crucial in Ladakh, a cold arid region, as it enhances crop productivity through techniques like water harvesting, rejuvenation of traditional water bodies, and micro-irrigation.\"\n    },\n    {\n        \"question\": \"How can crop diversification benefit farmers in Ladakh?\",\n        \"answer\": \"Crop diversification with high-value crops like kiwi fruit, olive, and hazelnut can maximize economic returns and minimize the risk of single crop failure.\"\n    },\n    {\n        \"question\": \"What role does Sea-buckthorn play in Ladakh's economy?\",\n        \"answer\": \"Sea-buckthorn, a thorny shrub with medicinal and cosmetic uses, has the potential to transform the economy of Ladakh, often referred to as 'gold' in the region.\"\n    },\n    {\n        \"question\": \"What is the purpose of promoting Integrated Farming Systems (IFS) in Ladakh?\",\n        \"answer\": \"Integrated Farming Systems (IFS) combine activities like protected cultivation, composting, and livestock rearing to enhance farm productivity and sustainability.\"\n    },\n    {\n        \"question\": \"How does mechanization contribute to farm efficiency in Ladakh?\",\n        \"answer\": \"Mechanization increases farm efficiency by providing prototypes, subsidizing equipment, and developing custom hiring centers for farmers.\"\n    },\n    {\n        \"question\": \"What are some high-value crops identified for crop diversification in Ladakh?\",\n        \"answer\": \"High-value crops identified include kiwi fruit, olive, hazelnut, pecan nut, pistachio nut, and Cape gooseberry.\"\n    },\n    {\n        \"question\": \"What techniques has DIHAR developed for farming in Ladakh's cold desert?\",\n        \"answer\": \"DIHAR has developed techniques like trench farming and the use of polythene sheets to help farmers grow fruits and vegetables in Ladakh's cold desert.\"\n    },\n    {\n        \"question\": \"What is the importance of protected and precision farming in Ladakh?\",\n        \"answer\": \"Protected and precision farming, including polyhouse technology and micro-irrigation, helps manage inputs efficiently and improve crop yields.\"\n    },\n    {\n        \"question\": \"How does water harvesting contribute to agriculture in Ladakh?\",\n        \"answer\": \"Water harvesting, including rainfall, runoff, and rooftop water collection, enhances water use efficiency and ensures water availability during lean seasons.\"\n    },\n    {\n        \"question\": \"What strategies are being implemented to double farmers' income in Ladakh by 2022?\",\n        \"answer\": \"Strategies include crop diversification, mechanization, water management, promotion of high-value crops, and the adoption of Integrated Farming Systems (IFS).\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What types of vegetables are now cultivated in highland regions that were unknown a decade ago?\",\n        \"answer\": \"Cabbages, onions, spinach, gourd, and watermelons.\"\n    },\n    {\n        \"question\": \"How is soil health managed in Leh and Kargil?\",\n        \"answer\": \"Through organic cultivation of local grain and millets, and promotion of soil amendments for reclamation of problematic and degraded soil.\"\n    },\n    {\n        \"question\": \"What technology is used for upgrading cattle breeds in the region?\",\n        \"answer\": \"Artificial Insemination with frozen semen technology and natural service.\"\n    },\n    {\n        \"question\": \"What is the purpose of establishing Fodder Banks in Zanaskar, Leh, and Kargil?\",\n        \"answer\": \"To meet the fodder requirements of the area.\"\n    },\n    {\n        \"question\": \"What is the focus of the milk chilling plant established at Leh?\",\n        \"answer\": \"To ensure proper storage and preservation of milk.\"\n    },\n    {\n        \"question\": \"What is the goal of introducing AI in sheep and goat farming?\",\n        \"answer\": \"To improve breeding and productivity through pilot projects.\"\n    },\n    {\n        \"question\": \"What is the significance of Pen and Cage Culture in fisheries?\",\n        \"answer\": \"It is a method for developing high-altitude lake fisheries and improving fish production.\"\n    },\n    {\n        \"question\": \"What is the purpose of developing Recreational Fisheries?\",\n        \"answer\": \"To promote sport and ornamental fisheries in the region.\"\n    },\n    {\n        \"question\": \"How are farmers connected to markets for better realization of their produce?\",\n        \"answer\": \"Through the establishment of platforms for e-markets, promotion of FPOs, and adoption of contract farming.\"\n    },\n    {\n        \"question\": \"What infrastructure is created to support farmers in marketing their produce?\",\n        \"answer\": \"Cool chain vans for transportation, wholesale/retail fish markets, and cold storage facilities.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is one way to ensure better prices for farmers' produce?\",\n        \"answer\": \"Creation of direct linkages with food processing industries.\"\n    },\n    {\n        \"question\": \"What is the purpose of establishing procurement and collection centers at the panchayat level?\",\n        \"answer\": \"To manage agricultural surplus with proper labelling.\"\n    },\n    {\n        \"question\": \"What is the significance of installing mini grading machines at the village level?\",\n        \"answer\": \"To improve the quality grading of agricultural produce.\"\n    },\n    {\n        \"question\": \"What is one policy support strategy for doubling farmers' income?\",\n        \"answer\": \"Amendment of APMC (Agricultural Produce Market Committee) Act.\"\n    },\n    {\n        \"question\": \"How does the government plan to support small and marginal farmers?\",\n        \"answer\": \"By increasing institutional support through subsidies and incentives.\"\n    },\n    {\n        \"question\": \"What is the importance of the Soil Health Card Scheme?\",\n        \"answer\": \"To provide farmers with information on soil health and recommend suitable crops and fertilizers.\"\n    },\n    {\n        \"question\": \"What is one infrastructural development strategy mentioned in the text?\",\n        \"answer\": \"Strengthening infrastructure based on PPP mode, such as go-downs and cold storage.\"\n    },\n    {\n        \"question\": \"What is the focus of the 'Kaushal Vikas Se Krishi Vikas' program?\",\n        \"answer\": \"Enhancing farmers' income by imparting skill development training in agriculture.\"\n    },\n    {\n        \"question\": \"How can ICT (Information and Communication Technology) benefit farmers?\",\n        \"answer\": \"By enabling rapid dissemination of customized information for adopting innovations.\"\n    },\n    {\n        \"question\": \"What is the purpose of establishing village knowledge centers?\",\n        \"answer\": \"To provide farmers with access to modern technologies at the village level.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the purpose of afforestation in steep slopes with more than 40% slope?\",\n        \"answer\": \"The purpose is to prevent soil erosion and improve land stability by planting perennial grasses and other vegetation.\"\n    },\n    {\n        \"question\": \"How does the promotion of seabuck thorn and wild grapes benefit agriculture?\",\n        \"answer\": \"Seabuck thorn and wild grapes are promoted for their resin and other commercial purposes, providing additional income sources for farmers.\"\n    },\n    {\n        \"question\": \"What is the significance of trenches or silages in agriculture?\",\n        \"answer\": \"Trenches or silages help in the percolation of water, reducing surface runoff and improving water retention in the soil.\"\n    },\n    {\n        \"question\": \"How does the construction of water tanks support agriculture?\",\n        \"answer\": \"Water tanks store water for use during lean seasons, ensuring a consistent water supply for irrigation.\"\n    },\n    {\n        \"question\": \"What are the benefits of using drudgery-prone implements like improved sickles and small threshers?\",\n        \"answer\": \"These implements reduce labor intensity, improve efficiency, and indirectly increase production and income for small farmers.\"\n    },\n    {\n        \"question\": \"Why is the promotion of organic farming and mulching important?\",\n        \"answer\": \"Organic farming and mulching help maintain soil moisture, reduce intercultural operation costs, and minimize the use of chemical inputs.\"\n    },\n    {\n        \"question\": \"How does the promotion of subsidiary occupations like goat and yak rearing benefit farmers?\",\n        \"answer\": \"These occupations provide additional sources of income, diversifying farmers' revenue streams.\"\n    },\n    {\n        \"question\": \"What role does skill development play in improving farmers' livelihoods?\",\n        \"answer\": \"Skill development, especially among women and youth, enhances their ability to engage in value-added activities and improve their income.\"\n    },\n    {\n        \"question\": \"How does the development of mobile apps and e-Marketing support agriculture?\",\n        \"answer\": \"Mobile apps and e-Marketing platforms provide farmers with access to information, market surplus commodities, and improve management and evaluation processes.\"\n    },\n    {\n        \"question\": \"What is the recommended approach for agro-climatic crop planning in different physiographic regions?\",\n        \"answer\": \"Agro-climatic crop planning should be tailored to each region, involving in-depth studies to assess resources, explore cost-effective technologies, and ensure availability of quality inputs.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What should the state government encourage in the Valley floor and plain areas of Jammu region?\",\n        \"answer\": \"The state government should encourage the cultivation of crops that do not compete with each other or can be grown off-season.\"\n    },\n    {\n        \"question\": \"Which areas are best suited for dry farming, horticulture, and fodder crops?\",\n        \"answer\": \"The Karewas of Kashmir and kandi areas of Jammu region are best suited for dry farming, horticulture, and fodder crops.\"\n    },\n    {\n        \"question\": \"What crops should be cultivated in the side valleys?\",\n        \"answer\": \"The side valleys should be earmarked for fodder cultivation and the cultivation of medicinal plants.\"\n    },\n    {\n        \"question\": \"What has been successfully experimented by farmers in the Ladakh region?\",\n        \"answer\": \"Farmers in the Ladakh region have successfully experimented with the cultivation of vegetables in poly greenhouses.\"\n    },\n    {\n        \"question\": \"Which varieties of tomato and onion have shown positive results in Ladakh?\",\n        \"answer\": \"The tomato varieties SL-12, PED, and AC-238, and the N-13 Nasik red onion have shown positive results in production.\"\n    },\n    {\n        \"question\": \"Why is air freight the only viable mode of transport for vegetables from Ladakh?\",\n        \"answer\": \"Air freight is the only viable mode of transport from Ladakh due to its remote location and the need for quick transportation of perishable products.\"\n    },\n    {\n        \"question\": \"What type of crops should the state government encourage in the Kashmir region?\",\n        \"answer\": \"The state government should encourage the production of high-value, low-volume crops like saffron, black zeera, and other spices.\"\n    },\n    {\n        \"question\": \"What potential does the Jhelum river have for fish production?\",\n        \"answer\": \"The Jhelum river, with its extensive tributaries, has enough potential to sustain fish production.\"\n    },\n    {\n        \"question\": \"Which fish species are found in the Indus river system?\",\n        \"answer\": \"The Indus river system has carps, catfishes, and the exotic rainbow and brown trouts.\"\n    },\n    {\n        \"question\": \"What is gaining rapid ground in the tropics and subtropics but not in temperate climates?\",\n        \"answer\": \"Paddy-cum-fish culture is gaining rapid ground in the tropics and subtropics but not in temperate climates.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"Which neighbouring districts of Punjab should be explored for selling fish from the Jammu region?\",\n        \"answer\": \"Gurudaspur, Amritsar, Jalandhar, and Ludhiana.\"\n    },\n    {\n        \"question\": \"What infrastructure support is suggested for the private sector in fish marketing?\",\n        \"answer\": \"Purchase of refrigerated containers or vehicles and working capital.\"\n    },\n    {\n        \"question\": \"What has the Agriculture University of Kashmir researched regarding livestock development?\",\n        \"answer\": \"Converting agricultural waste into cattle feed.\"\n    },\n    {\n        \"question\": \"Why is Jammu and Kashmir suitable for cattle breeding?\",\n        \"answer\": \"It provides a natural suitable climate, unlike other parts of the country where an artificial climate is needed.\"\n    },\n    {\n        \"question\": \"What is the government's role in promoting poultry development?\",\n        \"answer\": \"Encouraging development through modern technology and short-duration projects with NGO involvement.\"\n    },\n    {\n        \"question\": \"How can wool production in Jammu and Kashmir be improved?\",\n        \"answer\": \"By cross-breeding local sheep with fine wool breeds like Kashmir Merino, Russian Merino, Starapol, Caucasian Marino, and Ramboulleit.\"\n    },\n    {\n        \"question\": \"What is a major constraint to dairy development in Jammu and Kashmir?\",\n        \"answer\": \"Feed and fodder, which form 60% of milk production costs, especially during winter in Kashmir and Ladakh.\"\n    },\n    {\n        \"question\": \"What initiative is suggested for sheep cross-breeding in the Valley?\",\n        \"answer\": \"Promoting cross-breeding with Polled Dorst and Corriedale breeds in other areas of the state.\"\n    },\n    {\n        \"question\": \"What is the government's role in water resource management for agriculture?\",\n        \"answer\": \"Delineating water sources, strengthening existing resources, rejuvenating dwindling resources, and creating new ones.\"\n    },\n    {\n        \"question\": \"What is the importance of organic farming in Jammu and Kashmir?\",\n        \"answer\": \"It is promoted as part of state-specific strategies for doubling farmers' income by 2022.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the focus of departments in promoting modern agriculture?\",\n        \"A\": \"The focus is on promoting farm mechanization.\"\n    },\n    {\n        \"Q\": \"Which crops are promoted under High Density Plantation (HDP)?\",\n        \"A\": \"Apple, Almond, Mango, and Guava are promoted under High Density Plantation.\"\n    },\n    {\n        \"Q\": \"What is the purpose of promoting back-yard poultry and exotic hens?\",\n        \"A\": \"The purpose is to enhance laying potential and increase income for farmers.\"\n    },\n    {\n        \"Q\": \"Why is strengthening extension activities important in agriculture?\",\n        \"A\": \"It helps make farmers aware and knowledgeable about modern agricultural practices.\"\n    },\n    {\n        \"Q\": \"What infrastructure is needed to reduce post-harvest losses in agriculture?\",\n        \"A\": \"Infrastructure for transportation, storage, and value addition is needed.\"\n    },\n    {\n        \"Q\": \"What role do R&D facilities in farm universities play?\",\n        \"A\": \"They provide site-specific technical support to farm developmental agencies.\"\n    },\n    {\n        \"Q\": \"What policies should the State Government amend to support agriculture?\",\n        \"A\": \"APMC, land holding ownership, leasing policy, water management policy, and Minimum Support Price policy.\"\n    },\n    {\n        \"Q\": \"What is the impact of the Integrated Farming System (IFS) model?\",\n        \"A\": \"It improves soil health, provides biogas for domestic use, and increases net income significantly.\"\n    },\n    {\n        \"Q\": \"What technologies were adopted by Mohammad Ashraf Mir in the IFS model?\",\n        \"A\": \"Cultivation of high-yielding crops, commercial flower cultivation, backyard poultry, vermi-compost, biogas plant, and scientific fruit crop management.\"\n    },\n    {\n        \"Q\": \"How did Mohammad Musa increase his income through pashmina goat rearing?\",\n        \"A\": \"He started with 10 goats and expanded to 53, generating an income of Rs 2,65,000.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the expected income per family per year from the sale of pashmina and extra animals after 5 years?\",\n        \"answer\": \"The expected income per family per year after 5 years is Rs 45,000.\"\n    },\n    {\n        \"question\": \"What is the expected unit value after 5 years for 50 pashmina sheep?\",\n        \"answer\": \"The expected unit value after 5 years for 50 animals is Rs 2,50,000.\"\n    },\n    {\n        \"question\": \"When was the state of Jharkhand formed?\",\n        \"answer\": \"Jharkhand was formed on November 15th, 2000.\"\n    },\n    {\n        \"question\": \"What is the total geographical area of Jharkhand?\",\n        \"answer\": \"The total geographical area of Jharkhand is 79714 sq. km.\"\n    },\n    {\n        \"question\": \"What percentage of Jharkhand's population is rural?\",\n        \"answer\": \"76% of Jharkhand's population is rural.\"\n    },\n    {\n        \"question\": \"What percentage of Jharkhand's population belongs to the tribal community?\",\n        \"answer\": \"26% of Jharkhand's population belongs to the tribal community.\"\n    },\n    {\n        \"question\": \"What percentage of Jharkhand's geographical area is under forests?\",\n        \"answer\": \"29.33% of Jharkhand's geographical area is under forests.\"\n    },\n    {\n        \"question\": \"What are the three agro-climatic regions of Jharkhand?\",\n        \"answer\": \"The three agro-climatic regions of Jharkhand are Central and North-eastern Plateau (Region-I), Western Plateau (Region-II), and South-eastern Plateau (Region-III).\"\n    },\n    {\n        \"question\": \"What is a key characteristic of Sub Zone IV in Jharkhand?\",\n        \"answer\": \"A key characteristic of Sub Zone IV is the low water retentive capacity of the soil, particularly in uplands.\"\n    },\n    {\n        \"question\": \"What is a major challenge in Sub Zone V of Jharkhand?\",\n        \"answer\": \"A major challenge in Sub Zone V is the late arrival and early cessation of monsoon, along with erratic and uneven distribution of rainfall.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the average annual rainfall in Jharkhand?\",\n        \"answer\": \"The average annual rainfall in Jharkhand is 1289 mm.\"\n    },\n    {\n        \"question\": \"What percentage of rainfall in Jharkhand is received during the monsoon months?\",\n        \"answer\": \"Around 85% of the rainfall in Jharkhand is received during the four monsoon months.\"\n    },\n    {\n        \"question\": \"What are the main types of land in Jharkhand for farming?\",\n        \"answer\": \"The main types of land in Jharkhand for farming are upland (Tanr I & II), medium land (Tanr II and Don III), and low land (Don II and Don I).\"\n    },\n    {\n        \"question\": \"What percentage of Jharkhand's cultivable area is drought-prone?\",\n        \"answer\": \"80% of Jharkhand's cultivable area is drought-prone.\"\n    },\n    {\n        \"question\": \"What are the major challenges faced by the Eastern Plateau & Hills Region-VII?\",\n        \"answer\": \"The major challenges include rain-fed agriculture, moisture stress, drought, soil acidity, iron toxicity, low SRRs, non-availability of electricity, high population growth, poor roads, poor input delivery, and communication infrastructure.\"\n    },\n    {\n        \"question\": \"Which districts fall under the Central and North Eastern Plateau Sub Zone IV?\",\n        \"answer\": \"The districts include Bokaro, Deoghar, Dhanbad, Dumka, Giridih, Godda, Jamtara, Khunti, Koderma, Hazaribagh, Pakur, Ramgarh, Ranchi, and Sahebganj.\"\n    },\n    {\n        \"question\": \"What are the characteristics of the Western Plateau Sub Zone V?\",\n        \"answer\": \"The characteristics include erratic/uneven distribution of rainfall and low water retentive capacity of the soil.\"\n    },\n    {\n        \"question\": \"What percentage of Jharkhand's area is under agricultural wastelands?\",\n        \"answer\": \"30.61% of Jharkhand's area is under agricultural wastelands.\"\n    },\n    {\n        \"question\": \"What institutions are being established by the Jharkhand government to improve agricultural education?\",\n        \"answer\": \"The government is establishing an Agriculture Engineering College at BAU, Ranchi; Dairy College at Godda; Horticulture College at Chaibasa; College at Garhwa; Veterinary College at Jamtara; and Fisheries College at Gumla.\"\n    },\n    {\n        \"question\": \"What is the role of KVKs in Jharkhand?\",\n        \"answer\": \"KVKs (Krishi Vigyan Kendras) are responsible for technology assessment and refinement, demonstrations of locally relevant production technologies, capacity building of farmers and stakeholders, and working in association with ATMA for technology transfer.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What are the major constraints to agricultural productivity in Jharkhand?\",\n        \"A\": \"Major constraints include poor soil conditions, erratic rainfall, low water holding capacity, soil erosion, and high incidence of pests and diseases.\"\n    },\n    {\n        \"Q\": \"What percentage of Jharkhand's cropped area is under irrigation?\",\n        \"A\": \"Only 12% of the cropped area in Jharkhand is under irrigation.\"\n    },\n    {\n        \"Q\": \"What is the net sown area in Jharkhand?\",\n        \"A\": \"The net sown area in Jharkhand is 2.56 million hectares.\"\n    },\n    {\n        \"Q\": \"What are the edaphic challenges faced by Jharkhand's agriculture?\",\n        \"A\": \"Edaphic challenges include soil erosion, shallow soil depth, poor soil fertility, soil pH below 5.5, and deficiencies in nutrients like phosphorus, sulphur, zinc, and copper.\"\n    },\n    {\n        \"Q\": \"How does erratic rainfall affect agriculture in Jharkhand?\",\n        \"A\": \"Erratic rainfall leads to nutrient leaching, poor water retention, and stress on crop productivity and diversification.\"\n    },\n    {\n        \"Q\": \"What climatic factors damage crops in Jharkhand?\",\n        \"A\": \"Hailstorms during spring and summer, low humidity, and temperature conditions damage fruit and vegetable crops and hinder plant multiplication.\"\n    },\n    {\n        \"Q\": \"What are the biotic challenges in Jharkhand's agriculture?\",\n        \"A\": \"Biotic challenges include high incidence of pests like blast, false smut, brown hopper, and diseases like wilt, white rust, and powdery mildew in various crops.\"\n    },\n    {\n        \"Q\": \"What is the extent of soil erosion in Jharkhand?\",\n        \"A\": \"Soil erosion affects 2.3 million hectares annually in Jharkhand, primarily in the form of sheet and gully erosion.\"\n    },\n    {\n        \"Q\": \"What are the nutrient deficiencies in Jharkhand's soils?\",\n        \"A\": \"About 60% of soils are deficient in phosphorus, and there are deficiencies in sulphur, zinc, and copper, along with toxic levels of iron and aluminium.\"\n    },\n    {\n        \"Q\": \"What are the national strategic goals for agricultural development in Jharkhand?\",\n        \"A\": \"The goals include improving food security, enhancing inclusive growth, increasing agricultural competitiveness, sustaining natural resources, managing risks, and developing quality manpower for the sector.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What are the major challenges in fertilizer consumption for agriculture?\",\n        \"answer\": \"The fertilizer consumption is very low, with 33.52 kg/ha of nitrogen, 17.39 kg/ha of phosphorus, and 4.82 kg/ha of potassium. There is also low availability of boronated SSP and slow-release fertilizers.\"\n    },\n    {\n        \"question\": \"What is a significant issue in dry land agriculture?\",\n        \"answer\": \"A significant issue is the lack of suitable high-yielding crop varieties for large acreages under dry land agriculture.\"\n    },\n    {\n        \"question\": \"What contributes to inefficient agricultural production?\",\n        \"answer\": \"Poor crop management, low input use, and inadequate crop planning contribute to inefficient production.\"\n    },\n    {\n        \"question\": \"What is a consequence of the absence of watershed management systems?\",\n        \"answer\": \"The absence of appropriate watershed management systems leads to wastage of rainwater.\"\n    },\n    {\n        \"question\": \"What are the health hazards associated with indiscriminate use of insecticides and fungicides?\",\n        \"answer\": \"Indiscriminate use of insecticides and fungicides, especially in vegetable cultivation, poses health hazards.\"\n    },\n    {\n        \"question\": \"Why is there poor adoption of modern agro-technology?\",\n        \"answer\": \"Poor adoption is due to inappropriate technology, lack of awareness among farmers, and poor access to research institutions.\"\n    },\n    {\n        \"question\": \"What are the key issues with input availability in agriculture?\",\n        \"answer\": \"Key issues include low irrigation coverage (12%), low seed replacement rates for crops like paddy (16%), maize (12%), pulses (13%), and oilseeds (30%), and inadequate availability of seed and planting material.\"\n    },\n    {\n        \"question\": \"What is the economic status of a significant portion of farmers?\",\n        \"answer\": \"31.8% of the population of farmers are economically constrained and fall below the poverty line (BPL).\"\n    },\n    {\n        \"question\": \"What are the challenges in agricultural infrastructure?\",\n        \"answer\": \"Challenges include low credit and insurance coverage, inadequate infrastructure, poor roads, communication, power supply, storage, processing, and marketing facilities.\"\n    },\n    {\n        \"question\": \"What opportunities exist for improving water use in agriculture?\",\n        \"answer\": \"The state receives an average annual rainfall of 1300 mm, providing an opportunity for better water use through water conservation technologies. Currently, only about 20% of rainwater is utilized.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What crops are predominantly grown in Jharkhand?\",\n        \"answer\": \"Rice is the major crop, occupying about 70% of the area in kharif, while the remaining 30% is covered under maize, pigeon-pea, horse gram (kulthi), and vegetables.\"\n    },\n    {\n        \"question\": \"What is the cropping intensity in Jharkhand?\",\n        \"answer\": \"The cropping intensity in Jharkhand is very low, at 116%.\"\n    },\n    {\n        \"question\": \"What percentage of Jharkhand's net sown area is rain-fed?\",\n        \"answer\": \"75% of the net sown area in Jharkhand is rain-fed.\"\n    },\n    {\n        \"question\": \"What is the water productivity in Jharkhand?\",\n        \"answer\": \"The water productivity in Jharkhand is very low, at 0.26 kg/m³.\"\n    },\n    {\n        \"question\": \"How much of the available groundwater does Jharkhand utilize?\",\n        \"answer\": \"Jharkhand utilizes only 1.09 BCM out of 5.25 BCM available groundwater, which is approximately 20%.\"\n    },\n    {\n        \"question\": \"What is the current per capita availability of food grains in Jharkhand?\",\n        \"answer\": \"The current per capita availability of food grains in Jharkhand is 250 g/day.\"\n    },\n    {\n        \"question\": \"What are the main constraints in the Central and North Eastern Plateau Sub Zone IV of Jharkhand?\",\n        \"answer\": \"The main constraints are low availability of hybrid/HYV/quality seed, acidic soils, and imbalanced use of fertilizer for hybrids.\"\n    },\n    {\n        \"question\": \"What is the target for increasing the production of location-specific hybrid seeds in Jharkhand?\",\n        \"answer\": \"The target is to increase production from 3750 tons to 6750 tons to expand the area under cultivation from 2 lakh ha to 4 lakh ha.\"\n    },\n    {\n        \"question\": \"What is the recommended nutrient ratio for hybrid rice in Jharkhand?\",\n        \"answer\": \"The recommended nutrient ratio for hybrid rice is 150:70:90 to 100:50:60 for NPK.\"\n    },\n    {\n        \"question\": \"What are the challenges related to forest resources in Jharkhand?\",\n        \"answer\": \"Challenges include deforestation, over-grazing by livestock, loss of wetlands due to siltation, and exploitation of forests, which put tremendous pressure on plant biodiversity.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"Why is lime application recommended in agriculture?\",\n        \"A\": \"Lime application is recommended to improve soil health and enhance the effectiveness of fertilizers.\"\n    },\n    {\n        \"Q\": \"What is the target increase in the area under SRI cultivation?\",\n        \"A\": \"The target is to increase the area under SRI cultivation from 0.75 lakh ha to 1.5 lakh ha.\"\n    },\n    {\n        \"Q\": \"Why is diversification of rice cropping systems necessary in medium upland areas?\",\n        \"A\": \"Diversification is necessary because rice cultivation is not remunerative due to higher incidences of pests and diseases like pod borer and wilt.\"\n    },\n    {\n        \"Q\": \"Which crops are recommended for diversification in rice cropping systems?\",\n        \"A\": \"Maize, Pigeon-pea, Sorghum, and Pearl Millet are recommended for diversification.\"\n    },\n    {\n        \"Q\": \"What method of sowing is recommended for identified crops?\",\n        \"A\": \"Sowing in the ridge and furrow method is recommended.\"\n    },\n    {\n        \"Q\": \"What are the benefits of introducing early maturing and high-yielding HYVs/hybrids?\",\n        \"A\": \"They increase productivity and ensure better crop yields.\"\n    },\n    {\n        \"Q\": \"What is the recommended INM module for crops?\",\n        \"A\": \"The recommended INM module includes 25% RDF through organic and 75% through chemical fertilizers.\"\n    },\n    {\n        \"Q\": \"Why is rice cultivation less remunerative in upland areas?\",\n        \"A\": \"Rice cultivation is less remunerative due to poor management of uplands and acidic soil conditions.\"\n    },\n    {\n        \"Q\": \"What steps are being taken to improve vegetable cultivation?\",\n        \"A\": \"Steps include increasing the area under HYV/hybrid vegetable cultivation, producing quality seeds, and promoting drip irrigation with INM.\"\n    },\n    {\n        \"Q\": \"Which varieties are recommended for rainy season tomato cultivation?\",\n        \"A\": \"SwarnaLalima and Swarna Sampada F1 are recommended for rainy season tomato cultivation.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What percentage of the net area sown in the state is accounted for by fruits?\",\n        \"answer\": \"Fruits account for 6.01% of the net area sown in the state.\"\n    },\n    {\n        \"question\": \"Why do traditional orchards suffer from low productivity?\",\n        \"answer\": \"Traditional orchards suffer from low productivity due to the poor quality of planting material.\"\n    },\n    {\n        \"question\": \"What is the target area for promoting mango-based multitier systems in Sub zone VI?\",\n        \"answer\": \"The target area for promoting mango-based multitier systems in Sub zone VI is from 1000 ha to 2000 ha.\"\n    },\n    {\n        \"question\": \"What is the current per capita availability of fish in Jharkhand?\",\n        \"answer\": \"The per capita availability of fish in Jharkhand is 22 g/day.\"\n    },\n    {\n        \"question\": \"What are the main constraints in the fisheries sector of Jharkhand?\",\n        \"answer\": \"The main constraints are rain-fed ponds, old and silted seasonal tanks and ponds, lack of quality brood fish, economically weak stakeholders reluctant to use factory formulated feed, and climate not very suitable for diversification of aquaculture.\"\n    },\n    {\n        \"question\": \"What is the target for fish production in Jharkhand?\",\n        \"answer\": \"The target is to increase fish production from 2.00 to 2.60 lakh tons.\"\n    },\n    {\n        \"question\": \"What is the main constraint in poultry productivity in Jharkhand?\",\n        \"answer\": \"The main constraint is low egg and meat productivity of native birds and poor management practices under backyard conditions.\"\n    },\n    {\n        \"question\": \"What are the steps to improve poultry productivity in Jharkhand?\",\n        \"answer\": \"Steps include promotion of improved breeds of chicken, improved management practices for backyard poultry, and ensuring availability of improved varieties of chicken.\"\n    },\n    {\n        \"question\": \"What is the meat productivity of Black Bengal Goat in Jharkhand?\",\n        \"answer\": \"The meat productivity of Black Bengal Goat is 8.64 kg per animal per year.\"\n    },\n    {\n        \"question\": \"What measures are proposed to improve goatry in Jharkhand?\",\n        \"answer\": \"Measures include the introduction, conservation, and promotion of pure productive Black Bengal goats, and mass vaccination and de-worming to reduce mortality to 5%.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the productivity of desi pigs under extensive/semi-intensive management?\",\n        \"answer\": \"The productivity of desi pigs under extensive/semi-intensive management is 27 kg/animal/year.\"\n    },\n    {\n        \"question\": \"What is the productivity of Jharsuk Pig?\",\n        \"answer\": \"The productivity of Jharsuk Pig is 60-70 kg/animal/year.\"\n    },\n    {\n        \"question\": \"What percentage of the total cattle population in Jharkhand is exotic/crossbred cattle?\",\n        \"answer\": \"Exotic/crossbred cattle constitute less than 3% of the total cattle population in Jharkhand.\"\n    },\n    {\n        \"question\": \"What are the major constraints in dairy farming in Jharkhand?\",\n        \"answer\": \"The major constraints are poor outreach of veterinary services, inbreeding and poor management practices, and scarcity of fodder and processing units.\"\n    },\n    {\n        \"question\": \"What is the target increase in milk productivity for crossbred cattle in Jharkhand?\",\n        \"answer\": \"The target is to increase milk productivity from 6.0 kg/animal/day to 7.0 kg/animal/day.\"\n    },\n    {\n        \"question\": \"What is the current milk production of indigenous cattle in Jharkhand?\",\n        \"answer\": \"The current milk production of indigenous cattle in Jharkhand is 1.7 kg/day/cow.\"\n    },\n    {\n        \"question\": \"What is the per capita availability of milk in Jharkhand compared to the national level?\",\n        \"answer\": \"The per capita availability of milk in Jharkhand is 159 gm, compared to 263 gm at the national level.\"\n    },\n    {\n        \"question\": \"What are the steps to improve milk productivity in indigenous cattle?\",\n        \"answer\": \"Steps include artificial insemination with Sahiwal, Red Sindhi, Gir, and Tharparkar breeds, oestrus synchronization, and awareness and capacity building of dairy farmers.\"\n    },\n    {\n        \"question\": \"How does farm mechanization impact agricultural productivity in Jharkhand?\",\n        \"answer\": \"Farm mechanization increases productivity by 12 to 34%.\"\n    },\n    {\n        \"question\": \"What is the distribution of farm power sources in Jharkhand?\",\n        \"answer\": \"The major share of farm power is animate energy (54%), followed by mechanical (43%) and electrical (3%).\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What percentage of farmers in the region are small and marginal?\",\n        \"answer\": \"84% of the farmers are small and marginal.\"\n    },\n    {\n        \"question\": \"What organizations are involved in the demonstration of improved agricultural implements and machinery?\",\n        \"answer\": \"KVKs, SAMETI, ATMA, NFSM, NHM, and MIDH are involved in the demonstration of improved agricultural implements and machinery.\"\n    },\n    {\n        \"question\": \"How many agricultural implement banks are planned to be established in each panchayat?\",\n        \"answer\": \"3 agricultural implement banks are planned in each panchayat.\"\n    },\n    {\n        \"question\": \"What is the geographical area fit for agro-forestry activities in the region?\",\n        \"answer\": \"About 30% of the geographical area, i.e., 24 lakh hectares, is fit for agro-forestry activities.\"\n    },\n    {\n        \"question\": \"What are the main constraints for agro-forestry in the region?\",\n        \"answer\": \"The main constraints are poor nutrient status of degraded lands and the non-existence of wood/bamboo-based industries.\"\n    },\n    {\n        \"question\": \"Which state is the leading producer of lac in India?\",\n        \"answer\": \"Jharkhand is the leading state in lac production, contributing to 60% of national production.\"\n    },\n    {\n        \"question\": \"What percentage of total farm income comes from lac cultivation in major lac-growing areas?\",\n        \"answer\": \"25-32% of total farm income in major lac-growing areas comes from lac cultivation.\"\n    },\n    {\n        \"question\": \"How many families are provided livelihood by the tasar silk industry?\",\n        \"answer\": \"The tasar silk industry provides livelihood to nearly 3.5 lakh families.\"\n    },\n    {\n        \"question\": \"What is the proposed area to be brought into cultivable land from current fallow?\",\n        \"answer\": \"It is proposed to bring 2.10 lakh hectares of current fallow into cultivable land.\"\n    },\n    {\n        \"question\": \"What is the recommended approach to convert wasteland to cropped area?\",\n        \"answer\": \"Watershed-based development is recommended to convert wasteland to cropped area.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What measures are proposed to convert waste land into cultivable land?\",\n        \"A\": \"Watershed development, bunding, land terracing, moisture conservation measures, and water harvesting links are proposed to convert waste land into cultivable land.\"\n    },\n    {\n        \"Q\": \"What are the main soil issues in the state?\",\n        \"A\": \"The soil suffers from extreme to high acidity, low to medium organic carbon, low available nitrogen, phosphorus, potassium, sulphur, zinc deficiency, and boron deficiency.\"\n    },\n    {\n        \"Q\": \"What is recommended for water resource development in plateau areas?\",\n        \"A\": \"Micro level water resource development through tank cum well system is recommended for plateau areas with a slope of 2 to 5%.\"\n    },\n    {\n        \"Q\": \"What is the purpose of check-dams in water management?\",\n        \"A\": \"Check-dams are built across the direction of water flow on shallow rivers and streams for water harvesting.\"\n    },\n    {\n        \"Q\": \"How can farm ponds improve water management?\",\n        \"A\": \"Farm ponds constructed at the lower side of fields channelize runoff from higher fields, improving water storage and management.\"\n    },\n    {\n        \"Q\": \"What is the importance of Soil Health Cards?\",\n        \"A\": \"Soil Health Cards provide farmers with information on pH, nutrient status, soil depth, texture, structure, and organic matter, helping them manage soil health effectively.\"\n    },\n    {\n        \"Q\": \"What is the current Seed Replacement Rate (SRR) and what is the target?\",\n        \"A\": \"The current SRR is around 10-15%, with a target to increase it to 30% initially and eventually to 50 or 75% by the end of the current plan.\"\n    },\n    {\n        \"Q\": \"How can the state improve seed availability?\",\n        \"A\": \"The state can assist in forming seed villages, supply foundation seeds, and provide infrastructure for seed production and processing.\"\n    },\n    {\n        \"Q\": \"What is the role of public-private partnerships in seed production?\",\n        \"A\": \"State seed farms can be utilized in a public-private partnership mode for seed production.\"\n    },\n    {\n        \"Q\": \"What is proposed for animal health improvement?\",\n        \"A\": \"New or strengthening AI Centers are proposed, with one AI Center per district to improve animal health services.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the proposed ratio of community pasture land per 50000 Adult Cattle Units?\",\n        \"answer\": \"One per 50000 Adult Cattle Units.\"\n    },\n    {\n        \"question\": \"What is the estimated share of electricity consumption for agricultural purposes in the state compared to the all India average?\",\n        \"answer\": \"The state's share is 0.62%, while the all India average is 20.95%.\"\n    },\n    {\n        \"question\": \"What are the six principles of the System of Rice Intensification (SRI)?\",\n        \"answer\": \"(i) Use of 10-12 days seedlings, (ii) Seedlings raised on MAT nursery, (iii) Transplanted single seedling, (iv) Use of organic manures 10t/ha, (v) 4 times weeding using cono-weeder at 10 days interval, (vi) Alternate wetting and drying.\"\n    },\n    {\n        \"question\": \"What is the spacing used for transplanting single seedlings in the System of Rice Intensification (SRI)?\",\n        \"answer\": \"25 X 25 cm spacing.\"\n    },\n    {\n        \"question\": \"How much higher grain yield does the System of Rice Intensification (SRI) provide compared to conventional rice cultivation?\",\n        \"answer\": \"10.15% higher grain yield (5032 kg/ha compared to 4568 kg/ha).\"\n    },\n    {\n        \"question\": \"What is the benefit-cost ratio (BC ratio) of the System of Rice Intensification (SRI) compared to conventional rice cultivation?\",\n        \"answer\": \"2.04 for SRI compared to 1.37 for conventional method.\"\n    },\n    {\n        \"question\": \"What are the benefits of conservation agriculture in maize-wheat cropping systems?\",\n        \"answer\": \"It offsets production costs, increases moisture infiltration, reduces erosion, improves water use efficiency, and forms more stable soil aggregate structure.\"\n    },\n    {\n        \"question\": \"How does conservation agriculture affect sowing dates and crop emergence?\",\n        \"answer\": \"It advances the sowing date, ensures proper seed placement, early emergence, and availability of higher nutrient and moisture content.\"\n    },\n    {\n        \"question\": \"What is the recommended fertilizer dose for rice in the System of Rice Intensification (SRI)?\",\n        \"answer\": \"100:50:25 kg N: P2O5: K2O/ha, with ½ dose of nitrogen + full dose of phosphorus and ¾ dose of potash applied at sowing, and the remaining ½ dose of nitrogen and ¼ dose of potash applied at panicle initiation stage.\"\n    },\n    {\n        \"question\": \"How does the System of Rice Intensification (SRI) benefit rural youth?\",\n        \"answer\": \"It generates employment through the use of cono-weeder and markers.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the percentage increase in grain yield of maize under permanent narrow bed compared to conventional tillage?\",\n        \"answer\": \"20.33%\"\n    },\n    {\n        \"question\": \"What is the grain yield of wheat under permanent narrow bed conservation agriculture?\",\n        \"answer\": \"5371 kg/ha\"\n    },\n    {\n        \"question\": \"What is the B:C ratio in permanent narrow bed conservation agriculture?\",\n        \"answer\": \"2.19\"\n    },\n    {\n        \"question\": \"What percentage of Karnataka's total geographical area is covered under forests?\",\n        \"answer\": \"16%\"\n    },\n    {\n        \"question\": \"What is the total cropped area in Karnataka?\",\n        \"answer\": \"122.47 lakh ha\"\n    },\n    {\n        \"question\": \"What is the cropping intensity of Karnataka?\",\n        \"answer\": \"121.93%\"\n    },\n    {\n        \"question\": \"What percentage of Karnataka's total geographical area is cultivable waste?\",\n        \"answer\": \"2.15%\"\n    },\n    {\n        \"question\": \"What is the per hectare rice production in India compared to China?\",\n        \"answer\": \"India produces 3.6 tonnes per hectare compared to 6.7 tonnes in China.\"\n    },\n    {\n        \"question\": \"What is the yield gap percentage for bajra in Karnataka?\",\n        \"answer\": \"30%\"\n    },\n    {\n        \"question\": \"What is the average yield of paddy at the farm level in Karnataka for 2014-15?\",\n        \"answer\": \"4534 kg/ha\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"Which state has the second-largest area under rainfed agriculture in India?\",\n        \"answer\": \"Karnataka\"\n    },\n    {\n        \"question\": \"How many blocks in Karnataka were declared drought-hit during 2016-17?\",\n        \"answer\": \"Over 140 blocks\"\n    },\n    {\n        \"question\": \"What is the percentage increase in production for Sorghum from 150 to 1392?\",\n        \"answer\": \"27.23%\"\n    },\n    {\n        \"question\": \"What is the goal of the 'Doubling the Farmer's Income' initiative?\",\n        \"answer\": \"To double the income of farmers within a given time frame\"\n    },\n    {\n        \"question\": \"What percentage of the consumer rupee should farmers ideally receive to make farming profitable?\",\n        \"answer\": \"55-60%\"\n    },\n    {\n        \"question\": \"What are the three main strategies for doubling farmers' income in Karnataka?\",\n        \"answer\": \"Improved production, value addition, and institutional innovations\"\n    },\n    {\n        \"question\": \"What percentage of income increase can be achieved through improved production and agricultural technology?\",\n        \"answer\": \"30%\"\n    },\n    {\n        \"question\": \"What is the percentage increase in production for Maize from 5126 to 6001?\",\n        \"answer\": \"14.58%\"\n    },\n    {\n        \"question\": \"What challenges are associated with increasing farmers' share in the consumer price?\",\n        \"answer\": \"Market reforms, grading and processing infrastructure, and technology-led solutions\"\n    },\n    {\n        \"question\": \"What sectors are covered under a robust agricultural insurance product?\",\n        \"answer\": \"Crop, livestock, fishery, horticulture, and sericulture\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What is the focus of the North Eastern Transition Zone for doubling farmer's income?\",\n        \"answer\": \"The focus includes protective irrigation for pulse production, minimal processing of Dal, integration of small ruminants, bio-ethanol production from sugarcane, dryland horticulture, intercropping in sugarcane, crop cultivation with cash crops, and promotion of mango cultivation.\"\n    },\n    {\n        \"question\": \"What strategies are suggested for the North Eastern Dry Zone?\",\n        \"answer\": \"Strategies include integrated crop management in Red gram and Bengal gram, establishment of mini Dal mills, processing and packing industries, rainwater harvesting, hi-tech horticulture, integrated crop management in cotton and floriculture, reclamation of problematic soils, replacing rice with floriculture, processing of papaya, pomegranate, and fig, expanding irrigation facilities, promoting FPOs of oilseed growers, and integrating small ruminants with rainfed farming.\"\n    },\n    {\n        \"question\": \"How does the Northern Dry Zone plan to augment groundwater?\",\n        \"answer\": \"Through watershed development.\"\n    },\n    {\n        \"question\": \"What crops are suggested for intercropping in orchards in the Northern Dry Zone under dry conditions?\",\n        \"answer\": \"Greengram, Cowpea, Horse gram, sunflower, and millets.\"\n    },\n    {\n        \"question\": \"What are the key activities for the Central Dry Zone?\",\n        \"answer\": \"Soil and moisture conservation, rainwater harvesting through watershed approach, dry land horticulture, large scale production of short duration crops, small ruminant and poultry production, enhancing yield potential of maize and cotton, introduction of efficient intercrops in arecanut plantation, increasing compost/manure production, and cultivation of medicinal/aromatic plants.\"\n    },\n    {\n        \"question\": \"What is the significance of integrating small ruminants in agriculture?\",\n        \"answer\": \"It helps in diversifying income sources and utilizing agricultural by-products effectively.\"\n    },\n    {\n        \"question\": \"How is bio-ethanol production integrated into the agricultural strategy?\",\n        \"answer\": \"By utilizing sugarcane cultivation for bio-ethanol production.\"\n    },\n    {\n        \"question\": \"What role does rainwater harvesting play in agricultural strategies?\",\n        \"answer\": \"It ensures water availability for irrigation, especially in dry zones, enhancing crop yields.\"\n    },\n    {\n        \"question\": \"What is the purpose of establishing mini Dal mills at the Panchayat level?\",\n        \"answer\": \"To facilitate primary value addition of pulses at the local level.\"\n    },\n    {\n        \"question\": \"How does the strategy address soil fertility improvement?\",\n        \"answer\": \"By increasing compost/manure production and reclaiming problematic soils.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What are some alternate land-use systems for arable lands mentioned in the text?\",\n        \"answer\": \"Agri-horti system for arable lands (mango, sapota, tamarind, jack fruit etc.).\"\n    },\n    {\n        \"question\": \"What crops are included in dryland vegetables?\",\n        \"answer\": \"Chillies, beans, brinjal, tomato, cluster bean, gourds etc.\"\n    },\n    {\n        \"question\": \"What livestock components are mentioned in the text?\",\n        \"answer\": \"Dairy, sheep, piggery, rabbitry.\"\n    },\n    {\n        \"question\": \"What is the focus of watershed development in the Southern Dry Zone?\",\n        \"answer\": \"Augmenting surface and groundwater.\"\n    },\n    {\n        \"question\": \"What water-saving irrigation methods are mentioned for ginger and turmeric?\",\n        \"answer\": \"Cost-saving planting methods for irrigated ginger and turmeric.\"\n    },\n    {\n        \"question\": \"What exotic fruits are promoted in the Southern Transition Zone?\",\n        \"answer\": \"Rambutan, avocado, etc.\"\n    },\n    {\n        \"question\": \"What is the focus of watershed development in the Northern Transition Zone?\",\n        \"answer\": \"Soil and water conservation.\"\n    },\n    {\n        \"question\": \"What is promoted in the Hilly Zone for agro-eco tourism?\",\n        \"answer\": \"Hi-tech horticulture and exotic fruits and orchids.\"\n    },\n    {\n        \"question\": \"What is the focus of rain-shelter horticulture in the Coastal Zone?\",\n        \"answer\": \"Value addition for export.\"\n    },\n    {\n        \"question\": \"What is the purpose of promoting intercropping in mango and sapota orchards?\",\n        \"answer\": \"Intercropping with legumes and vegetables to enhance productivity.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What are some traditional water storage structures mentioned in the text?\",\n        \"answer\": \"The text mentions the strengthening of traditional water storage structures but does not specify their names.\"\n    },\n    {\n        \"question\": \"How can the productivity of livestock be improved?\",\n        \"answer\": \"The text mentions improving the productivity of livestock but does not provide specific methods.\"\n    },\n    {\n        \"question\": \"What are some methods of brackish water aquaculture mentioned?\",\n        \"answer\": \"Brackish water aquaculture methods include backwater cage culture and the bioflock method of prawn culture.\"\n    },\n    {\n        \"question\": \"What is used for feeding in cage culture according to the text?\",\n        \"answer\": \"Fish dressing waste is used for feeding in cage culture.\"\n    },\n    {\n        \"question\": \"What is mentioned about high-density cashew plantations?\",\n        \"answer\": \"The text mentions high-density cashew plantations but does not provide further details.\"\n    },\n    {\n        \"question\": \"What is the role of agricultural technology in doubling farmers' income?\",\n        \"answer\": \"Agricultural technology helps bridge yield gaps, enhance productivity and profitability, minimize risk, and improve livelihoods.\"\n    },\n    {\n        \"question\": \"What are some improved crop varieties developed by State Agricultural Universities in Karnataka?\",\n        \"answer\": \"Improved varieties include Paddy (GGV-05-01, IET 19251, GNV-10-89), Pigeonpea (TS-3R, GRG-811), Greengram (BGS-9), Chickpea (GBM-2), Sunflower (RSFH-1887, RSFH-130), and Cotton (SCS-793, SHH-818).\"\n    },\n    {\n        \"question\": \"What are the advantages of Direct Seeded Rice (DSR) over transplanted rice?\",\n        \"answer\": \"DSR requires 17-35% less water, allows timely sowing, uses less seed (8-10 kg/acre), eliminates puddling, saves energy (diesel 8-10 l/acre), reduces fertilizer use by 25-30%, lowers cultivation costs, and increases net returns by Rs. 7,000-8,000/acre.\"\n    },\n    {\n        \"question\": \"What are the components of the rainfed integrated farming system model?\",\n        \"answer\": \"Components include crops (Pigeonpea+Navane/greengram, clusterbean-jowar, clusterbean-safflower), vegetables (Amaranthus, pundi, palak, chilli, onion), animal husbandry (female and male goats), Azolla unit, silo-pits, and drumstick and Karileaf on bunds.\"\n    },\n    {\n        \"question\": \"What are the components of the irrigated integrated farming system model?\",\n        \"answer\": \"Components include crops (Bt-cotton, maize, chickpea), vegetables (Amaranthus, pundi, palak, tomato, chilli, avare), and animal husbandry (female and male goats).\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What types of crossbreed cows are mentioned in the text?\",\n        \"A\": \"The text mentions 2 crossbreed cows.\"\n    },\n    {\n        \"Q\": \"How many poultry birds are mentioned in the text?\",\n        \"A\": \"The text mentions 50 poultry birds.\"\n    },\n    {\n        \"Q\": \"What crops are included in the home garden?\",\n        \"A\": \"The home garden includes banana, avare, and drumstick.\"\n    },\n    {\n        \"Q\": \"What is the purpose of using a biodigester tank in vermicompost?\",\n        \"A\": \"The biodigester tank is used for vermicomposting.\"\n    },\n    {\n        \"Q\": \"What crops are grown on bunds?\",\n        \"A\": \"Perennial grasses, Hybrid Napier, and Guinea grass are grown on bunds.\"\n    },\n    {\n        \"Q\": \"What is the potential income increase due to the use of growth regulators in pulses?\",\n        \"A\": \"The potential income increase is 10%.\"\n    },\n    {\n        \"Q\": \"What is the purpose of Pulse Magic?\",\n        \"A\": \"Pulse Magic is used to manage flower and pod drop and enhance yield in Redgram.\"\n    },\n    {\n        \"Q\": \"What is the potential income increase due to the adoption of climate-resilient maize hybrids?\",\n        \"A\": \"The potential income increase is 20%.\"\n    },\n    {\n        \"Q\": \"What is the yield increase in cashew under ultra-density planting technique?\",\n        \"A\": \"About 3-4 tons of nut yield per hectare can be harvested in the early stage of orchard life.\"\n    },\n    {\n        \"Q\": \"What is the income increase in mango high-density planting due to the use of vigour regulating rootstock and growth retardants?\",\n        \"A\": \"The income increases by 150%.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What percentage of the total cultivable area in the state is dedicated to horticulture production?\",\n        \"A\": \"About 16% of the total cultivable area is dedicated to horticulture production.\"\n    },\n    {\n        \"Q\": \"Which types of crops are included in horticulture production in the state?\",\n        \"A\": \"Horticulture production includes plantation crops (45%), vegetables (23%), fruits (20%), spices (10%), and other commercial crops like flowers, medicinal, and aromatic plants (2%).\"\n    },\n    {\n        \"Q\": \"What was the production of fruits in the state during the year 2013-14?\",\n        \"A\": \"The state produced 66.26 Lakh MT of fruits during the year 2013-14.\"\n    },\n    {\n        \"Q\": \"What percentage of fruits and vegetables in Karnataka is currently being processed for value addition?\",\n        \"A\": \"Only about 1% of the total production of fruits and vegetables is currently being processed for value addition.\"\n    },\n    {\n        \"Q\": \"What is the estimated post-harvest loss percentage in Karnataka due to inadequate facilities?\",\n        \"A\": \"About 25–30% of post-harvest loss is estimated due to inadequate cold storage, transport, poor handling, insufficient processing, and other value addition facilities.\"\n    },\n    {\n        \"Q\": \"What is the estimated annual cost of wastage in the production of fruits and vegetables in India?\",\n        \"A\": \"The cost of wastage is estimated at Rs. 23,000 crores on an annual basis.\"\n    },\n    {\n        \"Q\": \"How many cold storage units are currently available in Karnataka for handling fruits and vegetables?\",\n        \"A\": \"There are 98 cold storage units in Karnataka, with a total capacity of 2.97 Lakh MT.\"\n    },\n    {\n        \"Q\": \"What is the potential income increase for cashew farmers if they adopt small-scale processing?\",\n        \"A\": \"The overall returns for cashew farmers could increase by 50-60% if they adopt small-scale processing.\"\n    },\n    {\n        \"Q\": \"What is the yield potential of cashew under ultra-high-density planting?\",\n        \"A\": \"About 3-4 tonnes of nut yield per hectare can be harvested in the early stage of orchard life from ultra-high-density orchards.\"\n    },\n    {\n        \"Q\": \"What is the potential income increase due to the ultra-high-density planting technique?\",\n        \"A\": \"The potential income increase due to ultra-high-density planting is 100–200%.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"question\": \"What types of intercrops can be grown in widely spaced cashew plantations?\",\n        \"answer\": \"Locally important marketable vegetables, pulses, and medicinal plants can be grown as intercrops.\"\n    },\n    {\n        \"question\": \"How many high-yielding cashew varieties have been released for cultivation?\",\n        \"answer\": \"43 high-yielding cashew varieties have been released and recommended for cultivation.\"\n    },\n    {\n        \"question\": \"What are some of the cashew hybrids under evaluation for release?\",\n        \"answer\": \"H-130, H-126, H-32/4, NRC 493, and NRC 301 are some of the hybrids under evaluation.\"\n    },\n    {\n        \"question\": \"What value-added products have been standardized from cashew apple?\",\n        \"answer\": \"Cashew apple juice (RTS), jelly, jam, halwa, and cider (low alcoholic beverage) have been standardized.\"\n    },\n    {\n        \"question\": \"How can cashew farmers increase their overall returns?\",\n        \"answer\": \"By adopting small-scale processing of cashew nuts themselves, farmers can increase their overall returns.\"\n    },\n    {\n        \"question\": \"What is the potential income increase from converting wastelands into cashew orchards?\",\n        \"answer\": \"The potential income increase is 50–60%.\"\n    },\n    {\n        \"question\": \"What is Arka Saka Nivarak used for?\",\n        \"answer\": \"Arka Saka Nivarak is used to control spongy tissue in Alphonso mango.\"\n    },\n    {\n        \"question\": \"What is the potential income increase from using IPM for major pests?\",\n        \"answer\": \"The potential income increase is 20–25%.\"\n    },\n    {\n        \"question\": \"What is the benefit of planting recently developed flower and vegetable varieties by ICAR-IIHR?\",\n        \"answer\": \"The income can increase by 2–4 times.\"\n    },\n    {\n        \"question\": \"What is the potential income increase from using PHM technologies for fruits like mango and guava?\",\n        \"answer\": \"The potential income increase is 30–75%.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the purpose of bringing beneficiaries of Krishi Bhagya Yojana on a common platform?\",\n        \"A\": \"To educate them for profitable use of the structures for protected cultivation.\"\n    },\n    {\n        \"Q\": \"What is minimal processing of fresh fruits and vegetables?\",\n        \"A\": \"It involves minimal handling and processing to maintain freshness and quality.\"\n    },\n    {\n        \"Q\": \"What is Modified Atmosphere Packaging (MAP)?\",\n        \"A\": \"It is a packaging technique that alters the atmosphere inside the package to extend the shelf life of fresh produce.\"\n    },\n    {\n        \"Q\": \"What are low-cost or no-cost technologies for pest management?\",\n        \"A\": \"They include prevention practices, traps, curative methods, trap cropping, and biological control.\"\n    },\n    {\n        \"Q\": \"What are some examples of value addition, packing, and marketing techniques?\",\n        \"A\": \"Examples include tetra packaging, bamboo mat holed boxes, polypropylene boxes, corrugated fibre board, and vacuum packaging.\"\n    },\n    {\n        \"Q\": \"How can organic practices reduce the cost of cultivation?\",\n        \"A\": \"By adopting crop diversity, soil management, weed management, controlling other organisms, and integrating livestock.\"\n    },\n    {\n        \"Q\": \"What is Low External Input and Sustainable Agriculture (LEISA)?\",\n        \"A\": \"It is a farming approach that minimizes external inputs and focuses on sustainable practices.\"\n    },\n    {\n        \"Q\": \"What technologies enhance production per unit area?\",\n        \"A\": \"Technologies include Per Drop More Crop, GM Technologies, Hi-tech horticulture, Precision Farming, and Hybrid seed production.\"\n    },\n    {\n        \"Q\": \"What are Agri-Horti-Silvi practices?\",\n        \"A\": \"They include Horti-silvi-livestock, Agri-silvi-horticulture, Agri-horti-silviculture, and Agri-horticulture.\"\n    },\n    {\n        \"Q\": \"What are the key marketing channels for agricultural products?\",\n        \"A\": \"They include direct to consumers, regulated markets, cooperative marketing societies, commodity groups, and direct channels from farmers to processors or bulk consumers.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the rank of Karnataka in cattle and buffalo population in India?\",\n        \"A\": \"Karnataka is the 9th largest state in cattle and buffalo population in India.\"\n    },\n    {\n        \"Q\": \"What percentage of the total livestock population in India does Karnataka account for?\",\n        \"A\": \"Karnataka accounts for 4.3% of the total livestock population in India.\"\n    },\n    {\n        \"Q\": \"What was the share of the livestock sector in the gross state domestic product of agriculture and allied activities in Karnataka during 2014-15?\",\n        \"A\": \"The share of the livestock sector was 20.27% during 2014-15.\"\n    },\n    {\n        \"Q\": \"What is the annual economic loss in India due to foot-and-mouth disease (FMD) in livestock?\",\n        \"A\": \"India loses approximately Rs 18,000 crore annually due to foot-and-mouth disease (FMD) in livestock.\"\n    },\n    {\n        \"Q\": \"What are the indirect losses due to foot-and-mouth disease (FMD) in livestock annually?\",\n        \"A\": \"The indirect losses due to FMD are estimated to be between Rs 30,000 to Rs 35,000 crores annually.\"\n    },\n    {\n        \"Q\": \"What are some technological options offered by research institutes to raise livestock productivity?\",\n        \"A\": \"Technological options include genetic enhancement of indigenous breeds, improvement of feed and fodder quality, development of vaccines, improved livestock management practices, and post-harvest management.\"\n    },\n    {\n        \"Q\": \"How much can clean milk production and control of subclinical mastitis increase farmers' income?\",\n        \"A\": \"Clean milk production and control of subclinical mastitis can increase farmers' income by 40%.\"\n    },\n    {\n        \"Q\": \"What is the potential income increase for farmers by adopting improved breeds of goats with assured health care services?\",\n        \"A\": \"Adopting improved breeds of goats with assured health care services can increase farmers' income by 50%.\"\n    },\n    {\n        \"Q\": \"What has the Karnataka government and Veterinary University done to mitigate animal losses and increase farmers' income?\",\n        \"A\": \"They have implemented animal health care or disease control programs, improved veterinary services, and other farm management programs.\"\n    },\n    {\n        \"Q\": \"What is the status of Karnataka regarding render pest disease?\",\n        \"A\": \"Karnataka has been declared a render pest disease-free zone by the Government of India.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What has reduced the occurrence of mastitis cases in cows and buffaloes?\",\n        \"A\": \"Better diagnostic and strategic control measures, along with knowledge and skills on mastitis detection and control techniques.\"\n    },\n    {\n        \"Q\": \"How has the keeping quality of milk improved?\",\n        \"A\": \"The keeping quality of milk has improved in both cow milk and buffalo milk.\"\n    },\n    {\n        \"Q\": \"What reduction was observed in the somatic cell count of milk?\",\n        \"A\": \"There was a reduction of one lakh in the somatic cell count of cows and buffaloes milk.\"\n    },\n    {\n        \"Q\": \"What is the strategic feeding regimen for a dairy animal yielding 10 litres of milk per day?\",\n        \"A\": \"30 kg of cereal green fodder, 5 kg leguminous green fodder, 4 kg dry fodder, and 2.5 kg concentrate feed.\"\n    },\n    {\n        \"Q\": \"How much can milk yield increase with the recommended feeding regimen?\",\n        \"A\": \"Milk yield can increase by 3.0-5.0 litres per animal.\"\n    },\n    {\n        \"Q\": \"What breeds of goats are recommended for upgrading local goats?\",\n        \"A\": \"Osmanabadi, Telicherry, Boer, and Beetel breeds.\"\n    },\n    {\n        \"Q\": \"What is the recommended concentrate supplementation for goats during gestation and after kidding?\",\n        \"A\": \"250 g of concentrates in the last two months of gestation and one month after kidding.\"\n    },\n    {\n        \"Q\": \"What health care practices are recommended for goats?\",\n        \"A\": \"Regular deworming and vaccination against PPR, HS, and ET.\"\n    },\n    {\n        \"Q\": \"What is the potential income increase from upgrading local goats?\",\n        \"A\": \"An annual income increase of Rs. 20,000.\"\n    },\n    {\n        \"Q\": \"What are the benefits of selective breeding with elite rams in sheep management?\",\n        \"A\": \"Increased birth weight, growth rate, marketable weight, and reduced genetic abnormalities and inbreeding depression.\"\n    }\n]\n```"
]