[
    "```json\n[\n    {\n        \"Q\": \"What is the recommended width for raised beds in agriculture?\",\n        \"A\": \"The recommended width for raised beds is 30-40 cm.\"\n    },\n    {\n        \"Q\": \"How much FYM and vermicompost should be applied per hectare for higher yield?\",\n        \"A\": \"Apply FYM at 8-10 t/ha and vermicompost at 1-2 t/ha.\"\n    },\n    {\n        \"Q\": \"What is the recommended spacing for carrot cultivation?\",\n        \"A\": \"For carrots, maintain row-to-row spacing of 20-30 cm and plant-to-plant spacing of 5-10 cm.\"\n    },\n    {\n        \"Q\": \"When should potatoes be planted for higher yield?\",\n        \"A\": \"Potatoes should be planted from the middle of October to the middle of November.\"\n    },\n    {\n        \"Q\": \"What is the recommended tuber size and spacing for planting potatoes?\",\n        \"A\": \"Use tubers weighing 40-50 g with row-to-row spacing of 50-60 cm and plant-to-plant spacing of 20 cm.\"\n    },\n    {\n        \"Q\": \"What is essential for cattle to maintain optimum production and prevent diseases?\",\n        \"A\": \"Regular supplementation of a mineral mixture and calcium, along with good management practices, are essential.\"\n    },\n    {\n        \"Q\": \"What is the recommended dosage of Piperazine for de-worming calves?\",\n        \"A\": \"Calves should be de-wormed with Piperazine at 110-130 mg/kg body weight.\"\n    },\n    {\n        \"Q\": \"What is the recommended dosage of Albendazole for de-worming goats?\",\n        \"A\": \"Goats should be de-wormed with Albendazole at 7.5 mg/kg body weight.\"\n    },\n    {\n        \"Q\": \"How should feed materials be stored to avoid fungal growth?\",\n        \"A\": \"Feed materials should be stored in a dry place to avoid possible fungal growth.\"\n    },\n    {\n        \"Q\": \"What practices should be followed to prevent coccidiosis in poultry?\",\n        \"A\": \"Litter materials should be dried and frequently changed, and proper ventilation and spacing should be maintained.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the recommended dosage of Praziquantel for de-worming birds?\",\n        \"A\": \"Praziquantel is recommended at 5 mg/kg body weight for birds, depending on their age.\"\n    },\n    {\n        \"Q\": \"What is the dosage of Albendazole for de-worming pigs?\",\n        \"A\": \"Pigs should be de-wormed with Albendazole at 5 mg/kg body weight.\"\n    },\n    {\n        \"Q\": \"What is the recommended dosage of Piperazine for treating roundworm in pigs?\",\n        \"A\": \"Piperazine is used against roundworm at a dosage of 110-200 mg/kg body weight in pigs.\"\n    },\n    {\n        \"Q\": \"What mineral supplementation is advised for pregnant sows?\",\n        \"A\": \"Pregnant sows are advised to receive a mineral mixture at 50-60 gm/day.\"\n    },\n    {\n        \"Q\": \"How much calcium should lactating sows receive daily?\",\n        \"A\": \"Lactating sows should receive calcium at 60-80 ml/day per sow.\"\n    },\n    {\n        \"Q\": \"What bio-security measure is recommended for pig farms?\",\n        \"A\": \"Restricting the movement of visitors and using good disinfectants in foot baths are recommended bio-security measures.\"\n    },\n    {\n        \"Q\": \"When should rabi maize be sown in lower elevated areas?\",\n        \"A\": \"Rabi maize should be sown in lower elevated areas in September and completed by mid-October.\"\n    },\n    {\n        \"Q\": \"What seed treatment is recommended for rabi maize?\",\n        \"A\": \"Seed treatment with Bavistin + Captan in a 1:1 ratio at 2g/kg seed is recommended for rabi maize.\"\n    },\n    {\n        \"Q\": \"What is the recommended spacing for planting rabi maize?\",\n        \"A\": \"The recommended spacing for rabi maize is 60 cm row to row and 20 cm plant to plant.\"\n    },\n    {\n        \"Q\": \"How should rabi paddy be harvested for optimal results?\",\n        \"A\": \"Rabi paddy should be harvested within the second fortnight of November when 80% of grains are mature.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the recommended sowing method for rapeseed/mustard in India?\",\n        \"A\": \"Zero or minimum tillage is recommended for sowing rapeseed/mustard.\"\n    },\n    {\n        \"Q\": \"What are the ideal temperature and humidity conditions for growing rapeseed/mustard?\",\n        \"A\": \"The crop needs about 18°C - 25°C temperature and prefers low humidity.\"\n    },\n    {\n        \"Q\": \"What weather conditions should be avoided during the flowering of rapeseed/mustard?\",\n        \"A\": \"Rainfall, high humidity, and cloudy weather should be avoided as they invite aphids and spoil the crop.\"\n    },\n    {\n        \"Q\": \"What type of soil is best for mustard cultivation?\",\n        \"A\": \"Mustard thrives best in medium or heavy loam soils.\"\n    },\n    {\n        \"Q\": \"What are the benefits of practicing zero tillage for rapeseed/mustard?\",\n        \"A\": \"Zero tillage helps utilize residual moisture, reduces cultivation costs, and improves soil condition by adding organic matter.\"\n    },\n    {\n        \"Q\": \"When should ploughing and sowing of Toria/Mustard be completed?\",\n        \"A\": \"Ploughing should be completed by the first fortnight of October, and sowing should be completed by the second fortnight of October.\"\n    },\n    {\n        \"Q\": \"What seed treatment is recommended for rapeseed/mustard?\",\n        \"A\": \"Seed treatment with Trichoderma viridae @ 5g/kg of seed is recommended.\"\n    },\n    {\n        \"Q\": \"Which varieties of Toria are recommended for cultivation under Papum Pare district?\",\n        \"A\": \"TS-36 and TS-38 are recommended for cultivation under Papum Pare district.\"\n    },\n    {\n        \"Q\": \"What is the optimal soil pH range for growing potatoes?\",\n        \"A\": \"The optimal pH range for growing potatoes is 4.8 to 5.4.\"\n    },\n    {\n        \"Q\": \"What is the recommended treatment for potato tubers before planting?\",\n        \"A\": \"Potato tubers should be treated with Azotobacter and Phosphobacteria each @ 2gm/kg of tuber before planting.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the cost for planting one hectare of potatoes?\",\n        \"A\": \"Rs 249.\"\n    },\n    {\n        \"Q\": \"How many tubers per hectare are required for planting potatoes?\",\n        \"A\": \"22-25 quintals per hectare.\"\n    },\n    {\n        \"Q\": \"What is the recommended planting distance for potatoes?\",\n        \"A\": \"60 x 20 cm.\"\n    },\n    {\n        \"Q\": \"Which potato varieties are recommended for cultivation in Arunachal Pradesh?\",\n        \"A\": \"Kufri Pokhraj, Khufri Bahar, Khufri Alankar, K. Jyoti, K. Kanchan (red-skinned).\"\n    },\n    {\n        \"Q\": \"When should the first irrigation be given to potato crops?\",\n        \"A\": \"At 10-12 days or after germination.\"\n    },\n    {\n        \"Q\": \"How is early blight of potato managed?\",\n        \"A\": \"By spraying with mancozeb @ 2.5g/litre of water at 15-day intervals for 3 times.\"\n    },\n    {\n        \"Q\": \"When should intercultural operations like hand weeding be carried out?\",\n        \"A\": \"At 30, 60, and 90 days after sowing.\"\n    },\n    {\n        \"Q\": \"When should irrigation be stopped before harvesting potatoes?\",\n        \"A\": \"At least 10 days before haulm cutting.\"\n    },\n    {\n        \"Q\": \"What is the recommended time for dehaulming potatoes?\",\n        \"A\": \"10-15 days before harvesting.\"\n    },\n    {\n        \"Q\": \"What is the optimal time for sowing buckwheat in high altitude areas?\",\n        \"A\": \"September-October.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is required for deep cultivation of nursery land?\",\n        \"A\": \"Deep cultivation of the nursery land requires soil turning plough or spade and subsequent 2-3 hoeing to achieve a fine tilth.\"\n    },\n    {\n        \"Q\": \"How much farmyard manure or compost should be mixed per square meter of soil?\",\n        \"A\": \"Mix 2 kg of well-rotten farmyard manure or compost, or 500 g of vermicompost per square meter of soil.\"\n    },\n    {\n        \"Q\": \"What should be done if the soil is heavy to ensure seed emergence?\",\n        \"A\": \"If the soil is heavy, mix 2-3 kg of sand per square meter to ensure seed emergence is not hampered.\"\n    },\n    {\n        \"Q\": \"How can soil be treated to make it pathogen and pest-free?\",\n        \"A\": \"Soil can be treated using soil solarization methods or a formalin solution.\"\n    },\n    {\n        \"Q\": \"How is the formalin solution prepared and applied for soil treatment?\",\n        \"A\": \"Prepare a 1.5 to 2% formalin solution and drench the soil at 4-5 liters per square meter, covering the area with a polythene sheet.\"\n    },\n    {\n        \"Q\": \"What is the standard size of a nursery bed?\",\n        \"A\": \"The standard size of a nursery bed is 3m × 1m × 15 cm.\"\n    },\n    {\n        \"Q\": \"How much farmyard manure should be added to each standard size nursery bed?\",\n        \"A\": \"Add 20-25 kg of well-rotten farmyard manure to each standard size nursery bed.\"\n    },\n    {\n        \"Q\": \"In which direction should the beds be prepared and the lines/rows for sowing be made?\",\n        \"A\": \"Beds should be prepared in the east and west direction, and lines/rows for sowing should be made from north to south direction.\"\n    },\n    {\n        \"Q\": \"How should seeds be treated for pea cultivation?\",\n        \"A\": \"Seeds should be treated with Trichoderma spp. @2g/100g or carbendazim 50% WP @ 2g/1kg seed.\"\n    },\n    {\n        \"Q\": \"What is the suitable temperature range for pea cultivation?\",\n        \"A\": \"The suitable temperature range for pea cultivation is between 15 to 30 degrees Celsius.\"\n    },\n    {\n        \"Q\": \"What is the optimum pH range for soil suitable for pea cultivation?\",\n        \"A\": \"The optimum pH range for soil suitable for pea cultivation is 6-7.5.\"\n    },\n    {\n        \"Q\": \"When is the sowing time for the rabi crop of peas?\",\n        \"A\": \"The sowing time for the rabi crop of peas is from October to November.\"\n    },\n    {\n        \"Q\": \"How much seed is required per hectare for pea cultivation?\",\n        \"A\": \"50 to 60 kg of seeds is required for a hectare in pea cultivation.\"\n    },\n    {\n        \"Q\": \"What should be done to control gummosis and collar rot disease of orange?\",\n        \"A\": \"Apply Bordeaux paste up to 1 meter high in post-monsoon to control gummosis and collar rot disease of orange.\"\n    },\n    {\n        \"Q\": \"What is the recommended interval for harvesting oranges?\",\n        \"A\": \"Oranges should be harvested in 10-15 days intervals.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the recommended rate of Rhizobium culture for seed treatment?\",\n        \"A\": \"The recommended rate is 2 kg.\"\n    },\n    {\n        \"Q\": \"How much Phosphobacterium should be applied as soil application before sowing?\",\n        \"A\": \"2 kg of Phosphobacterium should be applied.\"\n    },\n    {\n        \"Q\": \"What is the recommended spacing for sowing seeds?\",\n        \"A\": \"Seeds should be sown at 45 x 10 cm in line.\"\n    },\n    {\n        \"Q\": \"How often should irrigation be done after sowing if possible?\",\n        \"A\": \"Irrigation should be done once a week.\"\n    },\n    {\n        \"Q\": \"When should irrigation be managed in water scarcity areas?\",\n        \"A\": \"Irrigation should be managed at least at the flowering and pod formation stage.\"\n    },\n    {\n        \"Q\": \"What is the recommended application rate of FYM?\",\n        \"A\": \"Apply 20 t/ha of FYM.\"\n    },\n    {\n        \"Q\": \"How should the nitrogen fertilizer rate be adjusted when using Rhizobium inoculated seeds?\",\n        \"A\": \"The N fertilizer may be reduced to 50%.\"\n    },\n    {\n        \"Q\": \"What is the recommended concentration for Nuvan spray to manage pod borer?\",\n        \"A\": \"Nuvan should be sprayed at 0.5% concentration.\"\n    },\n    {\n        \"Q\": \"When can the first picking of peas be done for most varieties?\",\n        \"A\": \"The first picking can be done on 75 days after sowing.\"\n    },\n    {\n        \"Q\": \"What is the recommended spray for managing black rot in plants?\",\n        \"A\": \"Spray Copper oxychloride @300gm + streptomycine @6 gm/150 liters of water.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What should be provided to newly born piglets in piggery to protect them from cold?\",\n        \"A\": \"Proper bedding materials should be provided to newly born piglets to protect them from cold.\"\n    },\n    {\n        \"Q\": \"At what age should pigs be vaccinated against swine fever and how often should it be repeated?\",\n        \"A\": \"Pigs should be vaccinated against swine fever at the age of 3 months and the vaccination should be repeated annually.\"\n    },\n    {\n        \"Q\": \"What should be done during scarcity of fodder for cattle?\",\n        \"A\": \"During scarcity of fodder, provide hay, silage, or feed blocks.\"\n    },\n    {\n        \"Q\": \"How should calves be dewormed and at what dosage?\",\n        \"A\": \"Calves should be dewormed with albendazole at 5mg/kg body weight and repeat deworming once in 3-4 months.\"\n    },\n    {\n        \"Q\": \"What is the recommended dosage of albendazole for deworming goats, especially young kids?\",\n        \"A\": \"Goats should be dewormed with albendazole at 7.5 mg/kg body weight, especially before the start of the rainy season.\"\n    },\n    {\n        \"Q\": \"What should be done to prevent runoff water from polluting fish ponds?\",\n        \"A\": \"Runoff water should not be allowed into the pond as it contains dust, microbes, sand, and debris which can pollute the water and cause disease outbreaks.\"\n    },\n    {\n        \"Q\": \"What is the recommended pre-stocking management practice for fish ponds?\",\n        \"A\": \"Sundry the pond bottom and plough thoroughly, then add limestone powder at 60 kg/acre to maintain soil pH and release gases.\"\n    },\n    {\n        \"Q\": \"What should fish farmers do if cloudy conditions persist during the rainy season?\",\n        \"A\": \"If cloudy conditions persist during the rainy season, stop feeding the fish and resume feeding on the next sunny day.\"\n    },\n    {\n        \"Q\": \"What treatment should be applied if EUS disease outbreaks during the monsoon season?\",\n        \"A\": \"If EUS disease outbreaks during the monsoon season, apply CIFAX at 1 liter per hectare of water body.\"\n    },\n    {\n        \"Q\": \"What are the conditions required for a mushroom house?\",\n        \"A\": \"A mushroom house should be fully clean, dark, ventilated, and must be dust free.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"When will mushrooms start to become visible after planting?\",\n        \"A\": \"Mushrooms will be visible from around 28 to 30 days after planting.\"\n    },\n    {\n        \"Q\": \"What is the first step in the brining process for Rabi vegetables?\",\n        \"A\": \"The first step is to boil the brine by adding 1/4 cup of salt to 1 liter of water and then letting it cool.\"\n    },\n    {\n        \"Q\": \"Which vegetables are not suitable for brining?\",\n        \"A\": \"Leafy vegetables are not suitable for brining.\"\n    },\n    {\n        \"Q\": \"What is the process for pickling Rabi vegetables?\",\n        \"A\": \"Wash and cut the vegetables, steam them, roast mustard seed, fenugreek seed, and jeera, warm oil, add vegetables and spices, then add vinegar and oil before bottling.\"\n    },\n    {\n        \"Q\": \"When should the sowing of Rabi crops start in Manipur?\",\n        \"A\": \"Sowing of Rabi crops should start from mid-October to the end of November.\"\n    },\n    {\n        \"Q\": \"What is the recommended seed rate for field pea varieties in Manipur?\",\n        \"A\": \"The recommended seed rate for field pea varieties is 60 to 80 kg/ha.\"\n    },\n    {\n        \"Q\": \"What should be done for acidic soil at sowing time?\",\n        \"A\": \"For acidic soil, liming should be done at sowing time using CaCO3 at 500 kg/ha in furrows.\"\n    },\n    {\n        \"Q\": \"What is the suitable variety of Toria for Manipur?\",\n        \"A\": \"Suitable varieties of Toria for Manipur are M-27, TS-36, and TS-38.\"\n    },\n    {\n        \"Q\": \"What is the seed rate for mustard in Manipur?\",\n        \"A\": \"The seed rate for mustard in Manipur is 12-14 kg/ha.\"\n    },\n    {\n        \"Q\": \"How should fertilizer be applied for rabi pulses in Manipur?\",\n        \"A\": \"Apply NPK at 20:40:20 kg/ha for rabi pulses.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the recommended spacing for RCM-76 application?\",\n        \"A\": \"The recommended spacing for RCM-76 application is 60 cm × 20 cm.\"\n    },\n    {\n        \"Q\": \"How much FYM or compost should be applied per hectare before sowing?\",\n        \"A\": \"10 t/ha of FYM or compost should be applied 10-15 days prior to sowing.\"\n    },\n    {\n        \"Q\": \"What are the recommended amounts of N, P2O5, and K2O to apply per hectare?\",\n        \"A\": \"150-180 kg N, 70-80 kg P2O5, and 70-80 kg K2O should be applied per hectare.\"\n    },\n    {\n        \"Q\": \"What is the advised safe distance to maintain while carrying out field activities?\",\n        \"A\": \"A safe distance of 3-4 ft should be maintained while carrying out field activities.\"\n    },\n    {\n        \"Q\": \"When should the nursery raised beds for rabi vegetables be prepared?\",\n        \"A\": \"Nursery raised beds for rabi vegetables should be prepared during September-October.\"\n    },\n    {\n        \"Q\": \"What is the recommended variety of cauliflower for cultivation?\",\n        \"A\": \"Recommended varieties of cauliflower include Green Hero, Rare Ball, White Excel, Sweta, and Pusa Snowball.\"\n    },\n    {\n        \"Q\": \"What treatment is advised for vegetable seeds to control damping off?\",\n        \"A\": \"Vegetable seeds should be treated with Trichoderma viride or Pseudomonas fluorescens @ 5-10 g/l of water.\"\n    },\n    {\n        \"Q\": \"What is the ideal time for sowing King chilli?\",\n        \"A\": \"The ideal time for sowing King chilli is December-January.\"\n    },\n    {\n        \"Q\": \"What is the recommended spacing for transplanting seedlings?\",\n        \"A\": \"Transplanting of seedlings should be done at 60 x 60 cm or 45 x 45 cm spacing.\"\n    },\n    {\n        \"Q\": \"What is the suggested amount of NPK to apply per hectare?\",\n        \"A\": \"NPK should be applied at 120:80:80 kg/ha.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What are some locally available materials used for mulching to prevent soil erosion and conserve moisture?\",\n        \"A\": \"Locally available materials such as rice straw and rice husk are used for mulching to prevent soil erosion and conserve moisture.\"\n    },\n    {\n        \"Q\": \"What agricultural practices should be followed timely to manage crops effectively?\",\n        \"A\": \"Practices like hoeing, earthing up, and irrigation should be followed timely for effective crop management.\"\n    },\n    {\n        \"Q\": \"What is advised for monitoring insect pest attacks in crops?\",\n        \"A\": \"Constant monitoring of crops against insect pest attacks and roguing of infected plants regularly is advised.\"\n    },\n    {\n        \"Q\": \"How should borers be monitored in solanaceous crops?\",\n        \"A\": \"Monitoring of borers in solanaceous crops is advised using pheromone traps at a density of 10-15 per hectare.\"\n    },\n    {\n        \"Q\": \"What safety measures should be taken during the spraying of fungicides and insecticides?\",\n        \"A\": \"Hand gloves and masks should always be worn during spraying, and equipment should be washed properly before and after use.\"\n    },\n    {\n        \"Q\": \"How can the shelf life of harvested tomatoes, potatoes, and onions be extended?\",\n        \"A\": \"The shelf life can be extended by using traditional methods like cool ventilated bamboo structures or zero energy cool chambers.\"\n    },\n    {\n        \"Q\": \"What is the recommended storage method for potatoes?\",\n        \"A\": \"Potatoes should be stored in cool, well-ventilated bamboo structures with no windows on a 3 to 4-inch layer of dry sand.\"\n    },\n    {\n        \"Q\": \"What steps should be taken to increase the storage capacity of onions?\",\n        \"A\": \"Onions should be dried in the shade for 3 days and the bulb separated by breaking the stalk from 1.5-2 cm.\"\n    },\n    {\n        \"Q\": \"What advice is given to fisheries farmers regarding water depth in ponds?\",\n        \"A\": \"Fisheries farmers are advised to maintain the water depth up to six feet as fish prefer the colder bottom layers.\"\n    },\n    {\n        \"Q\": \"What measures should be taken to manage oxygen levels in fish ponds?\",\n        \"A\": \"Oxygen levels can be managed by aerating ponds either by adding fresh water or using aerators, especially during early hours.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What treatment can reduce disease problems in ponds before winter?\",\n        \"A\": \"Treating the pond with CIFAX @ 1 litre/ha.\"\n    },\n    {\n        \"Q\": \"What are the recommended treatments for protecting fish against disease during winters?\",\n        \"A\": \"Potassium permanganate @ 2.5-5 kg/ha, lime @ 125-300 kg/ha, or salt application @ 250 kg/ha.\"\n    },\n    {\n        \"Q\": \"How should manual harvesting be organized to ensure safety?\",\n        \"A\": \"Harvesting should be done in 4-5 feet spaced strips, with one strip assigned to one person.\"\n    },\n    {\n        \"Q\": \"What safety measures should be followed by persons engaged in harvesting?\",\n        \"A\": \"Use masks, wash hands at regular intervals, maintain a safe distance of 3-4 feet, and stagger field operations.\"\n    },\n    {\n        \"Q\": \"What should be done to ensure the health of workers during field activities?\",\n        \"A\": \"Engage only healthy persons and avoid those who are likely carriers of disease.\"\n    },\n    {\n        \"Q\": \"What is preferred over manual operations for harvesting?\",\n        \"A\": \"Mechanized operations are preferred wherever feasible.\"\n    },\n    {\n        \"Q\": \"What should be done with farm machinery after use?\",\n        \"A\": \"Farm machinery should be sanitized at the entry point and at regular intervals.\"\n    },\n    {\n        \"Q\": \"How should produce collection be managed to avoid crowding?\",\n        \"A\": \"Collect produce in small heaps spaced at 3-4 feet and assign 1-2 persons per heap.\"\n    },\n    {\n        \"Q\": \"What storage method is recommended for fruits and vegetables to avoid market rush?\",\n        \"A\": \"Use farm level storage like Zero Energy cool chambers.\"\n    },\n    {\n        \"Q\": \"What is suggested for storing onions to control rotting and fungal infestation?\",\n        \"A\": \"Use the Low cost Pusa Concentric Onion Storage Structure.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"How can diamond back moth be effectively managed in cabbage crops?\",\n        \"A\": \"Planting a crop in every 15 rows of cabbage can effectively manage diamond back moth.\"\n    },\n    {\n        \"Q\": \"What is the benefit of planting marigold with solanaceae, crucifers, legumes, and cucurbits?\",\n        \"A\": \"Planting marigold with these crops can lower the incidence of nematodes.\"\n    },\n    {\n        \"Q\": \"What is the purpose of using tomato or cucumber as a trap crop in tomato farming?\",\n        \"A\": \"Tomato or cucumber is used as a trap crop to attract tomato fruit borers for every 15 rows of the main crop.\"\n    },\n    {\n        \"Q\": \"How does sun drying of grains help in pest management?\",\n        \"A\": \"Sun drying of grains effectively reduces stored grain pests such as rice weevil and pulse beetle.\"\n    },\n    {\n        \"Q\": \"What are the purposes of using light traps in agriculture?\",\n        \"A\": \"Light traps are used for monitoring initial infestation, seasonal incidence, trapping, and killing pests.\"\n    },\n    {\n        \"Q\": \"How can red hairy caterpillar and egg masses of Pieris rapae be managed in vegetable crops?\",\n        \"A\": \"Hand picking of red hairy caterpillar and destruction of egg masses of Pieris rapae helps eliminate these pests in crops like cabbage and cauliflower.\"\n    },\n    {\n        \"Q\": \"What method is used to control mango mealy bugs?\",\n        \"A\": \"Banding with grease or polythene effectively controls mango mealy bugs.\"\n    },\n    {\n        \"Q\": \"How can aphids be managed in rapeseed mustard and cucumber?\",\n        \"A\": \"Locally made yellow traps with petroleum jelly or castor oil can be used to manage aphids in these crops.\"\n    },\n    {\n        \"Q\": \"What is the purpose of using ripe mash papaya in traps?\",\n        \"A\": \"Ripe mash papaya in a container with a hole can capture both male and female fruit flies for crops like pumpkin, tomato, mango, and watermelon.\"\n    },\n    {\n        \"Q\": \"How can birds help in pest management in fields?\",\n        \"A\": \"Keeping bird perches in the field allows birds to feed on insects and their life stages, aiding in pest control.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What practices should be followed to minimize nutrient loss while preparing food?\",\n        \"A\": \"Maximum nutrient loss minimization practices should be followed, including proper washing, drying, and grading.\"\n    },\n    {\n        \"Q\": \"How should drinking water be treated before use?\",\n        \"A\": \"Drinking water should be boiled and the boiled water should be used for rinsing utensils before serving food.\"\n    },\n    {\n        \"Q\": \"What deworming treatment is recommended for animals?\",\n        \"A\": \"Animals should be dewormed with Albendazole or Fenbendazole at 10mg/kg body weight.\"\n    },\n    {\n        \"Q\": \"When should oath folder seedling be done for cattle feed?\",\n        \"A\": \"Oath folder seedling should be done during October and November for cattle feed.\"\n    },\n    {\n        \"Q\": \"How can birds be protected from coccidiosis?\",\n        \"A\": \"Birds can be protected from coccidiosis by giving Cordinal powder or Furasol powder at 1g/litre of drinking water.\"\n    },\n    {\n        \"Q\": \"What is the recommended paste application for feeding sows to protect piglet anaemia?\",\n        \"A\": \"A paste of ferrous sulphate with gur should be applied at the teats of feeding sows to protect from piglet anaemia.\"\n    },\n    {\n        \"Q\": \"What is the ideal spacing for Boro paddy transplantation?\",\n        \"A\": \"The spacing of 15-25x10-20 cm should be maintained for Boro paddy transplantation.\"\n    },\n    {\n        \"Q\": \"What is the recommended seed rate and spacing for maize sowing?\",\n        \"A\": \"The seed rate of 25-30 kg/ha and spacing of 60 cm x 30 cm row to row and plant to plant should be maintained for maize sowing.\"\n    },\n    {\n        \"Q\": \"What treatment is recommended for rapeseed and mustard to manage seed borne pathogens?\",\n        \"A\": \"Seed treatment with freshly prepared aqueous garlic bulb extract 2% or Trichoderma @ 10g/kg seed is recommended for managing seed borne pathogens in rapeseed and mustard.\"\n    },\n    {\n        \"Q\": \"What is the suggested method to control weeds and conserve moisture in maize cultivation?\",\n        \"A\": \"Mulching with rice straw or weed biomass may control weeds and conserve moisture for higher productivity in maize cultivation.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What concentrations of neem oil or NSKE are effective against mustard aphid and diamond back moth?\",\n        \"A\": \"2% neem oil or 5% NSKE is found to be effective against mustard aphid and diamond back moth.\"\n    },\n    {\n        \"Q\": \"What is the benefit of zero tillage cultivation of toria after rice and maize?\",\n        \"A\": \"Zero tillage cultivation of toria after rice and maize saves time, energy, and reduces the cost of cultivation.\"\n    },\n    {\n        \"Q\": \"Which crops can be grown in dry upland terraces?\",\n        \"A\": \"In dry upland terraces, crops like Maize-mustard, Maize + French bean-mustard, Rice-mustard, and Groundnut-mustard can be grown.\"\n    },\n    {\n        \"Q\": \"What are some suitable crop combinations for marshy/lowland/wetland conditions?\",\n        \"A\": \"Suitable crop combinations for marshy/lowland/wetland conditions include Maize-mustard, Rice-mustard, Rice-mustard-tomato, and Rice-mustard-potato.\"\n    },\n    {\n        \"Q\": \"What intercropping combinations can be used on raised beds?\",\n        \"A\": \"Intercropping combinations on raised beds include Cabbage + mustard, Broccoli + mustard, and Coriander + mustard.\"\n    },\n    {\n        \"Q\": \"When should the crop be harvested?\",\n        \"A\": \"The crop should be harvested as soon as the pods turn yellowish-brown.\"\n    },\n    {\n        \"Q\": \"What is the recommended height, width, and length for preparing a vegetable nursery on raised beds?\",\n        \"A\": \"A vegetable nursery on raised beds should be 15 cm high, 1 metre wide, and the length should be as per convenience.\"\n    },\n    {\n        \"Q\": \"What seed treatment is recommended to prevent soil-borne diseases?\",\n        \"A\": \"Seed treatment with Trichoderma sp @5gm/kg of seed and Pseudomonas sp @10g/kg of seed is recommended to prevent soil-borne diseases.\"\n    },\n    {\n        \"Q\": \"What is the purpose of seedling root dip treatment with Trichoderma viridae or T. harzianum?\",\n        \"A\": \"Seedling root dip treatment with Trichoderma viridae or T. harzianum @ 5g/litre of water provides better protection against root diseases in the main field.\"\n    },\n    {\n        \"Q\": \"What should be added to enriched FYM/Vermicompost for healthy vegetable seedlings?\",\n        \"A\": \"Enriched FYM/Vermicompost should have Trichoderma and Pseudomonas @ 500g/ quintal of organic manure for healthy vegetable seedlings.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the purpose of using mulching between the rows of French beans?\",\n        \"A\": \"Mulching is used for soil moisture conservation and weed control between the rows of French beans.\"\n    },\n    {\n        \"Q\": \"What is a suitable crop rotation sequence for French beans in lowland paddy fields?\",\n        \"A\": \"A suitable crop rotation sequence is Paddy-Frenchbean.\"\n    },\n    {\n        \"Q\": \"Which crop rotation sequence includes French beans and tomatoes in upland fields?\",\n        \"A\": \"The sequence is Maize-Frenchbean-Tomato.\"\n    },\n    {\n        \"Q\": \"What pruning percentage is recommended for Khasi mandarin after fruit harvesting?\",\n        \"A\": \"Prune 30-40% of shoots during November-December to increase fruiting.\"\n    },\n    {\n        \"Q\": \"What should be applied after every pruning operation on Khasi mandarin?\",\n        \"A\": \"Bordeaux paste (1:1:10) should be applied.\"\n    },\n    {\n        \"Q\": \"Which improved pig breeds are recommended for higher growth rate and productivity?\",\n        \"A\": \"Hampshire cross, Ghungroo, Lumsniang, and Large black are recommended.\"\n    },\n    {\n        \"Q\": \"What should be done to maintain the temperature in a deep litter pig shed?\",\n        \"A\": \"The shed should be constructed to maintain temperature and avoid winter stress.\"\n    },\n    {\n        \"Q\": \"What is the recommended dosage of Albendazole for deworming pigs?\",\n        \"A\": \"Albendazole should be administered at 7.5 mg/kg body weight at three-month intervals.\"\n    },\n    {\n        \"Q\": \"What measures should be taken to prevent African Swine Fever (ASF) in pigs?\",\n        \"A\": \"Immediate quarantine of infected farms, disinfection points at farm entrances, and daily disinfection of pig sheds are necessary.\"\n    },\n    {\n        \"Q\": \"What should be done with the carcass of a pig that died from ASF?\",\n        \"A\": \"The carcass should be disposed of with deep burial of 6 feet deep using lime or bleaching powder.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What measures should be taken for managing animal health on farms?\",\n        \"A\": \"Regular deworming and providing minerals and vitamins supplements are essential for managing animal health.\"\n    },\n    {\n        \"Q\": \"What should be done if a pig suffers from a disease?\",\n        \"A\": \"The sick pig should be immediately separated from the healthy stock and reared in a quarantine shed until it recovers.\"\n    },\n    {\n        \"Q\": \"What should be done in case of suspected ASF in animals?\",\n        \"A\": \"Suspected cases of ASF should be immediately reported to Veterinary doctors and the District Veterinary Officer.\"\n    },\n    {\n        \"Q\": \"Which poultry breeds are recommended for rearing?\",\n        \"A\": \"Dual-purpose breeds such as Vanaraja, Kamrupa, Srinidhi, Kuroiler, and Rainbow rooster are recommended.\"\n    },\n    {\n        \"Q\": \"What are the housing requirements for poultry during winter?\",\n        \"A\": \"Proper housing is required to prevent exposure to extreme cold, including proper lighting and hanging gunny bags to block cold wind.\"\n    },\n    {\n        \"Q\": \"How often should poultry sheds be cleaned and ventilated?\",\n        \"A\": \"Poultry sheds must be cleaned and ventilated regularly, and clean drinking water should be provided 3-4 times a day.\"\n    },\n    {\n        \"Q\": \"What should be done if red diarrhoea symptoms are noticed in birds?\",\n        \"A\": \"Administer anticoccidial drugs in the drinking water for 3-5 days if red diarrhoea symptoms are noticed.\"\n    },\n    {\n        \"Q\": \"Which cattle breed is recommended for use?\",\n        \"A\": \"The Jersey Cross cattle breed is recommended.\"\n    },\n    {\n        \"Q\": \"What is the recommended mineral mixture dosage for different cattle?\",\n        \"A\": \"20-25 grams for calves, 50 grams for heifers, and 100-200 grams for lactating cows and bulls.\"\n    },\n    {\n        \"Q\": \"What type of fishery practice is suggested?\",\n        \"A\": \"Composite fish culture with supplementary feed comprising rice bran and MOC in a 1:1 ratio is suggested.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"When should collection and maintenance of common carp brooders start?\",\n        \"A\": \"Collection and maintenance of common carp brooders should start in the month of December.\"\n    },\n    {\n        \"Q\": \"When is breeding conducted in happa for common carp?\",\n        \"A\": \"Breeding in happa is conducted from February to March.\"\n    },\n    {\n        \"Q\": \"What should be done if algal bloom develops in the pond?\",\n        \"A\": \"Feeding and manuring should be temporarily stopped if algal bloom develops in the pond.\"\n    },\n    {\n        \"Q\": \"What is the recommended liming rate for fishponds?\",\n        \"A\": \"Liming at 65 kg/ha should be given once a month.\"\n    },\n    {\n        \"Q\": \"What percentage of total stock can be partially harvested to avoid overcrowding?\",\n        \"A\": \"About 25% of the total stock can be partially harvested to avoid overcrowding.\"\n    },\n    {\n        \"Q\": \"When should common carp brood fish be detached and stocked in segregated ponds?\",\n        \"A\": \"Three to four months before the breeding season, the common carp brood fish should be detached and stocked in segregated ponds.\"\n    },\n    {\n        \"Q\": \"When is the growing of different species of Oyster mushroom advocated?\",\n        \"A\": \"Growing of different species of Oyster mushroom is advocated from September onwards.\"\n    },\n    {\n        \"Q\": \"What is the purpose of establishing a Nutrition Garden by SHG women members?\",\n        \"A\": \"The purpose is to get fresh vegetables rich in vitamins and minerals to enhance immunity against COVID-19.\"\n    },\n    {\n        \"Q\": \"What vegetables can be grown in a kitchen garden or Nutrition Garden?\",\n        \"A\": \"Vegetables like brinjal, capsicum, chilli, and cucurbitaceous vegetables can be grown.\"\n    },\n    {\n        \"Q\": \"When should land preparation and sowing of maize be completed?\",\n        \"A\": \"Land preparation and sowing of maize should be completed from the 1st week of October.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the recommended soil amendment for sandy soil before sowing?\",\n        \"A\": \"In 60-70 kg sandy soil, soil amendment may be used before sowing.\"\n    },\n    {\n        \"Q\": \"How can cypermethrin be applied for pest control?\",\n        \"A\": \"Cypermethrin 10EC can be used at a rate of 1 ml/litre for foliar application.\"\n    },\n    {\n        \"Q\": \"What are the methods for managing Fall Army Worm (FAW) in maize?\",\n        \"A\": \"Management includes hand picking and destruction of egg masses and larvae, application of dry sand into the whorl of affected plants, and mass trapping of male moths using pheromone traps.\"\n    },\n    {\n        \"Q\": \"What is the chemical management strategy for controlling FAW larvae at 5% damage?\",\n        \"A\": \"Spray 5% NSKE or Azadirachtin 1500 ppm at 5 ml/litre of water to reduce the hatching ability of freshly laid eggs.\"\n    },\n    {\n        \"Q\": \"What is the recommended chemical treatment for 2nd and 3rd instar FAW larvae?\",\n        \"A\": \"Spray Spinetoram 11.7 SC at 0.5 ml/litre of water when damage is at 10-20%.\"\n    },\n    {\n        \"Q\": \"What is the advised practice after the emergence of tasselling in maize for FAW management?\",\n        \"A\": \"Hand picking of larvae is advisable as insecticide management at this stage is not cost-effective.\"\n    },\n    {\n        \"Q\": \"When should Rajmash cultivation be started and completed using improved varieties?\",\n        \"A\": \"Rajmash cultivation could be started by the second fortnight of August and completed in the first fortnight of September.\"\n    },\n    {\n        \"Q\": \"What is the basal dose of NPK recommended for Rajmash cultivation?\",\n        \"A\": \"A basal dose of NPK @ 20:40:20 is recommended at the time of sowing.\"\n    },\n    {\n        \"Q\": \"What is the recommended pre-emergence herbicide for weed control in pulses?\",\n        \"A\": \"Pendimethalin @ 1.5 /ha or Butachlor @ 10ml/litre of water can be used for weed control.\"\n    },\n    {\n        \"Q\": \"What is the recommended treatment for seeds in Toria cultivation?\",\n        \"A\": \"Seeds should be treated with Thirum/Captan 2.5 gm/kg seed.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"How can soil be made free from soil-borne disease-causing pathogens?\",\n        \"A\": \"Drench the bed with a 0.1% solution of Captan or Fytolan and cover it with a polythene sheet, gunny bag, or thick paper for 2 days.\"\n    },\n    {\n        \"Q\": \"What should be done after uncovering the soil treated for soil-borne diseases?\",\n        \"A\": \"Loosen the soil and leave it for 3-4 days.\"\n    },\n    {\n        \"Q\": \"How can seedlings be protected from soil-borne insects?\",\n        \"A\": \"Mix Malathion 5% dust thoroughly into the soil.\"\n    },\n    {\n        \"Q\": \"When should sowing be done for the best results?\",\n        \"A\": \"Sowing should be done by the last week of August or the first/second week of September.\"\n    },\n    {\n        \"Q\": \"What is the recommended spacing and depth for sowing seeds?\",\n        \"A\": \"Sow seeds in U-shaped furrows spaced at 2.5 cm and at a depth of 1-2 cm.\"\n    },\n    {\n        \"Q\": \"How should the seeds be covered after sowing?\",\n        \"A\": \"Cover the seeds with a thin layer of sand mixed with well-dried and sieved farmyard manure.\"\n    },\n    {\n        \"Q\": \"How should the sown beds be irrigated?\",\n        \"A\": \"Irrigate using a water cane fitted with a fine hose.\"\n    },\n    {\n        \"Q\": \"When are seedlings ready for transplanting?\",\n        \"A\": \"Seedlings are ready for transplanting 21-30 days after sowing.\"\n    },\n    {\n        \"Q\": \"What should be done to the pits before transplanting plants?\",\n        \"A\": \"Pits should be treated with insecticide before transplanting.\"\n    },\n    {\n        \"Q\": \"What is the recommended spacing for pit preparation?\",\n        \"A\": \"Pits should be prepared at a spacing of 75 x 30 cm (Row to row x Plant to plant).\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the purpose of applying Bordeaux paste in February?\",\n        \"A\": \"Bordeaux paste is used for cleaning lichens and mosses and for applying to the tree trunk up to 60 cm height from the ground level.\"\n    },\n    {\n        \"Q\": \"How is the trunk borer grubs problem addressed?\",\n        \"A\": \"The bored holes of the infested trunk are cleaned with iron wire, and a cotton swab soaked in petrol/Dichlorvos is inserted, or 5 mL of Dichlorvos @ 0.2% is injected and plugged with mud.\"\n    },\n    {\n        \"Q\": \"What is the recommended application of FYM in February?\",\n        \"A\": \"Apply FYM @ 30 kg/plant and lime @ 1 kg/plant in the basin.\"\n    },\n    {\n        \"Q\": \"What is the procedure for controlling bark eating caterpillar?\",\n        \"A\": \"Inject Dichlorvos @ 0.1% into the tunnel.\"\n    },\n    {\n        \"Q\": \"What is the recommended practice for mulching in February?\",\n        \"A\": \"Mulching of the tree basin is recommended.\"\n    },\n    {\n        \"Q\": \"What is the procedure for oyster mushroom cultivation?\",\n        \"A\": \"Cut straw 3-4 inches, boil for 20-30 mins, cool, squeeze to minimize moisture, layer in polythene with spawn, incubate in a dark room for 10-14 days, then water and harvest after 5-6 days.\"\n    },\n    {\n        \"Q\": \"What mineral supplementation is suggested for adult pigs?\",\n        \"A\": \"Regular supplementation of mineral mixture @ 20-30 g/head/day is suggested for adult pigs.\"\n    },\n    {\n        \"Q\": \"What measures are advised for pig farmers facing African swine fever?\",\n        \"A\": \"Regular disinfection of farm premises and pig sty, foot dips at farm entrance, quarantine for pigs from other locations, and avoiding pigs from infected areas.\"\n    },\n    {\n        \"Q\": \"What vaccination schedule is recommended for piglets against Classical Swine Fever?\",\n        \"A\": \"Vaccinate initially at 2 months of age, booster at 6 months, and then annually.\"\n    },\n    {\n        \"Q\": \"What is the suggested feed for pigs to minimize feed cost?\",\n        \"A\": \"Feed pigs with locally available non-conventional feed stuffs like kitchen waste, vegetable waste, brewery waste, and nutritious plants like wild cassava, Colacasia.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the recommended dosage of fenbendazole for treating goats?\",\n        \"A\": \"Fenbendazole should be administered at 7.5-10 mg/kg body weight orally.\"\n    },\n    {\n        \"Q\": \"What preventive measure is suggested for African Swine Fever?\",\n        \"A\": \"Importing of pigs, pork, or any by-products should be strictly prohibited.\"\n    },\n    {\n        \"Q\": \"What is advised for the disinfection of poultry house premises?\",\n        \"A\": \"Regularly disinfect with 1% sodium hypochlorite and inhibit the entry of outsiders.\"\n    },\n    {\n        \"Q\": \"What is the procedure before introducing new batches of chicks in poultry farms?\",\n        \"A\": \"Clean and disinfect the poultry houses with KMnO4 and formalin solution, then place birds after 24 hours of fumigation.\"\n    },\n    {\n        \"Q\": \"What is the suggested light duration for brooder and adult birds during the laying period?\",\n        \"A\": \"Provide a minimum of 23 hours light for brooders and 16 hours light for adult birds during the laying period.\"\n    },\n    {\n        \"Q\": \"What is recommended for the de-beaking of poultry birds?\",\n        \"A\": \"De-beaking should be done as early as 1 day to 6 weeks and repeated at 16 weeks if necessary.\"\n    },\n    {\n        \"Q\": \"What supplementation is suggested for poultry birds to prevent soft shell?\",\n        \"A\": \"Supplement with vitamin and mineral mixture (Grow B-plex/Ambiplex) and calcium during the laying period.\"\n    },\n    {\n        \"Q\": \"How should deworming of poultry birds be conducted?\",\n        \"A\": \"Deworm with Albomar liquid at 45ml/100 birds or Piperazine hydrochloride at 5ml/10 birds.\"\n    },\n    {\n        \"Q\": \"What is the recommended vitamin and mineral supplementation for dairy cattle?\",\n        \"A\": \"Regularly supplement with vitamins and minerals at 50-100 g/head/day.\"\n    },\n    {\n        \"Q\": \"What vaccinations are advised for goats?\",\n        \"A\": \"Vaccinate against PPR and FMD at 3 months and re-vaccinate annually.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the first step in preparing fully ripe tomatoes for dehydration?\",\n        \"A\": \"The tomatoes are washed well in running tap water.\"\n    },\n    {\n        \"Q\": \"At what temperature and for how long are tomatoes dried in the cabinet drier?\",\n        \"A\": \"Tomatoes are dried at 80°C for 10 hours.\"\n    },\n    {\n        \"Q\": \"What is the purpose of grinding dehydrated tomato pieces?\",\n        \"A\": \"The dehydrated tomato pieces are ground into powder.\"\n    },\n    {\n        \"Q\": \"What are the ingredients and their amounts in the preparation of tomato soup mix?\",\n        \"A\": \"Tomato powder 5g, Pepper powder 0.3g, Onion powder 0.5g, Salt 1.5g, Corn flour 2.0g, Ajinomoto 0.5g, Cumin powder 0.5g.\"\n    },\n    {\n        \"Q\": \"How is the tomato soup mix prepared for consumption?\",\n        \"A\": \"Ten grams of the prepared tomato soup mix is added to 150 ml of boiled water and stirred thoroughly.\"\n    },\n    {\n        \"Q\": \"What is the initial step in preparing onion powder?\",\n        \"A\": \"Disease-free big onions are selected, and the skin is peeled off.\"\n    },\n    {\n        \"Q\": \"At what temperature and for how long are onions dried for powder preparation?\",\n        \"A\": \"Onions are dried at 60°C for 7 hours.\"\n    },\n    {\n        \"Q\": \"What is the process for preparing vegetable powders?\",\n        \"A\": \"Vegetables are washed, cut into small pieces, steam blanched (except onion and tomatoes), dried at 80°C for 10 hours, and then ground into powder.\"\n    },\n    {\n        \"Q\": \"What are the main ingredients in cauliflower pickle?\",\n        \"A\": \"Cauliflower pieces, cardamom, salt, cumin, ginger, aniseed, onion, clove, garlic, tamarind pulp, red chilli, mustard, turmeric, vinegar, cinnamon, black pepper, and mustard oil.\"\n    },\n    {\n        \"Q\": \"How is cabbage processed for value-added product preparation?\",\n        \"A\": \"Cabbage is shredded, mixed with 2.5% salt, packed layer by layer, sealed hermetically, fermented at room temperature, blanched at 70°C for 10 minutes after 28 days, and stored under shade.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the recommended time for sowing field pea seeds?\",\n        \"A\": \"Field pea seeds should be sown during the second fortnight of October to the first fortnight of November.\"\n    },\n    {\n        \"Q\": \"How should pea seeds be treated before sowing?\",\n        \"A\": \"Pea seeds should be treated with rhizobium culture @ 50 g kg-1 seed, Bavistin @ 2 g kg-1 seed, and Trichoderma viride @ 4 g kg-1 seed.\"\n    },\n    {\n        \"Q\": \"What is the basal application of fertilizers for field pea per hectare?\",\n        \"A\": \"Incorporate organic matter @ 200 q ha-1, apply 55 kg of urea, 313 kg of SSP, and 42 kg of MOP per hectare.\"\n    },\n    {\n        \"Q\": \"What is the recommended time for sowing rapeseed seeds?\",\n        \"A\": \"Rapeseed sowing can be done from the second fortnight of October to the first fortnight of November, and can be delayed up to the last week of November.\"\n    },\n    {\n        \"Q\": \"What is the basal dose of fertilizers for rapeseed under irrigated conditions?\",\n        \"A\": \"Apply 54 kg of urea, 375 kg of SSP, and 50 kg of MOP per hectare by placement method at the time of sowing.\"\n    },\n    {\n        \"Q\": \"What is the recommended fertilizer application for linseed under rainfed conditions?\",\n        \"A\": \"Apply 87 kg of urea, 125 kg of SSP, 17 kg of MOP per hectare along with FYM @ 20 q ha-1 as basal.\"\n    },\n    {\n        \"Q\": \"What is the recommended treatment for rapeseed and linseed seeds before sowing?\",\n        \"A\": \"Treat seeds with Azotobacter and Phosphotika @ 40 g each per kg of seed.\"\n    },\n    {\n        \"Q\": \"How many weeding sessions are recommended and at what days after sowing (DAS)?\",\n        \"A\": \"At least two weeding sessions should be done at 20 and 40 DAS.\"\n    },\n    {\n        \"Q\": \"What is recommended to enhance yield through increased pollination in rapeseed?\",\n        \"A\": \"Install 5 honeybee colonies per hectare.\"\n    },\n    {\n        \"Q\": \"What is the recommended insecticide for high infestation of leaf feeders/caterpillars and borers?\",\n        \"A\": \"Use Indoxacarb 14.5 SC @ 0.5 ml/L or Emamectin benzoate 5% SG @ 0.4 g/L of water.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the recommended interval for spraying to control Powdery mildew and Pea rust?\",\n        \"A\": \"Spray at 25-day intervals.\"\n    },\n    {\n        \"Q\": \"What chemicals are suggested for controlling Sclerotinia stem rot and Alternaria black spot?\",\n        \"A\": \"Spray Blitox @3ml/lit or Dithan M-45 @2g/lit of water at 10-day intervals.\"\n    },\n    {\n        \"Q\": \"What is the recommended treatment for white rust?\",\n        \"A\": \"Spray Metalaxyl 8% + Mancozeb 64% WP @1000 g in 400 l of water/acre.\"\n    },\n    {\n        \"Q\": \"What is the ideal moisture content for storing field pea seeds?\",\n        \"A\": \"9-10 percent.\"\n    },\n    {\n        \"Q\": \"When should the nursery for cole crops be prepared?\",\n        \"A\": \"During the month of August-September.\"\n    },\n    {\n        \"Q\": \"What is the recommended soil composition for raised seed beds?\",\n        \"A\": \"Fine tilth soil with well decomposed FYM, or coco peat and Vermicompost in a 1:1 ratio.\"\n    },\n    {\n        \"Q\": \"What is the spacing for transplanting early season cole crops?\",\n        \"A\": \"45x30 cm.\"\n    },\n    {\n        \"Q\": \"When should winter vegetables like French bean, carrot, and pea be sown?\",\n        \"A\": \"Start in October and complete by 15th November.\"\n    },\n    {\n        \"Q\": \"How should kiwi be propagated?\",\n        \"A\": \"Through hardwood cuttings in December-January.\"\n    },\n    {\n        \"Q\": \"What is the method for managing aphid infestations?\",\n        \"A\": \"Clip infested shoots early, collect and destroy egg masses, and use yellow and blue sticky traps for monitoring.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the recommended practice to reduce soil-borne diseases before sowing?\",\n        \"A\": \"Treating the soil with water for an hour followed by shade drying.\"\n    },\n    {\n        \"Q\": \"Name some suitable varieties of cabbage.\",\n        \"A\": \"Rareball, Pusa Ageti, Pride of India, Green Challenger, Green Express.\"\n    },\n    {\n        \"Q\": \"What are the recommended varieties of cauliflower?\",\n        \"A\": \"Hybrid-Madhuri, Pusa Snowball 1, Pusa Sharad, Swati, Himani.\"\n    },\n    {\n        \"Q\": \"How can green mould in mushroom bags be managed?\",\n        \"A\": \"By using garlic extract. Make a paste of 50g garlic cloves with 50ml water, strain it, and spray the solution mixed with 3-5ml/litre of water on boiled straw.\"\n    },\n    {\n        \"Q\": \"What can be used to manage flies in mushroom cropping rooms?\",\n        \"A\": \"Yellow sticky paper.\"\n    },\n    {\n        \"Q\": \"How can farmers generate income from surplus horticultural crops?\",\n        \"A\": \"By processing and value addition through pickling, dehydration, and processing into products like juices, jam, jellies, and candy.\"\n    },\n    {\n        \"Q\": \"What vaccinations should livestock receive in preparation for winter?\",\n        \"A\": \"Swine Fever in pigs, FMD, HS, and BQ in cattle, buffalo, goat, mithun, and Ranikhet Disease in poultry.\"\n    },\n    {\n        \"Q\": \"What should be done to protect livestock during sudden temperature drops in November?\",\n        \"A\": \"Place livestock in covered sheds or areas with appropriate lighting during the night.\"\n    },\n    {\n        \"Q\": \"What should be done for animals affected by Pica?\",\n        \"A\": \"Deworm them and provide adequate mineral mixtures at 2% in their diet.\"\n    },\n    {\n        \"Q\": \"Why do animals require more feed during winter?\",\n        \"A\": \"To maintain heat production and body condition due to colder temperatures.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"When should boro rice transplanting be completed?\",\n        \"A\": \"Boro rice transplanting should be completed within the month of December to January.\"\n    },\n    {\n        \"Q\": \"What is the recommended time frame for preparing the nursery bed for boro rice?\",\n        \"A\": \"The nursery bed for boro rice should be prepared between 15th November and 15th December.\"\n    },\n    {\n        \"Q\": \"What fertilizers are applied at the time of nursery bed preparation for boro rice?\",\n        \"A\": \"1kg Urea, 3kg SSP, and 800g MOP are applied as a basal for one square meter area.\"\n    },\n    {\n        \"Q\": \"How often should the field be puddled during land preparation for boro rice transplanting?\",\n        \"A\": \"The field should be puddled twice at 7-10 days’ intervals.\"\n    },\n    {\n        \"Q\": \"What is the recommended spacing for transplanting boro rice?\",\n        \"A\": \"Transplanting should be done at a spacing of 20 x 15 cm or 20 x 20 cm.\"\n    },\n    {\n        \"Q\": \"How much nursery area is required for one-hectare land for boro rice?\",\n        \"A\": \"1000 square meters of nursery area is required for one-hectare land.\"\n    },\n    {\n        \"Q\": \"What seed treatment is recommended for boro rice?\",\n        \"A\": \"Seed treatment with Pseudomonas florescence (10-15 g per kg of seed) is recommended.\"\n    },\n    {\n        \"Q\": \"What is the basal fertilizer application for boro rice?\",\n        \"A\": \"Apply FYM @ 5 t/ha, one third of the Nitrogen (43 kg Urea/ha), and full dose of P and K (250 kg SSP and 68 kg MOP/ha) as basal.\"\n    },\n    {\n        \"Q\": \"When should the remaining doses of nitrogen be applied for boro rice?\",\n        \"A\": \"The remaining two doses of nitrogen should be applied at tillering and panicle initiation stages.\"\n    },\n    {\n        \"Q\": \"What is the ideal time for sowing Rabi Maize?\",\n        \"A\": \"The ideal time for sowing Rabi Maize is mid-November.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the recommended NPK ratio for Rabi Maize preparation?\",\n        \"A\": \"The recommended NPK ratio for Rabi Maize is 120:60:40 kg/ha.\"\n    },\n    {\n        \"Q\": \"When should the entire dose of P & K with 1/3rd of N be applied for Rabi Maize?\",\n        \"A\": \"The entire dose of P & K with 1/3rd of N should be applied at the time of sowing.\"\n    },\n    {\n        \"Q\": \"What is the recommended application of ZnSO4 for Rabi Maize?\",\n        \"A\": \"25 Kg of ZnSO4 is recommended at sowing for Rabi Maize.\"\n    },\n    {\n        \"Q\": \"At which stages should the rest split doses of N be applied for Rabi Maize?\",\n        \"A\": \"The rest split doses of N should be applied at the knee-high and tasselling stages.\"\n    },\n    {\n        \"Q\": \"What is the most critical stage for irrigation in Rabi Maize?\",\n        \"A\": \"The most critical stage for irrigation in Rabi Maize is the flowering period, including tasselling, silking, and pollination.\"\n    },\n    {\n        \"Q\": \"What is the recommended seed rate for mustard and toria in Tripura?\",\n        \"A\": \"A seed rate of 700-900 gm/kani is recommended for mustard and toria.\"\n    },\n    {\n        \"Q\": \"What is the recommended NPK fertilizer ratio for toria and mustard?\",\n        \"A\": \"The recommended NPK fertilizer ratio is 40:20:20 kg/ha for toria and 90:60:40 kg/ha for mustard.\"\n    },\n    {\n        \"Q\": \"How can aphids be controlled organically in mustard?\",\n        \"A\": \"Aphids can be controlled organically by spraying derisom or neem oil @ 2.5 gm or ml/lit of water two to three times.\"\n    },\n    {\n        \"Q\": \"What is the recommended sowing time for field pea in Tripura?\",\n        \"A\": \"The recommended sowing time for field pea in Tripura is the 1st fortnight of November.\"\n    },\n    {\n        \"Q\": \"What is the recommended NPK fertilizer ratio for lentil in Tripura?\",\n        \"A\": \"The recommended NPK fertilizer ratio for lentil is 20:60:40 kg/kani.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the recommended dosage of Agroson/Ceresan for seed treatment in brinjal?\",\n        \"A\": \"2.5g/kg of seed.\"\n    },\n    {\n        \"Q\": \"How much Trichoderma sp should be applied per 100 sq. meter nursery area for controlling damping off and fruit rot disease?\",\n        \"A\": \"25g per 100 sq. meter nursery area.\"\n    },\n    {\n        \"Q\": \"What treatment can reduce bacterial wilt in brinjal?\",\n        \"A\": \"Follow crop rotation with a non-solanaceous crop or treat with Streptocycline @ 1g/litres of water for 30 minutes.\"\n    },\n    {\n        \"Q\": \"What are the recommended fertilizers and their quantities for transplanting brinjal?\",\n        \"A\": \"Urea @ 1110kg/ha, SSP @ 375kg/ha, and MOP @ 96 Kg/ha.\"\n    },\n    {\n        \"Q\": \"How can brinjal shoot and fruit borer be managed?\",\n        \"A\": \"Install pheromone traps @ 12/ha, release larval parasitoids, or apply neem oil @ 15L/ha, Emamectin benzoate 5% SG @ 100g/acre, or Dimethoate 30% EC @ 660ml/ha.\"\n    },\n    {\n        \"Q\": \"What treatment is recommended for chilli seeds to control diseases?\",\n        \"A\": \"Treat with Trichoderma sp, Pseudomonas fluorescens (10g per kg of seed), Carbendazim @ 2g/kg, or Agroson/Ceresan @ 2.5g/kg of seed.\"\n    },\n    {\n        \"Q\": \"What fertilizers are recommended during chilli ride bed preparation?\",\n        \"A\": \"Urea @ 65Kg/ha, SSP @ 250 kg/Ha, and MOP @ 40 Kg/ha.\"\n    },\n    {\n        \"Q\": \"How can chilli leaf curl disease be managed?\",\n        \"A\": \"Apply Dimethoate 30% EC 660 ml/ha or Phosalone @ 625 ml/ha.\"\n    },\n    {\n        \"Q\": \"What method is recommended for managing chilli leaf curl disease caused by thrips?\",\n        \"A\": \"Install Blue Sticky traps, or apply Imidaclopride 17.8% SL, Dimethoate 30% EC, or Emamectin benzoate 5% SG.\"\n    },\n    {\n        \"Q\": \"What biocontrol agents are recommended for treating tomato seeds?\",\n        \"A\": \"Trichoderma sp, Pseudomonas fluorescens (10g per kg of seed), or Carbendazim @ 2g/kg of seed.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What are the conditions necessary for growing radish?\",\n        \"A\": \"Good seed, proper season, and a cool, moist atmosphere are essential for growing radish.\"\n    },\n    {\n        \"Q\": \"What is the recommended spacing for radish cultivation?\",\n        \"A\": \"A spacing of 15 x 10 cm is normally adopted for radish cultivation.\"\n    },\n    {\n        \"Q\": \"How can aphids, flea beetles, and mustard saw fly be controlled in radish crops?\",\n        \"A\": \"They can be controlled by spraying Malathion 50 EC at a concentration of 1 ml/lit twice or thrice at 10-day intervals.\"\n    },\n    {\n        \"Q\": \"What is the method to control white rust in radish?\",\n        \"A\": \"White rust can be controlled by spraying Mancozeb 2 g/lit or Copper oxychloride 2 g/lit.\"\n    },\n    {\n        \"Q\": \"How should carrot seeds be sown?\",\n        \"A\": \"Carrot seeds should be sown directly on raised beds or ridged beds.\"\n    },\n    {\n        \"Q\": \"What is the recommended soil treatment for carrot cultivation?\",\n        \"A\": \"The soil should be loosened about one-and-a-half times the expected length of the carrot, and the soil should be broken fine to avoid obstruction to root growth.\"\n    },\n    {\n        \"Q\": \"What is the ideal time for harvesting edible carrot roots?\",\n        \"A\": \"Edible roots can be harvested in 80-100 days of seed sowing, depending on the variety.\"\n    },\n    {\n        \"Q\": \"What is a beneficial practice for banana orchards during August to September?\",\n        \"A\": \"Utilizing the inter space of banana orchards by sowing legume or green manure crops like green gram or black gram is beneficial.\"\n    },\n    {\n        \"Q\": \"What is the recommended pest control measure for bananas?\",\n        \"A\": \"Spraying or soil application of Cartap hydrochloride 4G (Boregan SP) is recommended to control major pests of banana.\"\n    },\n    {\n        \"Q\": \"What is the ideal time for pineapple plantation in Tripura?\",\n        \"A\": \"The September to December months are ideal for pineapple plantation in Tripura.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"When should rainfed chickpea be sown?\",\n        \"A\": \"Rainfed chickpea should be sown in the first fortnight of October.\"\n    },\n    {\n        \"Q\": \"What is the recommended seed rate for desi chickpea varieties?\",\n        \"A\": \"For desi chickpea varieties, a seed rate of 50-75 kg per hectare should be used based on seed size.\"\n    },\n    {\n        \"Q\": \"What seed treatment is recommended for chickpea seeds?\",\n        \"A\": \"The seed should be treated with 4 g Trichoderma or 3 g Carbendazim per kg of seed followed by Rhizobium and PSB biofertilizer inoculation.\"\n    },\n    {\n        \"Q\": \"What is the recommended fertilizer dose for chickpea at sowing?\",\n        \"A\": \"A recommended fertilizer dose of 25 kg N, 50 kg P, and 25 kg K should be applied as a basal dose at the time of sowing.\"\n    },\n    {\n        \"Q\": \"When should irrigated wheat be sown?\",\n        \"A\": \"Timely sown irrigated wheat should be sown in the first fortnight of November.\"\n    },\n    {\n        \"Q\": \"What are the critical irrigation stages for wheat?\",\n        \"A\": \"The critical irrigation stages for wheat are CRI stage (18-20 days), tillering stage (30-35 days), flowering (65-70 days), grain filling stage (80-85 days), and grain maturity stage (95-100 days).\"\n    },\n    {\n        \"Q\": \"What is the recommended dose of NPK for timely sown wheat?\",\n        \"A\": \"The recommended dose for timely sown wheat is 100-120 kg N, 50-60 kg P, and 50-60 kg K.\"\n    },\n    {\n        \"Q\": \"How should the fertilizer be applied for late sown wheat?\",\n        \"A\": \"For late sown wheat, 80:40:40 kg NPK per hectare should be applied, with half of the N and full P and K as a basal dose at sowing.\"\n    },\n    {\n        \"Q\": \"What is the recommended sowing time for rainfed wheat?\",\n        \"A\": \"Rainfed wheat should be sown during the first fortnight of October using residual moisture available in the soil.\"\n    },\n    {\n        \"Q\": \"What is the recommended seed rate for Kabuli chickpea varieties?\",\n        \"A\": \"A seed rate of 100 kg per hectare should be used for Kabuli and bold chickpea varieties.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"When should rainfed Rabi sorghum be sown?\",\n        \"A\": \"Rainfed Rabi sorghum should be sown during 15th September to 1st October.\"\n    },\n    {\n        \"Q\": \"What is the recommended spacing for Rabi sorghum to achieve higher yield?\",\n        \"A\": \"The recommended spacing for Rabi sorghum is 45 cm x 12.5 cm.\"\n    },\n    {\n        \"Q\": \"What treatment should seeds of Rabi sorghum receive for controlling stem borer?\",\n        \"A\": \"Seeds should be treated with fungicide and Gaucho insecticide @ 4 g/kg of seed.\"\n    },\n    {\n        \"Q\": \"What is the recommended dose of NPK for Rabi sorghum?\",\n        \"A\": \"The recommended dose is 80:40:40 kg NPK, with half N and full P and K as basal dose and half N after 30 DAS.\"\n    },\n    {\n        \"Q\": \"When should rainfed safflower be sown?\",\n        \"A\": \"Rainfed safflower should be sown on residual moisture during 1st October to 15th October.\"\n    },\n    {\n        \"Q\": \"What spacing should be followed for irrigated safflower for better yield?\",\n        \"A\": \"A spacing of 45 x 20 cm should be followed for irrigated safflower.\"\n    },\n    {\n        \"Q\": \"What is the recommended spacing for linseed?\",\n        \"A\": \"The recommended spacing for linseed is 30 cm x 15 cm.\"\n    },\n    {\n        \"Q\": \"When should mustard be sown in Maharashtra?\",\n        \"A\": \"Mustard should be sown in the first fortnight of November in Maharashtra.\"\n    },\n    {\n        \"Q\": \"What is the recommended spacing for mustard sowing?\",\n        \"A\": \"The recommended spacing for mustard is 45 cm x 20 cm.\"\n    },\n    {\n        \"Q\": \"When should pre-seasonal sugarcane be planted?\",\n        \"A\": \"Pre-seasonal sugarcane should be planted during 1st October to 15th November.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the recommended NPK application rate for sugarcane per hectare?\",\n        \"A\": \"300:170:170 kg NPK per hectare should be applied.\"\n    },\n    {\n        \"Q\": \"How should nitrogen doses be applied for sugarcane?\",\n        \"A\": \"Nitrogen doses should be applied in four equal splits.\"\n    },\n    {\n        \"Q\": \"What is the advised pruning practice for Ambiya Bahar in pomegranate?\",\n        \"A\": \"Pruning should be taken for Ambiya Bahar in pomegranate.\"\n    },\n    {\n        \"Q\": \"Which high yielding pomegranate varieties are recommended?\",\n        \"A\": \"Improved and high yielding varieties like Bhagwa and Super Bhagwa are recommended.\"\n    },\n    {\n        \"Q\": \"How long should water stress be given to pomegranate according to soil type?\",\n        \"A\": \"Water stress of 30 to 60 days should be given according to soil type.\"\n    },\n    {\n        \"Q\": \"What is the recommended fertilizer dose for pomegranate after irrigation?\",\n        \"A\": \"A fertilizer dose of 400:200:200 g per plant should be applied after irrigation.\"\n    },\n    {\n        \"Q\": \"How should nitrogen be applied to pomegranate?\",\n        \"A\": \"Nitrogen should be given in two splits.\"\n    },\n    {\n        \"Q\": \"What is the key operation for Ambiya bahar management in citrus during the Rabi season?\",\n        \"A\": \"Stress management should be done in the month of November-December as per soil type.\"\n    },\n    {\n        \"Q\": \"What is the recommended potassium nitrate spray concentration for citrus?\",\n        \"A\": \"A spray of potassium nitrate at 15 gm per litre of water is recommended.\"\n    },\n    {\n        \"Q\": \"What should be done to protect mango fruits from fruit fly incidence?\",\n        \"A\": \"Install 'Rakshak fruit fly trap' developed by the university at 4 traps per hectare.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What measures should be taken to control brinjal shoot and fruit borer?\",\n        \"A\": \"Collect and destroy caterpillars or spray Neemark 4%, Cypermethrin 25% EC 5 ml, Chlorpyriphos 20 EC 20 ml, Deltamethrin 1%, or Trizophos 20 ml per 10 litres of water.\"\n    },\n    {\n        \"Q\": \"Which varieties of tomato are recommended for higher yield?\",\n        \"A\": \"Triple disease-resistant varieties like Arka Rakshak or Arka Samrat should be used.\"\n    },\n    {\n        \"Q\": \"When should tomato crops be planted for the Rabi season?\",\n        \"A\": \"Tomato crops should be planted in the month of August-September for the Rabi season.\"\n    },\n    {\n        \"Q\": \"What are some improved varieties of onion recommended for Rabi cultivation?\",\n        \"A\": \"Improved varieties include Baswant-780, N-2-4-1, Agri Found Light Red, Phule Samarth, Bhima Super, Bhima Red, Bhima Shakti, Bhima Shubhra, etc.\"\n    },\n    {\n        \"Q\": \"When should onion transplanting be done?\",\n        \"A\": \"Transplanting should be done in the month of October-November.\"\n    },\n    {\n        \"Q\": \"What solution should be applied to increase the shelf life of onions before harvesting?\",\n        \"A\": \"Apply ICAR RABI AgRo-AdvIsoRy for Farmers 311 Malic Hydroxide-40 @3000 ppm solution 15 to 20 days prior to harvesting.\"\n    },\n    {\n        \"Q\": \"How can powdery mildew in okra be controlled?\",\n        \"A\": \"Apply three sprays of 0.03% wettable sulphur at 10-15 days intervals.\"\n    },\n    {\n        \"Q\": \"What are some improved varieties of okra for higher yield?\",\n        \"A\": \"Improved varieties include Parbhani Kranti, Arka Anamika, Phule Kirti, Utkarsh, PBNOK-1.\"\n    },\n    {\n        \"Q\": \"What is the recommended planting spacing for Gaillardia?\",\n        \"A\": \"Planting should be done in well-drained soil using varieties like Murgudi, Fulzari.\"\n    },\n    {\n        \"Q\": \"What are some improved and high yielding varieties of Gladiolus?\",\n        \"A\": \"Improved varieties include Apsara, Meera, Sapna, Punam, Phule Ganesh, Phule Prerana, Phule Tejas, Nilrekha, White Prosperity.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What soil type is recommended for planting jasmine?\",\n        \"A\": \"Jasmine should be planted in well-drained black soil.\"\n    },\n    {\n        \"Q\": \"What is the recommended NPK fertilizer application for jasmine after two months?\",\n        \"A\": \"Apply 20 gm N/plant after two months.\"\n    },\n    {\n        \"Q\": \"What is the advised spacing for planting roses?\",\n        \"A\": \"Roses should be planted at 150 x 150 cm spacing.\"\n    },\n    {\n        \"Q\": \"What should be done to protect roses from downy mildew and powdery mildew?\",\n        \"A\": \"Spray copper Oxychloride 75 WP 20 g or Captan 50% WP 25 g per 10 liters of water if incidence is observed.\"\n    },\n    {\n        \"Q\": \"When should cattle be vaccinated against foot and mouth disease?\",\n        \"A\": \"Vaccination should be completed in September-October and March-April twice a year.\"\n    },\n    {\n        \"Q\": \"What is the recommended interval for vaccinating goats against PPR disease?\",\n        \"A\": \"Goats should be vaccinated once every three years.\"\n    },\n    {\n        \"Q\": \"What is a recommended practice to prevent vent pecking in poultry?\",\n        \"A\": \"Debeaking of birds is recommended to prevent vent pecking.\"\n    },\n    {\n        \"Q\": \"Which high-yielding Napier fodder variety is recommended for fodder management?\",\n        \"A\": \"BNH-10 is a recommended high-yielding Napier fodder variety.\"\n    },\n    {\n        \"Q\": \"What types of fish can be grown in mixed fish farming?\",\n        \"A\": \"Rohu, Katla, Mrigal, and Cyprinus can be grown in mixed fish farming.\"\n    },\n    {\n        \"Q\": \"What mulberry variety is recommended for higher leaf yield in sericulture?\",\n        \"A\": \"The V-1 mulberry variety is recommended for higher leaf yield.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What are some value-added products that can be made from Aonla fruits?\",\n        \"A\": \"Aonla fruits can be processed into products like Aonla candy, Aonla pulp, Aonla syrup, Aonla powder, and Aonla supari.\"\n    },\n    {\n        \"Q\": \"How can pomegranates be used to create value-added products?\",\n        \"A\": \"Pomegranates can be used to make Anardana and pomegranate juice.\"\n    },\n    {\n        \"Q\": \"What are some processed products that can be made from tomatoes?\",\n        \"A\": \"Tomatoes can be processed to make tomato ketchup and tomato sauce.\"\n    },\n    {\n        \"Q\": \"What value-added products can be made from green and red chillies?\",\n        \"A\": \"Green and red chillies can be processed to make chilli sauce, red chilli powder, and green chilli paste.\"\n    },\n    {\n        \"Q\": \"What is the recommended moisture level for storing sorghum and wheat grains for long-term storage?\",\n        \"A\": \"Sorghum and wheat grains should be stored at below 14% moisture for long-term storage.\"\n    },\n    {\n        \"Q\": \"What type of bags should be used for storing wheat and rice?\",\n        \"A\": \"Improved grain storage bags should be used for storing wheat, rice, and similar grains.\"\n    },\n    {\n        \"Q\": \"How can pulses like pigeon pea and chickpea be processed for higher returns?\",\n        \"A\": \"Pulses like pigeon pea, chickpea, green gram, and black gram should be processed into dal for higher returns.\"\n    },\n    {\n        \"Q\": \"What farming practice is recommended to conserve soil moisture?\",\n        \"A\": \"Use minimum tillage operations and avoid ploughing for land preparation to conserve soil moisture.\"\n    },\n    {\n        \"Q\": \"What irrigation method is suggested for chickpea crops at critical stages?\",\n        \"A\": \"Sprinkler irrigation is recommended for chickpea crops at critical stages like flowering and pod filling.\"\n    },\n    {\n        \"Q\": \"What tool should farm women use for intercultural operations in field crops to reduce drudgery?\",\n        \"A\": \"Farm women should use a cycle hoe for intercultural operations in field crops to reduce drudgery.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the recommended treatment for managing rust disease in late maturing groundnut crops?\",\n        \"A\": \"Spray 10 ml hexaconazole in 10 liters of water.\"\n    },\n    {\n        \"Q\": \"How should you determine if a groundnut crop is ready for harvest?\",\n        \"A\": \"Check randomly for pod filling and maturity; if grains are developing pink color, harvest the crop.\"\n    },\n    {\n        \"Q\": \"What is the recommended moisture level for threshing groundnut grains after sun drying?\",\n        \"A\": \"The moisture level should be below 8-7 percent.\"\n    },\n    {\n        \"Q\": \"What is the recommended practice for storing harvested groundnut pods?\",\n        \"A\": \"Store the pods in clean gunny bags in dry conditions.\"\n    },\n    {\n        \"Q\": \"When should top dressing with nitrogenous fertilizers be done for castor crops?\",\n        \"A\": \"Top dressing should be done at 70 days after sowing (DAS).\"\n    },\n    {\n        \"Q\": \"What is a recommended intercropping practice for castor to increase economic return?\",\n        \"A\": \"Intercropping with chickpea is recommended.\"\n    },\n    {\n        \"Q\": \"What irrigation method is highly recommended for cotton to save water and increase economic return?\",\n        \"A\": \"Drip irrigation is highly recommended.\"\n    },\n    {\n        \"Q\": \"What practice can be adopted between 75 and 100 DAS to increase boll setting in cotton?\",\n        \"A\": \"De topping, or cutting the terminal tip of plants, can be adopted.\"\n    },\n    {\n        \"Q\": \"What irrigation practice is recommended for pigeon pea to avoid yield loss?\",\n        \"A\": \"Ensure irrigation at flowering and pod filling stages.\"\n    },\n    {\n        \"Q\": \"What is the recommended practice for pomegranate to obtain fruits in 'Hast bahar'?\",\n        \"A\": \"Stop irrigation after monsoon and give recommended doses of fertilizers in September-October with two light irrigations.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"When is the preferable time for sowing crops in Gujarat state?\",\n        \"A\": \"Timely sowing in the 2nd and 3rd week of November is preferable to obtain a high yield of crops in Gujarat state.\"\n    },\n    {\n        \"Q\": \"What treatment is recommended for seed infestation by termites in sandy loam soils?\",\n        \"A\": \"Seed treatment with either bifenthrin 10 EC @ 200 ml OR fipronil 5 SC @ 600 ml in 5 liters of water per 100 kg of seed is useful to check termite infestation.\"\n    },\n    {\n        \"Q\": \"What should be done to avoid damping off disease in Rabi onion seedlings?\",\n        \"A\": \"To avoid damping off disease in Rabi onion seedlings, drench/spray copper-oxy-chloride @ 40 g / 10 liters if necessary.\"\n    },\n    {\n        \"Q\": \"Which varieties are recommended for red onion cultivation?\",\n        \"A\": \"Varieties for red onion include GJRO-11, Pusa Red, and Bhima Shakti.\"\n    },\n    {\n        \"Q\": \"When should sowing of Rabi maize be carried out?\",\n        \"A\": \"Sowing of Rabi maize can be carried out in the 2nd fortnight of October and 1st fortnight of November.\"\n    },\n    {\n        \"Q\": \"What is the recommended treatment for fall armyworm infestation in maize?\",\n        \"A\": \"For fall armyworm infestation, spray Bacillus thuringiensis-based formulation OR Beauveria bassiana @ 50 g / 10 liters of water. In case of heavy infestation, spray emamectin benzoate 5 SG @ 4 g OR chlorantraniliprole 18.5 SC @ 3 ml / 10 liters of water.\"\n    },\n    {\n        \"Q\": \"What are the recommended varieties for mustard cultivation?\",\n        \"A\": \"The recommended varieties for mustard cultivation are GDM-4 and GDM-6.\"\n    },\n    {\n        \"Q\": \"What is the recommended sowing time for cumin?\",\n        \"A\": \"Sowing of cumin variety GC-4 and GC-5 is recommended during the 1st fortnight of November.\"\n    },\n    {\n        \"Q\": \"Which variety is recommended for fennel cultivation?\",\n        \"A\": \"The variety recommended for fennel cultivation is GF-12.\"\n    },\n    {\n        \"Q\": \"When should sowing of semi-Rabi pearl millet be done?\",\n        \"A\": \"Sowing of semi-Rabi pearl millet crop can be done in the first fortnight of October.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What fungicides are recommended for seed treatment to protect from soil-borne pathogens?\",\n        \"A\": \"Vitavax or Thiram at 2.5 g/kg.\"\n    },\n    {\n        \"Q\": \"What is the recommended seed rate for sowing if the seed weight is 1000 seeds per 38-40 grams?\",\n        \"A\": \"100 kg/ha.\"\n    },\n    {\n        \"Q\": \"How should the seed rate be adjusted for every increase in seed weight?\",\n        \"A\": \"Add 2 kg of seed for every increase in seed weight.\"\n    },\n    {\n        \"Q\": \"What is the recommended NPK fertilizer dose for limited/partial irrigation?\",\n        \"A\": \"60:40:30 kg/ha.\"\n    },\n    {\n        \"Q\": \"What is the recommended dose of micronutrients for zinc and sulfur per hectare?\",\n        \"A\": \"Zinc - 25 kg/ha, Sulfur - 10 kg/ha.\"\n    },\n    {\n        \"Q\": \"What is the recommended irrigation schedule for one irrigation cycle?\",\n        \"A\": \"35-40 days.\"\n    },\n    {\n        \"Q\": \"Which herbicides are recommended for controlling broad leaf weeds?\",\n        \"A\": \"2-4D at 0.5 kg a.i./ha or Metsulphuron at 10g/ha.\"\n    },\n    {\n        \"Q\": \"What is the recommended seed treatment for chickpea to improve soil health?\",\n        \"A\": \"Use of PSB and Azotobactor 500g/100kg of seed.\"\n    },\n    {\n        \"Q\": \"What is the recommended sowing period for chickpea using the Ridge and Furrow method?\",\n        \"A\": \"First fortnight of November.\"\n    },\n    {\n        \"Q\": \"What is the recommended seed treatment for linseed for better germination and vigor?\",\n        \"A\": \"Carbendazim 2g + Mancozeb 1g and Imidacloprid 48 FS @ 1.25 ml/kg seed or Trichoderma viride @ 10 g/kg seed followed by PSB and Azotobactor @ 10g/kg seed.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the recommended fertilizer application ratio under irrigated conditions?\",\n        \"A\": \"80:40:20:20:5 N:P:K:S:Zn is recommended under irrigated conditions.\"\n    },\n    {\n        \"Q\": \"What is the recommended fertilizer application ratio under rainfed conditions?\",\n        \"A\": \"40:20:20:10:5 N:P:K:S:Zn is recommended under rainfed conditions.\"\n    },\n    {\n        \"Q\": \"What is an effective method for weed management at the 2-3 leaf stage?\",\n        \"A\": \"Metsulfuron methyl 4g a.i. + clodinophop 60g/1.25 ha land is effective against weed management at the 2-3 leaf stage.\"\n    },\n    {\n        \"Q\": \"What mechanical methods are effective for better aeration of the plant?\",\n        \"A\": \"Mechanical weeding methods such as dora, kulfa, cycle, or hand weeding are effective for better aeration.\"\n    },\n    {\n        \"Q\": \"What foliar spray is effective for better growth of the crop at the vegetative stage?\",\n        \"A\": \"Foliar spray of N:P:K:19:19:19 along with fungicide and insecticide is effective at the vegetative stage.\"\n    },\n    {\n        \"Q\": \"What equipment can be used to minimize labor costs during harvesting?\",\n        \"A\": \"A combine harvester under low RPM and ICAR RABI AgRo-AdvIsoRy foR fARmeRs 325 reaper cum binder can be used to minimize labor costs.\"\n    },\n    {\n        \"Q\": \"What is the best sowing time for mustard in the MP state?\",\n        \"A\": \"The best sowing time is from mid-October to mid-November.\"\n    },\n    {\n        \"Q\": \"What is the recommended seed rate for mustard?\",\n        \"A\": \"Use 5 kg seed per hectare.\"\n    },\n    {\n        \"Q\": \"What is the purpose of summer deep ploughing in the pre-sowing stage?\",\n        \"A\": \"Summer deep ploughing is done to kill fungal spores and the residual population of pests.\"\n    },\n    {\n        \"Q\": \"What seed treatment is recommended for managing seed-borne pathogens?\",\n        \"A\": \"Seed treatment with freshly prepared aqueous garlic bulb extract (2% w/v) or Trichoderma based product @ 10 g/kg or metalaxyl-M 31.8% ES @ 6 ml/kg seed is recommended.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What micronutrients are useful in pest management?\",\n        \"A\": \"Boron and zinc are useful in pest management.\"\n    },\n    {\n        \"Q\": \"Why should irrigation be avoided after the vegetative state?\",\n        \"A\": \"Irrigation after the vegetative state should be avoided to reduce Sclerotinia rot.\"\n    },\n    {\n        \"Q\": \"What is an initial method for managing aphid infestation?\",\n        \"A\": \"Hand picking of aphid-infested twigs is an initial method for managing aphid infestation.\"\n    },\n    {\n        \"Q\": \"Which natural enemies of aphids are conserved?\",\n        \"A\": \"Coccinella septempunctata, Chrysoperla carnea, and Syrphid fly are conserved as natural enemies of aphids.\"\n    },\n    {\n        \"Q\": \"What is the recommended application rate of glyphosate for controlling Orobanche?\",\n        \"A\": \"The recommended application rate of glyphosate is 25-50 g/ha at 30 and 50 days after sowing.\"\n    },\n    {\n        \"Q\": \"What is the purpose of releasing Chrysoperla in the field?\",\n        \"A\": \"Releasing Chrysoperla helps in controlling aphids.\"\n    },\n    {\n        \"Q\": \"How many irrigations are required for optimal sugarcane yield?\",\n        \"A\": \"2 to 3 irrigations are required for obtaining better yield potential in sugarcane.\"\n    },\n    {\n        \"Q\": \"What is the recommended pre-emergence herbicide for weed control in sugarcane?\",\n        \"A\": \"Pendimethalin at 1 to 1.5 l/ha is recommended for pre-emergence weed control in sugarcane.\"\n    },\n    {\n        \"Q\": \"Which sugarcane variety is recommended for Madhya Pradesh?\",\n        \"A\": \"Varieties like CoJN 86-600, CoJN 86-141, and Co 94008 (Shyama) are recommended for Madhya Pradesh.\"\n    },\n    {\n        \"Q\": \"What is the recommended nitrogen, phosphorus, and potash application for sugarcane?\",\n        \"A\": \"300 kg of nitrogen, 85 kg of phosphorus, and 60 kg of potash are recommended for sugarcane.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"How should setts be prepared before planting?\",\n        \"A\": \"Setts should be soaked in water for three hours before planting.\"\n    },\n    {\n        \"Q\": \"What age should the seed cane crop be for planting?\",\n        \"A\": \"The seed cane crop should be 8-10 months old for planting.\"\n    },\n    {\n        \"Q\": \"When should double line propping be done in sugarcane cultivation?\",\n        \"A\": \"Double line propping should be done at the age of 210 days of the crop.\"\n    },\n    {\n        \"Q\": \"What is the recommended depth for stubble shaving in ratoon crop management?\",\n        \"A\": \"Stubble shaving should be done to a depth of 4-6 cm along the ridges.\"\n    },\n    {\n        \"Q\": \"How should gaps in the ratoon sugarcane crop be filled?\",\n        \"A\": \"Gaps should be filled within 30 days of stubble shaving using sprouted cane stubbles from the same field.\"\n    },\n    {\n        \"Q\": \"What is the best method for gap filling in sugarcane if sprouted stubbles are not available?\",\n        \"A\": \"The next best method is gap filling with seedlings raised in polybags.\"\n    },\n    {\n        \"Q\": \"What should be applied to new fruit trees to protect against frost?\",\n        \"A\": \"Light irrigation should be given to new plants to minimize frost damage.\"\n    },\n    {\n        \"Q\": \"How can fruit trees be protected from termites and fungal diseases?\",\n        \"A\": \"Apply Bordeaux Paste on the trunk up to a height of 30 to 45 cm.\"\n    },\n    {\n        \"Q\": \"What should be done if mango trees show die-back symptoms?\",\n        \"A\": \"Prune the dead woods up to 5-10 cm of the green portion and spray copper oxychloride (0.3%) twice at 15-day intervals.\"\n    },\n    {\n        \"Q\": \"How should guava trees be pruned for better sunlight exposure?\",\n        \"A\": \"Prune the lower branches up to a height of 50-75 cm and cut the growing shoot to encourage lateral branches in the east-west direction.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"How often should sapota be irrigated to improve humidity and reduce fruit cracking?\",\n        \"A\": \"Sapota should be irrigated every 10-12 days.\"\n    },\n    {\n        \"Q\": \"What should be done to prevent banana stems from lodging due to high wind speed?\",\n        \"A\": \"Support the stem to prevent it from lodging.\"\n    },\n    {\n        \"Q\": \"What is crucial for managing livestock during extreme meteorological variations in winter?\",\n        \"A\": \"Provide proper shelter and care to livestock animals.\"\n    },\n    {\n        \"Q\": \"What should be ensured in livestock sheds to prevent diseases like pneumonia?\",\n        \"A\": \"Proper ventilation and no ammonia or nitrogen gas should be present in the shed.\"\n    },\n    {\n        \"Q\": \"What type of bedding should be used in livestock sheds during winter?\",\n        \"A\": \"Straw should be used as bedding to act as insulation and prevent heat loss.\"\n    },\n    {\n        \"Q\": \"What materials can be used to make curtains in sheds to obstruct wind?\",\n        \"A\": \"Curtains can be made from tarpaulin, bamboo, dry grass, guinea bags, or jute.\"\n    },\n    {\n        \"Q\": \"What should be done to avoid incidences of bloat in livestock during winter?\",\n        \"A\": \"Leguminous fodders should be mixed with non-legumes or wheat straw.\"\n    },\n    {\n        \"Q\": \"What is the recommended disinfectant solution for farm premises?\",\n        \"A\": \"1% hypochloride + bleaching powder (7gm in 1 liter of water) or 1% sodium hypochlorite.\"\n    },\n    {\n        \"Q\": \"What should be done to prevent colic and impaction in sheep and goats?\",\n        \"A\": \"Ensure clean, fresh, and lukewarm water in adequate quantities.\"\n    },\n    {\n        \"Q\": \"What is essential for maintaining poultry health during winter?\",\n        \"A\": \"Maintain proper shed temperature and provide ample lukewarm drinking water.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What is the purpose of using anti-stress vitamins such as vimeral in poultry?\",\n        \"A\": \"Anti-stress vitamins like vimeral are used to increase immunity and reduce climatic stress in poultry.\"\n    },\n    {\n        \"Q\": \"Why is a 6-inch depth of bedding material recommended in poultry houses during winter?\",\n        \"A\": \"A 6-inch depth of bedding material insulates chicks from the cooling effects of the ground and provides a cushion that offers warmth.\"\n    },\n    {\n        \"Q\": \"What diseases should chicks and birds be vaccinated against?\",\n        \"A\": \"Chicks and birds should be vaccinated against Ranikhet and IBD disease if not done earlier.\"\n    },\n    {\n        \"Q\": \"How often should deworming of birds be carried out?\",\n        \"A\": \"Deworming of birds should be carried out using a proper dewormer after every 3 months' interval.\"\n    },\n    {\n        \"Q\": \"What are some high-yielding wheat varieties suitable for irrigated ecosystems in Chhattisgarh?\",\n        \"A\": \"High-yielding wheat varieties include Ratan, Chhattisgarh Gehun-2, C.G. Gehun-3, and Chhattisgarh Amber wheat, among others.\"\n    },\n    {\n        \"Q\": \"What is the recommended seed rate for timely sown wheat?\",\n        \"A\": \"For timely sown wheat, the seed rate should be 100-125 kg per hectare.\"\n    },\n    {\n        \"Q\": \"When should wheat sowing be completed for timely sown varieties?\",\n        \"A\": \"Sowing of wheat should be completed by 25th November for timely sown varieties.\"\n    },\n    {\n        \"Q\": \"What is the recommended seed treatment before sowing wheat?\",\n        \"A\": \"Before sowing, wheat seeds should be treated with Carboxin at 2 g per kg of seed.\"\n    },\n    {\n        \"Q\": \"What is the recommended row to row spacing for wheat?\",\n        \"A\": \"The recommended row to row spacing for wheat is 20 cm.\"\n    },\n    {\n        \"Q\": \"What is the recommended application for controlling broad leaf weeds in wheat?\",\n        \"A\": \"Metsulfuron methyl at 1.6 grams active ingredient per acre should be applied 25-30 days after sowing for effective control of broad leaf weeds.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What type of soil in Chhattisgarh is suitable for chickpea cultivation?\",\n        \"A\": \"The har soils of Chhattisgarh plains are suitable for chickpea cultivation.\"\n    },\n    {\n        \"Q\": \"When should chickpea sowing be done in Chhattisgarh?\",\n        \"A\": \"Sowing should be done between 15th October to 30th November.\"\n    },\n    {\n        \"Q\": \"What is the recommended seed rate for timely sown chickpea?\",\n        \"A\": \"The seed rate should be 75-80 kg per hectare.\"\n    },\n    {\n        \"Q\": \"How should seeds be treated to protect chickpea from soil borne fungal diseases?\",\n        \"A\": \"Seeds should be treated by Carbendazim @ 2 g per kg seed.\"\n    },\n    {\n        \"Q\": \"What is the row spacing recommended for sowing chickpea?\",\n        \"A\": \"The row spacing should be 30 cm.\"\n    },\n    {\n        \"Q\": \"What is the major insect pest of chickpea and how is it managed?\",\n        \"A\": \"The major insect pest is the Gram pod borer, managed by applying Nuclear Polyhydrosis Virus 250 L.E. @ 500 litre water per hectare.\"\n    },\n    {\n        \"Q\": \"What are the improved varieties of lathyrus recommended for cultivation in Chhattisgarh?\",\n        \"A\": \"Improved varieties include Ratan, Prateek, and Maha Tiwda.\"\n    },\n    {\n        \"Q\": \"When should lathyrus sowing be completed in Chhattisgarh?\",\n        \"A\": \"Sowing should be completed between 15th October to 15th November.\"\n    },\n    {\n        \"Q\": \"What is the common disease of field pea and how can it be controlled?\",\n        \"A\": \"Powdery mildew is the common disease, controlled by timely sowing, balanced fertilizer application, and using Sulphur dust @ 25-30 kg/ha.\"\n    },\n    {\n        \"Q\": \"What are some improved varieties of field pea recommended for cultivation?\",\n        \"A\": \"Improved varieties include Ambika, Adarsh (I.P.F. 99-25), Shubhra, Paras, Vikas, Prakash, I.P.F.D.-10-12, Indira Matar-1, I.P.F.D. 12-2, and Pant P 243.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What are the recommended varieties of linseed for cultivation in Chhattisgarh?\",\n        \"A\": \"The recommended varieties of linseed are R-552, Kiran, T-397, Padmini, Shekhar, Indira Alsi-32, Kartika, Deepika, Indravati Alsi, R.L.C.-133, R.L.C.-143, R.L.C.-148, and R.L.C.-153.\"\n    },\n    {\n        \"Q\": \"What is the optimum sowing time for linseed in Chhattisgarh?\",\n        \"A\": \"The optimum sowing time for linseed in Chhattisgarh is from October to mid-November.\"\n    },\n    {\n        \"Q\": \"What seed rate is recommended for linseed under rainfed conditions?\",\n        \"A\": \"The seed rate for linseed under rainfed conditions is 30 kg/ha.\"\n    },\n    {\n        \"Q\": \"What seed treatment is recommended for linseed to protect against diseases?\",\n        \"A\": \"Seed should be treated with Carbendazim @ 2 g/kg seed to protect against seed and soil-borne diseases.\"\n    },\n    {\n        \"Q\": \"What are the recommended varieties of mustard for cultivation in Chhattisgarh?\",\n        \"A\": \"The recommended varieties of mustard are Pusa Jai Kisan (B.W.-902), Pusa Bold, Kranti (P.R.-15), Vardan (R.K. 1467), Varuna (T-59), Chhattisgarh Sarson-1, and Indira Toria-1.\"\n    },\n    {\n        \"Q\": \"What is the optimum sowing time for mustard in Chhattisgarh?\",\n        \"A\": \"The optimum sowing time for mustard in Chhattisgarh is between 15th October to 15th November.\"\n    },\n    {\n        \"Q\": \"What seed treatment is recommended for mustard before sowing?\",\n        \"A\": \"Mustard seeds should be treated with Carbendazim @ 1.5-2 g/kg seed before sowing.\"\n    },\n    {\n        \"Q\": \"What are the suitable varieties of safflower for cultivation in Chhattisgarh?\",\n        \"A\": \"Suitable varieties of safflower for cultivation in Chhattisgarh include A-1, Naari N.H.-1, Naari H-15, H.U.S.-305, Manjeera, P.B.N.S.-12, Naari-6, P.B.N.S.-40, Parbhani Kusum, Phule Kusum (J.L.S.F.-414), S.S.H.-129, Naari-38, and S.S.F.-658.\"\n    },\n    {\n        \"Q\": \"What is the optimum sowing period for safflower in Chhattisgarh?\",\n        \"A\": \"The optimum sowing period for safflower in Chhattisgarh is from 15th October to 15th November.\"\n    },\n    {\n        \"Q\": \"What are the recommended varieties of lentil for cultivation in Chhattisgarh?\",\n        \"A\": \"The recommended varieties of lentil are Lens-4076, I.P.L.-81 (Noori), J.L.-3, I.P.L.-316, R.V.L. 11-6, L-4717 (Pusa ageti Masoor), R.K.L.14-20 (Kota Masoor-2), L-4727, Kota Masoor-1 (RKL-607-1), and Chhattisgarh Masoor-1.\"\n    }\n]\n```",
    "```json\n[\n    {\n        \"Q\": \"What type of soil and conditions are best for growing maize as a fodder crop?\",\n        \"A\": \"Maize is a good fodder crop for well-drained sandy loam soils under irrigated conditions.\"\n    },\n    {\n        \"Q\": \"When should maize be sown for summer and rabi season crops?\",\n        \"A\": \"Maize should be sown by the end of February for the summer crop and in October-November for the rabi season crop.\"\n    },\n    {\n        \"Q\": \"What are the recommended varieties of maize for cultivation in Chhattisgarh?\",\n        \"A\": \"The recommended varieties are African Tall, Pratap Makka Chari – 6, Vijay, G.F.- 405, J.- 1006.\"\n    },\n    {\n        \"Q\": \"How often should irrigation be given to maize during summer and rabi seasons?\",\n        \"A\": \"During summer, irrigation should be given at 10-12 days intervals, and in rabi, at 15-20 days intervals.\"\n    },\n    {\n        \"Q\": \"What is Hybrid Napier and what are its benefits?\",\n        \"A\": \"Hybrid Napier is a multi-cut perennial fast-growing fodder crop that provides higher production, good quality, and digestibility.\"\n    },\n    {\n        \"Q\": \"What are the recommended varieties of Hybrid Napier for cultivation?\",\n        \"A\": \"The recommended varieties are C.O.-3, C.O.-5, R.B.N.-13, Sampoorn (DNH-6), IGFRI-7, and 10.\"\n    },\n    {\n        \"Q\": \"When and how should Hybrid Napier be planted?\",\n        \"A\": \"Under irrigated conditions, it should be planted by root or stem cuttings in February-March, with 60 cm row to row and plant to plant spacing.\"\n    },\n    {\n        \"Q\": \"What is the nutritional content of Berseem fodder?\",\n        \"A\": \"Berseem contains 17 to 21% protein, 12 to 15% dry matter, and is very digestible.\"\n    },\n    {\n        \"Q\": \"What are the recommended varieties of Berseem for cultivation in Chhattisgarh?\",\n        \"A\": \"The recommended varieties are Maskavi, Vardan, Bundel ICAR RABI AgRo-AdvIsoRy foR fARmeRs 338 Berseem-2, Bundel Berseem-3, J.B.-5, Pusa Jiant, U.P.B.-110, JHTB 96-4, B.L.-22.\"\n    },\n    {\n        \"Q\": \"What are the recommended varieties of tomato for cultivation in Chhattisgarh?\",\n        \"A\": \"The recommended varieties are Pusa early Dwarf, Sweet 72, Pusa Ruby, Pusa Gaurav, Naveen.\"\n    }\n]\n```"
]