[
    "{ Q: \"Who was the author of 'Symbolism in Gandhian politics'?\"\n                            A: \"Parel A\"\n                            Q: \"What is the relevance of biomass management according to Pathak BS?\"\n                            A: \"Biomass management is relevant for energy purposes, as discussed in the proceeding of a national seminar held at SPRERI, VV Nagar.\"\n                            Q: \"Which Indian organization published the 'Manual for District-Level Functionaries' for the Paramparagat Krishi Vikas Yojana (PKVY) scheme?\"\n                            A: \"The manual was retrieved from the website of the Department of Animal Husbandry, Dairying & Fisheries, Government of India.\"\n                            Q: \"What is the total number of farmers in India according to the Pocket Book of Agricultural Statistics (2019)?\"\n                            A: \"The total number of farmers in India in 2019 was 118.7 million.\"\n                            Q: \"Who wrote 'Gandhi and Swaraj'?\"\n                            A: \"Patil SH\"\n                            Q: \"What are the key issues in greenhouse gas emissions from Indian agriculture, according to Pathak et al. (2014)?\"\n                            A: \"Trends, mitigation, and policy needs are the key issues discussed in their report.\"\n                            Q: \"Which ministry published the ICAR–Committed to Generate Cost Effective and Environment Friendly Technologies press release in 2016?\"\n                            A: \"The Ministry of Agriculture & Farmers Welfare, Government of India.\"\n                            Q: \"What is the title of the 2019 presidential address by the National Academy of Agricultural Sciences (NAAS)?\"\n                            A: \"Feeding 1.7 Billion\"\n                            Q: \"Who wrote 'Gandhian Principles and Women Empowerment through Self-Help Groups'?\"\n                            A: \"Pereira M\" }",
    "Here are 10 question-answer pairs in JSON format based on the provided text corpus:\n\n```json\n{\n  \"QA_Pairs\": [\n    {\n      \"Q\": \"What are some key activities in modern agriculture?\",\n      \"A\": \"Precision farming, genetically modified crops, and sustainable irrigation techniques.\"\n    },\n    {\n      \"Q\": \"How does crop rotation help maintain soil fertility?\",\n      \"A\": \"Crop rotation helps maintain soil fertility by preventing depletion of nutrients and reducing pest and disease cycles.\"\n    },\n    {\n      \"Q\": \"What is the role of water management in agriculture?\",\n      \"A\": \"Water management, including irrigation and rainwater harvesting, ensures consistent crop yields, especially in drought-prone regions.\"\n    },\n    {\n      \"Q\": \"How does climate change impact agriculture?\",\n      \"A\": \"Climate change affects agriculture through unpredictable weather patterns, rising temperatures, and increased occurrences of droughts and floods.\"\n    },\n    {\n      \"Q\": \"What are some methods farmers use to protect crops from pests?\",\n      \"A\": \"Farmers use pesticides, biological control methods, and integrated pest management strategies.\"\n    },\n    {\n      \"Q\": \"What is the importance of millet grains in nutrition?\",\n      \"A\": \"Millet grains are rich in nutritional quality, with potential health benefits, as discussed in the paper by Saleh et al. (2013).\"\n    },\n    {\n      \"Q\": \"What is the role of Gandhian ideology in rural development?\",\n      \"A\": \"Gandhian ideology promotes sustainable rural development through its focus on self-sufficiency, simplicity, and grassroots empowerment, as highlighted by Sharma and Shikha (2016).\"\n    },\n    {\n      \"Q\": \"What are some challenges in ex-situ conservation of plant genetic resources?\",\n      \"A\": \"Challenges include maintaining genetic integrity, preventing contamination, and ensuring long-term survival, as discussed by Singh et al. (2004).\"\n    },\n    {\n      \"Q\": \"What is the Mera Gaon Mera Gaurav (MGMG) programme?\",\n      \"A\": \"The MGMG programme is an initiative aimed at improving agricultural production, profitability, and nutrition, as studied by Som et al. (2019).\"\n    },\n    {\n      \"Q\": \"What is the role of agricultural extension reforms in inclusive outreach?\",\n      \"A\": \"Agricultural extension reforms and institutional innovations help ensure inclusive outreach, enabling better access to information and resources for farmers, as discussed by Singh and Roy Burman (2020).\"\n    }\n  ]\n}\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"What are some of the key activities mentioned in the text related to agriculture?\",\n    \"A\": \"Crop cultivation, animal husbandry, fisheries, forestry, precision farming, genetically modified crops, sustainable irrigation, crop rotation, organic farming, pest management, water management, and soil health maintenance.\"\n  },\n  {\n    \"Q\": \"Which sector is agriculture primarily categorized under?\",\n    \"A\": \"The primary sector\"\n  },\n  {\n    \"Q\": \"What are some of the challenges faced by agriculture due to climate change?\",\n    \"A\": \"Unpredictable weather patterns, rising temperatures, droughts, and floods\"\n  },\n  {\n    \"Q\": \"How does modern agriculture improve productivity?\",\n    \"A\": \"Through practices like precision farming, genetically modified crops, and sustainable irrigation techniques\"\n  },\n  {\n    \"Q\": \"What are some methods used to maintain soil fertility?\",\n    \"A\": \"Fertilizers, crop rotation, and organic farming techniques\"\n  },\n  {\n    \"Q\": \"What is the importance of water management in agriculture?\",\n    \"A\": \"It ensures consistent crop yields, especially in drought-prone regions\"\n  },\n  {\n    \"Q\": \"What are some ways farmers protect crops from pests?\",\n    \"A\": \"Pesticides, biological control methods, and integrated pest management strategies\"\n  },\n  {\n    \"Q\": \"What are some of the benefits of grain legumes mentioned in the text?\",\n    \"A\": \"They are a boon to human nutrition\"\n  },\n  {\n    \"Q\": \"What is the role of governments and international organizations in supporting agriculture?\",\n    \"A\": \"They provide subsidies, research funding, and policies promoting sustainable farming practices\"\n  },\n  {\n    \"Q\": \"What are agricultural markets and supply chains crucial for?\",\n    \"A\": \"Ensuring fair prices for farmers and affordable food for consumers\"\n  }\n]\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"What is the primary goal of ICAR-CRIJAF's Vision 2025?\",\n    \"A\": \"To enhance agricultural productivity, profitability, and sustainability.\"\n  },\n  {\n    \"Q\": \"Who are the editors of the document?\",\n    \"A\": \"T. Mohapatra, Suresh Pal, and H. Pathak.\"\n  },\n  {\n    \"Q\": \"What are some of the authors' affiliations?\",\n    \"A\": \"Indian Council of Agricultural Research (ICAR), ICAR-National Institute of Agricultural Economics and Policy Research, ICAR-National Institute of Abiotic Stress Management, etc.\"\n  },\n  {\n    \"Q\": \"What is the focus of the paper by DP Vithal and GM Machewad (2006)?\",\n    \"A\": \"Processing of foxtail millet for improved nutrient availability.\"\n  },\n  {\n    \"Q\": \"What is the perspective of Mahatma Gandhi on millet, according to Yadav (2012)?\",\n    \"A\": \"Millet is considered a nutritious and sustainable crop, aligned with Gandhi's principles.\"\n  },\n  {\n    \"Q\": \"What compounds and activities were studied in the paper by LZ Zhang and RH Liu (2015)?\",\n    \"A\": \"Phenolic and carotenoid profiles and anti-proliferative activity of foxtail millet.\"\n  },\n  {\n    \"Q\": \"What is the role of the Department of Agricultural Research and Education?\",\n    \"A\": \"To conduct and coordinate agricultural research in India.\"\n  },\n  {\n    \"Q\": \"What are some of the divisions in the Indian Council of Agricultural Research (ICAR)?\",\n    \"A\": \"Agricultural Engineering, Animal Science, Agricultural Extension, Natural Resource Management, etc.\"\n  },\n  {\n    \"Q\": \"What is the focus of the ICAR-National Diary Research Institute?\",\n    \"A\": \"Research on dairy and its related products.\"\n  },\n  {\n    \"Q\": \"What is the role of the ICAR-Central Institute of Freshwater Aquaculture?\",\n    \"A\": \"Research and development in freshwater aquaculture.\"\n  }\n]\n```",
    "Here are 10 question-answer pairs based on the provided text, focusing on the authors and their affiliations:\n\n```json\n{\n  \"Q1\": \"Who is the Director of ICAR-National Bureau of Plant Genetic Resources in New Delhi?\",\n  \"A1\": \"Kuldeep Singh\",\n\n  \"Q2\": \"Where is ICAR-National Diary Research Institute located?\",\n  \"A2\": \"Karnal, Haryana\",\n\n  \"Q3\": \"Who is the Director General of Indian Council of Agricultural Research and Secretary, Department of Agricultural Research and Education?\",\n  \"A3\": \"T. Mohapatra\",\n\n  \"Q4\": \"Which institute is headed by Neeraj Kumar, Senior Scientist?\",\n  \"A4\": \"ICAR-National Institute of Abiotic Stress Management, Baramati, Maharashtra\",\n\n  \"Q5\": \"Who is the Director of ICAR-Indian Institute of Millets Research?\",\n  \"A5\": \"Nepolean T\",\n\n  \"Q6\": \"Where is ICAR-Indian Institute of Farming Systems Research located?\",\n  \"A6\": \"Modipuram, Uttar Pradesh\",\n\n  \"Q7\": \"Who is the Director of ICAR-Agricultural Technology Application Research Institute?\",\n  \"A7\": \"YG Prasad\",\n\n  \"Q8\": \"Which university is Gandhigram Rural Institute - Deemed University affiliated with?\",\n  \"A8\": \"Gandhigram, Tamilnadu\",\n\n  \"Q9\": \"Who is the Director of ICAR-Central Instituter for Research on Goats?\",\n  \"A9\": \"B. Rai\",\n\n  \"Q10\": \"Who is the Assistant Director General (AP&B) of Animal Science Division at Indian Council of Agricultural Research?\",\n  \"A10\": \"VK Saxena\"\n}\n```",
    "{ \"Q\": \"Who is the Director of ICAR-Indian Agricultural Research Institute, New Delhi?\",\n  \"A\": \"Singh AK\" },\n\n{ \"Q\": \"Which institute is Dr. S.K. Singh associated with?\",\n  \"A\": \"Directorate of Knowledge Management in Agriculture, Indian Council of Agricultural Research\" },\n\n{ \"Q\": \"What is the title of the publication compiled by Dr. Anil Kumar Saxena?\",\n  \"A\": \"Microbe Based Technologies Developed by ICAR\" },\n\n{ \"Q\": \"Who is the Secretary of the Department of Agricultural Research and Education and Director General of ICAR?\",\n  \"A\": \"Dr. Trilochan Mohaptra\" },\n\n{ \"Q\": \"What is the address of the Indian Council of Agricultural Research (ICAR)?\",\n  \"A\": \"Krishi Bhawan, New Delhi 110001\" },\n\n{ \"Q\": \"Who is the Joint Director (Research) at ICAR-Indian Agricultural Research Institute, New Delhi?\",\n  \"A\": \"Singh VK\" },\n\n{ \"Q\": \"What is the name of the publication's printer?\",\n  \"A\": \"M/s. Royal Offset Printers, A89/1, Naraina Industrial Area, Phase-I, New Delhi-110028\" },\n\n{ \"Q\": \"Who is the Assistant Director General (Agricultural Extension) at the Indian Council of Agricultural Research?\",\n  \"A\": \"Singh Randhir\" },\n\n{ \"Q\": \"What is the address of ICAR-National Bureau of Plant Genetic Resources?\",\n  \"A\": \"Hyderabad, Telangana\" },\n\n{ \"Q\": \"Who is the Director of ICAR-National Academy of Agricultural Research Management?\",\n  \"A\": \"Srinivasarao, Ch.\" }",
    "{ \"Q\": \"What is the role of microorganisms in sustainable agriculture?\",\n  \"A\": \"Microorganisms play a crucial role in sustainable agriculture by participating in biogeochemical cycles, nutrient solubilization, mineralization, mobilization, recycling of organic wastes, bioremediation, and soil formation.\"\n},\n{ \"Q\": \"What are some of the technologies mentioned for biofertilizers?\",\n  \"A\": \"Some of the technologies mentioned for biofertilizers include RhizoNBAIM Liquid Formulation, ZincFort, IronFort, Drought alleviating microbial formulation, and IARI-PUSA-Biofertilizer Technologies.\"\n},\n{ \"Q\": \"What is the purpose of Eco-Pesticide and Bio-Pulse?\",\n  \"A\": \"Eco-Pesticide and Bio-Pulse are used for disease management in agriculture.\"\n},\n{ \"Q\": \"What is the function of BioCompost Technology?\",\n  \"A\": \"BioCompost Technology is used for recycling organic wastes.\"\n},\n{ \"Q\": \"What is the role of Cyanobiocon (A & C) and Cyanonutricon?\",\n  \"A\": \"Cyanobiocon (A & C) and Cyanonutricon are involved in nutrient mobilization and recycling.\"\n},\n{ \"Q\": \"What is the purpose of IARI Compost Inoculant Technology?\",\n  \"A\": \"IARI Compost Inoculant Technology is used for in situ degradation of crop residue.\"\n},\n{ \"Q\": \"What is the role of Low Temperature Composting Consortium?\",\n  \"A\": \"Low Temperature Composting Consortium is involved in bioremediation.\"\n},\n{ \"Q\": \"What are the technologies mentioned for managing rice leaf folder?\",\n  \"A\": \"The technologies mentioned for managing rice leaf folder include Talc-Based Formulation Of Metarhizium, Talc-Based Formulation of Beauveria, Bentonite-Based Formulation of Bt, Suspension Concentrate (SC) formulation of DOR Bt-127, and Suspension Concentrate (SC) formulation of Beauveria bassiana.\"\n},\n{ \"Q\": \"What is the purpose of Trichoderma harzianum Th4d 20% SC and 1.5% WP?\",\n  \"A\": \"Trichoderma harzianum Th4d 20% SC and 1.5% WP are used for plant growth promotion and disease management.\"\n},\n{ \"Q\": \"What is the role of Arka Krishi Samrakshak, Arka Krishi Veera, Arka Krishi Vriddhi, and Arka Krishi Kawach?\",\n  \"A\": \"Arka Krishi Samrakshak, Arka Krishi Veera, Arka Krishi Vriddhi, and Arka Krishi Kawach are used for disease management and plant growth promotion in agriculture.\"\n}",
    "{ \"Q\": \"What is a major cause of declining soil health?\",\n  \"A\": \"Continuous cropping without recycling enough crop or animal residues and insufficient nutrient application.\",\n  \"Q\": \"What is a sustainable option to increase crop yield and improve soil health?\",\n  \"A\": \"Microbe mediated organic matter recycling.\",\n  \"Q\": \"What are the benefits of microbe based technologies in agriculture?\",\n  \"A\": \"They are low cost, eco-friendly, improve nutrient supply, and enhance soil health in the short and medium run.\",\n  \"Q\": \"Which organization has pioneered microbe based technologies in India?\",\n  \"A\": \"Indian Council of Agricultural Research (ICAR).\",\n  \"Q\": \"For how long has ICAR been involved in microbe based technologies?\",\n  \"A\": \"Since the 1960s.\",\n  \"Q\": \"What are some examples of microbe based technologies developed by ICAR?\",\n  \"A\": \"Biofertilizers, biopesticides, and compost inoculants.\",\n  \"Q\": \"What initiative has the Government of India taken to promote microbe based technologies?\",\n  \"A\": \"National Mission on Sustainable Agriculture (NMSA) promotes Integrated Nutrient Management (INM) using biofertilizers and composts.\",\n  \"Q\": \"When was the bulletin 'Microbe based technologies developed by ICAR' published?\",\n  \"A\": \"9th July 2020.\",\n  \"Q\": \"Which organization prepared the bulletin 'Microbe based technologies developed by ICAR'?\",\n  \"A\": \"ICAR-National Bureau of Agriculturally Important Microorganisms (NBAIM).\" }",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"What are the key roles microorganisms play in soil and agriculture?\",\n    \"A\": \"They are involved in nutrient solubilisation, mobilization, recycling, controlling soil-borne pathogens, stimulating plant growth, increasing nutrient availability, and accelerating decomposition of organic materials.\"\n  },\n  {\n    \"Q\": \"What percentage of the Indian population is engaged in farming?\",\n    \"A\": \"More than 50%\"\n  },\n  {\n    \"Q\": \"What is the primary goal of the ICAR in developing microbial technologies?\",\n    \"A\": \"To generate additional income for farmers or reduce initial farming investments by utilizing local microbial diversity for commercial and farming applications.\"\n  },\n  {\n    \"Q\": \"What is the name of the first microbial technology described in the bulletin?\",\n    \"A\": \"Bio NPK Liquid Biofertilizer\"\n  },\n  {\n    \"Q\": \"What are the three types of bacteria present in Bio NPK Liquid Biofertilizer and their functions?\",\n    \"A\": \"Azotobacter chroococcum (N2 fixing), Paenibacillus tylopili (P-solubilizing), and Bacillus decolorationis (K-solubilizing)\"\n  },\n  {\n    \"Q\": \"What is the shelf life of Bio NPK Liquid Biofertilizer?\",\n    \"A\": \"12-24 months\"\n  },\n  {\n    \"Q\": \"What are the target crops for Bio NPK Liquid Biofertilizer?\",\n    \"A\": \"Cereals, millets, pulses, vegetables, and oil-producing commercial crops\"\n  },\n  {\n    \"Q\": \"What are the methods of inoculation for Bio NPK Liquid Biofertilizer?\",\n    \"A\": \"Seed treatment, root dip for seedlings, and soil application for tree plants\"\n  },\n  {\n    \"Q\": \"Has Bio NPK Liquid Biofertilizer been patented?\",\n    \"A\": \"Yes, a patent application has been filed (CBR Number: 23706; patent numbered 3364/DEL/2015; dt 19.10.2015) for 'A Microbial Consortium'.\"\n  },\n  {\n    \"Q\": \"Which company has been licensed to use the Bio NPK Liquid Biofertilizer technology?\",\n    \"A\": \"M/s Monal\"\n  }\n]\n```",
    "{ \"Q\": \"What is the name of the company that developed Bio NPK?\", \"A\": \"ICAR-National Bureau of Agriculturally Important Microorganisms\" },\n{ \"Q\": \"What crops can Bio NPK be used for?\", \"A\": \"Rice, wheat, and maize\" },\n{ \"Q\": \"What is the potential saving of chemical fertilizers with Bio NPK?\", \"A\": \"25-30 kg of Nitrogen, 10-15 kg of Phosphorus, and 2-5 kg of Potassium\" },\n{ \"Q\": \"What is the estimated net saving per hectare with Bio NPK?\", \"A\": \"Rs. 2500\" },\n{ \"Q\": \"What are the bacterial species used in BIOGROW?\", \"A\": \"Bacillus sp. BC39, Bacillus sp. RC25, Pseudomonas sp. K30, and Pseudomonas sp. K31\" },\n{ \"Q\": \"Which crops can BIOGROW be used for?\", \"A\": \"Vegetable crops like tomato, brinjal, potato, and floriculture crops\" },\n{ \"Q\": \"What are the benefits of using BIOGROW on tomato?\", \"A\": \"Increased yield by 25-30% and improved nutritional quality with enhanced content of lycopene and β-carotene\" },\n{ \"Q\": \"What are the bacterial species used in Bio Phos and Bio Phos+?\", \"A\": \"Kluyvera cryocrescens (Bio Phos) and Paenibacillus tylopili (Bio Phos+)\" },\n{ \"Q\": \"What is the shelf life of Bio Phos and Bio Phos+ liquid formulations?\", \"A\": \"12 months\" },\n{ \"Q\": \"How can Bio Phos and Bio Phos+ be applied?\", \"A\": \"Seed treatment, root dip for seedlings, and soil application for tree plants\" }",
    "{ \"Q\": \"What is the primary constituent of Bio Phos and Bio Phos+?\",\n  \"A\": \"Phosphate-solubilizing microorganisms\",\n  \"Q\": \"How much P2O5 can be augmented using Bio Phos and Bio Phos+?\",\n  \"A\": \"15 to 20 kg P2O5 ha-1\",\n  \"Q\": \"What is the yield equivalence when using Bio Phos and Bio Phos+ with 30 kg P/ha in maize?\",\n  \"A\": \"Equivalent to 60 kg P/ha\",\n  \"Q\": \"How much yield increase can be expected in maize using Bio Phos and Bio Phos+ with 30 kg P/ha compared to RDF?\",\n  \"A\": \"~7%\",\n  \"Q\": \"What is the potential P fertilizer savings in wheat using Bio Phos and Bio Phos+ with 50% P?\",\n  \"A\": \"30 kg P2O5/ha\",\n  \"Q\": \"What is the primary constituent of Bio Zn?\",\n  \"A\": \"Zinc solubilizing bacteria (Bacillus endophyticus)\",\n  \"Q\": \"What are the target crops for Bio Zn?\",\n  \"A\": \"Cereals, millets, pulses, vegetables, and oil-producing commercial crops\",\n  \"Q\": \"What is the shelf life of Bio Zn?\",\n  \"A\": \"12 – 24 months\",\n  \"Q\": \"How much zinc sulfate can be saved per ha using Bio Zn?\",\n  \"A\": \"2 – 5 kg\",\n  \"Q\": \"What is the primary constituent of Bio Potash?\",\n  \"A\": \"K-solubilizing bacterium Bacillus decolorationis\",\n  \"Q\": \"What are the target crops for Bio Potash?\",\n  \"A\": \"Maize, wheat, mustard, and potato\",\n  \"Q\": \"What is the contact information for ICAR- NBAIM?\",\n  \"A\": \"Director, ICAR- National Bureau of Agriculturally Important Microorganisms, Mau- 275103\" }",
    "Here are 10 question-answer pairs based on the provided text, in JSON format:\n\n```json\n[\n  {\n    \"Q\": \"What is the name of the first microbial technology mentioned?\",\n    \"A\": \"Bio-Bacter\"\n  },\n  {\n    \"Q\": \"Which nitrogen-fixing bacterium is used in Bio-Bacter?\",\n    \"A\": \"Azotobacter chroococcum\"\n  },\n  {\n    \"Q\": \"What are the application methods for Bio-Bacter?\",\n    \"A\": \"Seed treatment, root dip for seedlings, and soil application for tree plants\"\n  },\n  {\n    \"Q\": \"How much nitrogen can Bio-Bacter save per hectare?\",\n    \"A\": \"20-25 kg N/ha\"\n  },\n  {\n    \"Q\": \"What is the name of the second microbial technology mentioned?\",\n    \"A\": \"RhizoNBAIM\"\n  },\n  {\n    \"Q\": \"Which crops are targeted by RhizoNBAIM?\",\n    \"A\": \"Leguminous crops like chickpea, pigeonpea, mungbean, urdbean, groundnut, pea, and lentil\"\n  },\n  {\n    \"Q\": \"How much nitrogen can RhizoNBAIM save per hectare?\",\n    \"A\": \"25-30 kg N/ha\"\n  },\n  {\n    \"Q\": \"What is the name of the third microbial technology mentioned?\",\n    \"A\": \"ZincFort\"\n  },\n  {\n    \"Q\": \"Which bacterium is used in ZincFort?\",\n    \"A\": \"Arthrobacter sp.\"\n  },\n  {\n    \"Q\": \"What is the shelf life of ZincFort?\",\n    \"A\": \"12 – 24 months\"\n  },\n  {\n    \"Q\": \"Where can these technologies be found commercially?\",\n    \"A\": \"On the website of Agrinnovate India Ltd.\"\n  },\n  {\n    \"Q\": \"Who can be contacted for more information about these technologies?\",\n    \"A\": \"Director, ICAR- National Bureau of Agriculturally Important Microorganisms, Mau- 275103\"\n  }\n]\n```",
    "Here are 10 question-answer pairs based on the provided text, in JSON format:\n\n```json\n[\n  {\n    \"Q\": \"What is the name of the technology that improves Zn content in wheat grains?\",\n    \"A\": \"IronFort\"\n  },\n  {\n    \"Q\": \"What is the microbial constituent of IronFort?\",\n    \"A\": \"An endophytic Arthrobacter sulfonivorans\"\n  },\n  {\n    \"Q\": \"How is IronFort applied to wheat crops?\",\n    \"A\": \"Through seed treatment\"\n  },\n  {\n    \"Q\": \"What is the expected increase in Zn content in wheat grains after IronFort inoculation?\",\n    \"A\": \"~35-40% (~45-50 ppm)\"\n  },\n  {\n    \"Q\": \"What is the expected increase in Fe content in wheat grains after IronFort inoculation?\",\n    \"A\": \"~40-45% (~55-65 ppm)\"\n  },\n  {\n    \"Q\": \"What is the name of the technology that saves irrigation water for wheat, maize, and mustard?\",\n    \"A\": \"Drought alleviating microbial formulation\"\n  },\n  {\n    \"Q\": \"What is the microbial constituent of the drought alleviating formulation?\",\n    \"A\": \"An archaea\"\n  },\n  {\n    \"Q\": \"How many irrigations can be saved by using the drought alleviating formulation?\",\n    \"A\": \"2-3\"\n  },\n  {\n    \"Q\": \"What is the expected impact of the drought alleviating formulation on plant growth?\",\n    \"A\": \"Sustains plant growth even in extreme water deficit\"\n  },\n  {\n    \"Q\": \"Where can interested parties contact for more information about these technologies?\",\n    \"A\": \"Director, ICAR- National Bureau of Agriculturally Important Microorganisms, Mau- 275103\"\n  }\n]\n```",
    "Here are 10 question-answer pairs based on the provided text about microbial-based technologies in agriculture:\n\n```json\n{\n  \"QA_Pairs\": [\n    {\n      \"Q\": \"What is the name of the bioformulation that consists of Pseudomonas fluorescens?\",\n      \"A\": \"Eco-Pesticide\"\n    },\n    {\n      \"Q\": \"What is the primary function of Pseudomonas fluorescens in Eco-Pesticide?\",\n      \"A\": \"It establishes robust and long-lasting colonization on root surfaces and penetrates into the epidermis of plants.\"\n    },\n    {\n      \"Q\": \"What is the shelf life of Eco-Pesticide under ambient room temperature?\",\n      \"A\": \"12 – 18 months\"\n    },\n    {\n      \"Q\": \"Which crops can Eco-Pesticide be used for?\",\n      \"A\": \"Cereals, millets, pulses, vegetables, and commercial plantation crops.\"\n    },\n    {\n      \"Q\": \"How can Eco-Pesticide be applied to crops?\",\n      \"A\": \"Through seed treatment, root dip for seedlings, and soil application for tree plants.\"\n    },\n    {\n      \"Q\": \"What is the name of the bioformulation that consists of Trichoderma harzianum and Bacillus amyloliquefaciens?\",\n      \"A\": \"Bio-Pulse\"\n    },\n    {\n      \"Q\": \"What are the properties of Bio-Pulse?\",\n      \"A\": \"It has biocontrol, plant growth promotion, nutrient mobilization, and root colonization properties.\"\n    },\n    {\n      \"Q\": \"What is the shelf life of Bio-Pulse?\",\n      \"A\": \"12 – 18 months\"\n    },\n    {\n      \"Q\": \"Which crops can Bio-Pulse be used for?\",\n      \"A\": \"Cereals, millets, pulses, vegetables, plantation crops, etc.\"\n    },\n    {\n      \"Q\": \"How can Bio-Pulse be applied to crops?\",\n      \"A\": \"Through seed treatment, root dip for seedlings, and soil application for tree and plantation crops.\"\n    }\n  ]\n}\n```",
    "Here are 10 question-answer pairs based on the provided text, in JSON format:\n\n```json\n[\n  {\n    \"Q\": \"What is the name of the technology developed by ICAR that uses beneficial microorganisms?\",\n    \"A\": \"BioCompost Technology\"\n  },\n  {\n    \"Q\": \"What are the main fungi used in the BioCompost formulation?\",\n    \"A\": \"Phanerochaete chrysosporium, Trichoderma viride, Aspergillus awamori and Pleurotus florida\"\n  },\n  {\n    \"Q\": \"What is the primary purpose of the BioCompost technology?\",\n    \"A\": \"To convert agricultural residue into mature compost\"\n  },\n  {\n    \"Q\": \"How long does the composting process take using BioCompost technology?\",\n    \"A\": \"65-70 days\"\n  },\n  {\n    \"Q\": \"What is the ratio of straw mix, cow dung, soil, and old compost used in the BioCompost process?\",\n    \"A\": \"8:1:0.5:0.5\"\n  },\n  {\n    \"Q\": \"What is the target agroecological zone for the BioCompost technology?\",\n    \"A\": \"Plains\"\n  },\n  {\n    \"Q\": \"What is the name of the technology that has been validated against various soil and seed borne pathogens?\",\n    \"A\": \"Bio-Pulse\"\n  },\n  {\n    \"Q\": \"What is the percentage reduction in wilt incidence in chickpea due to Bio-Pulse application?\",\n    \"A\": \"40-75%\"\n  },\n  {\n    \"Q\": \"How much yield increase can be expected in pea due to Bio-Pulse application under pathogenic stress?\",\n    \"A\": \"20-30%\"\n  },\n  {\n    \"Q\": \"Where can interested individuals contact for more information about these technologies?\",\n    \"A\": \"Director, ICAR- National Bureau of Agriculturally Important Microorganisms, Mau- 275103\"\n  }\n]\n```",
    "{ \"Q\": \"What is the name of the technology that uses microbial constituents to enhance soil fertility and crop yield?\",\n  \"A\": \"PUSA-Biofertilizer Technologies\",\n  \"Q\": \"Which institutes developed the PUSA-Biofertilizer Technologies?\",\n  \"A\": \"ICAR-IARI-PUSA\",\n  \"Q\": \"What are the main microbial constituents used in the PUSA-Biofertilizer Technologies?\",\n  \"A\": \"Rhizobium, Azotobacter, P-solubilizers, Azospirillum, Cyanobacteria, Mycorrhiza, Nitrogen Fixers, BGA (Blue Green Algae), Pseudomonas, Lactobacillus, Bacillus, and Vesicular Arbuscular Mycorrhizae\",\n  \"Q\": \"What are the delivery systems used for the PUSA-Biofertilizer Technologies?\",\n  \"A\": \"Seed coating, placement in furrows, machine spray, and broadcast in rice fields\",\n  \"Q\": \"Are there any specific agroecological zones targeted by these technologies?\",\n  \"A\": \"No, they can be used in all agroecological zones\",\n  \"Q\": \"How have the PUSA-Biofertilizer Technologies been validated and commercialized?\",\n  \"A\": \"They have been successfully validated in IARI and farmers' fields, and under AICRP trials. They have been commercialized and licensed to private companies through IARI-ZTM Unit\",\n  \"Q\": \"What are the benefits of using PUSA-Biofertilizer Technologies?\",\n  \"A\": \"They contribute 20-30 kg N/ha/season, increase crop yields by 8-25%, improve P uptake, and save 20-25 kg P2O5/ha. They also enhance soil health and augment K in a sustainable manner\",\n  \"Q\": \"How many hectares of cultivated land have been covered by PUSA-Biofertilizers?\",\n  \"A\": \"More than 10,000 ha\",\n  \"Q\": \"What is the cost-benefit ratio of using PUSA-Biofertilizer Technologies?\",\n  \"A\": \"1:3, taking Rs 6/ per kg as the minimum sale price\" }",
    "Here are 10 question-answer pairs based on the provided text about agricultural technologies developed by ICAR:\n\n```json\n{\n  \"QA_Pairs\": [\n    {\n      \"Q\": \"What is the application rate for BioFort technology?\",\n      \"A\": \"300 g/acre\"\n    },\n    {\n      \"Q\": \"Which micronutrients does BioFort technology significantly enrich in grains?\",\n      \"A\": \"Fe, Zn, and Mn\"\n    },\n    {\n      \"Q\": \"What is the expected increase in Fe, Zn, and Mn concentrations in grains with BioFort technology?\",\n      \"A\": \"13 – 40%\"\n    },\n    {\n      \"Q\": \"How much N savings can be achieved per hectare per season per crop with BioFort technology?\",\n      \"A\": \"40-60 kg\"\n    },\n    {\n      \"Q\": \"What is the expected increase in yields with BioFort technology?\",\n      \"A\": \"10-15%\"\n    },\n    {\n      \"Q\": \"Which crops are targeted by Cyanobiocon A & C technology?\",\n      \"A\": \"Nursery grown vegetables, cotton, and rice\"\n    },\n    {\n      \"Q\": \"What are the active microbial constituents in Cyanobiocon A & C technology?\",\n      \"A\": \"Anabaena laxa (A) or Calothrix elenkinii (C)\"\n    },\n    {\n      \"Q\": \"Which phytopathogenic fungi are targeted by Cyanobiocon A & C technology?\",\n      \"A\": \"Fusarium oxysporum / F. solani, Rhizoctonia solani, Macrophomina phaseolina, Magnaporthe oryzae, and Pythium aphanidermatum / P. debaryanum\"\n    },\n    {\n      \"Q\": \"What is the shelf life of BioFort and Cyanobiocon A & C formulations if stored in shade below 25 ºC?\",\n      \"A\": \"Six months\"\n    },\n    {\n      \"Q\": \"Which carrier is used for BioFort and Cyanobiocon A & C formulations?\",\n      \"A\": \"Compost: vermiculite, 1:1\"\n    }\n  ]\n}\n```",
    "Here are 10 question-answer pairs based on the provided text about microbial technologies developed by ICAR-IARI:\n\n```json\n{\n  \"QA_Pairs\": [\n    {\n      \"Q\": \"What is the name of the first microbial technology and its microbial constituents?\",\n      \"A\": \"Cyanonutricon - Plant growth promoting cyanobacterial formulation containing four cyanobacterial strains (Anabaena torulosa BF1, Nostoc carneum BF2, Nostoc piscinale BF3 and Anabaena doliolum BF4)\"\n    },\n    {\n      \"Q\": \"What crops can Cyanonutricon be used for?\",\n      \"A\": \"Rice, wheat, maize, cotton, vegetables, and flowers\"\n    },\n    {\n      \"Q\": \"How can Cyanonutricon be applied?\",\n      \"A\": \"As seedling dip, broadcast in fields, dried algal flakes, seed dressing, or potting mix supplements\"\n    },\n    {\n      \"Q\": \"What are the target agroecological zones for Cyanonutricon?\",\n      \"A\": \"Irrigated regions growing rice-wheat\"\n    },\n    {\n      \"Q\": \"What are the benefits of using Cyanonutricon?\",\n      \"A\": \"20-25 kg N savings/ha/season, enhanced N, P availability and uptake, yield enhancement of 15-20%, and enriching soil carbon status\"\n    },\n    {\n      \"Q\": \"What is the name of the second microbial technology?\",\n      \"A\": \"IARI Compost Inoculant Technology\"\n    },\n    {\n      \"Q\": \"What are the microbial constituents of the IARI Compost Inoculant Technology?\",\n      \"A\": \"A consortium of four lignocellulolytic fungi (Aspergillus nidulans, Trichoderma viride, Phanerochatae chrysosporium, and Aspergillus awamori)\"\n    },\n    {\n      \"Q\": \"What is the purpose of the IARI Compost Inoculant Technology?\",\n      \"A\": \"Composting of diverse agricultural waste\"\n    },\n    {\n      \"Q\": \"What are the benefits of using the IARI Compost Inoculant Technology?\",\n      \"A\": \"Improved compost quality, accelerated composting process, and enhanced nutrient availability\"\n    },\n    {\n      \"Q\": \"What is the contact information for further details about these technologies?\",\n      \"A\": \"Director, ICAR-Indian Agricultural Research Institute, Pusa, New Delhi-110012\"\n    }\n  ]\n}\n```",
    "Here are 10 question-answer pairs based on the provided text about microbial technologies developed by ICAR-IARI:\n\n```json\n{\n  \"QA_Pairs\": [\n    {\n      \"Q\": \"What crop residues are effectively decomposed by the first technology?\",\n      \"A\": \"Paddy straw, soybean trash, pearl millet, maize residues, and mustard stover.\"\n    },\n    {\n      \"Q\": \"How can the C:N ratio of crop residues be adjusted for better decomposition?\",\n      \"A\": \"By adding poultry droppings or cowdung in an 8:1 ratio.\"\n    },\n    {\n      \"Q\": \"How long does it take for 1 ton of crop residue to decompose using the first technology?\",\n      \"A\": \"60-75 days.\"\n    },\n    {\n      \"Q\": \"What are the target agroecological zones for the first technology?\",\n      \"A\": \"All ecological regions except cold climate.\"\n    },\n    {\n      \"Q\": \"What is the sufficient amount of inoculant for preparing 1-ton compost using the first technology?\",\n      \"A\": \"A packet of 500g.\"\n    },\n    {\n      \"Q\": \"What are the benefits of applying the compost prepared by the first technology?\",\n      \"A\": \"Significant increase in soil fertility status, microbial biomass, N, and available P; savings in chemical fertilizers.\"\n    },\n    {\n      \"Q\": \"What is the name of the microbial consortium used in the second technology?\",\n      \"A\": \"A consortium of efficient lignocellulolytic fungi Coprinopsis cinerea and Cyathus stercoreus.\"\n    },\n    {\n      \"Q\": \"What are the target crops for the second technology?\",\n      \"A\": \"Wheat and paddy.\"\n    },\n    {\n      \"Q\": \"How long does it take for the second technology to degrade paddy residue?\",\n      \"A\": \"15-25 days.\"\n    },\n    {\n      \"Q\": \"What are the target agroecological zones for the second technology?\",\n      \"A\": \"North western region of India.\"\n    }\n  ]\n}\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"What is the name of the technology developed by ICAR-CRIDA for composting rice straw and wheat straw?\",\n    \"A\": \"CRIDA Composting Technology\"\n  },\n  {\n    \"Q\": \"How long does it take for the technology to degrade paddy straw at low temperature?\",\n    \"A\": \"45 to 60 days\"\n  },\n  {\n    \"Q\": \"What is the significant reduction in decomposition time in hilly cold regions with this technology?\",\n    \"A\": \"From more than 90 days to less than 50 days\"\n  },\n  {\n    \"Q\": \"What is the contact information for ICAR-Indian Agricultural Research Institute?\",\n    \"A\": \"Director, ICAR-Indian Agricultural Research Institute, Pusa, New Delhi-110012\"\n  },\n  {\n    \"Q\": \"What are the microbial constituents of CRIDA Mixed Inoculum-I?\",\n    \"A\": \"Pseudomonas putida P7 + Paenibacillus favisporus strain B30\"\n  },\n  {\n    \"Q\": \"What is the target crop for CRIDA Mixed Inoculum-I?\",\n    \"A\": \"Sorghum\"\n  },\n  {\n    \"Q\": \"What is the delivery system for CRIDA Mixed Inoculum-I?\",\n    \"A\": \"Seed treatment\"\n  },\n  {\n    \"Q\": \"What is the increase in grain yield observed with CRIDA Mixed Inoculum-I under rainfed conditions?\",\n    \"A\": \"12-20%\"\n  },\n  {\n    \"Q\": \"What is the contact information for ICAR-Central Research Institute for Dryland Agriculture?\",\n    \"A\": \"Director, ICAR-Central Research Institute for Dryland Agriculture, Rajendranagar, Hyderabad- 500030\"\n  },\n  {\n    \"Q\": \"What are the microbial constituents of CRIDA Mixed Inoculum-II?\",\n    \"A\": \"Pseudomonas putida P45 + Bacillus amyloliquefaciens B17\"\n  },\n  {\n    \"Q\": \"What is the increase in yield of sunflower and sorghum with CRIDA Mixed Inoculum-II under rainfed conditions?\",\n    \"A\": \"upto 15-20%\"\n  },\n  {\n    \"Q\": \"What is the name of the microbial technology for biofortification in soybean and wheat?\",\n    \"A\": \"Bacillus aryabhattai MDSR14\"\n  },\n  {\n    \"Q\": \"What is the increase in seed yield of soybean with Bacillus aryabhattai MDSR14 inoculation?\",\n    \"A\": \"30.7%\"\n  },\n  {\n    \"Q\": \"What is the increase in seed yield of wheat with Bacillus aryabhattai MDSR14 inoculation?\",\n    \"A\": \"48.0%\"\n  }\n]\n```",
    "Here are 10 question-answer pairs based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"What is the name of the AMF consortium developed by ICAR for soybean and wheat crops?\",\n    \"A\": \"Glomus mosseae, Glomus intraradices and Glomus sp.\"\n  },\n  {\n    \"Q\": \"What is the target agroecological zone for the AMF consortium?\",\n    \"A\": \"Central Zone or regions with vertisols\"\n  },\n  {\n    \"Q\": \"How much can the on-farm production of AMF propagules increase from the initial level after three years?\",\n    \"A\": \"Up to 25 IP/g soil (from less than 1 IP/g soil)\"\n  },\n  {\n    \"Q\": \"What is the estimated shelf life of AMF propagules?\",\n    \"A\": \"Up to 50 °Celsius at 5-8% moisture\"\n  },\n  {\n    \"Q\": \"What is the name of the biocapsule technology developed by ICAR?\",\n    \"A\": \"Biocapsules\"\n  },\n  {\n    \"Q\": \"Which two companies have licensed the biocapsule technology?\",\n    \"A\": \"M/s Codagu Agritech and M/s SRT Agro Science Pvt. Ltd.\"\n  },\n  {\n    \"Q\": \"What is the expected coverage of biocapsule technology across India in the next five years?\",\n    \"A\": \"At least 20% of the area\"\n  },\n  {\n    \"Q\": \"Which microbial strains are commercialized in biocapsule form by M/s SRT Agro Science Pvt. Ltd.?\",\n    \"A\": \"Rhizobium and Azotobacter\"\n  },\n  {\n    \"Q\": \"What is the contact for the Director of ICAR-Indian Institute of Soybean Research?\",\n    \"A\": \"Near IT Park, Khandwa Road, Indore-452001\"\n  },\n  {\n    \"Q\": \"What is the contact for the Director of ICAR-Indian Institute of Spices Research?\",\n    \"A\": \"Marikunnu PO, Kozhikode-673012\"\n  }\n]\n```",
    "Here are 10 question-answer pairs based on the provided text about the Arka Microbial Consortium and Arka Actino-Plus technologies:\n\n```json\n[\n  {\n    \"Q\": \"What is the name of the microbial consortium and its constituent strains?\",\n    \"A\": \"Arka Microbial Consortium comprises Azotobacter tropicalis strain PAN MC 1, Bacillus aryabhattai strain Bel 6, and Pseudomonas taiwanensis strain Mpf2.\"\n  },\n  {\n    \"Q\": \"What are the target crops for the Arka Microbial Consortium?\",\n    \"A\": \"All horticultural crops.\"\n  },\n  {\n    \"Q\": \"What are the available delivery systems for the consortium?\",\n    \"A\": \"Solid carrier and liquid inoculum.\"\n  },\n  {\n    \"Q\": \"In which state has the consortium been widely used?\",\n    \"A\": \"Karnataka\"\n  },\n  {\n    \"Q\": \"When was the consortium approved for commercial use?\",\n    \"A\": \"2011\"\n  },\n  {\n    \"Q\": \"How many entrepreneurs and organizations have been licensed to produce the consortium?\",\n    \"A\": \"Thirteen\"\n  },\n  {\n    \"Q\": \"What is the total installed capacity of the licensees to produce the consortium?\",\n    \"A\": \"1000 t/annum\"\n  },\n  {\n    \"Q\": \"What is the name of the Actinobacterial formulation and its constituent strains?\",\n    \"A\": \"Arka Actino-Plus comprises Streptomyces viridobrunneus strain Pan Act1, Streptomyces bullii strain Pan Act2, and Streptomyces griseorubens strain Pan Act3.\"\n  },\n  {\n    \"Q\": \"What are the target crops for Arka Actino-Plus?\",\n    \"A\": \"All horticultural crops.\"\n  },\n  {\n    \"Q\": \"When was Arka Actino-Plus approved for commercial use?\",\n    \"A\": \"2015\"\n  }\n]\n```",
    "Here are 10 question-answer pairs based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"What is the name of the first technology and its microbial constituents?\",\n    \"A\": \"Arka Fermented Cocopeat, produced by Aspergillus heteromorphus strain PATHLF-1, Aspergillus heteromorphus strain HSGLF-1, and enriched with Arka Microbial Consortium\"\n  },\n  {\n    \"Q\": \"Which crops can Arka Fermented Cocopeat be used for?\",\n    \"A\": \"All horticultural crops, nursery-raised crops, and field crops like sugarcane\"\n  },\n  {\n    \"Q\": \"What is the target agroecological zone for Arka Fermented Cocopeat?\",\n    \"A\": \"All\"\n  },\n  {\n    \"Q\": \"When was Arka Fermented Cocopeat approved for commercial use?\",\n    \"A\": \"2011\"\n  },\n  {\n    \"Q\": \"How many entrepreneurs has Arka Fermented Cocopeat been licensed to?\",\n    \"A\": \"Five\"\n  },\n  {\n    \"Q\": \"What is the cost reduction per kg of cocopeat with Arka Fermented Cocopeat?\",\n    \"A\": \"Rs. 2\"\n  },\n  {\n    \"Q\": \"What is the name of the second technology?\",\n    \"A\": \"Soilless Arbuscular Mycorrhizal Fungal Inoculum\"\n  },\n  {\n    \"Q\": \"Which crops can the Soilless Arbuscular Mycorrhizal Fungal Inoculum be used for?\",\n    \"A\": \"All horticultural crops except those belonging to families Brassicaceae and Chenopodiaceae\"\n  },\n  {\n    \"Q\": \"When was the Soilless Arbuscular Mycorrhizal Fungal Inoculum approved for commercial use?\",\n    \"A\": \"2016\"\n  },\n  {\n    \"Q\": \"What are the benefits of the Soilless Arbuscular Mycorrhizal Fungal Inoculum?\",\n    \"A\": \"Increased propagule density per gram of inoculum, freedom from nematodes\"\n  }\n]\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"What is the name of the coconut seedling bioinoculant developed by ICAR?\",\n    \"A\": \"KeraProbioTM\"\n  },\n  {\n    \"Q\": \"Which genus and species of bacteria is used in KeraProbioTM?\",\n    \"A\": \"Bacillus megaterium\"\n  },\n  {\n    \"Q\": \"What are the primary plant growth promotion properties of the bacteria in KeraProbioTM?\",\n    \"A\": \"Hormone production and pathogen suppression activities\"\n  },\n  {\n    \"Q\": \"Which crops is KeraProbioTM effective for, besides coconut?\",\n    \"A\": \"Tomato, brinjal, and chilli\"\n  },\n  {\n    \"Q\": \"In which agroecological zones has KeraProbioTM been validated?\",\n    \"A\": \"Kerala\"\n  },\n  {\n    \"Q\": \"What is the name of the commercialized product by the Farmers First Program (FFP) group based on KeraProbioTM?\",\n    \"A\": \"Kalpakam Kera Probio\"\n  },\n  {\n    \"Q\": \"What are the main benefits of applying KeraProbioTM to coconut seedlings?\",\n    \"A\": \"Improved root growth, better nutrition uptake, quicker growth, and yield enhancement of 10-12% nuts/palm/yr\"\n  },\n  {\n    \"Q\": \"What is the name of the cocoa seedling bioinoculant developed by ICAR?\",\n    \"A\": \"CocoaProbioTM\"\n  },\n  {\n    \"Q\": \"Which genus and species of bacteria is used in CocoaProbioTM?\",\n    \"A\": \"Pseudomonas putida\"\n  },\n  {\n    \"Q\": \"What was the increase in dry matter contents in cocoa seedlings after applying CocoaProbioTM?\",\n    \"A\": \"56%\"\n  }\n]\n```",
    "Here are 10 question-answer pairs based on the provided text about microbial-based technologies developed by ICAR for coconut cultivation:\n\n```json\n{\n  \"QA_Pairs\": [\n    {\n      \"Q\": \"What is the dominant arbuscular mycorrhizal (AM) species isolated from coconut agro-ecosystems with high potential to increase coconut seedling growth?\",\n      \"A\": \"Claroideoglomus etunicatum\"\n    },\n    {\n      \"Q\": \"What is the name of the technology using this AM species?\",\n      \"A\": \"Not explicitly stated in the text\"\n    },\n    {\n      \"Q\": \"Where was this AM species evaluated for its potential?\",\n      \"A\": \"Different coconut growing places in Kerala\"\n    },\n    {\n      \"Q\": \"What is the name of the vermicompost technology developed using coconut leaves and cow dung?\",\n      \"A\": \"Kalpa Organic Gold\"\n    },\n    {\n      \"Q\": \"What is the primary benefit of using Kalpa Organic Gold in coconut cultivation?\",\n      \"A\": \"It can meet 25% of the nitrogen requirement of coconut palms in a 1 ha area\"\n    },\n    {\n      \"Q\": \"What is the estimated yield improvement with the use of Kalpa Organic Gold?\",\n      \"A\": \"24% (approx 11 nuts/palm)\"\n    },\n    {\n      \"Q\": \"What is the name of the technology using coir-pith for composting?\",\n      \"A\": \"Kalpa Soil Care\"\n    },\n    {\n      \"Q\": \"What are the primary nutrients in the coir-pith compost produced by Kalpa Soil Care?\",\n      \"A\": \"1.3-1.4 %N, 0.9-1.2% P, and 1.3 to 1.6 % K\"\n    },\n    {\n      \"Q\": \"How long does it take to compost coir-pith using Kalpa Soil Care?\",\n      \"A\": \"60 days\"\n    },\n    {\n      \"Q\": \"Which companies have licensed the Kalpa Soil Care technology?\",\n      \"A\": \"Biotech Division, SPIC, Combatore; Cladis Pvt. Ltd., Calicut; Chooral Coir Unit, Payyanur, Kerala; Banana Biotech Pvt. Ltd., Andhra Pradesh\"\n    }\n  ]\n}\n```",
    "Here are 10 question-answer pairs based on the provided text about microbial-based technologies for groundnut cultivation:\n\n```json\n{\n  \"QA_Pairs\": [\n    {\n      \"Q\": \"What is the name of the first microbial-based technology mentioned?\",\n      \"A\": \"NutBoost\"\n    },\n    {\n      \"Q\": \"Which microorganisms are present in the NutBoost formulation?\",\n      \"A\": \"Pseudomonas gessardii BHU1, Pseudomonas putida S1(6), and Pseudomonas aeruginosa BM6\"\n    },\n    {\n      \"Q\": \"What are the target crops for NutBoost?\",\n      \"A\": \"Groundnut\"\n    },\n    {\n      \"Q\": \"How can NutBoost be applied?\",\n      \"A\": \"Through irrigation water, FYM, drip, or as seed treatment\"\n    },\n    {\n      \"Q\": \"What is the expected increase in pod yield with NutBoost seed inoculation?\",\n      \"A\": \"16.5 to 18.1%\"\n    },\n    {\n      \"Q\": \"What is the name of the second microbial-based technology mentioned?\",\n      \"A\": \"NutMagic\"\n    },\n    {\n      \"Q\": \"Which microorganisms are present in the NutMagic formulation?\",\n      \"A\": \"Pseudomonas gessardii BHU1, Pseudomonas putida S1(6), Enterobacter cloacae BM8, Bacillus polymyxa, Sinorhizobium americanum NRCG4, and Rhizobium sp. NRCG9\"\n    },\n    {\n      \"Q\": \"How does NutMagic enhance nutrient uptake?\",\n      \"A\": \"It improves mobilization and uptake of nutrients like P, K, N, Fe, Zn, Mn, etc.\"\n    },\n    {\n      \"Q\": \"What is the expected increase in biological nitrogen fixation with NutMagic?\",\n      \"A\": \"25-30%\"\n    },\n    {\n      \"Q\": \"Which institute developed both NutBoost and NutMagic technologies?\",\n      \"A\": \"ICAR (Indian Council of Agricultural Research)\"\n    }\n  ]\n}\n```",
    "Here are 10 question-answer pairs based on the provided text about microbial technologies developed by ICAR for groundnut cultivation:\n\n```json\n{\n  \"QA_Pairs\": [\n    {\n      \"Q\": \"What is the name of the technology that uses Thiram for groundnut yield enhancement?\",\n      \"A\": \"Thiram\"\n    },\n    {\n      \"Q\": \"What is the potential yield advantage of using Thiram?\",\n      \"A\": \"Up to 20%\"\n    },\n    {\n      \"Q\": \"What is the shelf life of Thiram at room temperature?\",\n      \"A\": \"More than 1 year\"\n    },\n    {\n      \"Q\": \"How much nitrogenous, phosphatic, and potassic fertilizers can be saved by using NutMagic?\",\n      \"A\": \"25-30%, 30-40%, and 25% respectively\"\n    },\n    {\n      \"Q\": \"What is the name of the microbial technology that stimulates plant growth and suppresses soil-borne pathogens in groundnut?\",\n      \"A\": \"NutGrow\"\n    },\n    {\n      \"Q\": \"Which microorganisms constitute the NutGrow technology?\",\n      \"A\": \"Diacetyl-fluoroglucinol producing multiple plant growth phloroglucinol fluorescent pseudomonads (Pseudomonas putida DAPG2, P. putida DAPG4, P. fluorescens FP98, and Pseudomonas putida FP86)\"\n    },\n    {\n      \"Q\": \"What is the reduction in groundnut seedling mortality achieved by NutGrow?\",\n      \"A\": \"From 73-82% to 21-42%\"\n    },\n    {\n      \"Q\": \"How much does NutGrow improve the yield of groundnut cultivar GG20?\",\n      \"A\": \"13-21%\"\n    },\n    {\n      \"Q\": \"What is the reduction in collar and stem rot incidence achieved by NutGrow?\",\n      \"A\": \"40-60%\"\n    },\n    {\n      \"Q\": \"What is the name of the technology that alleviates drought stress in groundnut, soybean, and pigeonpea?\",\n      \"A\": \"DroughtGuard\"\n    },\n    {\n      \"Q\": \"Which bacterium is used in the DroughtGuard technology?\",\n      \"A\": \"Bacillus firmus J22\"\n    }\n  ]\n}\n```",
    "Here are 10 question-answer pairs based on the provided text about microbial technologies developed by ICAR:\n\n```json\n{\n  \"QA_Pairs\": [\n    {\n      \"Q\": \"What are the key benefits of using drought-stress alleviating endophytic bacteria in summer groundnut cultivation?\",\n      \"A\": \"Water saving (3-4 irrigations), horizontal expansion of irrigated area, economic benefits (doubling production and income), and yield improvement (up to 32%) in farmers' fields.\"\n    },\n    {\n      \"Q\": \"How does Bacillus firmus J22 help in improving groundnut yield?\",\n      \"A\": \"It prevents yield losses up to 20%, increases pod yield by an average of 17.9%, and increases haulm yield by 6%.\"\n    },\n    {\n      \"Q\": \"What is the net return and benefit-cost ratio (BCR) for groundnut cultivation with endophytic bacterial seed treatment?\",\n      \"A\": \"Net return of Rs 79,320/ha and BCR of 2.37.\"\n    },\n    {\n      \"Q\": \"Which districts in Gujarat are particularly benefited by the use of endophytic bacteria for groundnut cultivation?\",\n      \"A\": \"Kachchh, Porbandar, Junagadh, Dwarka, Gir-Somnath, and Surendranagar districts.\"\n    },\n    {\n      \"Q\": \"What is the name of the technology that uses microbially derived biopolymer for smart farming?\",\n      \"A\": \"Microbial biopolymer for smart farming.\"\n    },\n    {\n      \"Q\": \"What is the primary function of the microbially derived biopolymer in smart farming?\",\n      \"A\": \"To improve soil health, water retention, and nutrient availability.\"\n    },\n    {\n      \"Q\": \"Which crops are targeted by the microbial biopolymer technology?\",\n      \"A\": \"Cereals, oilseeds, and vegetables.\"\n    },\n    {\n      \"Q\": \"What is the expected increase in crop yield with the use of microbial biopolymer?\",\n      \"A\": \"Up to 20-30%.\"\n    },\n    {\n      \"Q\": \"How is the microbial biopolymer applied to crops?\",\n      \"A\": \"As a soil amendment or through foliar spray.\"\n    },\n    {\n      \"Q\": \"Who is the contact person for more information about these microbial technologies developed by ICAR?\",\n      \"A\": \"Director, ICAR-Directorate of Groundnut Research, Ivnagar Road, PB No. 5, Junagadh-362001\"\n    }\n  ]\n}\n```",
    "Here are 10 question-answer pairs based on the provided text:\n\n```json\n{\n  \"QA_Pairs\": [\n    {\n      \"Q\": \"What is the primary microbial constituent of Goa Bio-1?\",\n      \"A\": \"Bacillus methylotrophicus strain STC-4\"\n    },\n    {\n      \"Q\": \"What is the shelf life of Goa Bio-1?\",\n      \"A\": \"More than 24 months\"\n    },\n    {\n      \"Q\": \"Under what conditions can Goa Bio-1 be stored?\",\n      \"A\": \"Ambient temperature\"\n    },\n    {\n      \"Q\": \"Which crops can Goa Bio-1 be used for?\",\n      \"A\": \"Paddy, vegetable crops, black pepper, fruit and plantation crop nurseries\"\n    },\n    {\n      \"Q\": \"What are the delivery methods for Goa Bio-1?\",\n      \"A\": \"Seed treatment, soil application in nursery and main field\"\n    },\n    {\n      \"Q\": \"What is the target agroecological zone for Goa Bio-1?\",\n      \"A\": \"All\"\n    },\n    {\n      \"Q\": \"Where was Goa Bio-1 validated?\",\n      \"A\": \"ICAR- CCARI, Goa\"\n    },\n    {\n      \"Q\": \"What is the name of the biopolymer derived from Rhizobium sp. associated with Psoralea corylifolia L.?\",\n      \"A\": \"Not explicitly named in the text\"\n    },\n    {\n      \"Q\": \"What are the unique properties of the biopolymer?\",\n      \"A\": \"Excellent gelability, heat stability, diversity of reactive functional groups, ability to induce microbial colonization\"\n    },\n    {\n      \"Q\": \"Which crops has the biopolymer been validated for?\",\n      \"A\": \"Sorghum, soybean, maize, brinjal, onion, fenugreek\"\n    }\n  ]\n}\n```",
    "{ Q: What is the name of the technology discussed in the text?\n                            A: Goa Bio-2\n                            Q: What is the microbial constituent of Goa Bio-2?\n                            A: Bacillus methylotrophicus RCh6-2b\n                            Q: What is the shelf life of Goa Bio-2 talc formulation?\n                            A: More than 24 months without any loss of bacterial populations (8 log CFU g-1)\n                            Q: Can Goa Bio-2 be stored under ambient temperature?\n                            A: Yes\n                            Q: Which crops can Goa Bio-2 be used in?\n                            A: Vegetable crops (brinjal, tomato, chilli, cucumber), black pepper, and fruit and plantation crop nurseries\n                            Q: How is Goa Bio-2 applied?\n                            A: Through seed treatment, soil application in nursery and main field\n                            Q: What are the benefits of using Goa Bio-2?\n                            A: Improved plant growth parameters, plant health, and yield; reduced soil-borne diseases incidence; important component in IPM strategy; eco-friendly and fits in organic farming concept\n                            Q: What is the reduction in soil-borne diseases incidence in chilli with Goa Bio-2?\n                            A: 40-60% wilt and root rot\n                            Q: What is the reduction in soil-borne diseases incidence in black pepper with Goa Bio-2?\n                            A: 70-80% foot rot\n                            Q: Where can I find more information about Goa Bio-2?\n                            A: Contact Director, ICAR- Central Coastal Agricultural Research Institute, Old Goa 403 402, Goa.}",
    "Here are 10 question-answer pairs based on the provided text about the two microbial-based technologies developed by ICAR:\n\n```json\n{\n  \"QA_Pairs\": [\n    {\n      \"Q\": \"What is the name of the first technology and its microbial constituent?\",\n      \"A\": \"Liquid bioinoculant of endophytic nitrogen fixing bacteria (Azotobacter chroococcum Avi2)\"\n    },\n    {\n      \"Q\": \"What is the target crop for this technology?\",\n      \"A\": \"Rice crop\"\n    },\n    {\n      \"Q\": \"What are the delivery systems for applying this bioinoculant?\",\n      \"A\": \"Seed treatment and root dip for seedlings\"\n    },\n    {\n      \"Q\": \"What is the target agroecological zone for this technology?\",\n      \"A\": \"Eastern region of India\"\n    },\n    {\n      \"Q\": \"What is the shelf life of this bioinoculant?\",\n      \"A\": \"More than 12 months\"\n    },\n    {\n      \"Q\": \"What is the name of the second technology and its microbial constituent?\",\n      \"A\": \"Liquid bioinoculant of rhizospheric nitrogen fixing bacteria (Azotobacter vinelandii SRIAz3)\"\n    },\n    {\n      \"Q\": \"How much chemical fertilizer usage can this technology help save?\",\n      \"A\": \"Up to 15-25% of the recommended dose\"\n    },\n    {\n      \"Q\": \"What is the contact for more information about these technologies?\",\n      \"A\": \"Director, ICAR-National Rice Research Institute, Cuttack – 753006\"\n    },\n    {\n      \"Q\": \"Where were these technologies validated?\",\n      \"A\": \"Multiple locations of farmers’ fields (30 villages of Cuttack & Puri district) and NRRI field\"\n    },\n    {\n      \"Q\": \"How do these bioinoculants help maintain crop yield?\",\n      \"A\": \"They can save chemical fertilizer usage by up to 25% without compromising yield and growth of the plants, and application with 75% RDF resulted in at par yield in rice\"\n    }\n  ]\n}\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"What is the name of the first biopesticide technology and its microbial constituent?\",\n    \"A\": \"Talc-based formulation of Metarhizium anisopliae TF19\"\n  },\n  {\n    \"Q\": \"What is the target crop for this biopesticide?\",\n    \"A\": \"Rice leaf folder\"\n  },\n  {\n    \"Q\": \"What is the delivery system for this biopesticide?\",\n    \"A\": \"Spraying\"\n  },\n  {\n    \"Q\": \"What is the target agroecological zone for this biopesticide?\",\n    \"A\": \"Eastern region of India\"\n  },\n  {\n    \"Q\": \"What is the leaf folder mortality rate achieved by this biopesticide in farmers' fields?\",\n    \"A\": \"76.83%\"\n  },\n  {\n    \"Q\": \"What is the name of the second biopesticide technology and its microbial constituent?\",\n    \"A\": \"Talc-based formulation of Beauveria bassiana TF6\"\n  },\n  {\n    \"Q\": \"What is the shelf life of the second biopesticide?\",\n    \"A\": \"More than 8 months\"\n  },\n  {\n    \"Q\": \"What is the leaf folder mortality rate achieved by the second biopesticide in farmers' fields?\",\n    \"A\": \"74.00%\"\n  },\n  {\n    \"Q\": \"What is the name of the third biopesticide technology and its microbial constituent?\",\n    \"A\": \"Bentonite-based formulation of Bt (TB160)\"\n  },\n  {\n    \"Q\": \"What is the target agroecological zone for the third biopesticide?\",\n    \"A\": \"Not specified in the provided text\"\n  }\n]\n```",
    "Here are 10 question-answer pairs based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"What is the microbial constituent of the biopesticide TB160?\",\n    \"A\": \"Bacillus thuringiensis\"\n  },\n  {\n    \"Q\": \"Which pest is the biopesticide TB160 used to manage?\",\n    \"A\": \"Rice leaf folder\"\n  },\n  {\n    \"Q\": \"What is the delivery system for applying TB160?\",\n    \"A\": \"Spraying\"\n  },\n  {\n    \"Q\": \"In which region is TB160 primarily used?\",\n    \"A\": \"Eastern region of India\"\n  },\n  {\n    \"Q\": \"What is the shelf life of the bentonite-based formulation of Bt (TB160)?\",\n    \"A\": \"More than 8 months\"\n  },\n  {\n    \"Q\": \"What is the patent number for the technology using TB160?\",\n    \"A\": \"264/KOL/2015\"\n  },\n  {\n    \"Q\": \"What is the leaf folder mortality rate achieved by TB160 in farmers' fields?\",\n    \"A\": \"82.34%\"\n  },\n  {\n    \"Q\": \"What are the benefits of using TB161 over chemical pesticides?\",\n    \"A\": \"It saves from harmful effects on soil and human health\"\n  },\n  {\n    \"Q\": \"What is the leaf folder mortality rate achieved by TB161 in farmers' fields?\",\n    \"A\": \"79.29%\"\n  },\n  {\n    \"Q\": \"Who is the contact person for more information about these technologies?\",\n    \"A\": \"Director, ICAR-National Rice Research Institute, Cuttack-753006\"\n  }\n]\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"What is the name of the first biopesticide technology mentioned?\",\n    \"A\": \"Bentonite-based formulation of Bt (TB261)\"\n  },\n  {\n    \"Q\": \"What is the target pest for this biopesticide?\",\n    \"A\": \"Rice leaf folder\"\n  },\n  {\n    \"Q\": \"How long does the first biopesticide's shelf life last?\",\n    \"A\": \"More than 8 months\"\n  },\n  {\n    \"Q\": \"What is the target agroecological zone for the first biopesticide?\",\n    \"A\": \"Eastern region of India\"\n  },\n  {\n    \"Q\": \"What is the name of the second biopesticide technology mentioned?\",\n    \"A\": \"Bentonite-based formulation of Bt (TB263)\"\n  },\n  {\n    \"Q\": \"How long does the second biopesticide's shelf life last?\",\n    \"A\": \"More than 12 months\"\n  },\n  {\n    \"Q\": \"What is the leaf folder mortality rate achieved by the second biopesticide in farmers' fields?\",\n    \"A\": \"73.24%\"\n  },\n  {\n    \"Q\": \"What is the name of the third biopesticide technology mentioned?\",\n    \"A\": \"Suspension Concentrate (SC) formulation of DOR Bt-127\"\n  },\n  {\n    \"Q\": \"What is the active microbial constituent in the third biopesticide?\",\n    \"A\": \"Bacillus thuringiensis var. kurstaki strain DOR Bt- 127\"\n  },\n  {\n    \"Q\": \"What is the contact information for the Director of ICAR-National Rice Research Institute?\",\n    \"A\": \"Director, ICAR-National Rice Research Institute, Cuttack-753006\"\n  }\n]\n```",
    "{ \"Q\": \"What are the target pests for the Bt-127 strain?\",\n  \"A\": \"Helicoverpa armigera, Achaea janata, Spodoptera exigua, and S. litura\" },\n\n{ \"Q\": \"What is the maximum temperature at which Bt-127 strain is effective?\",\n  \"A\": \"40°C\" },\n\n{ \"Q\": \"What is the potency of Bt-127 strain against Helicoverpa armigera?\",\n  \"A\": \"34,833 IU/mg\" },\n\n{ \"Q\": \"Which crops are the target for Bt-127 SC formulation evaluation under AICRP?\",\n  \"A\": \"Soybean, castor, sunflower, cotton, and groundnut\" },\n\n{ \"Q\": \"What is the active ingredient in the Beauveria bassiana SC formulation?\",\n  \"A\": \"Beauveria bassiana\" },\n\n{ \"Q\": \"What is the target pest for the Beauveria bassiana SC formulation?\",\n  \"A\": \"Helicoverpa armigera on pigeon pea\" },\n\n{ \"Q\": \"What is the carrier used in the Beauveria bassiana SC formulation?\",\n  \"A\": \"Mineral oil\" },\n\n{ \"Q\": \"How many companies have been licensed to use the Beauveria bassiana technology?\",\n  \"A\": \"Four\" },\n\n{ \"Q\": \"What is the contact information for the Director of ICAR-Indian Institute of Oilseed Research?\",\n  \"A\": \"Director, ICAR-Indian Institute of Oilseed Research, Rajendranagar, Hyderabad- 500030\" },\n\n{ \"Q\": \"What are the benefits of using the Beauveria bassiana SC formulation?\",\n  \"A\": \"It is effective against H. armigera and T. orichalcea on sunflower, not phytotoxic, eco-friendly, and safe to non-target organisms and beneficial insects.\" }",
    "Here are 10 question-answer pairs based on the provided text about microbial-based technologies developed by ICAR:\n\n```json\n{\n  \"QA_Pairs\": [\n    {\n      \"Q\": \"What is the microbial constituent and formulation of the first technology?\",\n      \"A\": \"Trichoderma harzianum Th4d, Suspension Concentrate (SC)\"\n    },\n    {\n      \"Q\": \"What are the target diseases for the first technology?\",\n      \"A\": \"Phytophthora seedling blight, Macrophomina root rot, Fusarium wilt, Grey mold, Alternaria aster leaf blight, powdery mildew\"\n    },\n    {\n      \"Q\": \"What is the shelf life of the first technology?\",\n      \"A\": \"More than 18 months\"\n    },\n    {\n      \"Q\": \"How many companies have licensed the first technology?\",\n      \"A\": \"4\"\n    },\n    {\n      \"Q\": \"What is the dosage required for the first technology?\",\n      \"A\": \"1 or 2ml/kg seed/L water\"\n    },\n    {\n      \"Q\": \"What is the microbial constituent and formulation of the second technology?\",\n      \"A\": \"Trichoderma harzianum Th4d, Wettable powder (WP)\"\n    },\n    {\n      \"Q\": \"What are the target diseases for the second technology?\",\n      \"A\": \"Phytophthora seedling blight, Macrophomina root rot, Fusarium wilt\"\n    },\n    {\n      \"Q\": \"How many private firms have shown interest in transferring the second technology?\",\n      \"A\": \"2\"\n    },\n    {\n      \"Q\": \"What is the shelf life of the second technology?\",\n      \"A\": \"More than 18 months\"\n    },\n    {\n      \"Q\": \"What is the microbial constituent and formulation of the third technology?\",\n      \"A\": \"Trichoderma asperellum Ta DOR 7316, 5% WP\"\n    }\n  ]\n}\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"What is the name of the technology and its microbial constituent for controlling soil-borne diseases in safflower and castor?\",\n    \"A\": \"Wettable powder of thermo-tolerant strain of Trichoderma asperellum TaDOR7316\"\n  },\n  {\n    \"Q\": \"How is the technology applied in safflower?\",\n    \"A\": \"As seed treatment under drought conditions\"\n  },\n  {\n    \"Q\": \"What are the target agroecological zones for this technology?\",\n    \"A\": \"All\"\n  },\n  {\n    \"Q\": \"Where are multi-locational field trials being conducted for this technology?\",\n    \"A\": \"AICRP centres of Safflower and Castor\"\n  },\n  {\n    \"Q\": \"What is the name of the microbial constituent for managing white grubs in sugarcane?\",\n    \"A\": \"Metarhizium anisopliae ICAR-NBAIR Ma 4\"\n  },\n  {\n    \"Q\": \"What is the delivery system for the Metarhizium anisopliae ICAR-NBAIR Ma 4 technology?\",\n    \"A\": \"Soil application of M. anisopliae enriched Farm Yard Manure\"\n  },\n  {\n    \"Q\": \"What is the target crop for the Metarhizium anisopliae ICAR-NBAIR Ma 4 technology?\",\n    \"A\": \"Sugarcane\"\n  },\n  {\n    \"Q\": \"What is the name of the microbial constituent for managing Fall armyworm in maize?\",\n    \"A\": \"Metarhizium anisopliae ICAR-NBAIR Ma 35\"\n  },\n  {\n    \"Q\": \"What are the formulations developed for Metarhizium anisopliae ICAR-NBAIR Ma 35?\",\n    \"A\": \"Talc formulation (2% W. P) and oil formulation\"\n  },\n  {\n    \"Q\": \"What is the target crop for the Metarhizium anisopliae ICAR-NBAIR Ma 35 technology?\",\n    \"A\": \"Maize\"\n  }\n]\n```",
    "Here are 10 question-answer pairs based on the provided text:\n\n```json\n{\n  \"QA_Pairs\": [\n    {\n      \"Q\": \"What is the name of the technology and its microbial constituent for managing fall armyworm in maize?\",\n      \"A\": \"Metarhizium anisopliae ICAR-NBAIR Ma 35\"\n    },\n    {\n      \"Q\": \"How many foliar sprays were applied to control fall armyworm in maize?\",\n      \"A\": \"Three\"\n    },\n    {\n      \"Q\": \"What was the interval between each foliar spray for fall armyworm control?\",\n      \"A\": \"10 days\"\n    },\n    {\n      \"Q\": \"What was the dose of Metarhizium anisopliae ICAR-NBAIR Ma 35 used for fall armyworm control?\",\n      \"A\": \"5g/ml/liter containing 1 x 108cfu/ml\"\n    },\n    {\n      \"Q\": \"What was the percentage reduction in plant damage caused by fall armyworm in maize?\",\n      \"A\": \"33-76%\"\n    },\n    {\n      \"Q\": \"What was the increase in yield after using Metarhizium anisopliae ICAR-NBAIR Ma 35?\",\n      \"A\": \"38-53%\"\n    },\n    {\n      \"Q\": \"What is the microbial constituent for managing Rugose Spiralling Whitefly in coconut and oil palm?\",\n      \"A\": \"Isaria fumosorosea ICAR-NBAIR Pfu-5\"\n    },\n    {\n      \"Q\": \"What are the target crops for Isaria fumosorosea ICAR-NBAIR Pfu-5?\",\n      \"A\": \"Coconut and Oil Palm\"\n    },\n    {\n      \"Q\": \"What was the percentage reduction of Rugose Spiralling Whitefly in coconut and oil palm after using Isaria fumosorosea ICAR-NBAIR Pfu-5?\",\n      \"A\": \"74-75%\"\n    },\n    {\n      \"Q\": \"What is the microbial constituent for managing aphids in various crops?\",\n      \"A\": \"Beauveria bassiana ICAR-NBAIR Bb-5a\"\n    }\n  ]\n}\n```",
    "Here are 10 question-answer pairs based on the provided text, in JSON format:\n\n```json\n[\n  {\n    \"Q\": \"What are the main advantages of using Beauveria bassiana ICAR-NBAIR Bb-5a over chemical insecticides?\",\n    \"A\": \"It has no deleterious effects on non-target organisms and is more environmentally friendly.\"\n  },\n  {\n    \"Q\": \"What crops were tested for the effectiveness of Beauveria bassiana ICAR-NBAIR Bb-5a?\",\n    \"A\": \"Chilli, brinjal, cabbage, and cowpea\"\n  },\n  {\n    \"Q\": \"What is the application method for Beauveria bassiana ICAR-NBAIR Bb-5a?\",\n    \"A\": \"Foliar application\"\n  },\n  {\n    \"Q\": \"What is the expected yield increase after using Beauveria bassiana ICAR-NBAIR Bb-5a?\",\n    \"A\": \"20-33%\"\n  },\n  {\n    \"Q\": \"What is the name of the technology based on Lecanicillium lecanii ICAR-NBAIR Vl-8 strain?\",\n    \"A\": \"Lecanicillium lecanii ICAR-NBAIR Vl-8\"\n  },\n  {\n    \"Q\": \"What crops can be treated with Lecanicillium lecanii ICAR-NBAIR Vl-8?\",\n    \"A\": \"Chilli and cowpea\"\n  },\n  {\n    \"Q\": \"What is the expected aphid reduction after using Lecanicillium lecanii ICAR-NBAIR Vl-8?\",\n    \"A\": \"77-78%\"\n  },\n  {\n    \"Q\": \"What is the expected yield increase after using Lecanicillium lecanii ICAR-NBAIR Vl-8?\",\n    \"A\": \"24-27%\"\n  },\n  {\n    \"Q\": \"What is the name of the plant growth-promoting bacterial strain developed by ICAR?\",\n    \"A\": \"Bacillus megaterium NBAII EXB-53\"\n  },\n  {\n    \"Q\": \"What is the primary function of Bacillus megaterium NBAII EXB-53?\",\n    \"A\": \"Promoting plant growth\"\n  }\n]\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text about microbial technologies in agriculture:\n\n```json\n[\n  {\n    \"Q\": \"What is the name of the first microbial technology discussed?\",\n    \"A\": \"Ant growth promoter\"\n  },\n  {\n    \"Q\": \"Which vegetable crops has the ant growth promoter been tested on?\",\n    \"A\": \"Chilli, capsicum, tomato, eggplant, cauliflower and cabbage\"\n  },\n  {\n    \"Q\": \"What are the two formulations developed for the ant growth promoter?\",\n    \"A\": \"Talc and liquid based formulations\"\n  },\n  {\n    \"Q\": \"What is the shelf life of the ant growth promoter formulations?\",\n    \"A\": \"12 months\"\n  },\n  {\n    \"Q\": \"Which company has licensed the ant growth promoter technology?\",\n    \"A\": \"Agribiocare, Kottayam, Kerala\"\n  },\n  {\n    \"Q\": \"How does seed treatment with the talc-based formulation of B. megaterium NBAII EXB53 affect seedling vigor index in chilli varieties?\",\n    \"A\": \"Increased by 20 to 245% compared to untreated control\"\n  },\n  {\n    \"Q\": \"What is the name of the second microbial technology discussed?\",\n    \"A\": \"Maru sena 1\"\n  },\n  {\n    \"Q\": \"Which genus and species is the microbial constituent of Maru sena 1?\",\n    \"A\": \"Trichoderma harzianum\"\n  },\n  {\n    \"Q\": \"What are the target crops for Maru sena 1?\",\n    \"A\": \"Legumes, oil seeds crops, vegetables and seed species, specifically cumin\"\n  },\n  {\n    \"Q\": \"In which agroecological zones is Maru sena 1 targeted?\",\n    \"A\": \"Arid and semi-arid regions\"\n  }\n]\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text about ICAR-FUSICONT, a microbial-based technology developed by ICAR:\n\n```json\n[\n  {\n    \"Q\": \"What is the name of the bio-formulation and its microbial constituents?\",\n    \"A\": \"ICAR-FUSICONT is a bio-formulation developed using antagonistic fungal isolate CSR-T-3 of Trichoderma reesei and a bacterial PGPR isolate CSR-A-11 of Lysinibacillus fusiforms.\"\n  },\n  {\n    \"Q\": \"What is the effective shelf life of ICAR-FUSICONT?\",\n    \"A\": \"It has an effective shelf life of 14-18 months when stored at ambient temperature.\"\n  },\n  {\n    \"Q\": \"Which crops can ICAR-FUSICONT be applied to?\",\n    \"A\": \"It can be applied in the control of wilt diseases in banana, vegetables (tomato, potato, capsicum, chillies) and spices (cumin and fenugreek).\"\n  },\n  {\n    \"Q\": \"How is ICAR-FUSICONT applied as a seed treatment?\",\n    \"A\": \"It can be applied as seed treatment with 1% solution prepared by dissolving 10 g in 1 litre of water along with 2 g of jaggery.\"\n  },\n  {\n    \"Q\": \"How is ICAR-FUSICONT applied in the field?\",\n    \"A\": \"Field application through drenching with 3 percent solution at the critical stages of the crop growth.\"\n  },\n  {\n    \"Q\": \"What are the target agroecological zones for ICAR-FUSICONT?\",\n    \"A\": \"All\"\n  },\n  {\n    \"Q\": \"Where has ICAR-FUSICONT been validated?\",\n    \"A\": \"It has been validated in the hot spots of banana wilt affected regions of Uttar Pradesh and Bihar, and under AICRP fruits program in several universities across India.\"\n  },\n  {\n    \"Q\": \"How has ICAR-FUSICONT helped in controlling cumin wilt?\",\n    \"A\": \"It has been validated for control of cumin wilt in the Jodhpur region.\"\n  },\n  {\n    \"Q\": \"What is the cost benefit ratio of ICAR-FUSICONT?\",\n    \"A\": \"The cost benefit ratio varies from 1:25 to 1:50, depending on the crop and growing season.\"\n  },\n  {\n    \"Q\": \"How has ICAR-FUSICONT benefited banana growers?\",\n    \"A\": \"Its application could restore 273 acres of wilt affected banana plantations back into cultivation and restricted the proliferation of the disease to other districts. It also revived the income of banana growers in the hotspot region to about 16.38 crores.\"\n  }\n]\n```",
    "Here are 10 question-answer pairs based on the provided text about the microbial biopesticides Arka Krishi Samrakshak and Arka Krishi Veera:\n\n```json\n{\n  \"QA_Pairs\": [\n    {\n      \"Q\": \"What is the microbial constituent of Arka Krishi Samrakshak?\",\n      \"A\": \"Pseudomonas fluorescens IIHR Pf-2\"\n    },\n    {\n      \"Q\": \"What are the target crops for Arka Krishi Samrakshak?\",\n      \"A\": \"capsicum, onion, cabbage, cauliflower, crossandra, roses, gerbera, banana, grapes, guava, acid lime, papaya, tomato and egg plant\"\n    },\n    {\n      \"Q\": \"How can Arka Krishi Samrakshak be applied?\",\n      \"A\": \"seed treatment, substrate treatment and soil application\"\n    },\n    {\n      \"Q\": \"What pathogens and nematodes does Arka Krishi Samrakshak control?\",\n      \"A\": \"soil borne pathogens and nematodes, including root-knot nematode (Meloidogyne incognita), Fusarium oxysporum f.sp. vasinfectum, Ralstonia solanacearum, Erwinia caratovora and Fusarium solani\"\n    },\n    {\n      \"Q\": \"How much yield increase is reported with Arka Krishi Samrakshak?\",\n      \"A\": \"13.2 to 21.8% in several horticultural crops\"\n    },\n    {\n      \"Q\": \"What is the microbial constituent of Arka Krishi Veera?\",\n      \"A\": \"Trichoderma viride IIHR Tv-5\"\n    },\n    {\n      \"Q\": \"What are the target crops for Arka Krishi Veera?\",\n      \"A\": \"Same as Arka Krishi Samrakshak\"\n    },\n    {\n      \"Q\": \"How can Arka Krishi Veera be applied?\",\n      \"A\": \"Same as Arka Krishi Samrakshak\"\n    },\n    {\n      \"Q\": \"How many industry licensees have been granted for Arka Krishi Samrakshak and Arka Krishi Veera?\",\n      \"A\": \"168 and 177 respectively\"\n    },\n    {\n      \"Q\": \"What is the contact for more information about these technologies?\",\n      \"A\": \"Director, ICAR-Indian Institute of Horticultural Research, Bengaluru-560089\"\n    }\n  ]\n}\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text about the biopesticides Arka Krishi Vriddhi and Arka Krishi Kawach:\n\n```json\n[\n  {\n    \"Q\": \"What is the name of the biopesticide containing Trichoderma harzianum IIHR Th-2?\",\n    \"A\": \"Arka Krishi Vriddhi\"\n  },\n  {\n    \"Q\": \"How is Arka Krishi Vriddhi delivered to target crops?\",\n    \"A\": \"Seed treatment, substrate treatment, and soil application\"\n  },\n  {\n    \"Q\": \"Which crops can Arka Krishi Vriddhi be used on?\",\n    \"A\": \"Capsicum, onion, cabbage, cauliflower, crossandra, roses, gerbera, banana, grapes, guava, acid lime, papaya, tomato, and eggplant\"\n  },\n  {\n    \"Q\": \"What is the active ingredient in Arka Krishi Kawach?\",\n    \"A\": \"Purpureocillium lilacinum (formerly Paecilomyces lilacinus) IIHR Pl-2\"\n  },\n  {\n    \"Q\": \"How is Arka Krishi Kawach applied?\",\n    \"A\": \"Seed treatment, substrate treatment, and soil application\"\n  },\n  {\n    \"Q\": \"What are the target pests of Arka Krishi Kawach?\",\n    \"A\": \"Root-knot nematode (Meloidogyne spp.) and reniform nematode (Rotylenchulus reniformis)\"\n  },\n  {\n    \"Q\": \"What diseases can Arka Krishi Vriddhi help control?\",\n    \"A\": \"Fusarium oxysporum f. sp. vasinfectum, Fusarium oxysporum f. sp. lycopersici, Sclerotium rolfsii, and Fusarium solani\"\n  },\n  {\n    \"Q\": \"How much yield increase has been observed with Arka Krishi Vriddhi?\",\n    \"A\": \"12.8 to 16.3% in several horticultural crops\"\n  },\n  {\n    \"Q\": \"What is the potential reduction in chemical pesticide usage with Arka Krishi Vriddhi?\",\n    \"A\": \"30-50%\"\n  },\n  {\n    \"Q\": \"What is the estimated net saving per acre by using Arka Krishi Vriddhi?\",\n    \"A\": \"Rs.12000 to Rs.15000\"\n  }\n]\n```",
    "{ \"Q\": \"What is the primary constituent of Arka Krishi Rakshak?\", \"A\": \"Pochonia chlamydosporia (formerly Verticillium chlamydosporium) IIHR Vc-3, a promising nematophagus fungus.\" },\n{ \"Q\": \"How can Arka Krishi Rakshak be applied?\", \"A\": \"It can be inoculated as seed treatment, substrate treatment and soil application.\" },\n{ \"Q\": \"Which nematodes does Arka Krishi Rakshak target?\", \"A\": \"Root-knot nematode (Meloidogyne sp.), reniform nematode (Rotylenchulus reniformis), banana nematode (Radopholus similis), and citrus nematode (Tylenchulus semipenetrans).\" },\n{ \"Q\": \"What is the yield increase observed with Arka Krishi Rakshak?\", \"A\": \"14.2 to 17.8% in several horticultural crops under field conditions.\" },\n{ \"Q\": \"How much chemical nematicide usage can be reduced with Arka Krishi Rakshak?\", \"A\": \"40 to 50%\" },\n{ \"Q\": \"What is the net saving per acre by reducing chemical nematicide usage with Arka Krishi Rakshak?\", \"A\": \"Rs. 8000 to Rs. 10000 per acre.\" },\n{ \"Q\": \"What are the microbial constituents of Arka Krishi All-rounder and Arka Plant Growth Booster?\", \"A\": \"Pseudomonas fluorescens and Trichoderma harzianum.\" },\n{ \"Q\": \"What are the formulations of Arka Krishi All-rounder and Arka Plant Growth Booster?\", \"A\": \"Arka Krishi All-rounder is talc-based, and Arka Plant Growth Booster is liquid-based.\" },\n{ \"Q\": \"Which crops can Arka Krishi All-rounder and Arka Plant Growth Booster be applied to?\", \"A\": \"All horticultural crops.\" },\n{ \"Q\": \"How have these technologies been validated?\", \"A\": \"They have been validated at multiple locations under All India Coordinated Research Projects and tested in different agro-climatic regions for two seasons.\" }",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"What is the name of the first technology and its microbial constitution?\",\n    \"A\": \"CIARI-Bioconsortia, a talc based biofertilizer cum biocontrol agent with consortia of multipotential Bacillus spp.\"\n  },\n  {\n    \"Q\": \"Which crops can CIARI-Bioconsortia be used for?\",\n    \"A\": \"It can be used for management of bacterial wilt disease and plant growth promotion in brinjal.\"\n  },\n  {\n    \"Q\": \"How is CIARI-Bioconsortia applied?\",\n    \"A\": \"It can be applied in soil 20 days after transplantation as bioenriched FYM.\"\n  },\n  {\n    \"Q\": \"What are the target agro-ecological zones for CIARI-Bioconsortia?\",\n    \"A\": \"Islands of Andaman-Nicobar and Lakshadweep\"\n  },\n  {\n    \"Q\": \"Has CIARI-Bioconsortia been validated?\",\n    \"A\": \"Yes, it has been validated for management of bacterial wilt disease, plant growth promotion, and yield enhancement in brinjal.\"\n  },\n  {\n    \"Q\": \"Has CIARI-Bioconsortia been licensed to private companies?\",\n    \"A\": \"No\"\n  },\n  {\n    \"Q\": \"What is the name of the second technology and its microbial constitution?\",\n    \"A\": \"CIARI-GroPro, a microbial based technology developed by ICAR-CIARI\"\n  },\n  {\n    \"Q\": \"Which crops can CIARI-GroPro be used for?\",\n    \"A\": \"It can be used for various horticultural crops like tomato, capsicum, okra, brinjal, etc.\"\n  },\n  {\n    \"Q\": \"How is CIARI-GroPro applied?\",\n    \"A\": \"It can be applied through FYM or drip application, spraying on the foliage, or treating potting mixture.\"\n  },\n  {\n    \"Q\": \"What are the target agro-ecological zones for CIARI-GroPro?\",\n    \"A\": \"All\"\n  }\n]\n```",
    "Here are 10 question-answer pairs based on the provided text:\n\n```json\n{\n  \"QA_Pairs\": [\n    {\n      \"Q\": \"What is the name of the first microbial technology and its primary constituent?\",\n      \"A\": \"CIARI-GroPro, a consortia of multipotential Bacillus spp.\"\n    },\n    {\n      \"Q\": \"Which vegetable crops can CIARI-GroPro be used for?\",\n      \"A\": \"Solanaceous vegetable crops like brinjal and tomato\"\n    },\n    {\n      \"Q\": \"How is CIARI-GroPro applied?\",\n      \"A\": \"As seed treatment, seedling dip, and foliar spray\"\n    },\n    {\n      \"Q\": \"Where has CIARI-GroPro been validated?\",\n      \"A\": \"At farmers' fields in Andaman and Nicobar Islands\"\n    },\n    {\n      \"Q\": \"What are the benefits of using CIARI-GroPro?\",\n      \"A\": \"Enhances plant growth, acts as a biocontrol agent, and has a long shelf life\"\n    },\n    {\n      \"Q\": \"What is the name of the second microbial technology and its constituent?\",\n      \"A\": \"Bacillus subtilis bio formulation containing Bacillus subtilis DR-39 strain\"\n    },\n    {\n      \"Q\": \"Which crop is the Bacillus subtilis bio formulation primarily used for?\",\n      \"A\": \"Grapevine\"\n    },\n    {\n      \"Q\": \"How is the Bacillus subtilis bio formulation applied?\",\n      \"A\": \"By foliar spraying\"\n    },\n    {\n      \"Q\": \"What is the spore load of Trichoderma asperelloides strain 5R?\",\n      \"A\": \"10^11\"\n    },\n    {\n      \"Q\": \"How is Trichoderma asperelloides strain 5R grown?\",\n      \"A\": \"On liquid media and solid organic substrate\"\n    }\n  ]\n}\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"What are the main diseases that Trichoderma asperelloides 5R helps control in grapevines?\",\n    \"A\": \"Foliar and soil-borne diseases, especially powdery mildew\"\n  },\n  {\n    \"Q\": \"How is Trichoderma asperelloides 5R applied?\",\n    \"A\": \"Soil drenching\"\n  },\n  {\n    \"Q\": \"What is the primary use of Trichoderma afroharzianum liquid formulation?\",\n    \"A\": \"Disease control in grapevines\"\n  },\n  {\n    \"Q\": \"How is Trichoderma afroharzianum liquid formulation applied?\",\n    \"A\": \"Foliar application\"\n  },\n  {\n    \"Q\": \"What are the benefits of using Trichoderma asperelloides 5R in liquid/solid form?\",\n    \"A\": \"Enhances disease resistance, reduces fungicide use, and leads to 'zero' residue levels in grapes\"\n  },\n  {\n    \"Q\": \"How does Trichoderma afroharzianum liquid formulation help in controlling powdery mildew?\",\n    \"A\": \"Its spray application in alternation with sulfur remarkably reduces powdery mildew severity\"\n  },\n  {\n    \"Q\": \"What is the concentration of spores in Trichoderma afroharzianum liquid formulation?\",\n    \"A\": \"5X108 spores/ml\"\n  },\n  {\n    \"Q\": \"Where has Trichoderma asperelloides 5R been validated for use?\",\n    \"A\": \"Multiple locations on farmers’ fields and vineyard of ICAR- NRC for Grapes, Pune\"\n  },\n  {\n    \"Q\": \"How does Trichoderma asperelloides 5R help in controlling downy mildew?\",\n    \"A\": \"Its need-based foliar application along with soil drenching minimizes downy mildew incidence\"\n  },\n  {\n    \"Q\": \"What are the contact details for ICAR – National Research Centre for Grapes, Pune?\",\n    \"A\": \"Director, ICAR – National Research Centre for Grapes, Pune- 413702\"\n  }\n]\n```",
    "{ \"Q\": \"What is the primary goal of Indian agriculture's evolution?\",\n  \"A\": \"To remain responsive to meet the growing and diversified needs of stakeholders in the entire production to consumption area.\"\n},\n{ \"Q\": \"What is crucial for sustainable development of agriculture in India?\",\n  \"A\": \"Creation of skilled, talented and entrepreneurial human resources to harness demographic dividend in an equitable manner.\"\n},\n{ \"Q\": \"What are the targets set out in the agriculture policy that require adequate trained manpower?\",\n  \"A\": \"The targets of growth rate set out in the agriculture policy.\"\n},\n{ \"Q\": \"What percentage of seats in Bachelor and Master's degree programmes are set aside for AIEEA in the ICAR-AU system?\",\n  \"A\": \"15% for Bachelor and 25% for Master's degree programmes.\"\n},\n{ \"Q\": \"When was the centralized admission to doctoral degree programmes introduced through AICE-JRF/SRF(PGS) by ICAR?\",\n  \"A\": \"From the Academic Session 2015-16.\"\n},\n{ \"Q\": \"When was online counseling for admission to different disciplines of agriculture & allied sciences introduced by ICAR?\",\n  \"A\": \"W.e.f. the Academic Session 2017-18.\"\n},\n{ \"Q\": \"From which academic year were admissions through ICAR's All India Entrance Examination not allowed for non-accredited colleges and programmes?\",\n  \"A\": \"From the Academic Year 2016-17.\"\n},\n{ \"Q\": \"Since when are ICAR's All India Entrance Examinations conducted in LAN based CBT mode by NTA?\",\n  \"A\": \"Since 2019.\"\n},\n{ \"Q\": \"When will the Council conduct a single entrance examination for all degree programmes?\",\n  \"A\": \"From 2020-21.\"\n},\n{ \"Q\": \"What is the name of the premier testing organization that conducts ICAR's entrance examinations under the Department of Higher Education, Ministry of Human Resource Development, Government of India?\",\n  \"A\": \"National Testing Agency (NTA)\"\n}",
    "Here are 10 question-answer pairs based on the provided text:\n\n```json\n{\n  \"Q1\": \"What is the primary objective of the All India Entrance Examination conducted by ICAR?\",\n  \"A1\": \"To curtail academic inbreeding, promote national integration, infuse merit, encourage talent, and promote uniform examination standards in agricultural education.\",\n  \"Q2\": \"Which examinations does ICAR conduct annually for admission to agricultural programs?\",\n  \"A2\": \"All India Entrance Examination for Admission (AIEEA) to undergraduate (AIEEA (UG)) and postgraduate (AIEEA (PG)) programmes, and the All India Competitive Examination for admission to doctoral degree programmes (AICE-JRF/SRF(PGS)).\",\n  \"Q3\": \"What is the total number of seats offered in UG, PG, and Ph.D. programs in ICAR's 2019 examination?\",\n  \"A3\": \"2,784 seats in UG, 3,075 seats in PG, and 905 seats in Ph.D. programs.\",\n  \"Q4\": \"How many Agricultural Universities participated in ICAR's 2019 examination?\",\n  \"A4\": \"67 Agricultural Universities.\",\n  \"Q5\": \"What was the increase in the number of applicants for AIEEA (UG)-2019 compared to the previous year?\",\n  \"A5\": \"60.45%.\",\n  \"Q6\": \"What was the increase in the number of applicants for AICE-JRF/SRF(PGS)-2019 compared to the previous year?\",\n  \"A6\": \"49.40%.\",\n  \"Q7\": \"What is the role of SAUs in attracting talent to higher agricultural education?\",\n  \"A7\": \"To play a more proactive role in creating awareness and generating competent human resources to address challenges in the agricultural sector.\",\n  \"Q8\": \"What is the purpose of the publication by the Agricultural Education Division?\",\n  \"A8\": \"To provide insights into the dynamics of talent required for the Higher Agricultural Education System and to create a framework for policy planning to generate competent human capital.\",\n  \"Q9\": \"Who is the author of the preface in the provided text?\",\n  \"A9\": \"Dr. Trilochan Mohapatra.\",\n  \"Q10\": \"What does the author hope the publication will achieve?\",\n  \"A10\": \"To strengthen information sharing among all stakeholders of higher agricultural education in the country.\"\n}\n```",
    "Here are 10 question-answer pairs based on the provided text, in JSON format:\n\n```json\n[\n  {\n    \"Q\": \"What is the increase in the number of applicants for AIEEA (PG)-2019 compared to the last year?\",\n    \"A\": \"9.22%\"\n  },\n  {\n    \"Q\": \"What has been the trend in the percentage of candidates for AIEEA (UG) from rural areas over the last three years?\",\n    \"A\": \"Remained static\"\n  },\n  {\n    \"Q\": \"What is the purpose of the present report on Examination Statistics?\",\n    \"A\": \"To provide inputs for evidence-based policy making and help low-performing universities improve\"\n  },\n  {\n    \"Q\": \"What are the academic sessions covered in the present publication?\",\n    \"A\": \"2014-15 through 2019-20\"\n  },\n  {\n    \"Q\": \"What are the earlier publications on Examination Statistics by the Agricultural Education Division?\",\n    \"A\": \"All India Entrance Examination for Admission to Bachelor and Master’s degree programmes (AIEEA-UG & PG) in Agriculture & Allied Sciences and SRF(PGS) – At a Glance and Talent for Responsive Agriculture\"\n  },\n  {\n    \"Q\": \"What is the role of agricultural education in food and nutritional security?\",\n    \"A\": \"To play a crucial role\"\n  },\n  {\n    \"Q\": \"What are some new initiatives in agricultural education?\",\n    \"A\": \"Talent getting attracted towards higher agricultural education and new initiatives in agricultural education\"\n  },\n  {\n    \"Q\": \"What are the schemes for attracting talented students and capacity building of faculty?\",\n    \"A\": \"Schemes for students and faculty\"\n  },\n  {\n    \"Q\": \"What are the trends in UG admissions for AIEEA (UG)?\",\n    \"A\": \"Trends in UG admissions\"\n  },\n  {\n    \"Q\": \"What are the trends in PG admissions for AIEEA (PG)?\",\n    \"A\": \"Trends in PG admissions\"\n  }\n]\n```",
    "Here are 10 question-answer pairs based on the provided text, in JSON format:\n\n```json\n[\n  {\n    \"Q\": \"What was the total number of candidates who secured marks in AIEEA (UG)-2019?\",\n    \"A\": \"19,500\"\n  },\n  {\n    \"Q\": \"How many seats were filled for UG admissions in the last six years?\",\n    \"A\": \"22,000\"\n  },\n  {\n    \"Q\": \"What is the domicile state-wise distribution of candidates admitted through AIEEA (UG)-2019?\",\n    \"A\": \"Available in Table 6 on page 23\"\n  },\n  {\n    \"Q\": \"How many candidates were admitted to different Agricultural Universities (AUs) with/without NTS (UG) in 2019?\",\n    \"A\": \"Available in Table 7 on page 24\"\n  },\n  {\n    \"Q\": \"What was the domicile state-wise distribution of qualified candidates for AIEEA-PG-2019 counselling?\",\n    \"A\": \"Available in Table 8 on page 27\"\n  },\n  {\n    \"Q\": \"How many candidates admitted through AIEEA (PG)-2019 graduated from AUs located in their respective states?\",\n    \"A\": \"Available in Table 9 on page 30\"\n  },\n  {\n    \"Q\": \"What is the subject-wise distribution of candidates applied/appeared and eligible for participation in AIEEA (PG)-2019 counselling?\",\n    \"A\": \"Available in Table 10 on page 31\"\n  },\n  {\n    \"Q\": \"How many seats were filled for PG admissions in the last six years?\",\n    \"A\": \"11,000\"\n  },\n  {\n    \"Q\": \"Which subjects had less than 50% seats filled up through AIEEA (PG)-2019 counselling?\",\n    \"A\": \"Available in Table 12 on page 33\"\n  },\n  {\n    \"Q\": \"What is the number of candidates admitted to different AUs with ICAR-PG Scholarship and with/without NTS (PG) through AIEEA (PG)-2019?\",\n    \"A\": \"Available in Table 14 on page 34\"\n  }\n]\n```",
    "Here are 10 question-answer pairs based on the provided text, focusing on the All India Competitive Examination (AICE) for the award of Junior/Senior Research Fellowship (PGS) in 2019:\n\n```json\n{\n  \"QA_Pairs\": [\n    {\n      \"Q\": \"How many candidates applied for AICE-JRF/SRF (PGS)-2019?\",\n      \"A\": \"39\"\n    },\n    {\n      \"Q\": \"What was the number of seats available for AICE-JRF/SRF (PGS)-2019?\",\n      \"A\": \"39\"\n    },\n    {\n      \"Q\": \"How many candidates were eligible for counseling for AICE-JRF/SRF (PGS)-2019?\",\n      \"A\": \"41\"\n    },\n    {\n      \"Q\": \"What is the acronym for All India Competitive Examination?\",\n      \"A\": \"AICE\"\n    },\n    {\n      \"Q\": \"What does JRF/SRF (PGS) stand for in AICE-JRF/SRF (PGS)?\",\n      \"A\": \"Junior/Senior Research Fellowship (Post Graduate Studies)\"\n    },\n    {\n      \"Q\": \"What is the total number of candidates who appeared for AICE-JRF/SRF (PGS)-2019?\",\n      \"A\": \"41\"\n    },\n    {\n      \"Q\": \"What is the acronym for Indian Council of Agricultural Research?\",\n      \"A\": \"ICAR\"\n    },\n    {\n      \"Q\": \"What is the acronym for Gross Enrolment Ratio/Rate?\",\n      \"A\": \"GER\"\n    },\n    {\n      \"Q\": \"What is the acronym for Global Hunger Index?\",\n      \"A\": \"GHI\"\n    },\n    {\n      \"Q\": \"What is the acronym for Gross Value Added?\",\n      \"A\": \"GVA\"\n    }\n  ]\n}\n```",
    "{ \"Q\": \"When was the first State Agricultural University (SAU) established in India?\",\n  \"A\": \"1960\",\n  \"Q\": \"Which university was the first SAU established in India?\",\n  \"A\": \"Govind Ballabh Pant University of Agriculture & Technology\",\n  \"Q\": \"What is the land grant pattern that the first SAU was based on?\",\n  \"A\": \"The US land grant pattern\",\n  \"Q\": \"What is the backbone of the Indian economy, according to Dr. Rajendra Prasad?\",\n  \"A\": \"Agriculture\",\n  \"Q\": \"What was Dr. Rajendra Prasad's slogan for maximizing agricultural production?\",\n  \"A\": \"Grow More Food\",\n  \"Q\": \"What was the state of India's food grain production after independence?\",\n  \"A\": \"Deficiency\",\n  \"Q\": \"What is the current state of India's food grain production?\",\n  \"A\": \"Self-sufficiency\",\n  \"Q\": \"Which system oversees the institutions of higher agricultural education in India?\",\n  \"A\": \"ICAR-AU system\",\n  \"Q\": \"What is the acronym for the Indian Council of Agricultural Research - Agricultural Universities system?\",\n  \"A\": \"ICAR-AU\" }",
    "{ \"Q\": \"What is the total intake capacity of students in Agricultural Universities (AUs) in India currently?\",\n  \"A\": \"Over 45,000 students\",\n\n  \"Q\": \"How many Agricultural Universities (AUs) are there in India under the NAREE system?\",\n  \"A\": \"74\",\n\n  \"Q\": \"What was the intake capacity of students in AUs in 1960?\",\n  \"A\": \"Less than 5,000\",\n\n  \"Q\": \"How many students are enrolled annually at the undergraduate level in AUs?\",\n  \"A\": \"About 28,000\",\n\n  \"Q\": \"How many students are enrolled annually at the postgraduate level in AUs?\",\n  \"A\": \"Over 17,500\",\n\n  \"Q\": \"What is the total number of constituent colleges in AUs?\",\n  \"A\": \"About 410\",\n\n  \"Q\": \"How many private affiliated colleges are there in India for higher agricultural education?\",\n  \"A\": \"Over 400\",\n\n  \"Q\": \"What is the target year for doubling the income of farmers in India?\",\n  \"A\": \"2022-23\",\n\n  \"Q\": \"What is the targeted annual agricultural growth rate to double farmers' income by 2022-23?\",\n  \"A\": \"More than 14 per cent per year\",\n\n  \"Q\": \"How many subjects are offered at the undergraduate level in AUs?\",\n  \"A\": \"11\",\n\n  \"Q\": \"How many subjects are offered at the postgraduate level in AUs?\",\n  \"A\": \"95\" }",
    "{ \"Q\": \"What are some of the challenges faced by the agriculture sector in India today?\",\n  \"A\": \"Challenges include stagnating/declining productivity and profitability, depleting natural resources, biotic and abiotic stresses, inefficient use of agro-inputs, unsafe livelihoods for small farmers, regional imbalances in productivity, lack of qualified manpower, rising input costs, changing food habits, high post-harvest losses, lack of value addition, fossil fuel crisis, climate change, and global competitiveness.\" },\n\n{ \"Q\": \"What is the role of agricultural education in food and nutritional security?\",\n  \"A\": \"Agricultural education plays a crucial role in addressing food and nutritional security by developing highly motivated and skilled human resources capable of sustaining, diversifying, and realizing the potential of agriculture to feed the burgeoning population.\" },\n\n{ \"Q\": \"What is India's ranking on the Global Hunger Index (GHI) in 2019?\",\n  \"A\": \"India ranked 102 out of 119 countries on the Global Hunger Index in 2019, with a score of 30.3, placing it in the 'serious' category.\" },\n\n{ \"Q\": \"What percentage of Indian children under five are underweight?\",\n  \"A\": \"More than 20%\" },\n\n{ \"Q\": \"What percentage of Indian children under five are too short for their age?\",\n  \"A\": \"About 33%\" },\n\n{ \"Q\": \"What is India's estimated total food grain production for 2017-18?\",\n  \"A\": \"284.83 million tonnes\" },\n\n{ \"Q\": \"How does India's food grain production in 2017-18 compare to the previous record?\",\n  \"A\": \"It is higher by 9.72 million tonnes than the previous record production of 275.11 million tonnes achieved during 2016-17.\" },\n\n{ \"Q\": \"What is the primary goal of encouraging students to pursue higher studies in other states?\",\n  \"A\": \"To reduce academic inbreeding in agricultural education.\" },\n\n{ \"Q\": \"What scholarships/fellowships are provided to students for pursuing higher studies in other states?\",\n  \"A\": \"National Talent Scholarship, ICAR-PG Scholarship, and ICAR-JRF/SRF (PGS).\" },\n\n{ \"Q\": \"What is one of the options to address the challenges faced by the agriculture sector in India?\",\n  \"A\": \"High-tech agriculture.\" }",
    "{ \"Q\": \"What was the increase in food grain production during 2017-18 compared to the previous five years' average?\",\n  \"A\": \"24.66 million tonnes\",\n  \"Q\": \"Which sector's growth is attributed to the concerted efforts of skilled human resource developed through AES?\",\n  \"A\": \"Agricultural sector\",\n  \"Q\": \"By how much has food grain production increased since 1950-51?\",\n  \"A\": \"4-fold\",\n  \"Q\": \"What is the increase in fish production since 1950-51, specifically for marine and inland fish?\",\n  \"A\": \"Marine: 5-fold, Inland: 17-fold\",\n  \"Q\": \"How many times has milk production increased since 1950-51?\",\n  \"A\": \"6-fold\",\n  \"Q\": \"What is the increase in egg production since 1950-51?\",\n  \"A\": \"27-fold\",\n  \"Q\": \"What are the four revolutions mentioned in the text that have led to enhanced agricultural production and productivity?\",\n  \"A\": \"Green, White, Blue, Yellow, Pink\",\n  \"Q\": \"What is the need mentioned in the text to shift from in agricultural production?\",\n  \"A\": \"From input-based to knowledge-based\",\n  \"Q\": \"What percentage of admitted candidates in Agricultural Universities through AIEEA (2019-20) had secured 80% and above marks in their qualifying Intermediate Board Examinations?\",\n  \"A\": \"52%\" }",
    "Here are 10 question-answer pairs based on the provided text:\n\n```json\n{\n  \"Q\": \"What is the total cost of the National Agricultural Higher Education Project (NAHEP)?\",\n  \"A\": \"US$ 165 million (~ ` 1100 crores)\"\n\n},\n{\n  \"Q\": \"Who is funding the NAHEP project?\",\n  \"A\": \"World Bank and Govt. of India on a 50:50 cost sharing basis\"\n\n},\n{\n  \"Q\": \"What are the major objectives of the NAHEP project?\",\n  \"A\": \"Accentuation of the relevance and quality of higher agricultural education, student and faculty development, improvement in learning outcomes, employability and entrepreneurship, and enhancement of institutional and system management effectiveness\"\n\n},\n{\n  \"Q\": \"What is the recommended pattern for agricultural education?\",\n  \"A\": \"A move from the Land-Grant to a “World Grant” pattern\"\n\n},\n{\n  \"Q\": \"What is the 'STEAM' concept in agriculture?\",\n  \"A\": \"Putting Agriculture in the middle of Science, Technology, Engineering and Mathematics\"\n\n},\n{\n  \"Q\": \"What is the expected outcome of the revised curricula?\",\n  \"A\": \"Internalizing the 'STEAM' concept in agricultural education\"\n\n},\n{\n  \"Q\": \"When is the annual ranking of agricultural universities announced?\",\n  \"A\": \"On 16th July, the Foundation Day of ICAR\"\n\n},\n{\n  \"Q\": \"What are some of the new initiatives undertaken by Agricultural Education?\",\n  \"A\": \"Ranking of agricultural universities, revision of curricula, and All India Entrance Examination\"\n\n},\n{\n  \"Q\": \"What is the larger objective of ranking agricultural universities?\",\n  \"A\": \"To improve the ranking of Indian Universities in World University Rankings\"\n\n},\n{\n  \"Q\": \"What parameters are emphasized while evaluating agricultural universities?\",\n  \"A\": \"Students’ performance, academic excellence, faculty profile, etc.\"\n\n}\n```",
    "{ \"Q\": \"What were the top three ranking agricultural universities in India according to ICAR's first-ever ranking in 2018?\",\n  \"A\": \"ICAR-National Dairy Research Institute, Karnal; ICAR-Indian Agricultural Research Institute, New Delhi and Guru Angad Dev Veterinary and Animal Sciences University, Ludhiana\" },\n\n{ \"Q\": \"When was the Student READY programme launched in India?\",\n  \"A\": \"25th July, 2015\" },\n\n{ \"Q\": \"What are the five components of the Student READY programme?\",\n  \"A\": \"Experiential Learning (EL), Rural Agriculture Work Experience (RAWE), In Plant Training/Industrial Attachment, Hands-on Training (HOT)/Skill Development Training and Student projects\" },\n\n{ \"Q\": \"When was the Food Nutrition & Dietetics programme introduced for admission through AIEEA (UG)?\",\n  \"A\": \"2018-19\" },\n\n{ \"Q\": \"How many UG degrees in agriculture and allied subjects were declared as professional degree courses by ICAR?\",\n  \"A\": \"13\" },\n\n{ \"Q\": \"When was the centralized admission to 25% seats of doctoral degree programmes introduced?\",\n  \"A\": \"Academic Session 2015-16\" },\n\n{ \"Q\": \"From which academic session were admissions through ICAR's entrance examinations permitted only to ICAR accredited programmes and colleges?\",\n  \"A\": \"Academic Session 2016-17\" },\n\n{ \"Q\": \"When was the online counseling for admission to different agricultural degree programmes introduced?\",\n  \"A\": \"Academic Session 2017-18\" },\n\n{ \"Q\": \"In which year was the decision regarding admission of candidates from private agricultural colleges/universities taken?\",\n  \"A\": \"2019\" },\n\n{ \"Q\": \"What is the total number of agricultural universities in India evaluated in the first-ever ranking conducted by ICAR?\",\n  \"A\": \"63\" }",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"Which organizations conduct ICAR's PG and Ph.D. examinations?\",\n    \"A\": \"ICAR and NTA (National Testing Agency)\"\n  },\n  {\n    \"Q\": \"Since when are ICAR's AIEEA conducted in LAN-based CBT mode?\",\n    \"A\": \"2019\"\n  },\n  {\n    \"Q\": \"From which academic year will there be a single entrance examination for admission to doctoral degree programmes in ICAR-AU system?\",\n    \"A\": \"2020-21\"\n  },\n  {\n    \"Q\": \"How many specialized subjects will the AICE-JRF/SRF (Ph.D.) examination cover from 2020-21?\",\n    \"A\": \"73\"\n  },\n  {\n    \"Q\": \"What is the monthly scholarship amount for National Talent Scholarship (NTS) for undergraduate studies?\",\n    \"A\": \"Rs. 3000\"\n  },\n  {\n    \"Q\": \"Which students are eligible for Post Matric Scholarship for Scheduled Caste and Scheduled Tribe Candidates?\",\n    \"A\": \"Scheduled Caste and Scheduled Tribe students pursuing Bachelor degree programme in agriculture and allied sciences\"\n  },\n  {\n    \"Q\": \"What is the monthly scholarship amount for Post Matric Scholarship for Scheduled Caste and Scheduled Tribe Candidates?\",\n    \"A\": \"Rs. 1000\"\n  },\n  {\n    \"Q\": \"What is the monthly scholarship amount for Merit-cum-Means Scholarship for undergraduate studies?\",\n    \"A\": \"Rs. 1000\"\n  },\n  {\n    \"Q\": \"What is the monthly fellowship amount for Junior Research Fellowship (JRF) during the first and second year of Ph.D. program?\",\n    \"A\": \"Rs. 31,000\"\n  },\n  {\n    \"Q\": \"What is the monthly fellowship amount for Senior Research Fellowship (SRF) during the third year of Ph.D. program?\",\n    \"A\": \"Rs. 35,000\"\n  }\n]\n```",
    "{ \"Q\": \"What is the total number of foreign students admitted annually to Indian Agricultural Universities?\", \"A\": \"Over 250 foreign students from more than 20 countries\" },\n{ \"Q\": \"Which organizations facilitate the admission of foreign students to Indian Agricultural Universities?\", \"A\": \"DARE, EdCIL, and ICCR\" },\n{ \"Q\": \"What is the objective of the Netaji Subhas-ICAR International Fellowship?\", \"A\": \"To develop competent human resources trained in the best laboratories worldwide and showcase the strength of the ICAR-AU system\" },\n{ \"Q\": \"How many fellowships are available every year under the Netaji Subhas-ICAR International Fellowship?\", \"A\": \"Thirty fellowships\" },\n{ \"Q\": \"What is the fellowship amount for Indian fellows and overseas candidates under the Netaji Subhas-ICAR International Fellowship?\", \"A\": \"US $ 2,000/- and `40,000/- per month, respectively\" },\n{ \"Q\": \"How many African nationals were provisionally selected for higher degree programmes in Indian Agricultural Universities under the India-Africa Fellowship in 2018-19?\", \"A\": \"88 candidates\" },\n{ \"Q\": \"Which countries did the provisionally selected African nationals belong to in 2018-19 under the India-Africa Fellowship?\", \"A\": \"Botswana, South Sudan, Kenya, Tanzania, Nigeria, Eritrea, Ghana, Malawi, Egypt, Zimbabwe, Uganda, Mozambique, and Ethiopia\" },\n{ \"Q\": \"How many Afghan nationals were provisionally selected for Master and PhD programmes in Indian Agricultural Universities under the India-Afghanistan Fellowship in 2018-19?\", \"A\": \"75 candidates\" },\n{ \"Q\": \"What is the purpose of the ICAR Post-doctoral Fellowship (ICAR-PDF) programme?\", \"A\": \"To provide postdoctoral research opportunities to Indian and foreign nationals in agricultural sciences\" },\n{ \"Q\": \"When was the ICAR Post-doctoral Fellowship (ICAR-PDF) programme introduced?\", \"A\": \"The programme was introduced recently\" }",
    "Here are 10 question-answer pairs based on the provided text:\n\n```json\n{\n  \"QA_Pairs\": [\n    {\n      \"Q\": \"What is the name of the scheme introduced in Academic Session 2019-20 for supporting young researchers in agriculture?\",\n      \"A\": \"Postdoctoral Fellowship (PDF) Scheme\"\n    },\n    {\n      \"Q\": \"How many positions are available for Postdoctoral Fellows (PDFs) under this scheme?\",\n      \"A\": \"25 positions\"\n    },\n    {\n      \"Q\": \"What is the monthly stipend provided to a PDF under this scheme?\",\n      \"A\": \"₹75,000/- per month\"\n    },\n    {\n      \"Q\": \"What is the annual contingency grant provided to a PDF?\",\n      \"A\": \"₹2.00 lakhs per annum\"\n    },\n    {\n      \"Q\": \"What is the duration of the Postdoctoral Fellowship under this scheme?\",\n      \"A\": \"One year\"\n    },\n    {\n      \"Q\": \"What is the total number of positions available under the ICAR National Professor/National Fellow Scheme?\",\n      \"A\": \"35 positions (10 National Professorial Chairs + 25 National Fellows)\"\n    },\n    {\n      \"Q\": \"Which prestigious chair is included in the ICAR National Professorial Chairs scheme?\",\n      \"A\": \"BP Pal Chair in Genetics and Plant Breeding at IARI, New Delhi\"\n    },\n    {\n      \"Q\": \"What is the aim of the ICAR Emeritus Professors program?\",\n      \"A\": \"To utilize the talent of outstanding superannuated professionals in teaching, research guidance, and developing instructional material\"\n    },\n    {\n      \"Q\": \"What is the aim of the ICAR Emeritus Scientists program?\",\n      \"A\": \"To utilize the services of outstanding superannuated scientists/teachers for supporting ongoing research and developing instructional material\"\n    },\n    {\n      \"Q\": \"How many Centres of Advanced Faculty Training (CAFT) have been established?\",\n      \"A\": \"40 Centres\"\n    }\n  ]\n}\n```",
    "{ \"Q\": \"What is the primary objective of the Niche Area of Excellence (NAE) program?\",\n  \"A\": \"To achieve educational excellence in teaching, research, and capacity building in frontier areas of agriculture and its allied disciplines, and to create global competitiveness in agricultural education and research.\" },\n\n{ \"Q\": \"When was the Niche Area of Excellence program initiated?\",\n  \"A\": \"During 2006-07\" },\n\n{ \"Q\": \"What is the aim of developing at least one center of excellence in each State Agricultural University (SAU) under NAE?\",\n  \"A\": \"To promote research through excellence in teaching, research, consultancy, and other services in chosen niche/specific areas to compete with the best in the world.\" },\n\n{ \"Q\": \"What are the diverse areas focused on by the NAEs supported by ICAR?\",\n  \"A\": \"Sustenance of quality of natural resources through diversification and productivity enhancement.\" },\n\n{ \"Q\": \"Since when has ICAR been sponsoring Summer Schools, Winter Schools, and Short Courses?\",\n  \"A\": \"Since 1967\" },\n\n{ \"Q\": \"What are the purposes of organizing Summer Schools, Winter Schools, and Short Courses?\",\n  \"A\": \"To bring about qualitative improvement, update knowledge, provide orientation to contemporary problems, and provide a common forum for professionals to interact and exchange experiences.\" },\n\n{ \"Q\": \"What is the Capacity Building Program (CBP) portal used for?\",\n  \"A\": \"It is an online management system for all training programs sponsored by the Agricultural Education Division, providing information on training programs, proposals, applications, e-books, and reports.\" },\n\n{ \"Q\": \"When was the Capacity Building Program (CBP) portal operational?\",\n  \"A\": \"Not specified in the given text.\" },\n\n{ \"Q\": \"What are the benefits of the Capacity Building Program (CBP) for human resources in research and education?\",\n  \"A\": \"It contributes to the development of skilled human resources by bringing out qualitative improvement in pedagogical skills and updating knowledge in specialized/emerging areas, making research and education more relevant.\" },\n\n{ \"Q\": \"What is the purpose of the Capacity Building Program (CBP) portal's workflow-based online management system?\",\n  \"A\": \"To manage all training programs sponsored by the Agricultural Education Division, providing information and facilitating communication among users.\" }",
    "{ \"Q\": \"What is the total number of teachers/scientists trained under ICAR's CBP since 2014 till December 2019?\",\n  \"A\": \"Around 22,000 teachers/scientists have been trained through this programme.\" },\n\n{ \"Q\": \"What is the percentage of seats reserved for All India Entrance Examinations in Bachelor's and Master's degree programmes in Agricultural Universities?\",\n  \"A\": \"15% for Bachelor's and 25% for Master's degree programmes.\" },\n\n{ \"Q\": \"When was the All India Entrance Examination for Admission (AIEEA) programme started?\",\n  \"A\": \"The programme started in the year 1996-97.\" },\n\n{ \"Q\": \"How many AIEEA examinations have been conducted so far for UG and PG Degree programmes?\",\n  \"A\": \"24 All India Entrance Examinations have been conducted.\" },\n\n{ \"Q\": \"Since which year have ICAR been conducting centralized admission to Ph.D. degree programmes through AICE-JRF/SRF (Ph.D.) examination?\",\n  \"A\": \"Since 2015-16\" },\n\n{ \"Q\": \"Which organization conducts the AIEEA, AICE-JRF/SRF (Ph.D.) examinations in LAN-based CBT mode since 2019?\",\n  \"A\": \"The National Testing Agency (NTA)\" },\n\n{ \"Q\": \"Under which ministry is the National Testing Agency (NTA) established?\",\n  \"A\": \"Department of Higher Education, Ministry of Human Resource Development, Govt. of India\" },\n\n{ \"Q\": \"What is the primary goal of the National Testing Agency (NTA)?\",\n  \"A\": \"To assess competence of candidates for admissions and recruitment with efficiency, transparency and error-free delivery.\" },\n\n{ \"Q\": \"When was the National Testing Agency (NTA) established?\",\n  \"A\": \"The NTA was established as a premier, specialist, autonomous and self-sustained testing organization.\" },\n\n{ \"Q\": \"What is the website of the National Testing Agency (NTA)?\",\n  \"A\": \"www.nta.ac.in\" }",
    "Here are 10 question-answer pairs based on the provided text about higher agricultural education and the National Testing Agency (NTA):\n\n```json\n{\n  \"Q\": \"What is the mission of the National Testing Agency (NTA)?\",\n  \"A\": \"To improve equity and quality in education by administering research-based valid, reliable, efficient, transparent, fair and international level assessments.\"\n\n},\n{\n  \"Q\": \"What are the core values of NTA?\",\n  \"A\": \"Quality, efficiency, effectiveness, equity and security of assessments.\"\n\n},\n{\n  \"Q\": \"What are the objectives of NTA?\",\n  \"A\": \"To conduct efficient, transparent and internationally standardized tests for admission and recruitment purposes, and to undertake research on educational systems.\"\n\n},\n{\n  \"Q\": \"What does NTA aim to achieve through collaboration with international organizations?\",\n  \"A\": \"To develop a state-of-the-art culture of testing in India by using domestic and international expertise.\"\n\n},\n{\n  \"Q\": \"What is the function of NTA in creating a question bank for examinations?\",\n  \"A\": \"To create a question bank for all subjects using modern techniques.\"\n\n},\n{\n  \"Q\": \"What is the purpose of the All India Entrance Examinations for Admission (AIEEA)?\",\n  \"A\": \"To offer degree courses at the undergraduate level in various agricultural disciplines with an emphasis on hands-on practice and field experience.\"\n\n},\n{\n  \"Q\": \"How many disciplines are offered through AIEEA for undergraduate courses?\",\n  \"A\": \"11 disciplines\"\n\n},\n{\n  \"Q\": \"Which discipline was discontinued from AIEEA from the Academic Session 2017-18?\",\n  \"A\": \"Agri. Marketing & Cooperation\"\n\n},\n{\n  \"Q\": \"What is the purpose of the 5th Deans Committee report mentioned in the text?\",\n  \"A\": \"To provide information about the admission process and changes in the disciplines offered through AIEEA.\"\n\n},\n{\n  \"Q\": \"What is the purpose of the reforms and training mentioned for school boards and other bodies by NTA?\",\n  \"A\": \"To ensure that the testing standards are comparable with the entrance examinations.\"\n\n}\n```",
    "{ \"Q\": \"What is the expected Gross Enrolment Ratio (GER) for higher education in India by 2029?\",\n  \"A\": \"30-35%\" },\n\n{ \"Q\": \"What is the world average GER for higher education?\",\n  \"A\": \"23%\" },\n\n{ \"Q\": \"Why is the GER for girls lower than that of boys in India?\",\n  \"A\": \"Factors such as social, cultural, and religious beliefs, poverty, and poor learning environment contribute to the lower GER for girls.\" },\n\n{ \"Q\": \"What was the GER for all categories of students in India in 2001?\",\n  \"A\": \"8.1%\" },\n\n{ \"Q\": \"What is the current GER for all categories of students in India (2018-19)?\",\n  \"A\": \"26.3%\" },\n\n{ \"Q\": \"What is the GER for males in India (2018-19)?\",\n  \"A\": \"26.3%\" },\n\n{ \"Q\": \"What is the GER for females in India (2018-19)?\",\n  \"A\": \"26.4%\" },\n\n{ \"Q\": \"What is the Gross Enrolment Rate for Agricultural Education in India?\",\n  \"A\": \"Below 1%\" },\n\n{ \"Q\": \"How many applicants were there for each seat in UG admissions during AIEEA-2019?\",\n  \"A\": \"Around 85\" },\n\n{ \"Q\": \"What was the total number of candidates who applied for ICAR’s 24th AIEEA (UG)-2019 examination?\",\n  \"A\": \"2,36,931\" }",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"Which state had the highest number of applicants for AIEEA (UG)-2019?\",\n    \"A\": \"Kerala (38,651)\"\n  },\n  {\n    \"Q\": \"Which state had the highest number of candidates that appeared for the exam?\",\n    \"A\": \"Rajasthan (17,991)\"\n  },\n  {\n    \"Q\": \"Which state had the highest number of candidates eligible for registration and choice filling for counselling?\",\n    \"A\": \"Rajasthan (17,953)\"\n  },\n  {\n    \"Q\": \"What percentage of candidates from Andaman & Nicobar Islands were eligible for registration and choice filling?\",\n    \"A\": \"100.00%\"\n  },\n  {\n    \"Q\": \"Which state had the second-highest number of applicants?\",\n    \"A\": \"Bihar (33,948)\"\n  },\n  {\n    \"Q\": \"What was the total number of candidates who appeared for the exam?\",\n    \"A\": \"108,979\"\n  },\n  {\n    \"Q\": \"What was the total number of candidates eligible for registration and choice filling for counselling?\",\n    \"A\": \"108,591\"\n  },\n  {\n    \"Q\": \"Which stream did the majority of candidates prefer?\",\n    \"A\": \"Biology-based streams (83.66%)\"\n  },\n  {\n    \"Q\": \"Which stream had the highest number of candidates?\",\n    \"A\": \"PCB (57.98%)\"\n  },\n  {\n    \"Q\": \"What was the number of candidates opting for the Agriculture stream?\",\n    \"A\": \"Not specified in the given text\"\n  }\n]\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n{\n  \"QA_Pairs\": [\n    {\n      \"Q\": \"What percentage of candidates appeared in the Agriculture stream (PCA) in AIEEA (UG)-2019?\",\n      \"A\": \"1.86%\"\n    },\n    {\n      \"Q\": \"Which stream had the highest number of candidates in AIEEA (UG)-2019?\",\n      \"A\": \"PCB (63195 candidates)\"\n    },\n    {\n      \"Q\": \"What was the average score for the PCM stream in AIEEA (UG)-2019?\",\n      \"A\": \"103.27\"\n    },\n    {\n      \"Q\": \"How many candidates from the PCA stream scored above 60% marks?\",\n      \"A\": \"None\"\n    },\n    {\n      \"Q\": \"Which stream had the highest number of candidates securing marks above 60%?\",\n      \"A\": \"PCB\"\n    },\n    {\n      \"Q\": \"What was the total number of candidates eligible for registration and choice filling for AIEEA (UG)-2019?\",\n      \"A\": \"1,08,591\"\n    },\n    {\n      \"Q\": \"What was the percentage of female candidates eligible for registration and choice filling?\",\n      \"A\": \"49.8%\"\n    },\n    {\n      \"Q\": \"How many seats were available for AIEEA (UG)-2019?\",\n      \"A\": \"2784\"\n    },\n    {\n      \"Q\": \"Which stream had the highest number of candidates eligible for counseling?\",\n      \"A\": \"ABC (27925 candidates)\"\n    },\n    {\n      \"Q\": \"What was the maximum score for each stream in AIEEA (UG)-2019?\",\n      \"A\": \"PCM - 480, PCB - 525, PCA - 412, ABC - 459\"\n    }\n  ]\n}\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"What was the total number of seats received from universities in 2019?\",\n    \"A\": \"2,784 seats\"\n  },\n  {\n    \"Q\": \"How many more seats were there in 2019 compared to 2018?\",\n    \"A\": \"830 seats (42.50% increase)\"\n  },\n  {\n    \"Q\": \"What was the overall seat fill-up percentage in 2019-20?\",\n    \"A\": \"79%\"\n  },\n  {\n    \"Q\": \"Which subjects had more than 80% seats filled up in 2019-20?\",\n    \"A\": \"Agriculture, Agricultural Engineering, and Dairy Technology\"\n  },\n  {\n    \"Q\": \"What was the seat fill-up percentage for Community Science in 2019-20?\",\n    \"A\": \"50%\"\n  },\n  {\n    \"Q\": \"Which state had the highest number of candidates recommended for admission?\",\n    \"A\": \"Rajasthan (408 candidates)\"\n  },\n  {\n    \"Q\": \"How many female candidates were granted provisional admission in 2019?\",\n    \"A\": \"1,018 (46.5%)\"\n  },\n  {\n    \"Q\": \"From which state were the highest number of female candidates admitted?\",\n    \"A\": \"Kerala (212 female candidates)\"\n  },\n  {\n    \"Q\": \"How many states/UTs remained unrepresented in the admissions?\",\n    \"A\": \"8\"\n  },\n  {\n    \"Q\": \"What was the seat fill-up percentage for B.Sc. (Hons.) Agriculture in 2019?\",\n    \"A\": \"85%\"\n  }\n]\n```",
    "{ Q: What are the key activities included in agricultural engineering?\n                            A: Agricultural engineering involves activities like precision farming, genetically modified crops, and sustainable irrigation techniques.\n                            Q: Which course has the highest number of candidates admitted through AIEEA (UG)-2019?\n                            A: B.Tech. Agricultural Engineering has the highest number of candidates admitted with 2452.\n                            Q: How many candidates were admitted without NTS (UG) through AIEEA (UG)-2019?\n                            A: A total of 408 candidates were admitted without NTS (UG).\n                            Q: Which university admitted the most candidates with NTS (UG)?\n                            A: Dr. Rajendra Prasad Central Agricultural University, Pusa, Samastipur (Bihar) admitted the most candidates with NTS (UG), totaling 1018.\n                            Q: What is the total number of candidates admitted to different AUs with/without NTS (UG)?\n                            A: A total of 2,189 candidates were admitted to 59 AUs with/without NTS (UG).\n                            Q: How many female candidates were admitted from Andhra Pradesh through AIEEA (UG)-2019?\n                            A: 68 female candidates were admitted from Andhra Pradesh.\n                            Q: Which state has the highest number of candidates admitted with NTS (UG)?\n                            A: Uttar Pradesh has the highest number of candidates admitted with NTS (UG), totaling 781.\n                            Q: How many candidates were admitted from Delhi (U.T.) through AIEEA (UG)-2019?\n                            A: A total of 24 candidates were admitted from Delhi (U.T.).\n                            Q: Which university admitted the most candidates without NTS (UG)?\n                            A: Bidhan Chandra Krishi Viswavidhyalaya, Mohanpur (West Bengal) admitted the most candidates without NTS (UG), totaling 117.\n                            Q: How many candidates were admitted from the Erstwhile Jammu & Kashmir through AIEEA (UG)-2019?\n                            A: A total of 5 candidates were admitted from the Erstwhile Jammu & Kashmir.}",
    "Here are 10 question-answer pairs in JSON format based on the provided text about higher agricultural education in India:\n\n```json\n[\n  {\n    \"Q\": \"Which university is located in Solan, Himachal Pradesh?\",\n    \"A\": \"Dr. Y.S. Parmar University of Horticulture & Forestry\"\n  },\n  {\n    \"Q\": \"What is the total number of candidates admitted to Dr. Y.S.R. Horticultural University without NTS (UG)?\",\n    \"A\": 12\n  },\n  {\n    \"Q\": \"Where is the Faculty of Agriculture, Institute of Agricultural Sciences BHU located?\",\n    \"A\": \"Varanasi, Uttar Pradesh\"\n  },\n  {\n    \"Q\": \"What is the total number of candidates admitted to G.B. Pant University of Agriculture and Technology with NTS (UG)?\",\n    \"A\": 57\n  },\n  {\n    \"Q\": \"Which university is located in Ludhiana, Punjab?\",\n    \"A\": \"Guru Angad Dev Veterinary and Animal Sciences University\"\n  },\n  {\n    \"Q\": \"What is the total number of candidates admitted to ICAR-National Dairy Research Institute with and without NTS (UG)?\",\n    \"A\": 49\n  },\n  {\n    \"Q\": \"Where is Indira Gandhi Krishi Vishwavidyalaya located?\",\n    \"A\": \"Krishi Nagar, Raipur, Chhattisgarh\"\n  },\n  {\n    \"Q\": \"What is the total number of candidates admitted to Junagadh Agricultural University without NTS (UG)?\",\n    \"A\": 1\n  },\n  {\n    \"Q\": \"Which university is located in Bidar, Karnataka?\",\n    \"A\": \"Karnataka Veterinary, Animal & Fisheries Sciences University\"\n  },\n  {\n    \"Q\": \"What is the total number of candidates admitted to Kerala Agricultural University with and without NTS (UG)?\",\n    \"A\": 49\n  }\n]\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"How many candidates applied for AIEEA (PG) in 2019-20?\",\n    \"A\": \"31,486\"\n  },\n  {\n    \"Q\": \"What percentage of applicants appeared for the examination?\",\n    \"A\": \"86.27%\"\n  },\n  {\n    \"Q\": \"What was the mode of examination in 2019-20?\",\n    \"A\": \"LAN-based CBT mode\"\n  },\n  {\n    \"Q\": \"How many major subject groups were there in the examination?\",\n    \"A\": \"20\"\n  },\n  {\n    \"Q\": \"How many examination city centers were there across the country?\",\n    \"A\": \"87 (with 129 venues)\"\n  },\n  {\n    \"Q\": \"What was the ratio of the number of seats to the applicants?\",\n    \"A\": \"1:10\"\n  },\n  {\n    \"Q\": \"How many candidates were eligible for registration and choice-filling in 2019?\",\n    \"A\": \"19,266\"\n  },\n  {\n    \"Q\": \"What was the increase in the number of applicants from 2014 to 2019?\",\n    \"A\": \"17%\"\n  },\n  {\n    \"Q\": \"Which state had the highest number of applicants?\",\n    \"A\": \"Andhra Pradesh\"\n  },\n  {\n    \"Q\": \"Which state had the highest number of candidates eligible for registration and choice-filling?\",\n    \"A\": \"Andhra Pradesh\"\n  }\n]\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"Which state has the highest number of candidates admitted through AIEEA (PG)-2019 who graduated from AUs located in that state?\",\n    \"A\": \"Karnataka\"\n  },\n  {\n    \"Q\": \"How many candidates were eligible for registration and choice filling for participation in counselling for AIEEA (PG)-2019?\",\n    \"A\": \"19,266\"\n  },\n  {\n    \"Q\": \"What was the total number of seats available for AIEEA (PG)-2019?\",\n    \"A\": \"3,075\"\n  },\n  {\n    \"Q\": \"How many seats were filled up during AIEEA (PG)-2019?\",\n    \"A\": \"2,586\"\n  },\n  {\n    \"Q\": \"What percentage of candidates recommended for admission were girl candidates?\",\n    \"A\": \"47.17%\"\n  },\n  {\n    \"Q\": \"Which state has the second-highest number of candidates admitted through AIEEA (PG)-2019?\",\n    \"A\": \"Maharashtra\"\n  },\n  {\n    \"Q\": \"How many SAUs, CAUs, and Central Universities with an Agriculture Faculty and ICAR-DUs are there in Andhra Pradesh?\",\n    \"A\": \"3\"\n  },\n  {\n    \"Q\": \"What is the total number of states and union territories mentioned in the provided text?\",\n    \"A\": \"36\"\n  },\n  {\n    \"Q\": \"What is the total number of candidates who appeared for AIEEA (PG)-2019 and were eligible for counselling?\",\n    \"A\": \"2,586\"\n  },\n  {\n    \"Q\": \"What is the overall percentage of seats filled up during AIEEA (PG)-2019?\",\n    \"A\": \"84.17%\"\n  }\n]\n```",
    "{ \"Q\": \"Which state has the highest number of candidates appeared for the examination in the major subject of Agronomy?\",\n  \"A\": \"Uttar Pradesh (8,120)\" },\n\n{ \"Q\": \"What is the total number of candidates appeared for the examination in all major subjects?\",\n  \"A\": \"74,258\" },\n\n{ \"Q\": \"Which major subject had the highest number of candidates appeared?\",\n  \"A\": \"Agronomy (4,567)\" },\n\n{ \"Q\": \"How many major subjects had more than 1,000 candidates appeared?\",\n  \"A\": \"8\" },\n\n{ \"Q\": \"Which major subject had the lowest number of candidates appeared?\",\n  \"A\": \"Water Science and Technology (36)\" },\n\n{ \"Q\": \"What percentage of seats were filled for the major subject of Plant Biotechnology in 2019?\",\n  \"A\": \"84.2%\" },\n\n{ \"Q\": \"Which major subject had the highest percentage of seats filled in 2019?\",\n  \"A\": \"Entomology and Nematology (89.1%)\" },\n\n{ \"Q\": \"How many major subjects had more than 90% of seats filled in 2019?\",\n  \"A\": \"12\" },\n\n{ \"Q\": \"Which major subject had the lowest percentage of seats filled in 2019?\",\n  \"A\": \"Animal Biotechnology (17%)\" },\n\n{ \"Q\": \"What is the total number of seats filled across all major subjects in 2019?\",\n  \"A\": \"19,266\" }",
    "{ \"Q\": \"What is the total number of seats in higher agricultural education in India?\",\n  \"A\": \"3075\" },\n\n{ \"Q\": \"How many seats remained unfilled in the 2019 admission cycle?\",\n  \"A\": \"33\" },\n\n{ \"Q\": \"Which subject had the highest number of female candidates admitted in 2019?\",\n  \"A\": \"Plant Sciences (170 candidates)\" },\n\n{ \"Q\": \"What is the ICAR PG Scholarship amount for postgraduate studies?\",\n  \"A\": \"₹12,640 per month + ₹6,000 per year\" },\n\n{ \"Q\": \"How many sub-subjects had less than 50% seats filled in the 2019 admission cycle?\",\n  \"A\": \"5\" },\n\n{ \"Q\": \"Which sub-subject had the lowest seat filling percentage in the 2019 admission cycle?\",\n  \"A\": \"Not specified in the provided text\" },\n\n{ \"Q\": \"What was the total number of candidates admitted through AIEEA (PG)-2019 counselling?\",\n  \"A\": \"351\" },\n\n{ \"Q\": \"How many candidates were awarded the ICAR PG Scholarship in 2019?\",\n  \"A\": \"600\" },\n\n{ \"Q\": \"What is the duration for which the ICAR PG Scholarship is awarded?\",\n  \"A\": \"Two years\" },\n\n{ \"Q\": \"In which major subjects were there sub-subjects with less than 50% seat filling in 2019?\",\n  \"A\": \"Under 3 Major subjects\" }",
    "{ \"Q\": \"What is the total number of candidates admitted through AIEEA (PG)-2019?\",\n  \"A\": \"2,586\" },\n\n{ \"Q\": \"How many of these candidates were admitted with ICAR-PG Scholarship?\",\n  \"A\": \"600\" },\n\n{ \"Q\": \"How many candidates were admitted with NTS (PG) and without NTS (PG)?\",\n  \"A\": \"1,862 and 124\" },\n\n{ \"Q\": \"How many accredited AUs were there in India in 2019?\",\n  \"A\": \"64\" },\n\n{ \"Q\": \"Which university admitted the highest number of candidates in 2019?\",\n  \"A\": \"Anand Agricultural University, Anand (Gujarat)\" },\n\n{ \"Q\": \"How many candidates were admitted to Anand Agricultural University?\",\n  \"A\": \"66\" },\n\n{ \"Q\": \"Which university admitted the highest number of ICAR-PG Scholarship holders in 2019?\",\n  \"A\": \"Bidhan Chandra Krishi Viswavidyalaya, Mohanpur (West Bengal)\" },\n\n{ \"Q\": \"How many ICAR-PG Scholarship holders were admitted to Bidhan Chandra Krishi Viswavidyalaya?\",\n  \"A\": \"42\" },\n\n{ \"Q\": \"Which university admitted the highest number of candidates without NTS (PG) in 2019?\",\n  \"A\": \"Assam Agricultural University, Jorhat (Assam)\" },\n\n{ \"Q\": \"How many candidates were admitted to Assam Agricultural University without NTS (PG)?\",\n  \"A\": \"64\" }",
    "Here are 10 question-answer pairs in JSON format based on the provided text about agricultural universities in India:\n\n```json\n[\n  {\n    \"Q\": \"What is the total number of admitted candidates in ICAR-Indian Agricultural Research Institute, New Delhi?\",\n    \"A\": \"147\"\n  },\n  {\n    \"Q\": \"How many admitted candidates are there in Punjab Agricultural University, Ludhiana?\",\n    \"A\": \"33\"\n  },\n  {\n    \"Q\": \"What is the total number of admitted candidates with PG scholarship in G.B. Pant University of Agriculture and Technology, Pantnagar?\",\n    \"A\": \"74\"\n  },\n  {\n    \"Q\": \"How many admitted candidates are there in Kerala Agricultural University, Thrissur with NTS-PG?\",\n    \"A\": \"10\"\n  },\n  {\n    \"Q\": \"What is the total number of admitted candidates in Dr. Y.S. Parmar University of Horticulture & Forestry, Solan?\",\n    \"A\": \"11\"\n  },\n  {\n    \"Q\": \"How many admitted candidates are there in Junagadh Agricultural University, Junagadh without NTS-PG?\",\n    \"A\": \"2\"\n  },\n  {\n    \"Q\": \"What is the total number of admitted candidates in Mahatma Phule Krishi Vidyapeeth, Rahuri?\",\n    \"A\": \"6\"\n  },\n  {\n    \"Q\": \"How many admitted candidates are there in Odisha University of Agriculture and Technology, Bhubaneswar with PG scholarship?\",\n    \"A\": \"2\"\n  },\n  {\n    \"Q\": \"What is the total number of admitted candidates in Rajasthan University of Veterinary and Animal Sciences, Bikaner?\",\n    \"A\": \"1\"\n  },\n  {\n    \"Q\": \"How many admitted candidates are there in Sher-e-Kashmir University of Agricultural Sciences & Technology, Srinagar with PG scholarship?\",\n    \"A\": \"3\"\n  }\n]\n```",
    "{ \"Q\": \"Which university in Karnataka admitted the highest number of candidates in 2014?\",\n  \"A\": \"University of Agricultural Sciences, Bengaluru (Karnataka) with 30 admitted candidates\",\n  \"Q\": \"How many universities in Tamil Nadu were listed in the provided data?\",\n  \"A\": \"2 (Tamil Nadu Veterinary and Animal Sciences University, Chennai and TN Dr. JJLFU, Nagapattinam)\",\n  \"Q\": \"What is the total number of admitted candidates across all listed universities?\",\n  \"A\": \"1862\",\n  \"Q\": \"Which university in Rajasthan admitted the second-highest number of candidates?\",\n  \"A\": \"Swami Keshwanand Rajasthan Agricultural University, Bikaner (Rajasthan) with 2 admitted candidates\",\n  \"Q\": \"What was the total number of admitted candidates with PG scholarships?\",\n  \"A\": \"124\",\n  \"Q\": \"Which university in Karnataka had the highest number of admitted candidates without NTS-PG?\",\n  \"A\": \"University of Agricultural Sciences, Dharwad, Karnataka with 42 admitted candidates\",\n  \"Q\": \"What was the total number of admitted candidates with NTS-PG?\",\n  \"A\": \"67\",\n  \"Q\": \"Which university in West Bengal admitted the highest number of candidates?\",\n  \"A\": \"Uttar Banga Krishi Vishwavidyalaya, Cooch Behar, West Bengal with 18 admitted candidates\",\n  \"Q\": \"What was the total number of admitted candidates in the 'Other' category (not specified)?\",\n  \"A\": \"2586\" }",
    "Here are 10 question-answer pairs based on the provided text, in JSON format:\n\n```json\n[\n  {\n    \"Q\": \"When was the centralized admission system for 25% seats of Doctoral degree programmes introduced?\",\n    \"A\": \"Academic Session 2015-16\"\n  },\n  {\n    \"Q\": \"Which examination was used for centralized admission to ICAR-DUs in 2015-16?\",\n    \"A\": \"AICE-JRF/SRF (PGS)\"\n  },\n  {\n    \"Q\": \"From which academic session did ICAR-DUs start conducting their own entrance examinations?\",\n    \"A\": \"2016-17\"\n  },\n  {\n    \"Q\": \"In which mode is the AICE-JRF/SRF(PGS) examination conducted since 2019?\",\n    \"A\": \"LAN-based CBT (Computer-Based Test)\"\n  },\n  {\n    \"Q\": \"Who conducts the AICE-JRF/SRF(PGS) examination since 2019?\",\n    \"A\": \"NTA (National Testing Agency)\"\n  },\n  {\n    \"Q\": \"For how many subjects was the AICE-JRF/SRF (PGS)-2020 examination conducted?\",\n    \"A\": \"73 separate specialized subjects\"\n  },\n  {\n    \"Q\": \"From which academic session will a single unified entrance examination be conducted for all ICAR-AU System universities?\",\n    \"A\": \"2020-21\"\n  },\n  {\n    \"Q\": \"What is the monthly fellowship amount for Junior Research Fellows (JRFs) in the ICAR-AU System?\",\n    \"A\": \"31,000/- (fixed)\"\n  },\n  {\n    \"Q\": \"What is the duration of the Junior Research Fellowship (JRF) in the ICAR-AU System?\",\n    \"A\": \"I and II year of Ph.D. program\"\n  },\n  {\n    \"Q\": \"How many candidates appeared for the AICE-JRF/SRF (PGS)-2019 examination?\",\n    \"A\": \"7102 (84.81%)\"\n  }\n]\n```",
    "Here are 10 question-answer pairs based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"When was the All India Coordinated Entrance Examination for Junior Research Fellowship and Senior Research Fellowship (PGS) first conducted?\",\n    \"A\": \"2014\"\n  },\n  {\n    \"Q\": \"What was the purpose of the examination in 2014?\",\n    \"A\": \"Award of fellowship\"\n  },\n  {\n    \"Q\": \"Which states had the highest number of applicants, appeared candidates, and eligible candidates for registration in AICE-JRF/SRF (PGS)-2019?\",\n    \"A\": \"Karnataka, Uttar Pradesh, and Andhra Pradesh\"\n  },\n  {\n    \"Q\": \"What percentage of candidates from Andhra Pradesh were eligible for registration and choice filling for counselling in AICE-JRF/SRF (PGS)-2019?\",\n    \"A\": \"85.59%\"\n  },\n  {\n    \"Q\": \"Which state had the highest number of candidates eligible for registration and choice filling for counselling in AICE-JRF/SRF (PGS)-2019?\",\n    \"A\": \"Karnataka\"\n  },\n  {\n    \"Q\": \"What was the total number of candidates eligible for registration and choice filling for counselling in AICE-JRF/SRF (PGS)-2019?\",\n    \"A\": \"6080\"\n  },\n  {\n    \"Q\": \"What was the overall percentage of candidates eligible for registration and choice filling for counselling in AICE-JRF/SRF (PGS)-2019?\",\n    \"A\": \"85.60%\"\n  },\n  {\n    \"Q\": \"What was the percentage of SC applicants in PG and Ph.D. compared to UG?\",\n    \"A\": \"19% (PG and Ph.D.) vs 13% (UG)\"\n  },\n  {\n    \"Q\": \"What was the percentage of ST applicants in PG and Ph.D. compared to UG?\",\n    \"A\": \"11% (PG) and 10% (Ph.D.) vs 6% (UG)\"\n  },\n  {\n    \"Q\": \"What is the scope to attract more postgraduates to meet the increasing demand for manpower in teaching, research, and extension?\",\n    \"A\": \"Increasing the number and amount of fellowships\"\n  }\n]\n```",
    "Here are 10 question-answer pairs based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"How many candidates applied for AICE-JRF/SRF(PGS)-2019?\",\n    \"A\": \"The number of candidates is not specified in the text.\"\n  },\n  {\n    \"Q\": \"What was the total number of seats in the AICE-JRF/SRF(PGS)-2019 examination?\",\n    \"A\": \"42\"\n  },\n  {\n    \"Q\": \"Which subjects had 100% seat fill-up in the AICE-JRF/SRF(PGS)-2019 examination?\",\n    \"A\": \"Natural Resource Management-I and Agricultural Statistics\"\n  },\n  {\n    \"Q\": \"In which subjects were more than 90% of the seats filled up?\",\n    \"A\": \"Horticulture, Agricultural Engineering and Technology\"\n  },\n  {\n    \"Q\": \"Which subjects had more than half of their seats unfilled?\",\n    \"A\": \"Veterinary and Animal Sciences-I, Veterinary and Animal Sciences-III, Dairy Science, Dairy Technology & Food Technology\"\n  },\n  {\n    \"Q\": \"How many female candidates got admission in Veterinary and Animal Sciences-II?\",\n    \"A\": \"34 out of 66 (51.51%)\"\n  },\n  {\n    \"Q\": \"What was the total number of JRF/SRF(PGS) fellowships awarded in 2019?\",\n    \"A\": \"297\"\n  },\n  {\n    \"Q\": \"What was the increase in the number of female awardees receiving JRF/SRF(PGS) in 2019 compared to 2014?\",\n    \"A\": \"333%\"\n  },\n  {\n    \"Q\": \"Which university ranked first in terms of JRF/SRF(PGS) secured by its postgraduates in 2019?\",\n    \"A\": \"GBPUAT, Pantnagar\"\n  },\n  {\n    \"Q\": \"How many JRF/SRF(PGS) could not be awarded due to lack of eligible candidates in 2019?\",\n    \"A\": \"3\"\n  }\n]\n```",
    "{ Q: Which major subject group had the highest number of seats filled in 2019?\n                            A: Crop Sciences-I with 83 seats filled.\n                            Q: What was the total number of seats filled in 2019 across all major subject groups?\n                            A: 905 seats were filled in 2019.\n                            Q: Which major subject group had the lowest percentage of seats filled in 2019?\n                            A: Agricultural Statistics with 58% seats filled.\n                            Q: What is the total number of seats in the major subject group Crop Sciences-I?\n                            A: There are 68 total seats in Crop Sciences-I.\n                            Q: How many candidates appeared for the UG examination from rural areas?\n                            A: 57% of candidates were from villages.\n                            Q: What was the percentage of candidates from rural areas in PG examinations?\n                            A: 55% of candidates were from villages in PG.\n                            Q: Which category had the highest distribution of candidates securing ICAR-JRF/SRF (PGS) in 2019?\n                            A: General category had the highest distribution with 73%.\n                            Q: What was the total number of candidates that applied for the UG examination in 2019?\n                            A: The total number of candidates that applied for the UG examination in 2019 is not provided in the given data.\n                            Q: How many candidates secured ICAR-JRF/SRF (PGS) in 2019 without any reservation category?\n                            A: 33 candidates secured ICAR-JRF/SRF (PGS) without any reservation category in 2019.\n                            Q: What was the percentage of candidates from cities in PG examinations?\n                            A: 23% of candidates were from cities in PG. }",
    "[\n  {\n    \"Q\": \"What percentage of UG applicants were females in 2019?\",\n    \"A\": \"50%\"\n  },\n  {\n    \"Q\": \"What was the increase in female applicants for UG and PG between 2014 and 2019?\",\n    \"A\": \"7% each\"\n  },\n  {\n    \"Q\": \"What was the increase in female applicants for Ph.D. between 2014 and 2019?\",\n    \"A\": \"11%\"\n  },\n  {\n    \"Q\": \"Which board had the highest number of candidates eligible for UG counseling in 2019?\",\n    \"A\": \"CBSE (28,611 candidates)\"\n  },\n  {\n    \"Q\": \"Which board had the second-highest number of candidates eligible for UG counseling in 2019?\",\n    \"A\": \"Board of Secondary Education Rajasthan (26,423 candidates)\"\n  },\n  {\n    \"Q\": \"Which board had the highest number of UG candidates admitted in 2019?\",\n    \"A\": \"CBSE (803 candidates)\"\n  },\n  {\n    \"Q\": \"Which board had the second-highest number of UG candidates admitted in 2019?\",\n    \"A\": \"Board of Secondary Education, Rajasthan (536 candidates)\"\n  },\n  {\n    \"Q\": \"What was the total number of candidates eligible for UG counseling from different boards in 2019?\",\n    \"A\": \"1,08,591\"\n  },\n  {\n    \"Q\": \"What percentage of PG applicants were females in 2019?\",\n    \"A\": \"47%\"\n  },\n  {\n    \"Q\": \"What percentage of Ph.D. applicants were females in 2019?\",\n    \"A\": \"49%\"\n  }\n]",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"Which board admitted the most students in XII class for higher agricultural education in India?\",\n    \"A\": \"Board of Secondary Education, Rajasthan (26485 students)\"\n  },\n  {\n    \"Q\": \"How many students appeared for the XII class exam from the Central Board of Secondary Education – International?\",\n    \"A\": \"409 students\"\n  },\n  {\n    \"Q\": \"What is the number of students admitted by the Kerala Board of Higher Secondary Education?\",\n    \"A\": \"5885 students\"\n  },\n  {\n    \"Q\": \"How many students were eligible for registration and choice filling for counseling from the Uttar Pradesh State Open School Board?\",\n    \"A\": \"39 students\"\n  },\n  {\n    \"Q\": \"Which board had the highest number of students appearing for the XII class exam in Telangana?\",\n    \"A\": \"Telangana State Board of Intermediate Education (5975 students)\"\n  },\n  {\n    \"Q\": \"How many students were admitted by the Haryana Board of Education?\",\n    \"A\": \"192 students\"\n  },\n  {\n    \"Q\": \"What is the number of students appeared for the XII class exam from the Bihar Board of Open Schooling and Examination?\",\n    \"A\": \"340 students\"\n  },\n  {\n    \"Q\": \"Which board had the lowest number of students admitted for higher agricultural education in India?\",\n    \"A\": \"Dayalbagh Educational Institute (Deemed University) (4 students)\"\n  },\n  {\n    \"Q\": \"How many students were eligible for registration and choice filling for counseling from the National Institute of Open Schooling?\",\n    \"A\": \"136 students\"\n  },\n  {\n    \"Q\": \"Which board had the highest number of students appearing for the XII class exam in West Bengal?\",\n    \"A\": \"West Bengal Council of Higher Secondary Education (4764 students)\"\n  }\n]\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"What is the total number of candidates admitted through ICAR's AIEEA-2019 Exam?\",\n    \"A\": \"108,979\"\n  },\n  {\n    \"Q\": \"How many seats are reserved for Physically Challenged candidates in different subjects?\",\n    \"A\": \"5%\"\n  },\n  {\n    \"Q\": \"What was the increase in reservation for Physically Challenged candidates from the academic session 2018-19?\",\n    \"A\": \"Increased from 3% to 5%\"\n  },\n  {\n    \"Q\": \"How many Physically Challenged candidates were admitted to PG programs with JRF/SRF(PGS) in 2019?\",\n    \"A\": \"25\"\n  },\n  {\n    \"Q\": \"When was the reservation for Economically Weaker Section (EWS) candidates introduced for Central Educational Institutions?\",\n    \"A\": \"W.e.f. 2019-20\"\n  },\n  {\n    \"Q\": \"How many EWS candidates were admitted to PG programs with PG Scholarship in 2019?\",\n    \"A\": \"18\"\n  },\n  {\n    \"Q\": \"What is the total number of EWS candidates admitted to Ph.D. programs in 2019?\",\n    \"A\": \"4\"\n  },\n  {\n    \"Q\": \"Since when have universities been awarded based on the number of ICAR-PG scholarship holders produced?\",\n    \"A\": \"W.e.f. 2016-17\"\n  },\n  {\n    \"Q\": \"How many broad programme categories are there for the award of Best Performing University?\",\n    \"A\": \"4\"\n  },\n  {\n    \"Q\": \"What is the purpose of education according to A. P. J. Abdul Kalam?\",\n    \"A\": \"To make good human beings with skill and expertise, and to create enlightened human beings by teachers.\"\n  }\n]\n```",
    "Here are 10 question-answer pairs based on the provided text, in JSON format:\n\n```json\n[\n  {\n    \"Q\": \"What are the major subject groups under the Agricultural Sciences programme category?\",\n    \"A\": \"Plant Sciences, Physical Science, Entomology & Nematology, Agronomy, Social Sciences, Statistical Sciences, Community Science, and Agribusiness Management\"\n  },\n  {\n    \"Q\": \"Which universities are part of the Horticulture and Forestry programme category?\",\n    \"A\": \"Horticulture and Forestry/Agroforestry and Silviculture\"\n  },\n  {\n    \"Q\": \"What are the programme categories under Engineering and Technology?\",\n    \"A\": \"Plant Biotechnology, Agricultural Engineering & Technology, Water Science Technology, Animal Biotechnology, Dairy Sciences, Dairy Technology, and Food Science Technology\"\n  },\n  {\n    \"Q\": \"Which universities produced the maximum ICAR-PG scholarship holders in the Agricultural Sciences group in 2019-20?\",\n    \"A\": \"UAS, Bengaluru (37 scholarships)\"\n  },\n  {\n    \"Q\": \"Which university topped the Horticulture and Forestry group in 2018-19?\",\n    \"A\": \"UHS, Bagalkot (45 scholarships)\"\n  },\n  {\n    \"Q\": \"Which university was second in the Engineering and Technology group in 2017-18?\",\n    \"A\": \"OUAT, Bhubaneswar (29 scholarships)\"\n  },\n  {\n    \"Q\": \"How many ICAR-PG scholarships were awarded to GBPUAT, Pantnagar in 2016-17?\",\n    \"A\": \"6 (for CAU, Imphal) and 13 (for GBPUAT, Pantnagar)\"\n  },\n  {\n    \"Q\": \"Which institution was the top preference among ICAR-PG scholarship holders in 2016-17?\",\n    \"A\": \"IARI, New Delhi (123 candidates)\"\n  },\n  {\n    \"Q\": \"Which SAU was ranked topmost in terms of 'brand value' for ICAR-PG scholarship holders?\",\n    \"A\": \"GBPUAT, Pantnagar\"\n  },\n  {\n    \"Q\": \"How many ICAR-PG scholarships were awarded in total in 2016-17?\",\n    \"A\": \"600 candidates\"\n  }\n]\n```",
    "Here are 10 question-answer pairs based on the provided text:\n\n```json\n{\n  \"Q1\": \"Which university secured the highest number of JRF/SRF(PGS) in AICE-JRF/SRF(PGS)-2019?\",\n  \"A1\": \"GBPUAT, Pantnagar with 23\",\n  \"Q2\": \"How many ICAR-PG Scholarships were secured by the graduates of UAS, Bengaluru in 2014-2019?\",\n  \"A2\": \"16\",\n  \"Q3\": \"What is the top university based on the number of graduates eligible for AIEEA (PG)-2019 online counselling?\",\n  \"A3\": \"TNAU, Coimbatore with 925 candidates\",\n  \"Q4\": \"What percentage of qualified candidates from CAU Imphal got admissions?\",\n  \"A4\": \"59.48%\",\n  \"Q5\": \"Which university had the highest number of postgraduates eligible for AICE-JRF/SRF(PGS)-2019 online counselling?\",\n  \"A5\": \"TNAU, Coimbatore with 232 candidates\",\n  \"Q6\": \"What is the GER for Agricultural Education out of the total eligible population in the country?\",\n  \"A6\": \"0.03%\",\n  \"Q7\": \"What is one of the major challenges in ensuring the quality of education imparted through private colleges in agricultural education?\",\n  \"A7\": \"Lack of brand value for most of SAUs\",\n  \"Q8\": \"What is the growing unemployment rate among agricultural graduates?\",\n  \"A8\": \"43%\",\n  \"Q9\": \"What is the growing unemployment rate among agricultural postgraduates?\",\n  \"A9\": \"25%\",\n  \"Q10\": \"What is one of the issues contributing to the decline in the quality of students admitted to agricultural education?\",\n  \"A10\": \"Shifting employment opportunities from public to private sector\"\n}\n```",
    "{ \"Q\": \"What was the total number of admissions in the agriculture stream in 2015?\",\n  \"A\": \"5669\" },\n\n{ \"Q\": \"What was the placement percentage for agriculture graduates in 2013?\",\n  \"A\": \"20.8%\" },\n\n{ \"Q\": \"Which year had the highest placement percentage for agriculture graduates?\",\n  \"A\": \"2012 (26.9%)\" },\n\n{ \"Q\": \"What was the total number of placements in 2014?\",\n  \"A\": \"1037\" },\n\n{ \"Q\": \"How did the admission status of agriculture graduates change from 2011 to 2015?\",\n  \"A\": \"It gradually increased from 3982 in 2011 to 5669 in 2015.\" },\n\n{ \"Q\": \"What was the average placement percentage for agriculture graduates from 2011 to 2015?\",\n  \"A\": \"Around 21.5%\" },\n\n{ \"Q\": \"Who reported the status of admission and placement of agriculture graduates in India?\",\n  \"A\": \"Vijayakumar (2017)\" },\n\n{ \"Q\": \"What are some challenges faced by the Indian higher agricultural education system?\",\n  \"A\": \"Low access, lack of required quality standards, lack of adequate financial support, gender inequality, academic inbreeding, lack of faculty competence in cutting-edge areas, etc.\" },\n\n{ \"Q\": \"Who has the primary administrative and policy control over State Agricultural Universities (SAUs) in India?\",\n  \"A\": \"State Governments\" },\n\n{ \"Q\": \"What is one of the key focuses for agricultural graduates to deal with the emerging globalized environment?\",\n  \"A\": \"Possessing the required professional capabilities and skill-set to deal with the concerns of sustainable development of climate-resilient agriculture.\" }",
    "Here are 10 question-answer pairs based on the provided text:\n\n```json\n{\n  \"QA_Pairs\": [\n    {\n      \"Q\": \"What percentage of time do teachers in SAUs spend on teaching and research?\",\n      \"A\": \"Less than 50%\"\n    },\n    {\n      \"Q\": \"How can the quality of education in SAUs be improved?\",\n      \"A\": \"Increase the number of hours teachers spend with students and address faculty shortages.\"\n    },\n    {\n      \"Q\": \"What is one reason for student dissatisfaction with the fee structure in universities?\",\n      \"A\": \"The fee is considered too high for the quality of education and facilities offered.\"\n    },\n    {\n      \"Q\": \"What is one consequence of establishing new SAUs without proper support?\",\n      \"A\": \"It escalates existing problems in the university system.\"\n    },\n    {\n      \"Q\": \"According to the Dr. R.S. Paroda Committee Report, what is a problem with recent private colleges and universities?\",\n      \"A\": \"They charge high fees for substandard education and facilities.\"\n    },\n    {\n      \"Q\": \"What is one issue with the legalization of private college affiliations by SAUs?\",\n      \"A\": \"It goes against the provisions of the Model Act of ICAR.\"\n    },\n    {\n      \"Q\": \"What is missing in the establishment of private institutions, according to the report?\",\n      \"A\": \"An enforcing mechanism to accredit these institutions after they have been established.\"\n    },\n    {\n      \"Q\": \"What is the prime motive of private institutions, as per the report?\",\n      \"A\": \"Profit.\"\n    },\n    {\n      \"Q\": \"What is one proposed solution to maintain the quality of agricultural education?\",\n      \"A\": \"Establish an 'Agricultural Education Council of India (AECI)' as a regulatory authority.\"\n    },\n    {\n      \"Q\": \"What decision was taken regarding admission of candidates from private agricultural colleges/universities?\",\n      \"A\": \"A decision was taken in the Annual Vice-chancellors’ Conference held on 30-31 January, 2019 regarding admission of candidates passing out from private agricultural colleges/universities in view of the Gujarat High Court Order.\"\n    }\n  ]\n}\n```",
    "{ \"Q\": \"What is the eligibility criteria for ICAR's All India Entrance examinations based on a Supreme Court order?\",\n  \"A\": \"Candidates passed out from private Agricultural Universities/Colleges not accredited by ICAR are not eligible, even if they are affiliated to public funded/Govt. institutions.\" },\n\n{ \"Q\": \"What is a major factor contributing to low productivity in India's agriculture sector?\",\n  \"A\": \"Low investment in agricultural research and education.\" },\n\n{ \"Q\": \"What is essential for achieving technology-led agriculture growth?\",\n  \"A\": \"Strengthening higher agricultural education and enhancing the quality of human resources.\" },\n\n{ \"Q\": \"What is the key to improving the quality of human resources in agriculture?\",\n  \"A\": \"Vertical integration of agricultural education.\" },\n\n{ \"Q\": \"What is a major constraint in delivering agricultural technologies at the grassroots level?\",\n  \"A\": \"Lack of qualified manpower in adequate numbers in frontier areas of agricultural science and technology.\" },\n\n{ \"Q\": \"How does investment in education help in poverty elevation?\",\n  \"A\": \"It helps in sustaining agricultural productivity and profitability.\" },\n\n{ \"Q\": \"What role should State Agricultural Universities (SAUs) play to attract talent?\",\n  \"A\": \"Provide an enabling environment and facilities for the all-round development, growth, and employment of students.\" },\n\n{ \"Q\": \"What should states do to modernize and strengthen SAUs?\",\n  \"A\": \"Provide more funds to SAUs to improve infrastructural facilities.\" },\n\n{ \"Q\": \"What is required to achieve an average annual growth rate above 4% in the agriculture sector?\",\n  \"A\": \"Taking allied sectors on board and developing new technologies through concerted R&D efforts.\" },\n\n{ \"Q\": \"What is the trend of the budget for Agricultural Education from IX to XII Plan and the 3-year Annual Plans (2018-2020)?\",\n  \"A\": \"The budget increased from `224.69 crores (IX Plan) to `2050 crores (2018-2020), but there was no commensurate increase in budgetary provisions despite the increase in the number of Agricultural Universities and their constituent colleges and departments.\" }",
    "{ \"Q\": \"What is the financial status of State Agricultural Universities (SAUs) in India?\",\n  \"A\": \"The financial health of SAUs in India is generally precarious.\",\n  \"Q\": \"What is the suggested measure to improve the financial status of SAUs?\",\n  \"A\": \"Enhance budgetary support at the center and state level to improve technology development and research quality.\",\n  \"Q\": \"What is one of the initiatives to encourage young professionals to set up their own enterprise in agriculture?\",\n  \"A\": \"Providing subsidized funding and exchange programs with universities abroad.\",\n  \"Q\": \"What is the role of youth in transforming agriculture in India?\",\n  \"A\": \"Youth play a vital role in transforming agriculture in India.\",\n  \"Q\": \"What is the reason for the continuous increase in rural youth migration to urban areas?\",\n  \"A\": \"The lack of profitability in agriculture.\",\n  \"Q\": \"What is the ICAR initiative to attract and retain youth in agriculture?\",\n  \"A\": \"The Attracting and Retaining Youth in Agriculture (ARYA) program.\",\n  \"Q\": \"What are the major objectives of the ARYA project?\",\n  \"A\": \"To attract and empower rural youth, enable network groups, and demonstrate functional linkage with institutions.\",\n  \"Q\": \"How many rural youths will be identified for skill development in each district under the ARYA project?\",\n  \"A\": \"200-300 rural youths per district.\",\n  \"Q\": \"What are some of the entrepreneurial activities and enterprise units planned under the ARYA project?\",\n  \"A\": \"Poultry farming, dairying, fisheries, goat rearing, mushroom production, and other similar activities.\" }",
    "{ \"Q\": \"What are the main objectives of the initiatives mentioned for empowering youth in agriculture?\",\n  \"A\": \"The main objectives are to provide knowledge, skills, and enthusiasm to pursue agriculture with new vigour, leading to an overall improvement in the rural situation.\",\n  \"Q\": \"Why do some students opt for agriculture as a subject?\",\n  \"A\": \"Students who do not get admission in medicine, engineering, management, or veterinary courses often opt for agriculture.\",\n  \"Q\": \"What is needed to nurture talent in the available pool of agriculture students?\",\n  \"A\": \"Excellent teaching environment, facilities, knowledgeable, updated, and motivated faculty are required to teach newer concepts and methodologies.\",\n  \"Q\": \"What is the current state of infrastructure and facilities in agricultural educational institutions?\",\n  \"A\": \"The infrastructure and facilities are often frail and cannot enthuse new entrants about the profession.\",\n  \"Q\": \"What is the recommended approach for improving higher agricultural education in India?\",\n  \"A\": \"Establishing world-class institutions focusing on PG teaching and research, attracting and nurturing the best talent, and drawing more foreign students.\",\n  \"Q\": \"How can agricultural education be globalized?\",\n  \"A\": \"By setting up campuses abroad, initiating collaborative projects, and increasing student exchange programmes.\",\n  \"Q\": \"What should be the focus for improving the employability of agriculture students?\",\n  \"A\": \"Attaining excellence in areas of strategic importance such as IPRs, WTO-related areas, techno-legal specialties, and Agri-business.\",\n  \"Q\": \"What are the recommended measures for institutional capacity building in agricultural education?\",\n  \"A\": \"Establishing linkages/partnerships with other institutions/stakeholders, faculty and student exchange programmes, and enlarging the number and scope of fellowships.\",\n  \"Q\": \"What facilities should be created to attract international students and faculty to study in India's agricultural universities?\",\n  \"A\": \"Good hostel and transit accommodation facilities should be created to attract international students and faculty.\" }",
    "Here are 10 question-answer pairs based on the provided text about youth in agriculture:\n\n```json\n{\n  \"Q1\": \"What is the primary objective of the National Mission on Youth in Agriculture?\",\n  \"A1\": \"To impart better knowledge and skill to youth on sustainable, secondary, and specialty agriculture, efficient knowledge dissemination, technical backstopping, new agri-business models, entrepreneurship, and linking farmers to markets through value chain.\",\n\n  \"Q2\": \"Which levels of education should agricultural education be imparted from, according to the committee?\",\n  \"A2\": \"From school level onwards, including vocational and formal diploma programs by CAUs, SAUs, and ICAR institutes.\",\n\n  \"Q3\": \"What is the recommended new research agenda for Youth-Agriculture Nexus aimed to achieve?\",\n  \"A3\": \"To delineate different contexts for youth-oriented agricultural research, identify opportunities for youth's engagement in ARI4D, and determine future pathways for sustainable agricultural growth and income.\",\n\n  \"Q4\": \"How can youth contribute to the 'Plough-to-Plate' initiative to help double farmers' income?\",\n  \"A4\": \"By networking for knowledge sharing, validating innovations using technology parks, using ICT, creating agri-clinics, supporting mentoring, and being aware of intellectual property rights.\",\n\n  \"Q5\": \"What is the recommended paradigm shift for youth in agriculture, according to the committee?\",\n  \"A5\": \"From 'youth as a farmer' to 'youth as value chain developer' to provide better economic opportunities in the changing agricultural scenario.\",\n\n  \"Q6\": \"What are some economic opportunities that the combination of agricultural value chains, technology, and entrepreneurship can open up for youth?\",\n  \"A6\": \"Opportunities in both farm and non-farm sectors, such as setting up agri-service centers to offer custom-hire services for small and marginal farmers.\",\n\n  \"Q7\": \"What is the 'Earn while you learn' programme mentioned in the report?\",\n  \"A7\": \"It is a programme mentioned in the report but not described in the provided text.\",\n\n  \"Q8\": \"What is the 'Landscape of Higher Agricultural Education in India' report about?\",\n  \"A8\": \"It is a report mentioned in the text but not described in the provided text.\",\n\n  \"Q9\": \"What are the major objectives of the National Mission on Youth in Agriculture, as emphasized by the committee?\",\n  \"A9\": \"To build new skills in youth for innovative agriculture, impart better knowledge and skill, and link farmers to markets through value chain.\",\n\n  \"Q10\": \"What is the recommended way to inspire and attract youth to adopt agriculture, according to the committee?\",\n  \"A10\": \"By institutionalizing incentives and an award/reward system.\"\n}\n```",
    "{ \"Q\": \"What is the primary goal of institutionalizing incentives, awards, and rewards in agriculture?\",\n  \"A\": \"To encourage youth-led inclusive growth in agriculture by making it a more attractive profession.\" },\n\n{ \"Q\": \"Who should act as role models for youth in agriculture?\",\n  \"A\": \"Successful entrepreneurs should be identified and encouraged to act as role models for capacity development and technical back-stopping of other youth.\" },\n\n{ \"Q\": \"What is the recommended initiative for creating an 'Agri-Youth Innovation Corpus Fund'?\",\n  \"A\": \"The private sector is required to play a proactive role through Corporate Social Responsibility (CSR) and special projects to enhance rural employment opportunities.\" },\n\n{ \"Q\": \"Which ministry is recommended to create a separate Department of Youth in Agriculture?\",\n  \"A\": \"The Ministry of Agriculture and Farmers Welfare (MoA & FW) is recommended to create such a department.\" },\n\n{ \"Q\": \"What is the purpose of the proposed 'National Mission on Youth in Agriculture'?\",\n  \"A\": \"To motivate and attract youth to engage in agriculture and allied fields by providing funding support and institutional mechanisms.\" },\n\n{ \"Q\": \"What are some enabling policies suggested to encourage youth in agriculture?\",\n  \"A\": \"Long-term investments, easy and soft credit, upfront subsidies, farmer exchange visits, easy market accessibility, land law reforms, no taxation system, risk insurance, and reforms in marketing laws.\" },\n\n{ \"Q\": \"What is the role of the Agricultural Education Division, ICAR in attracting youth to agriculture?\",\n  \"A\": \"It aims to attract talent from across the country and expose them to different socio-cultural environments to generate interest in agriculture.\" },\n\n{ \"Q\": \"What is the recommended approach to create a compendium of youth-led success stories in agriculture?\",\n  \"A\": \"Prepare a compendium of case studies of young agricultural entrepreneurs and innovators from various sectors and eco-regions of the country.\" },\n\n{ \"Q\": \"How can private players contribute to enhancing rural employment opportunities in agriculture?\",\n  \"A\": \"Through soft loans, mentoring programs, and involving rural youths as input dealers/suppliers and paid extension agents.\" },\n\n{ \"Q\": \"What is the suggested institutional mechanism to coordinate with other ministries for youth in agriculture?\",\n  \"A\": \"Create a separate Department of Youth in Agriculture under the MoA & FW to collaborate and coordinate with concerned line departments in other ministries.\" }",
    "Here are 10 question-answer pairs in JSON format based on the provided text:\n\n```json\n[\n  {\n    \"Q\": \"Which university secured the most PGS in 2019?\",\n    \"A\": \"GBPUAT, Pantnagar\"\n  },\n  {\n    \"Q\": \"How many PGS did GBPUAT, Pantnagar secure in 2019?\",\n    \"A\": \"23\"\n  },\n  {\n    \"Q\": \"Which university secured the least PGS in 2019?\",\n    \"A\": \"CKV, Anjora\"\n  },\n  {\n    \"Q\": \"How many JRF/SRF did CKV, Anjora secure in 2019?\",\n    \"A\": \"0\"\n  },\n  {\n    \"Q\": \"Which university secured the most JRF/SRF in 2019?\",\n    \"A\": \"ICAR-IVRI, Izatnagar\"\n  },\n  {\n    \"Q\": \"How many JRF/SRF did ICAR-IVRI, Izatnagar secure in 2019?\",\n    \"A\": \"19\"\n  },\n  {\n    \"Q\": \"Which university had the highest total of PGS and JRF/SRF secured in 2019?\",\n    \"A\": \"GBPUAT, Pantnagar\"\n  },\n  {\n    \"Q\": \"What was the total number of PGS and JRF/SRF secured by GBPUAT, Pantnagar in 2019?\",\n    \"A\": \"42\"\n  },\n  {\n    \"Q\": \"Which university had the lowest total of PGS and JRF/SRF secured in 2019?\",\n    \"A\": \"CKV, Anjora\"\n  },\n  {\n    \"Q\": \"What was the total number of PGS and JRF/SRF secured by CKV, Anjora in 2019?\",\n    \"A\": \"3\"\n  }\n]\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text about agricultural universities in India:\n\n```json\n[\n  {\n    \"Q\": \"Which state is KUFOS located in?\",\n    \"A\": \"Kerala\"\n  },\n  {\n    \"Q\": \"What is the number of PGS secured by KVASU in 2018?\",\n    \"A\": 1\n  },\n  {\n    \"Q\": \"How many JRF/SRF were secured by LUVAS in 2017?\",\n    \"A\": 5\n  },\n  {\n    \"Q\": \"What is the total number of PGS secured by MAFSU from 2014 to 2019?\",\n    \"A\": 45\n  },\n  {\n    \"Q\": \"How many JRF/SRF were secured by MPKV in 2016?\",\n    \"A\": 6\n  },\n  {\n    \"Q\": \"What is the number of PGS secured by MPUAT in 2015?\",\n    \"A\": 8\n  },\n  {\n    \"Q\": \"When were admissions to SHUATS stopped?\",\n    \"A\": \"W.e.f. 2019-20\"\n  },\n  {\n    \"Q\": \"How many JRF/SRF were secured by SKNAU in 2018?\",\n    \"A\": 7\n  },\n  {\n    \"Q\": \"What is the total number of PGS secured by SKUAST-J from 2014 to 2019?\",\n    \"A\": 43\n  },\n  {\n    \"Q\": \"How many JRF/SRF were secured by TNAU in 2019?\",\n    \"A\": 12\n  }\n]\n```",
    "Here are 10 question-answer pairs in JSON format based on the provided text about agricultural universities in India:\n\n```json\n[\n  {\n    \"Q\": \"What is the total number of agricultural universities listed in the table?\",\n    \"A\": \"18\"\n  },\n  {\n    \"Q\": \"Which university is listed first?\",\n    \"A\": \"Acharya N G Ranga Agricultural University, Guntur, Andhra Pradesh\"\n  },\n  {\n    \"Q\": \"What is the telephone number of Acharya Narendra Deva University of Agriculture & Technology, Ayodhya, Uttar Pradesh?\",\n    \"A\": \"05270-262035\"\n  },\n  {\n    \"Q\": \"What is the website of Agricultural University, Kota, Rajasthan?\",\n    \"A\": \"www.aukota.org\"\n  },\n  {\n    \"Q\": \"Which state is Assam Agricultural University located in?\",\n    \"A\": \"Assam\"\n  },\n  {\n    \"Q\": \"What is the postal address of Bihar Animal Sciences University, Patna, Bihar?\",\n    \"A\": \"Bihar Veterinary College Campus, Patna - 800014, Bihar\"\n  },\n  {\n    \"Q\": \"Which university is listed last?\",\n    \"A\": \"Guru Angad Dev Veterinary and Animal Sciences University, Ludhiana, Punjab\"\n  },\n  {\n    \"Q\": \"What is the telephone number of Dr. Balasaheb Sawant Konkan Krishi Vidyapeeth, Ratnagiri, Maharashtra?\",\n    \"A\": \"02358-282065\"\n  },\n  {\n    \"Q\": \"Which university specializes in horticulture and forestry?\",\n    \"A\": \"Dr. Yashwant Singh Parmar University of Horticulture & Forestry, Nauni, Himachal Pradesh\"\n  },\n  {\n    \"Q\": \"What is the total number of agricultural universities in Rajasthan listed in the table?\",\n    \"A\": \"2\"\n  }\n]\n```",
    "{ Q: Which is the main campus of Kerala Agricultural University?\n                            A: KAU Main Campus, KAU P.O., Vellanikkara, Thrissur -680656\n                            Q: What is the phone number of Punjab Agricultural University?\n                            A: 0161- 2401960\n                            Q: Where is the administrative office of Prof. Jayashankar Telangana State Agricultural University located?\n                            A: Rajendranagar, Hyderabad-500030, Telangana\n                            Q: What is the website of Navsari Agricultural University?\n                            A: www.nau.in\n                            Q: Which city is Odisha University of Agriculture & Technology located in?\n                            A: Bhubaneswar\n                            Q: What is the phone number of Rajasthan University of Veterinary & Animal Sciences?\n                            A: 0151-2540028\n                            Q: Where is the campus office of Maharana Pratap Horticultural University located?\n                            A: Anjanthali, Karnal, Campus Office-CCS Haryana Agricultural University Campus, Hisar-125001 (Haryana)\n                            Q: What is the website of Mahatma Phule Krishi Vidyapeeth?\n                            A: www.mpkv.ac.in\n                            Q: Which city is Lala Lajpat Rai University of Veterinary & Animal Sciences located in?\n                            A: Hisar\n                            Q: What is the phone number of Sardar Vallabh Bhai Patel University of Agriculture and Technology?\n                            A: 02762-243201 }"
]