[
    "{ Q: What is the ICAR Handbook of Technical Services?\n                            A: The ICAR Handbook of Technical Services is a document that provides guidelines for annual assessment reports of technical personnel in the Indian Council of Agricultural Research (ICAR).\n                            Q: What information is included in Part I of the assessment report?\n                            A: Part I includes personal data such as the officer's name, date of birth, academic qualifications, date of joining ICAR, present grade, post, salary, and absence from duty.\n                            Q: Who fills in Part II of the assessment report?\n                            A: Part II is filled in by the officer reported upon, providing a brief description of duties, performance resume, constraints, and additional qualifications acquired.\n                            Q: What is the role of the reporting authority in Part III of the assessment report?\n                            A: The reporting authority assesses the officer's work quality, output, knowledge of the sphere of work, and attributes such as attitude and initiative.\n                            Q: What is the purpose of the reviewing officer's remarks in Part IV?\n                            A: The reviewing officer provides comments on the officer's length of service, acceptance of the assessment, and any special characteristics or outstanding merit for career advancement.\n                            Q: What is the ICAR?\n                            A: The Indian Council of Agricultural Research (ICAR) is an autonomous organization under the Department of Agricultural Research and Education, Ministry of Agriculture and Farmers Welfare, Government of India.\n                            Q: What is the self-assessment section in the report for?\n                            A: The self-assessment section allows the officer to provide a brief description of duties, performance resume, constraints, and additional qualifications acquired during the year.\n                            Q: What is the role of the reporting authority in assessing the officer's knowledge of the sphere of work?\n                            A: The reporting authority comments on the officer's level of knowledge regarding functions, related instructions, and their application, as well as the quality of technical achievements.\n                            Q: What information is required about the officer's absence from duty?\n                            A: The report requires information about the officer's absence from duty, including leave, training, and the duration of such absences. }",
    "{ Q: How does the Officer's ability to motivate impact his/her work?\n                            A: The Officer's ability to motivate helps obtain willing support by own conduct and inspires confidence.\n                            Q: What is the importance of interpersonal relations and teamwork in the Officer's role?\n                            A: It is important for the Officer to maintain good relationships with superiors, colleagues, and subordinates, and to work effectively as a team member.\n                            Q: How does the Officer's relationship with the public affect his/her performance?\n                            A: The Officer's accessibility to the public and responsiveness to their needs are crucial for effective service delivery.\n                            Q: What is the purpose of the overall assessment of the Officer in Part IV?\n                            A: The overall assessment highlights the Officer's strengths, shortcomings, and notable qualities not covered in previous entries.\n                            Q: What is the criteria for grading an Officer as outstanding?\n                            A: An Officer is graded outstanding only if exceptional qualities and performances are noticed, with clear justification.\n                            Q: What is the role of the Reviewing Officer in the assessment process?\n                            A: The Reviewing Officer evaluates the report's accuracy and agrees or disagrees with the assessment given by the Reporting Officer.\n                            Q: What is the purpose of the Supplementary Information Proforma?\n                            A: It allows Technical Personnel to provide additional material for their subsequent assessment for grant of merit promotion.\n                            Q: How can the reviewee add supplementary material to the assessment process?\n                            A: The reviewee can indicate any additional qualifications or training acquired and request a personal discussion with the Assessment Committee.\n                            Q: What is the significance of the Officer's field of specialization and present posting?\n                            A: The Officer's field of specialization and present posting are important factors in evaluating their performance and potential for advancement. }",
    "{ Q: Does the Technical Personnel want to come for a personal discussion?\n                            A: No, unless indicated otherwise.\n                            Q: What is the purpose of the ICAR Handbook of Technical Services?\n                            A: The handbook provides guidelines for technical services within the ICAR.\n                            Q: What is the ICAR Handbook of Technical Services Appendix VIII used for?\n                            A: It is used for merit promotion based on assessment in technical services.\n                            Q: Is medical examination conducted at the time of entry into ICAR service?\n                            A: Yes, it is mentioned in the handbook.\n                            Q: What is checked in the officer's character and antecedents?\n                            A: Their character and antecedents are verified.\n                            Q: What is the purpose of the Assessment Committee in ICAR?\n                            A: The Assessment Committee evaluates officers for potential promotions.\n                            Q: Is the officer's vigilance clearance required for assessment?\n                            A: Yes, the officer must be cleared from the vigilance angle.\n                            Q: What is considered in the DPC/Assessment Committee recommendation?\n                            A: The DPC/Assessment Committee considers the officer's qualifications, performance, and other requirements for the post.\n                            Q: Who is the appointing authority in ICAR?\n                            A: The appointing authority is not specified in the provided text.}",
    "{ Q: What are the rules and regulations followed by the ICAR as per Bye-Law 30?\n                            A: The ICAR follows the rules and regulations framed by the Government of India, mutatis-mutandis.\n                            Q: How are the Central Civil Services (Classification, Control and Appeal) Rules applicable to ICAR employees?\n                            A: They are applicable subject to the modification that any reference to the 'President' and 'Government Servant' is construed as reference to the 'President of the Society' and 'Officers and employees of the Society', respectively.\n                            Q: What rule mentions the penalties that can be imposed on ICAR employees?\n                            A: Rule 11 of the Central Civil Services (Classification, Control and Appeal) Rules, 1965.\n                            Q: Who is authorized to impose penalties on ICAR employees?\n                            A: Only the officers so authorized by Rules, known as the 'Disciplinary Authority'.\n                            Q: What is the provision of Rule 12 of CCS(CCA) Rules, 1965 regarding ICAR?\n                            A: It provides for the schedule of Disciplinary/Appellate Authorities for imposition of penalties in respect of various posts covered under the Technical Service of the ICAR.\n                            Q: Who is the highest disciplinary authority in ICAR headquarters?\n                            A: The President of the ICAR.\n                            Q: What is the maximum penalty that the President of the ICAR can impose on employees?\n                            A: The maximum penalty is suspension from service for a period not exceeding 8 years, with subsistence allowance not exceeding Rs 16,000 per month.\n                            Q: Who can impose penalties on posts in grade Secy, ICAR in all other cases?\n                            A: Secretary, ICAR.\n                            Q: What is the subject of the letter No.18-1/97.Estt IV dated 3 February 2000?\n                            A: Modifications in the existing Technical Service Rules of the ICAR.}",
    "{ Q: What is the proposal regarding the revision of Technical Service Rules in ICAR?\n                            A: The proposal aims to remove anomalies and improve/update the qualifications by revising some provisions of the existing Technical Service Rules.\n                            Q: When was the matter of revising Technical Service Rules considered by the Governing Body?\n                            A: The matter was considered by the Governing Body in its meeting held on 18 November 1999.\n                            Q: What changes have been made to the grade structure in Category I and II?\n                            A: The grade structure has been modified by removing the overlapping grades T-1-3 and T-H-3, and introducing a new T-3 grade.\n                            Q: How will the assessment promotion from T-2 to T-3 be regulated in the revised structure?\n                            A: Personnel with prescribed qualifications will be eligible for assessment promotion to T-3 after five years of service, while others will be eligible after ten years of service in T-2 grade.\n                            Q: What is the revised provision for assessment promotions from T-5 grade of Category II to T-6 grade of Category III?\n                            A: Technical personnel in T-5 grade with essential qualifications for Category III direct recruitment can be promoted to T-6 after five years, while those without these qualifications can be promoted after ten years, provided they have qualifications for Category II (T-3) direct recruitment.\n                            Q: What is the new pay scale introduced in the revised Technical Service Rules?\n                            A: A revised single pay scale of Rs 10,000-15,200 has been introduced as a replacement.\n                            Q: What is the eligibility criteria for assessment promotion to T-6 grade for T-5 technical personnel without Category III qualifications?\n                            A: They must have qualifications for Category II (T-3) direct recruitment and have completed ten years of service in T-5 grade.\n                            Q: How will the assessment promotion be regulated for T-5 technical personnel without Category II qualifications?\n                            A: They will not be eligible for further assessment promotion to Category III of the Technical Services.\n                            Q: What is the purpose of modifying the grade structure in Category I and II?\n                            A: The purpose is to eliminate redundancy caused by overlapping grades and streamline the assessment promotion process. }",
    "{\n  Q: What is the change in the technical grades of T-7 and T-8?\n  A: The technical grades T-7 and T-8 have been redesignated as a uniform and single grade T(7-8) in the pay scale of Rs 10,000-15,200.\n\n  Q: How will the movement of technical personnel in T(7-8) grade be regulated?\n  A: The movement of technical personnel in T(7-8) grade will be regulated under the assessment system to the next higher grade of T-9.\n\n  Q: What are the eligibility criteria for assessment to T-9 grade from T-7 grade?\n  A: Technical personnel working in T-7 grade will be eligible for assessment to T-9 grade after completing 7 years of service in T-7 grade.\n\n  Q: How long do technical personnel in T-8 grade need to serve before being assessed for T-9 grade?\n  A: Technical personnel in T-8 grade will be assessed for T-9 grade after completing 5 years of service in T-8 grade.\n\n  Q: What are the minimum essential qualifications for direct recruitment in Category I?\n  A: The minimum essential qualification for direct recruitment in Category I is a matriculate with at least one year certificate from a recognized institution in the relevant field.\n\n  Q: What qualifications are required for direct recruitment in Category II?\n  A: A bachelor's degree in the relevant field or equivalent qualifications from a recognized university is required for direct recruitment in Category II.\n\n  Q: What is the minimum essential qualification for direct recruitment in Category III?\n  A: A master's degree in the relevant field or equivalent qualifications from a recognized university is required for direct recruitment in Category III.\n\n  Q: How will the specific qualifications for direct recruitment be finalized?\n  A: The specific qualifications for direct recruitment will be finalized in consultation with the concerned subject-matter divisions.\n\n  Q: Will the existing assessment system for promotions continue?\n  A: Yes, the existing assessment system for promotions will continue, but the assessment committees will determine the benchmark for the relevant period as per the instructions of the Department of Personnel and Training.\n\n  Q: When will the modifications in the technical service rules take effect?\n  A: The modifications will take immediate effect from the date of issuance of the notification.\n}",
    "{ Q: What modifications have been made to the existing technical service rules?\n                            A: The 33.3% promotion quota will be operative only in Cat. I at the level of T-1, and no post/grade of post under Category III of technical service should be filled up by direct recruitment until further instructions.\n                            Q: What is the impact of these modifications on the promotion quota?\n                            A: The promotion quota of 33.3% will only be applicable in Category I at the level of T-1.\n                            Q: What is the regulation for vacancies occurring due to retirement/death/resignation?\n                            A: Vacancies will occur only in the initial grade of the technical person's appointment under the service.\n                            Q: What should institutes avoid doing in the meantime?\n                            A: Institutes should not fill up any post/grade under Category III of technical service through direct recruitment until further instructions.\n                            Q: Who should acknowledge receipt of this notification?\n                            A: The Directors should acknowledge receipt of this notification.\n                            Q: To whom should a copy of the notification be endorsed?\n                            A: A copy of the notification should be endorsed to ICAR staff representatives.\n                            Q: What is the status of the instructions issued on 9 September 1999?\n                            A: The instructions issued on 9 September 1999 have been withdrawn and superseded.\n                            Q: What guidelines and procedure will prevail on the subject?\n                            A: The guidelines and procedure on the subject, as in force prior to the correspondence dated 9 September 1999, will prevail.\n                            Q: Who should be given a copy of the guidelines at their end?\n                            A: Institute Joint Staff Council representatives of the Institutes should be given a copy of the guidelines at their end.}",
    "{ Q: What was the eligibility for promotion of Technical personnel in Category I before 1995?\n                            A: Only educationally qualified Technical personnel in Category I at T-1-3 grade were eligible for promotion to T-11-3 in Category II.\n                            Q: What happened to the post held by promoted personnel in Category II?\n                            A: The post held by them in T-1-3 reverted to T-1 grade in Category I after promotion to Category II.\n                            Q: What changed after the removal of the Category bar in 1995?\n                            A: After removal of the Category bar, personnel moved to Category II along with their post, and the post did not fall back to Category I at T-1 grade.\n                            Q: What concerns did supporting staff have after the removal of the Category bar?\n                            A: They were concerned that their promotional avenues had been reduced by 33.33% at T-1 grade in Category I due to physical non-availability of posts.\n                            Q: What interim measure was taken to address the concern?\n                            A: As an interim measure, 33.33% of vacancies due to retirement, resignation, etc., in Category II were placed into Category I at T-1 grade.\n                            Q: What was the decision regarding the designation of the post of Compounder?\n                            A: The post of Compounder was redesignated as 'Pharmacist'.\n                            Q: What clarification was sought by some Institutes regarding advance increments?\n                            A: They sought clarification on whether the grant of advance increment(s) at T-1-3 level would continue after the removal of the category bar.\n                            Q: How was the case of pay fixation regulated on removal of the category bar?\n                            A: The case of pay fixation was regulated based on the removal of the category bar from Category I to Category II (from T-1-3 to T-11-3) level and on promotion.\n                            Q: What percentage of vacancies in Category II were to be placed into Category I at T-1 grade?\n                            A: 33.33% of the vacancies in Category II were to be placed into Category I at T-1 grade.}",
    "{\n  Q: What is the matter being clarified in the letter dated 30 April 1997?\n  A: The letter clarifies the regulation of advance increments granted to technical personnel in the assessment system.\n\n  Q: What is the decision regarding the rate of advance increments for technical personnel?\n  A: The advance increments granted to technical personnel may be allowed at the rate indicated in the scale of pay, at the appropriate stage(s).\n\n  Q: What is the pay scale for T-1-3 level in Category I and T-11-3 in Category II?\n  A: The pay scale for both T-1-3 level in Category I and T-11-3 in Category II is Rs 1,400-2,300.\n\n  Q: Are technical staff in T-1-3 eligible for grant of advance increment(s)?\n  A: Yes, technical staff in T-1-3 will continue to be eligible for grant of advance increment(s) at T-1-3 level.\n\n  Q: What is the pay scale for T-5 level in Category II and T-6 level?\n  A: The pay scale for T-5 level in Category II is Rs 2,000-3,500, and for T-6 level, it is Rs 2,200-4,000.\n\n  Q: What is the subject of the letter dated 10 March 1997?\n  A: The subject of the letter is the abolition of Auxiliary and Administrative (non-ministerial) Category and reclassification of posts.\n\n  Q: Are the posts of Sr Hindi Translator, Hindi Translator, and Jr Hindi Translator classified as Technical?\n  A: Yes, the posts of Sr Hindi Translator, Hindi Translator, and Jr Hindi Translator are also classified as Technical.\n\n  Q: What is the reference date for pay fixation for technical personnel who have been granted advance increment(s)?\n  A: The pay of a technical person who has been granted advance increment(s) will be fixed as per FR 22(a)(ii) by taking into account the pay, including the advance increment(s), being drawn on the date of removal of category bar/promotion as per Council's letter No.7(2)/84-Per.Ill dated 3.6.1988.\n\n  Q: What is the matter being considered in the Council regarding advance increments?\n  A: The Council considered the matter of grant of advance increment(s) for technical staff in T-1-3 level and clarified that since the provision of grant of advance increment(s) has not been withdrawn, the technical staff will continue to be eligible for it.\n\n  Q: What is the approval of Competent Authority regarding the rate of advance increments?\n  A: The Competent Authority approved the decision that the advance increments granted to Technical Personnel may be allowed at the rate indicated in the scale of pay, at the appropriate stage(s).\n}",
    "{ Q: What was the purpose of the Committee under Dr Kirti Singh?\n                            A: The purpose of the Committee was to consider issues related to classification/reclassification of posts not covered in the Award given by the Board of Arbitration, including the removal of auxiliary posts and appropriate classification of administrative posts.\n                            Q: What decision was made regarding the Auxiliary and Administrative (non-ministerial) Category posts?\n                            A: The posts in the Auxiliary and Administrative (non-ministerial) Category were abolished.\n                            Q: What new functional groups were added in the reclassification of posts?\n                            A: Two new functional groups were added: functional group VIII 'Medical and Paramedical Staff' and functional group IX - 'Housekeeping Staff'.\n                            Q: What action is required for the posts belonging to the new functional groups?\n                            A: Directors of the Institutes are requested to submit proposals regarding model qualifications for the posts belonging to the new functional groups and draft Recruitment Rules for newly classified Administrative and Supporting posts.\n                            Q: How were the Drivers reclassified in the Technical Services?\n                            A: Drivers were reclassified as Technical under 'Workshop group', and the qualifications prescribed for this functional group will be applicable in addition to the appropriate driving license requirement.\n                            Q: Which posts were classified into the Technical Category for the first time?\n                            A: Posts under Medical/Paramedical staff and Housekeeping were classified into the Technical Category for the first time.\n                            Q: What option is given to the existing employees while adjusting their categories?\n                            A: An option for the new category may be obtained before their category is changed as per the enclosed proforma.\n                            Q: What happens to the existing permanent and temporary employees appointed through DPC/Selection Committees?\n                            A: They will be fitted into the newly reclassified categories.\n                            Q: Who approved the proceedings of the Governing Body regarding the reclassification of posts?\n                            A: The President, ICAR, approved the proceedings of the Governing Body.}",
    "{ Q: What is the rule for induction into Technical Services?\n                            A: The induction into Technical Services should be done on a point-to-point basis in accordance with rule 5.1 and 3.1 of Technical Services Rules.\n                            Q: What should be done if any doubt arises during the induction process?\n                            A: The matter should be referred to the ICAR.\n                            Q: What is the deadline for completing the induction into Technical Services?\n                            A: The induction into Technical Services should be completed by 31.12.1996.\n                            Q: Why might some ICAR institutes have failed to supply information about post abolition?\n                            A: It is possible that some ICAR institutes might have failed to supply the information in time.\n                            Q: What should be considered while sending proposals for remaining auxiliary and administrative posts?\n                            A: Due consideration should be given to the nature of duties, pay scale, and qualification.\n                            Q: What is the deadline for sending requests for re-classification of posts?\n                            A: The requests for re-classification should be sent on or before 30 November 1996.\n                            Q: What will happen if no information is received by the deadline for re-classification?\n                            A: It will be presumed that the process of re-classification has been completed, and no further requests will be entertained.\n                            Q: What happens to posts marked with * in the Annexure I?\n                            A: Posts marked with * will be treated as of dying type, and no new posts should be filled in such designations.\n                            Q: When do these orders regarding re-classification of posts become applicable?\n                            A: These orders will be applicable from 29.6.1996, the date of approval by the President, ICAR.}",
    "{ Q: What is the ICAR Circular No. I 7(12)/95-E.V dated for change of category of post?\n                            A: The ICAR Circular No. I 7(12)/95-E.V dated for change of category of post is 20.8.1996.\n                            Q: What is the name of the post classified as a technical group in the ICAR Handbook?\n                            A: Transpon Officer is a post classified as a technical group in the ICAR Handbook.\n                            Q: Which post is classified under the functional group of Workshop in the ICAR Handbook?\n                            A: Blockmaker/Setter Offset Machine is a post classified under the functional group of Workshop.\n                            Q: What is the qualification for staff recruited against any post in Boat Crew within the workshop group?\n                            A: The qualification for staff recruited against any post in Boat Crew within the workshop group is as laid down in T.S.R. for Boat Crew Staff.\n                            Q: Which post is classified under the Medical and Paramedical functional group in the ICAR Handbook?\n                            A: Sr Medical Officer is a post classified under the Medical and Paramedical functional group.\n                            Q: What is the name of the post classified as administrative in the ICAR Handbook?\n                            A: Sanitary Inspector is a post classified as administrative in the ICAR Handbook.\n                            Q: Which post is classified under the functional group of Security in the ICAR Handbook?\n                            A: Security Officer is a post classified under the functional group of Security.\n                            Q: What is the name of the post classified as supporting in the ICAR Handbook?\n                            A: Animal House Keeper is a post classified as supporting in the ICAR Handbook.\n                            Q: Which post is classified under the functional group of Photography in the ICAR Handbook?\n                            A: Photographer/Photography Asstt. is a post classified under the functional group of Photography.\n                            Q: What is the name of the post classified as administrative (non-ministerial) in the ICAR Handbook?\n                            A: The provided text does not mention any specific post classified as administrative (non-ministerial) in the ICAR Handbook.}",
    "{ Q: What are some examples of posts classified as technical staff?\n                            A: Examples include Liaison Officer (Press), Sports Officer, and Physical Training Instructor I.\n                            Q: What is the salary range for the post of Cook/Cook (Boat)?\n                            A: The salary range for the post of Cook/Cook (Boat) is Rs 825-1,200.\n                            Q: What is the issue regarding the removal of the category bar between Category I and Category II?\n                            A: The issue is that some technical personnel may become junior to others if their service in T-1-3 grade is counted.\n                            Q: What decision was made regarding the counting of service in T-1-3 grade?\n                            A: It was decided that for the purpose of five-yearly assessment, service rendered in T-1-3 grade will only be counted.\n                            Q: What posts were initially classified as technical but later reclassified as administrative or auxiliary?\n                            A: Posts of Drivers/Mechanics for Staff Car/Jeep/Tractor etc. were initially classified as technical but later reclassified.\n                            Q: What is the salary range for the post of Machine Milker?\n                            A: The salary range for the post of Machine Milker is Rs 1,200-2,040.\n                            Q: What is the subject of the letter dated 29 September 1995?\n                            A: The subject of the letter is the applicability of removal of category bar between Cat.I and Cat.II to incumbents of posts like Drivers/Mechanics.\n                            Q: What is the salary range for the post of Hand Milker?\n                            A: The salary range for the post of Hand Milker is Rs 975-1,540.\n                            Q: What is the post of the person who signed the letter dated 29 September 1995?\n                            A: The post of the person who signed the letter is OSD(S) in KARI Handbook of Technical Services.}",
    "{\n  Q: What is the content of Council's Circular No. 9-1/82-P.IV dated 28.5.82?\n  A: Council's Circular No. 9-1/82-P.IV dated 28.5.82 states that incumbents of posts earlier classified as technical and subsequently reclassified as non-technical (administrative or auxiliary) will derive all the benefits of technical service on a personal basis.\n\n  Q: What is the clarification regarding the removal of category bar between Cat.I and Cat.II?\n  A: The clarification states that such staff (Appendix II part C of Rules) will also get the benefit of removal of category bar between Cat.I and Cat.II in terms of Council's Circular of even number dated 1.2.1995.\n\n  Q: What amendment was made to Rule 6.4 of Technical Service Rules?\n  A: Rule 6.4 of Technical Service Rules was amended to state that merit promotion or grant of advance increments is to be given with effect from the date following the date of completion of 5 years in a grade.\n\n  Q: What is the effective date of the amendment to Rule 6.4 of Technical Service Rules?\n  A: The amendment to Rule 6.4 of Technical Service Rules is effective from 1.1.1995.\n\n  Q: What is the date of effect of assessment benefits for employees completing 5 years of service on 31.12.1994?\n  A: The date of effect of assessment benefits for employees completing 5 years of service on 31.12.1994 is 1.1.1995.\n\n  Q: How will existing employees at level T-1-3 be placed in grade T-II-3 of Cat. II?\n  A: Existing employees at level T-1-3 who possess qualifications prescribed for entry to Cat.II by direct recruitment will be placed in grade T-II-3 of Cat. II with effect from 1.1.1995.\n\n  Q: What will happen to employees who do not possess the required qualifications for Cat.II entry?\n  A: Employees who do not possess the required qualifications for Cat.II entry will be placed in grade T-II-3 if they improve their qualifications and acquire the necessary degree/diploma/certificate.\n\n  Q: When will employees who improve their qualifications be placed in grade T-II-3?\n  A: Employees who improve their qualifications will be placed in grade T-II-3 from the 1st January of the year following the year in which the degree/diploma/certificate is awarded.\n\n  Q: What is the subject of the letter dated 1 February 1995 from ICAR?\n  A: The subject of the letter dated 1 February 1995 from ICAR is the removal of category bar between Cat.I and Cat.II.\n\n  Q: What decision was made regarding the removal of category bar between Cat.I and Cat.II?\n  A: It was decided with the approval of the Governing Body to remove the category bar between Cat.I and Cat.II in a specified manner.\n}",
    "{ Q: What is the impact of completing five years of service in grade T-2 on merit promotion?\n                            A: Employees with five years of service in grade T-2 and prescribed qualifications will be placed in grade T-11-3, while those without qualifications will be placed in grade T-1-3.\n                            Q: How does acquiring a new qualification affect an employee's grade?\n                            A: An employee in grade T-1-3 who improves their qualification will be placed in grade T-11-3 during the next merit promotion.\n                            Q: What is the amendment made to Rule 6.4 of Technical Service Rules?\n                            A: The amendment states that merit promotion or advance increments will be given from the date following the completion of five years of service in a grade.\n                            Q: When will the amendment to Rule 6.4 be effective?\n                            A: The amendment will be effective from January 1, 1995.\n                            Q: What is the existing provision for merit promotion or grant of advance increments?\n                            A: The existing provision states that merit promotion or advance increments will be given with effect from July 1 or January 1 of the following year, depending on the completion date of five years of service.\n                            Q: What is the subject of the letter dated July 18, 2000?\n                            A: The subject of the letter is regarding the rationalization of the qualifications for the post of Driver under the Council.\n                            Q: What difficulties were faced in filling up the post of Driver?\n                            A: Institutes faced difficulties in filling up the post of Driver due to the qualification requirements.\n                            Q: Who was consulted for the proposal on rationalization of qualifications for the post of Driver?\n                            A: The Agricultural Scientists' Recruitment Board was consulted for the proposal.\n                            Q: What was the proposal submitted to the 183rd Meeting of the Governing Body?\n                            A: The proposal was to rationalize the qualifications for the post of Driver under the Council.}",
    "{ Q: What modifications were made to the qualifications of the post of Driver in the ICAR?\n                            A: The qualifications were revised to include a matriculation pass, a valid driving license, and desirable qualifications such as a trade certificate or driving experience.\n                            Q: What is the minimum educational qualification required for the post of Driver in ICAR?\n                            A: The minimum educational qualification required is a matriculation pass from a recognized board.\n                            Q: What is the requirement for the driving license of the Driver post in ICAR?\n                            A: The candidate must possess a valid and appropriate driving license from a prescribed Government Authority.\n                            Q: What desirable qualifications are mentioned for the post of Driver in ICAR?\n                            A: Desirable qualifications include a one-year trade certificate in the relevant field from ITI, driving experience in a recognized institution, or experience in motor mechanic work.\n                            Q: Who were eligible for the special one-time relaxation as Departmental candidates for the post of Driver?\n                            A: Group 'D'/Supporting Staff who were deployed continuously and uninterruptedly as drivers in the Institute/Hqrs for not less than one full year as of 29th June 1996.\n                            Q: To whom was the copy of the revised qualifications forwarded for information?\n                            A: The copy was forwarded to various officials in ICAR, including DDGs, the Secretary of Agric. Scientists' Recruitment Board, and the Director (Personnel).\n                            Q: What is the ICAR?\n                            A: ICAR stands for the Indian Council of Agricultural Research.\n                            Q: What is the content of the ICAR Budget Book 2018-19?\n                            A: The content includes an introduction, receipts from DARE Grant No.2, summary of budget proposals, anticipated expenditure, and revenue receipts targets.\n                            Q: Who compiled the ICAR Budget Book 2018-19?\n                            A: The ICAR Budget Book 2018-19 was compiled by the Budget Section at ICAR Headquarters.}",
    "{ Q: What is the Indian Council of Agricultural Research (ICAR) responsible for?\n                            A: The ICAR is responsible for the organization and management of research, education, and extension in the field of agriculture, animal sciences, and fisheries.\n                            Q: What types of institutions does the ICAR operate?\n                            A: The ICAR operates a national research and training network consisting of Central Research Institutes (CRIs), National Research Centers (NRCs), Project Directorates (PDs), and Project Coordinating Units (PCUs).\n                            Q: How does the ICAR receive budgetary support from the Government?\n                            A: The ICAR receives budgetary support from the Government through Government of India grants, proceeds from the Agricultural Produce Cess Act, and other sources (Internal Resource Generation).\n                            Q: What is the classification of Government expenditure from 2017-18 onwards?\n                            A: From 2017-18, the Government expenditure will be classified as Revenue and Capital.\n                            Q: What are the three components of the total expenditure to be met out of Government of India grants?\n                            A: The three components are Grant for Creation of Capital Assets, Grant-in-Aid-Salary, and Grant-in-Aid General including Pension.\n                            Q: What does Part-VIII of the ICAR Budget Book 2018-19 provide?\n                            A: Part-VIII provides a summary of the cadre strength of Scientists and other categories.\n                            Q: What is the total gross budget allocation for 2016-2017?\n                            A: The total gross budget allocation for 2016-2017 is 5995.21 crores of Rupees.\n                            Q: What is the budget allocation for 2018-2019 under the Revenue component?\n                            A: The budget allocation for 2018-2019 under the Revenue component is not provided in the given text.\n                            Q: What is the purpose of the Agricultural Produce Cess Act?\n                            A: The Agricultural Produce Cess Act provides proceeds that contribute to the ICAR's budgetary support from the Government. }",
    "{ Q: What is the establishment expenditure of the Centre's Secretariat in 2018-2019?\n                            A: The establishment expenditure of the Centre's Secretariat in 2018-2019 is 7.09.\n                            Q: What is the budget allocation for Agricultural Extension under Central Sector Schemes/Projects in 2017-2018 (Revised)?\n                            A: The budget allocation for Agricultural Extension in 2017-2018 (Revised) is 232.51.\n                            Q: What is the expenditure on Agricultural Engineering in 2016-2017?\n                            A: The expenditure on Agricultural Engineering in 2016-2017 is 190.86.\n                            Q: What is the budget for Natural Resource Management Institutes including Agro Forestry Research in 2018-2019?\n                            A: The budget for Natural Resource Management Institutes including Agro Forestry Research in 2018-2019 is 174.39.\n                            Q: What is the total budget for Climate Resilient Agriculture Initiative in 2017-2018 (Revised)?\n                            A: The total budget for Climate Resilient Agriculture Initiative in 2017-2018 (Revised) is 50.00.\n                            Q: What is the expenditure on Crop Science in 2016-2017?\n                            A: The expenditure on Crop Science in 2016-2017 is 1347.93.\n                            Q: What is the budget for Horticultural Science in 2018-2019?\n                            A: The budget for Horticultural Science in 2018-2019 is 200.00.\n                            Q: What is the budget for National Agricultural Science Fund in 2017-2018 (Revised)?\n                            A: The budget for National Agricultural Science Fund in 2017-2018 (Revised) is 48.80.\n                            Q: What is the total expenditure on Animal Science in 2018-2019?\n                            A: The total expenditure on Animal Science in 2018-2019 is 400.00.}",
    "{ Q: What is the total revenue capital for Fisheries Science?\n                            A: The total revenue capital for Fisheries Science is 170.69.\n                            Q: What is the expenditure for Agricultural Universities and Institutions under Central Sector Schemes/Projects?\n                            A: The expenditure for Agricultural Universities and Institutions under Central Sector Schemes/Projects is 684.70.\n                            Q: What is the budget allocated to ICAR Headquarters in 2018-19?\n                            A: The budget allocated to ICAR Headquarters in 2018-19 is 4574.09 (in lakhs).\n                            Q: What are the actual recoveries for the given year?\n                            A: The actual recoveries for the given year are -265.96.\n                            Q: What is the total expenditure on Autonomous Bodies?\n                            A: The total expenditure on Autonomous Bodies is 4870.93.\n                            Q: What is the budget for Economic Services in 2018-19?\n                            A: The budget for Economic Services in 2018-19 is 7376.52.\n                            Q: What is the expenditure on North Eastern Areas under Others?\n                            A: The expenditure on North Eastern Areas under Others is 423.48.\n                            Q: What is the total Govt. Grant allocated to Indian Council of Agricultural Research in 2016-17?\n                            A: The total Govt. Grant allocated to Indian Council of Agricultural Research in 2016-17 is 573519.95 (in lakhs).\n                            Q: What is the budget estimate for ICAR in 2018-19?\n                            A: The budget estimate for ICAR in 2018-19 is 751414.00 (in lakhs).\n                            }",
    "{ Q: What are the actual expenditure figures for ICAR in 2016-17?\n                            A: The actual expenditure figures for ICAR in 2016-17 are as per the Consolidated Annual Accounts 2016-17.\n\n                            Q: What is the government grant allocated to DARE+ICAR in B.E. 2017-18?\n                            A: The government grant allocated to DARE+ICAR in B.E. 2017-18 is 680000.00 lakhs.\n\n                            Q: What are the estimated revenue receipts for ICAR in B.E. 2018-19?\n                            A: The estimated revenue receipts for ICAR in B.E. 2018-19 are 20013.90 lakhs.\n\n                            Q: What is the allocation for ICAR in B.E. 2018-19?\n                            A: The allocation for ICAR in B.E. 2018-19 is 751414.00 lakhs.\n\n                            Q: What are the total resources available for ICAR in B.E. 2018-19?\n                            A: The total resources available for ICAR in B.E. 2018-19 are 777412.04 lakhs.\n\n                            Q: What are the revenue receipts achievements for the Crop Science division in 2017-18?\n                            A: The revenue receipts achievements for the Crop Science division in 2017-18 are 1221.63 lakhs.\n\n                            Q: What are the targeted revenue receipts for the Animal Science division in 2018-19?\n                            A: The targeted revenue receipts for the Animal Science division in 2018-19 are 2644.65 lakhs.\n\n                            Q: What are the actual achievements in revenue receipts for ICAR in 2017-18?\n                            A: The actual achievements in revenue receipts for ICAR in 2017-18 are 7498.04 lakhs.\n\n                            Q: What is included in the revenue receipts targets for 2018-19?\n                            A: The revenue receipts targets for 2018-19 include income from sales of farm produce/livestock, income from services, fee/subscriptions, and income from royalty, publications, etc.\n                            }",
    "{\n  Q: \"What is the actual revenue generation of CICR, Nagpur for the year 2017-18?\"\n  A: \"The actual revenue generation of CICR, Nagpur for the year 2017-18 is Rs. 29.92 lakh.\",\n\n  Q: \"What are the revenue generation targets for IARI, New Delhi in 2018-19?\"\n  A: \"The revenue generation targets for IARI, New Delhi in 2018-19 are Rs. 220.81 lakh (Schedule 8), Rs. 30.64 lakh (Schedule 10), and Rs. 0.02 lakh (Schedule 12).\",\n\n  Q: \"What are the actual achievements of NBAIM, Mau in the year 2017-18 under Schedule 10?\"\n  A: \"The actual achievements of NBAIM, Mau in the year 2017-18 under Schedule 10 are Rs. 0.00 lakh.\",\n\n  Q: \"What are the total revenue generation targets for the Department of Groundnut Research, Junagadh in 2018-19?\"\n  A: \"The total revenue generation targets for the Department of Groundnut Research, Junagadh in 2018-19 are Rs. 21.24 lakh.\",\n\n  Q: \"What are the actual achievements of NRC on Plant Biotechnology, New Delhi in the year 2017-18 under Schedule 8?\"\n  A: \"The actual achievements of NRC on Plant Biotechnology, New Delhi in the year 2017-18 under Schedule 8 are Rs. 8.08 lakh.\",\n\n  Q: \"What are the revenue generation targets for IIAB, Ranchi in 2018-19 under all schedules?\"\n  A: \"The revenue generation targets for IIAB, Ranchi in 2018-19 are Rs. 0.53 lakh (Schedule 8), Rs. 0.00 lakh (Schedule 10), and Rs. 0.00 lakh (Schedule 12).\",\n\n  Q: \"What are the actual achievements of NIBSM, Raipur in the year 2017-18 under Schedule 12?\"\n  A: \"The actual achievements of NIBSM, Raipur in the year 2017-18 under Schedule 12 are Rs. 0.00 lakh.\",\n\n  Q: \"What are the total actual achievements of all Crop Science institutes in 2017-18?\"\n  A: \"The total actual achievements of all Crop Science institutes in 2017-18 are Rs. 1,221.63 lakh.\",\n\n  Q: \"What are the total revenue generation targets for all Horticultural Science institutes in 2018-19?\"\n  A: \"The total revenue generation targets for all Horticultural Science institutes in 2018-19 are Rs. 1465.96 lakh.\",\n\n  Q: \"What are the actual achievements of CISH, Lucknow in the year 2017-18 under Schedule 12?\"\n  A: \"The actual achievements of CISH, Lucknow in the year 2017-18 under Schedule 12 are Rs. 0.52 lakh.\"\n}",
    "{\n  Q: \"What is the actual achievement for the year 2017-18 of CPRI, Simla?\"\n  A: \"The actual achievement for the year 2017-18 of CPRI, Simla is 193.25 lakh.\",\n\n  Q: \"What are the revenue generation targets for 2018-19 for NRC Banana, Tiruchirapalli?\"\n  A: \"The revenue generation targets for 2018-19 for NRC Banana, Tiruchirapalli are 35.21 lakh.\",\n\n  Q: \"What are the Schedule 8, 10, and 12 achievements for IIHR, Bangalore in 2017-18?\"\n  A: \"The Schedule 8, 10, and 12 achievements for IIHR, Bangalore in 2017-18 are 98.63, 99.74, and 118.36 lakh respectively.\",\n\n  Q: \"What is the total revenue generation for the Horticultural Sciences division?\"\n  A: \"The total revenue generation for the Horticultural Sciences division is 1642.20 lakh.\",\n\n  Q: \"What are the actual achievements for the year 2017-18 of Dte. of Floriculture, New Delhi?\"\n  A: \"The actual achievements for the year 2017-18 of Dte. of Floriculture, New Delhi are 0.10 lakh.\",\n\n  Q: \"What are the revenue generation targets for 2018-19 for ICAR Research Complex, Goa?\"\n  A: \"The revenue generation targets for 2018-19 for ICAR Research Complex, Goa are 69.73 lakh.\",\n\n  Q: \"What are the Schedule 8, 10, and 12 targets for 2018-19 for NBSS & LUP, Nagpur?\"\n  A: \"The Schedule 8, 10, and 12 targets for 2018-19 for NBSS & LUP, Nagpur are 3.11, 0.00, and 5.09 lakh respectively.\",\n\n  Q: \"What is the actual achievement for the year 2017-18 of IISS, Bhopal?\"\n  A: \"The actual achievement for the year 2017-18 of IISS, Bhopal is 25.73 lakh.\",\n\n  Q: \"What are the total Schedule 8, 10, and 12 achievements for CARI (NRC Agroforestry), Jhansi in 2017-18?\"\n  A: \"The total Schedule 8, 10, and 12 achievements for CARI (NRC Agroforestry), Jhansi in 2017-18 are 16.64 lakh.\",\n\n  Q: \"What are the revenue generation targets for 2018-19 for Dte. of Weed Science Research, Jabalpur?\"\n  A: \"The revenue generation targets for 2018-19 for Dte. of Weed Science Research, Jabalpur are 165.32 lakh.\"\n}",
    "{\n  Q: What is the name of the research institute located in Modipuram?\n  A: Indian Institute of Farming System Research\n\n  Q: What are the revenue generation targets for 2018-19 for CIRCOT, Mumbai?\n  A: The revenue generation targets for 2018-19 for CIRCOT, Mumbai are 146.18 lakh.\n\n  Q: Which institute has the highest revenue generation target for 2018-19 in the Animal Sciences category?\n  A: CIRB, Hissar\n\n  Q: What are the actual achievements for the year 2017-18 for NRC Equines, Hissar?\n  A: The actual achievements for the year 2017-18 for NRC Equines, Hissar are 71.31 lakh.\n\n  Q: What are the Sch. 8, Sch. 10, and Sch. 12 targets for the year 2018-19 for CIBA, Chennai?\n  A: The Sch. 8 target is 58.41 lakh, Sch. 10 target is 2.82 lakh, and Sch. 12 target is 61.23 lakh for CIBA, Chennai.\n\n  Q: What are the actual achievements for the year 2017-18 in the Fisheries category?\n  A: There are no actual achievements mentioned for the year 2017-18 in the Fisheries category.\n\n  Q: What is the total revenue generation target for 2018-19 for the Animal Sciences category?\n  A: The total revenue generation target for 2018-19 for the Animal Sciences category is 2644.65 lakh.\n\n  Q: Which institute has the lowest actual achievements for the year 2017-18 in the Animal Sciences category?\n  A: IVRI, Mukteswar\n\n  Q: What are the Sch. 8, Sch. 10, and Sch. 12 achievements for the year 2017-18 for NDRI, Karnal?\n  A: The Sch. 8 achievements are 533.53 lakh, Sch. 10 achievements are 83.50 lakh, and Sch. 12 achievements are 617.74 lakh for NDRI, Karnal.\n\n  Q: What is the name of the institute located in Dirang?\n  A: NRC Yak\n}",
    "{  Q: What are the names of the fisheries research institutes mentioned in the text?\n A: The two fisheries research institutes mentioned are NBFGR, Lucknow and Dte. Of Cold Water Fisheries Research, Bhimtal.\n\n Q: What is the total revenue generation for the fisheries sector in 2017-18?\n A: The total revenue generation for the fisheries sector in 2017-18 is 351.63 lakh rupees.\n\n Q: What is the revenue generation target for the Agricultural Economics & Statistics sector in 2018-19?\n A: The revenue generation target for the Agricultural Economics & Statistics sector in 2018-19 is 40.83 lakh rupees.\n\n Q: Which institute under Agricultural Education has the highest revenue generation in 2017-18?\n A: NAARM, Hyderabad has the highest revenue generation of 151.42 lakh rupees in 2017-18 under Agricultural Education.\n\n Q: What are the actual achievements for the year 2017-18 for the Agricultural Extension sector?\n A: The actual achievements for the year 2017-18 for the Agricultural Extension sector is 29.43 lakh rupees.\n\n Q: What is the revenue generation target for the Head Quarter sector in 2018-19?\n A: The revenue generation target for the Head Quarter sector in 2018-19 is 840.28 lakh rupees.\n\n Q: What are the actual receipts for the year 2014-15 for Non-Plan?\n A: The actual receipts for the year 2014-15 for Non-Plan are not provided in the given text.\n\n Q: What is the total revenue generation for all sectors combined in 2017-18?\n A: The total revenue generation for all sectors combined in 2017-18 is 7498.04 lakh rupees.\n\n Q: Which institute under Agricultural Extension has the highest revenue generation in 2017-18?\n A: D-KMA, New Delhi has the highest revenue generation of 29.14 lakh rupees in 2017-18 under Agricultural Extension.\n\n Q: What are the actual receipts for the year 2015-16 for Non-Plan?\n A: The actual receipts for the year 2015-16 for Non-Plan are not provided in the given text.\n}",
    "{\n  Q: \"What was the income from sales of farm produce and livestock in 2016-17?\"\n  A: \"The income from sales of farm produce and livestock in 2016-17 was 3884.11.\"\n},\n{\n  Q: \"How much was the income from services in 2017-18?\"\n  A: \"The income from services in 2017-18 was 1738.81.\"\n},\n{\n  Q: \"What was the interest earned on short-term deposits in 2016-17?\"\n  A: \"The interest earned on short-term deposits in 2016-17 was 5565.01.\"\n},\n{\n  Q: \"What were the total revenue receipts realized in 2017-18?\"\n  A: \"The total revenue receipts realized in 2017-18 were 25182.28.\"\n},\n{\n  Q: \"What was the recovery of loans and advances in 2016-17?\"\n  A: \"The recovery of loans and advances in 2016-17 was 2108.38.\"\n},\n{\n  Q: \"What was the capital expenditure in the Crop Sciences division in 2016-17?\"\n  A: \"The capital expenditure in the Crop Sciences division in 2016-17 was 38799.24.\"\n},\n{\n  Q: \"What was the total expenditure in the Animal Sciences division in 2016-17?\"\n  A: \"The total expenditure in the Animal Sciences division in 2016-17 was 84303.79.\"\n},\n{\n  Q: \"What was the revenue expenditure in the Agricultural Education division in 2016-17?\"\n  A: \"The revenue expenditure in the Agricultural Education division in 2016-17 was 57784.64.\"\n},\n{\n  Q: \"What was the allocation budget for the Horticultural Sciences division under NEH in 2017-18?\"\n  A: \"The allocation budget for the Horticultural Sciences division under NEH in 2017-18 was 34862.00.\"\n},\n{\n  Q: \"What was the grand total allocation for the ICAR Headquarters in 2017-18?\"\n  A: \"The grand total allocation for the ICAR Headquarters in 2017-18 was 22210.38.\"\n}",
    "{  Q: What is the total allocation for Crop Sciences in the revised estimates of 2017-18?\n A: The total allocation for Crop Sciences in the revised estimates of 2017-18 is 155,290 lakhs.\n\n Q: What is the capital expenditure for Horticultural Sciences in the NEH region in 2017-18?\n A: The capital expenditure for Horticultural Sciences in the NEH region in 2017-18 is 14,441 lakhs.\n\n Q: What is the total allocation for Animal Sciences in the TSP region in 2017-18?\n A: The total allocation for Animal Sciences in the TSP region in 2017-18 is 9,948.5 lakhs.\n\n Q: What is the salary expenditure for NICRA in the revised estimates of 2017-18?\n A: The salary expenditure for NICRA in the revised estimates of 2017-18 is 500 lakhs.\n\n Q: What is the general expenditure for Fisheries in the NEH region in 2017-18?\n A: The general expenditure for Fisheries in the NEH region in 2017-18 is 100 lakhs.\n\n Q: What is the total allocation for Agricultural Extension in 2017-18?\n A: The total allocation for Agricultural Extension in 2017-18 is 78,795 lakhs.\n\n Q: What is the capital expenditure for ICAR Hqrs. in the budget estimates of 2018-19?\n A: The capital expenditure for ICAR Hqrs. in the budget estimates of 2018-19 is 17,250 lakhs.\n\n Q: What is the salary expenditure for NASF in the revised estimates of 2017-18?\n A: The salary expenditure for NASF in the revised estimates of 2017-18 is 0 lakhs.\n\n Q: What is the total allocation for NAHEP in the budget estimates of 2018-19?\n A: The total allocation for NAHEP in the budget estimates of 2018-19 is 500 lakhs.\n\n Q: What is the grand total of all allocations in the revised estimates of 2017-18?\n A: The grand total of all allocations in the revised estimates of 2017-18 is 654,902.15 lakhs.\n}",
    "{ Q: What is the total amount spent on Crop Sciences in the given year?\n                            A: 98907.00\n                            Q: Which institute has the highest actual expenditure for 2016-17 in Crop Sciences?\n                            A: IARI, NEW DELHI with 46166.55\n                            Q: What is the budget estimate for CICR, NAGPUR for 2018-19?\n                            A: 6553.91\n                            Q: Which institute has the lowest budget estimate for 2018-19 in Animal Sciences?\n                            A: NBAIR (PDBC), BANGALORE with 3030.74\n                            Q: What are the actuals for 2016-17 for Fisheries?\n                            A: 54602.00\n                            Q: What is the revised estimate for IIPR, KANPUR for 2017-18?\n                            A: 8517.64\n                            Q: Which institute has the highest actual expenditure for 2016-17 in Agricultural Education?\n                            A: AGRICULTURAL EDUCATION with 69947.00\n                            Q: What is the budget estimate for IIOR (DOR), HYDERABAD for 2018-19?\n                            A: 5525.62\n                            Q: What are the actuals for 2016-17 for Agricultural Extension?\n                            A: 82046.00\n                            Q: Which institute has the lowest actual expenditure for 2016-17 in Agricultural Engineering?\n                            A: NASF with 5215.00\n                            }",
    "{  Q: What is the total budget allocated for Crop Sciences in the ICAR Budget Book 2018-19?\n          A: The total budget allocated for Crop Sciences is 148658.00 lakhs.\n\n  Q: What were the actuals for the Institute IIWBR (DWR), KARNAL in 2016-17?\n          A: The actuals for the Institute IIWBR (DWR), KARNAL in 2016-17 were 4911.00 lakhs.\n\n  Q: What is the BE (Budget Estimate) for Horticultural Sciences in 2018-19?\n          A: The BE for Horticultural Sciences in 2018-19 is 2528.02 lakhs.\n\n  Q: What are the RE (Revised Estimate) figures for CPCRI, KASARAGOD in 2017-18?\n          A: The RE figures for CPCRI, KASARAGOD in 2017-18 are 7889.5 lakhs.\n\n  Q: What is the total budget allocated for Animal Sciences in the ICAR Budget Book 2018-19?\n          A: The total budget allocated for Animal Sciences is 62732.49 lakhs.\n\n  Q: What were the actuals for the Institute NISHAD(HSADL), BHOPAL in 2016-17?\n          A: The actuals for the Institute NISHAD(HSADL), BHOPAL in 2016-17 were 1662.20 lakhs.\n\n  Q: What is the BE for NRC MITHUN, JHARNAPANI in 2018-19?\n          A: The BE for NRC MITHUN, JHARNAPANI in 2018-19 is 2136.71 lakhs.\n\n  Q: What are the RE figures for DTE. OF POULTRY RES., HYDERABAD in 2017-18?\n          A: The RE figures for DTE. OF POULTRY RES., HYDERABAD in 2017-18 are 2625.50 lakhs.\n\n  Q: What were the actuals for the Institute CARI, IZATNAGAR in 2016-17 under Animal Sciences?\n          A: The actuals for the Institute CARI, IZATNAGAR in 2016-17 under Animal Sciences were 3285.05 lakhs.\n\n  Q: What is the total budget allocated for Horticultural Sciences in the ICAR Budget Book 2018-19 (BE)?\n          A: The total budget allocated for Horticultural Sciences in the ICAR Budget Book 2018-19 (BE) is 64338.00 lakhs.\n}",
    "{\n  Q: \"What is the total budget for Animal Sciences in the given year?\"\n  A: \"The total budget for Animal Sciences is 104949.00 lakhs.\",\n\n  Q: \"What are the actuals for the year 2016-17 for NRC on Integrated Farming, Motihari?\"\n  A: \"The actuals for the year 2016-17 for NRC on Integrated Farming, Motihari are 1307.00 lakhs.\",\n\n  Q: \"What is the budget estimate for 2018-19 for CIBA, Chennai under Fisheries?\"\n  A: \"The budget estimate for 2018-19 for CIBA, Chennai under Fisheries is 6950.40 lakhs.\",\n\n  Q: \"What are the revised estimates for 2017-18 for Agricultural Engineering?\"\n  A: \"The revised estimates for 2017-18 for Agricultural Engineering are 26099.00 lakhs.\",\n\n  Q: \"What are the actuals for 2016-17 for NBFGR, Lucknow under Fisheries?\"\n  A: \"The actuals for 2016-17 for NBFGR, Lucknow under Fisheries are 2742.00 lakhs.\",\n\n  Q: \"What is the budget estimate for 2018-19 for ICAR Headquarters, New Delhi?\"\n  A: \"The budget estimate for 2018-19 for ICAR Headquarters, New Delhi is 26.82 lakhs.\",\n\n  Q: \"What are the actuals for 2016-17 for Non-Plan Institutes under Agricultural Education?\"\n  A: \"The actuals for 2016-17 for Non-Plan Institutes under Agricultural Education are 73671.00 lakhs.\",\n\n  Q: \"What are the budget estimates for 2017-18 for ATARI Zone-II, Jodhpur under Agricultural Extension?\"\n  A: \"The budget estimates for 2017-18 for ATARI Zone-II, Jodhpur under Agricultural Extension are 7896.00 lakhs.\",\n\n  Q: \"What are the revised estimates for 2017-18 for CIAE, Bhopal under Agricultural Engineering?\"\n  A: \"The revised estimates for 2017-18 for CIAE, Bhopal under Agricultural Engineering are 12152.12 lakhs.\",\n\n  Q: \"What are the actuals for 2016-17 for IASRI, New Delhi under Agricultural Economics and Statistics?\"\n  A: \"The actuals for 2016-17 for IASRI, New Delhi under Agricultural Economics and Statistics are 5947.00 lakhs.\"\n}",
    "{\n  Q: \"What are the names of the ATARI zones mentioned in the text?\"\n  A: \"The names of the ATARI zones mentioned in the text are: ATARI ZONE-III (Kanpur), ATARI ZONE-IV (Patna), ATARI ZONE-V (Kolkata), ATARI ZONE-VI (Guwahati), ATARI ZONE-VII (Barapani), ATARI ZONE-VIII (Pune), ATARI ZONE-IX (Jabalpur), ATARI ZONE-X (Hyderabad), and ATARI ZONE-XI (Bengalore).\"\n\n  Q: \"What are the actual expenditures for the year 2016-17 for the Crop Sciences Institute in CICR, Nagpur?\"\n  A: \"The actual expenditures for the year 2016-17 for the Crop Sciences Institute in CICR, Nagpur are 278.86 lakhs for capital, 5161.19 lakhs for revenue, 6.89 lakhs for loan & advance, and a grand total of 5446.94 lakhs.\"\n\n  Q: \"What is the BE (Budget Estimate) for the year 2018-19 for the Network Project in ATARI?\"\n  A: \"The BE for the year 2018-19 for the Network Project in ATARI is 573519.95 lakhs.\"\n\n  Q: \"What is the total agricultural extension expenditure for the year 2017-18?\"\n  A: \"The total agricultural extension expenditure for the year 2017-18 is 91100.00 lakhs.\"\n\n  Q: \"What is the actual expenditure for the year 2016-17 for the Indian Institute of Wheat & Barley Research, Karnal?\"\n  A: \"The actual expenditure for the year 2016-17 for the Indian Institute of Wheat & Barley Research, Karnal is 4898.08 lakhs.\"\n\n  Q: \"What is the BE for the year 2018-19 for the Disaster Management in ATARI?\"\n  A: \"The BE for the year 2018-19 for the Disaster Management in ATARI is 113.00 lakhs.\"\n\n  Q: \"What is the grand total non-plan expenditure for the year 2016-17 for the Indian Institute of Oilseed Research, Hyderabad?\"\n  A: \"The grand total non-plan expenditure for the year 2016-17 for the Indian Institute of Oilseed Research, Hyderabad is 4949.84 lakhs.\"\n\n  Q: \"What is the capital expenditure for the year 2016-17 for the NBAIM, Mau?\"\n  A: \"The capital expenditure for the year 2016-17 for the NBAIM, Mau is 40.68 lakhs.\"\n\n  Q: \"What is the revenue expenditure for the year 2016-17 for the Dte. of Groundnut Research, Junagadh?\"\n  A: \"The revenue expenditure for the year 2016-17 for the Dte. of Groundnut Research, Junagadh is 2144.92 lakhs.\"\n\n  Q: \"What is the loan & advance expenditure for the year 2016-17 for the NRC on Plant Biotechnology, New Delhi?\"\n  A: \"The loan & advance expenditure for the year 2016-17 for the NRC on Plant Biotechnology, New Delhi is 0.23 lakhs.\"\n}",
    "{\n    Q: \"What is the total grand amount for the Horticultural Sciences Institute for the year 2016-17?\"\n    A: \"The total grand amount for the Horticultural Sciences Institute for the year 2016-17 is 57,064.70 lakhs.\",\n\n    Q: \"What is the revenue for the Indian Institute of Oil Palm Research, Pedavegi in the year 2016-17?\"\n    A: \"The revenue for the Indian Institute of Oil Palm Research, Pedavegi in the year 2016-17 is 933.67 lakhs.\",\n\n    Q: \"What is the loan and advance amount for the Central Citrus Research Institute, Nagpur in the year 2016-17?\"\n    A: \"The loan and advance amount for the Central Citrus Research Institute, Nagpur in the year 2016-17 is 2.19 lakhs.\",\n\n    Q: \"What is the total grand amount for the Natural Resource Management Institute for the year 2016-17?\"\n    A: \"The total grand amount for the Natural Resource Management Institute for the year 2016-17 is 67,527.55 lakhs.\",\n\n    Q: \"What is the capital amount for the Indian Institute of Water Management, Bhubaneswar in the year 2016-17?\"\n    A: \"The capital amount for the Indian Institute of Water Management, Bhubaneswar in the year 2016-17 is 107.33 lakhs.\",\n\n    Q: \"What is the revenue for the ICAR Research Complex for Eastern Region, Patna in the year 2016-17?\"\n    A: \"The revenue for the ICAR Research Complex for Eastern Region, Patna in the year 2016-17 is 3,211.82 lakhs.\",\n\n    Q: \"What is the total grand amount for the Agricultural Engineering Institute for the year 2016-17?\"\n    A: \"The total grand amount for the Agricultural Engineering Institute for the year 2016-17 is 19,250.55 lakhs.\",\n\n    Q: \"What is the loan and advance amount for the Central Institute of Post-Harvest Engineering and Technology, Ludhiana in the year 2016-17?\"\n    A: \"The loan and advance amount for the Central Institute of Post-Harvest Engineering and Technology, Ludhiana in the year 2016-17 is 4.81 lakhs.\",\n\n    Q: \"What is the capital amount for the National Bureau of Soil Survey and Land Use Planning, Nagpur in the year 2016-17?\"\n    A: \"The capital amount for the National Bureau of Soil Survey and Land Use Planning, Nagpur in the year 2016-17 is 215.83 lakhs.\",\n\n    Q: \"What is the revenue for the Directorate of Onion and Garlic Research, Pune in the year 2016-17?\"\n    A: \"The revenue for the Directorate of Onion and Garlic Research, Pune in the year 2016-17 is 916.71 lakhs.\"\n}",
    "{\n  Q: \"What is the total revenue for the Animal Sciences institutes in 2016-17?\"\n  A: \"The total revenue for the Animal Sciences institutes in 2016-17 is 75,888.76 lakhs.\",\n\n  Q: \"What is the grand total for the Fisheries institute with the S.No. 96?\"\n  A: \"The grand total for the CMFRI, Cochin (S.No. 96) is 12,888.75 lakhs.\",\n\n  Q: \"What is the capital expenditure for the Agricultural Economics & Statistics institute with the highest amount?\"\n  A: \"The capital expenditure for IASRI, New Delhi (S.No. 99) is 162.00 lakhs.\",\n\n  Q: \"What is the loan and advance amount for the Agricultural Extension institute with the S.No. 103?\"\n  A: \"The loan and advance amount for ATARI(ZPD - I), Ludhiana (S.No. 103) is 1.02 lakhs.\",\n\n  Q: \"What is the total amount for the Agricultural Education institute with the S.No. 102?\"\n  A: \"The total amount for the Central Institute for Women in Agriculture, Bhubaneswar (S.No. 102) is 3,280.35 lakhs.\",\n\n  Q: \"What is the revenue for the institute with the name NDRI, Bangalore?\"\n  A: \"The revenue for NDRI, Bangalore (S.No. 78) is 1,637.44 lakhs.\",\n\n  Q: \"What is the grand total for the institute with the highest amount in the Fisheries section?\"\n  A: \"The grand total for CMFRI, Cochin (S.No. 96) is 12,888.75 lakhs.\",\n\n  Q: \"What is the capital expenditure for the institute with the S.No. 93 in the Fisheries section?\"\n  A: \"The capital expenditure for CIFA, Bhubaneswar (S.No. 93) is 299.65 lakhs.\",\n\n  Q: \"What is the loan and advance amount for the institute with the S.No. 89 in the Animal Sciences section?\"\n  A: \"The loan and advance amount for Central Institute of Research on Cattle, Meerut (S.No. 89) is 2.00 lakhs.\",\n\n  Q: \"What is the total amount for the Agricultural Extension section?\"\n  A: \"The total amount for the Agricultural Extension section is 75,519.91 lakhs.\"\n}",
    "{\n  Q: \"What is the total revenue for the Head Quarter in 2016-17?\"\n  A: \"The total revenue for the Head Quarter in 2016-17 is 21,813.86 lakhs.\",\n\n  Q: \"What is the grand total for the year 2016-17?\"\n  A: \"The grand total for the year 2016-17 is 574,067.96 lakhs.\",\n\n  Q: \"What is the total capital budget for CICR, Nagpur in 2017-18?\"\n  A: \"The total capital budget for CICR, Nagpur in 2017-18 is 213.00 lakhs.\",\n\n  Q: \"What are the administrative expenses for NRRI, Cuttack in 2017-18?\"\n  A: \"The administrative expenses for NRRI, Cuttack in 2017-18 are 4,971.50 lakhs.\",\n\n  Q: \"What is the total revenue for IARI, New Delhi in 2017-18?\"\n  A: \"The total revenue for IARI, New Delhi in 2017-18 is 42,107.00 lakhs.\",\n\n  Q: \"What is the total miscellaneous expense for CRIJAF, Barrackpore in 2017-18?\"\n  A: \"The total miscellaneous expense for CRIJAF, Barrackpore in 2017-18 is 120.00 lakhs.\",\n\n  Q: \"What is the total grant in aid for research and operational expenses for AICRP on Cotton, CICR, Nagpur in 2017-18?\"\n  A: \"The total grant in aid for research and operational expenses for AICRP on Cotton, CICR, Nagpur in 2017-18 is 1,477.00 lakhs.\",\n\n  Q: \"What is the grand total for the AINPJAF, CRIJAF, Barrackpore in 2017-18?\"\n  A: \"The grand total for the AINPJAF, CRIJAF, Barrackpore in 2017-18 is 303.00 lakhs.\",\n\n  Q: \"What is the total establishment expense for the NETWORK on Tobacco, CTRI, Rajamundry in 2017-18?\"\n  A: \"There are no establishment expenses for the NETWORK on Tobacco, CTRI, Rajamundry in 2017-18.\",\n\n  Q: \"What is the total capital budget for the Incentivizing Research in Agriculture, NRRI, Cuttack in 2017-18?\"\n  A: \"The total capital budget for the Incentivizing Research in Agriculture, NRRI, Cuttack in 2017-18 is 300.00 lakhs.\"\n}",
    "{ Q: What is the name of the organization that conducts research on Molecular Breeding?\n                            A: IARI, New Delhi\n                            Q: What is the total grant in aid for research and operational expenses for AICRP on Forage Crops and Utilization, IGFRI, Jhansi?\n                            A: 1157.70 lakhs\n                            Q: What is the grand total (capital + revenue) for IIPR, Kanpur?\n                            A: 2903.00 lakhs\n                            Q: What is the establishment expense grant for AICRP on Pigeonpea, IIPR, Kanpur?\n                            A: 0.00 lakhs\n                            Q: What is the total revenue for NBAIM, Maunath Bhanjan?\n                            A: 831.00 lakhs\n                            Q: What is the capital grant for NBPGR, New Delhi?\n                            A: 1507.00 lakhs\n                            Q: What is the total miscellaneous expense for AMAAS, NBAIM, Mau?\n                            A: 0.00 lakhs\n                            Q: What is the total administrative expense for CRP-AGRO BIODIVERSITY, NBPGR, New Delhi?\n                            A: 5.00 lakhs\n                            Q: What is the total traveling allowance for SBI, Coimbatore?\n                            A: 2.50 lakhs\n                            Q: What is the pension and other retirement benefits for VPKAS, Almora?\n                            A: 21.75 lakhs }",
    "{\n  Q: What is the total budget for DR & MR, Bharatpur in 2018-19?\n  A: The total budget for DR & MR, Bharatpur in 2018-19 is 1022.00 lakhs.\n\n  Q: What is the grant for establishment expenses for AICRP on Soyabean, Indore in 2017-18?\n  A: The grant for establishment expenses for AICRP on Soyabean, Indore in 2017-18 is 0.00 lakhs.\n\n  Q: What is the total revenue for NBAIR, Bengaluru in 2017-18?\n  A: The total revenue for NBAIR, Bengaluru in 2017-18 is 1385.00 lakhs.\n\n  Q: What is the total capital grant for IIMR, Hyderabad in 2018-19?\n  A: The total capital grant for IIMR, Hyderabad in 2018-19 is 207.00 lakhs.\n\n  Q: What is the total administrative expense for AICRP on Pearl Millets, IIMR, Hyderabad in 2017-18?\n  A: The total administrative expense for AICRP on Pearl Millets, IIMR, Hyderabad in 2017-18 is 0.00 lakhs.\n\n  Q: What is the grand total budget for IIOR, Hyderabad in 2017-18?\n  A: The grand total budget for IIOR, Hyderabad in 2017-18 is 3146.00 lakhs.\n\n  Q: What is the total grant for research and operational expenses for AICRP on Small Millets, IIMR, Hyderabad in 2017-18?\n  A: The total grant for research and operational expenses for AICRP on Small Millets, IIMR, Hyderabad in 2017-18 is 0.00 lakhs.\n\n  Q: What is the pension and other retirement benefits for DSR, Indore in 2018-19?\n  A: The pension and other retirement benefits for DSR, Indore in 2018-19 is 12.00 lakhs.\n\n  Q: What is the total miscellaneous expense for AICRP on Biological Control, NBAIR, Bengaluru in 2017-18?\n  A: The total miscellaneous expense for AICRP on Biological Control, NBAIR, Bengaluru in 2017-18 is 48.50 lakhs.\n\n  Q: What is the total revenue for AICRP on Maize, IIMR, New Delhi in 2017-18?\n  A: The total revenue for AICRP on Maize, IIMR, New Delhi in 2017-18 is 1562.00 lakhs.\n}",
    "{\n  Q: What is the total budget for Seed Production in Agricultural Corps and Fisheries, DSR, Mau?\n  A: The total budget for Seed Production in Agricultural Corps and Fisheries, DSR, Mau is 730.00 lakhs.\n\n  Q: What are the establishment expenses for NIBSM, Raipur?\n  A: The establishment expenses for NIBSM, Raipur are 302.70 lakhs.\n\n  Q: What is the total revenue for IIAB, Ranchi?\n  A: The total revenue for IIAB, Ranchi is 955.00 lakhs.\n\n  Q: What are the administrative expenses for CIARI, Port Blair?\n  A: The administrative expenses for CIARI, Port Blair are 27.55 lakhs.\n\n  Q: What is the total capital for AICRP on AZF, CIAH, Bikaner?\n  A: The total capital for AICRP on AZF, CIAH, Bikaner is 0.00 lakhs.\n\n  Q: What are the research and operational expenses for CISH, Lucknow?\n  A: The research and operational expenses for CISH, Lucknow are 756.00 lakhs.\n\n  Q: What is the grand total for CPCRI, Kasaragod?\n  A: The grand total for CPCRI, Kasaragod is 6853.00 lakhs.\n\n  Q: What are the miscellaneous expenses for AICRP on Potato, CPRI, Shimla?\n  A: The miscellaneous expenses for AICRP on Potato, CPRI, Shimla are 0.00 lakhs.\n\n  Q: What is the total grants in aid - general for CTCRI, Thiruvanthapuram?\n  A: The total grants in aid - general for CTCRI, Thiruvanthapuram is 509.00 lakhs.\n\n  Q: What are the pension and other retirement benefits for IIHR, Bangalore?\n  A: The pension and other retirement benefits for IIHR, Bangalore are not provided in the given text.\n}",
    "{\n  Q: \"What is the name of the AICRP (All India Coordinated Research Project) focused on Fruit?\"\n  A: \"AICRP on Fruit, IIHR, Bangalore\",\n\n  Q: \"Which institute has the highest budget allocation for Research & Operational Expenses in the given data?\"\n  A: \"IIVR, Varanasi\",\n\n  Q: \"What is the total budget (Capital + Revenue) for the Department of Mushroom Research, Solan?\"\n  A: \"929.20 lakhs\",\n\n  Q: \"Which institute has the highest total budget allocation in the Horticultural Sciences category?\"\n  A: \"AICRP on Floriculture, Department of Floriculture, Pune\",\n\n  Q: \"What is the total establishment expenses (Grants in Aid- Salaries) for CCRI, Nagpur?\"\n  A: \"290.00 lakhs\",\n\n  Q: \"What is the total budget (Capital + Revenue) for the Network Project on Buffalo?\"\n  A: This information is not provided in the given data,\n\n  Q: \"Which institute has the lowest pension and other retirement benefits?\"\n  A: \"NRC for Orchids, Sikkim\",\n\n  Q: \"What is the total administrative expenses for AICRP on Spices, IISR, Calicut?\"\n  A: \"0.00 lakhs\",\n\n  Q: \"What is the total capital grant for the Department of Cashew Research, Puttur?\"\n  A: \"1.00 lakhs\",\n\n  Q: \"What is the total revenue for NRC for Banana, Tiruchirapalli?\"\n  A: \"1016.15 lakhs\"\n}",
    "{\n    Q: What is the total capital grant for the AICRP on Goats, CIRG, Makhdoom?\n    A: The total capital grant for the AICRP on Goats, CIRG, Makhdoom is 130 lakhs.\n\n    Q: What are the establishment expenses for CSWRI, Avikanagar?\n    A: The establishment expenses for CSWRI, Avikanagar are 319 lakhs.\n\n    Q: What is the total revenue for the Outreach Program on Environmental Pollutants, IVRI, Izatnagar?\n    A: The total revenue for the Outreach Program on Environmental Pollutants, IVRI, Izatnagar is 90 lakhs.\n\n    Q: What are the administrative expenses for the Network Project on Animal Genetic Resources, NBAGR, Karnal?\n    A: The administrative expenses for the Network Project on Animal Genetic Resources, NBAGR, Karnal are 0.5 lakhs.\n\n    Q: What is the grand total for NIHSAD, Bhopal?\n    A: The grand total for NIHSAD, Bhopal is 1642.2 lakhs.\n\n    Q: What are the miscellaneous expenses for the AICRP on Mega Sheep Seed Project, CSWRI, Avikanagar?\n    A: The miscellaneous expenses for the AICRP on Mega Sheep Seed Project, CSWRI, Avikanagar are 0 lakhs.\n\n    Q: What is the total grant in aid for research and operational expenses for NDRI, Karnal?\n    A: The total grant in aid for research and operational expenses for NDRI, Karnal is 10930 lakhs.\n\n    Q: What are the pension and other retirement benefits for IVRI, Izatnagar?\n    A: The pension and other retirement benefits for IVRI, Izatnagar are 70 lakhs.\n\n    Q: What are the traveling allowance expenses for the Network on Sheep Improvement, CSWRI, Avikanagar?\n    A: The traveling allowance expenses for the Network on Sheep Improvement, CSWRI, Avikanagar are 0 lakhs.\n\n    Q: What is the total capital grant for NIANP, Bangalore?\n    A: The total capital grant for NIANP, Bangalore is 222 lakhs.\n}",
    "{\n  Q: What is the total capital grant for the NRC on Camel, Bikaner?\n  A: The total capital grant for the NRC on Camel, Bikaner is 148.00 lakhs.\n\n  Q: What are the establishment expenses for the National Centre for Veterinary Type Culture Collection?\n  A: The establishment expenses for the National Centre for Veterinary Type Culture Collection are 116.00 lakhs.\n\n  Q: What is the total revenue for the NRC on Pig, Guwahati?\n  A: The total revenue for the NRC on Pig, Guwahati is 1055.00 lakhs.\n\n  Q: What are the administrative expenses for the AICRP on Poultry, Dte. Of Poultry Research, Hyderabad?\n  A: The administrative expenses for the AICRP on Poultry, Dte. Of Poultry Research, Hyderabad are 0.00 lakhs.\n\n  Q: What is the total miscellaneous expense for the NRC on Yak, Dirang?\n  A: The total miscellaneous expense for the NRC on Yak, Dirang is 105.00 lakhs.\n\n  Q: What are the research and operational expenses for the CIRC, Meerut?\n  A: The research and operational expenses for the CIRC, Meerut are 977.00 lakhs.\n\n  Q: What is the total establishment expense (including salaries) for CAZRI, Jodhpur?\n  A: The total establishment expense (including salaries) for CAZRI, Jodhpur is 4386.00 lakhs.\n\n  Q: What is the total capital grant for the Poultry Seed Project, Dte. Of Poultry Research, Hyderabad?\n  A: The total capital grant for the Poultry Seed Project, Dte. Of Poultry Research, Hyderabad is 182.00 lakhs.\n\n  Q: What are the pension and other retirement benefits for the Dte. Of Foot & Mouth Disease, Mukteswar?\n  A: The pension and other retirement benefits for the Dte. Of Foot & Mouth Disease, Mukteswar are 100.00 lakhs.\n\n  Q: What is the grand total (capital + revenue) for TOTAL ANIMAL SCIENCES?\n  A: The grand total (capital + revenue) for TOTAL ANIMAL SCIENCES is 86977.00 lakhs.\n}",
    "{ Q: What is the total revenue for AICRP on Dryland Agriculture, CRIDA, Hyderabad?\n                            A: The total revenue for AICRP on Dryland Agriculture, CRIDA, Hyderabad is 85.50 lakhs.\n                            Q: What is the grand total budget for AICRP on Agrometeorology, CRIDA, Hyderabad?\n                            A: The grand total budget for AICRP on Agrometeorology, CRIDA, Hyderabad is 685.00 lakhs.\n                            Q: What is the capital expenditure for IIS & WC (CS & WCR & TI), Dehradun?\n                            A: The capital expenditure for IIS & WC (CS & WCR & TI), Dehradun is 938.00 lakhs.\n                            Q: What are the establishment expenses for CSSRI, Karnal?\n                            A: The establishment expenses for CSSRI, Karnal are 225.00 lakhs.\n                            Q: What is the total administrative expense for ICAR RC For NEH Region.,Barapani?\n                            A: The total administrative expense for ICAR RC For NEH Region.,Barapani is 590.00 lakhs.\n                            Q: What is the total miscellaneous expense for CCARI (ICAR Res. Complex), Goa?\n                            A: The total miscellaneous expense for CCARI (ICAR Res. Complex), Goa is 250.00 lakhs.\n                            Q: What is the total grants in aid - general for IISS, Bhopal?\n                            A: The total grants in aid - general for IISS, Bhopal is 1620.00 lakhs.\n                            Q: What is the research and operational expense for AICRP on Micronutrients, IISS, Bhopal?\n                            A: The research and operational expense for AICRP on Micronutrients, IISS, Bhopal is 61.00 lakhs.\n                            Q: What is the grand total budget for NBSS & LUP, Nagpur?\n                            A: The grand total budget for NBSS & LUP, Nagpur is 7291.00 lakhs.\n                            Q: What is the total pension and other retirement benefits for CARI, Jhansi?\n                            A: The total pension and other retirement benefits for CARI, Jhansi is 105.00 lakhs.\n                            }",
    "{\n  Q: What is the total budget estimate for AICRP on Integrated Farming System, IIFSR, for the year 2018-19?\n  A: The total budget estimate for AICRP on Integrated Farming System, IIFSR, for the year 2018-19 is 2,468,000 lakhs.\n\n  Q: What is the establishment expenses grant-in-aid for NIASM, Baramati in 2018-19?\n  A: The establishment expenses grant-in-aid for NIASM, Baramati in 2018-19 is 585,000 lakhs.\n\n  Q: What is the total revenue for the NRM Division in 2018-19?\n  A: The total revenue for the NRM Division in 2018-19 is 61,468,000 lakhs.\n\n  Q: What are the total administrative expenses for CIFE, Mumbai in 2018-19?\n  A: The total administrative expenses for CIFE, Mumbai in 2018-19 are 677,000 lakhs.\n\n  Q: What is the total capital grant for ANIP Mericulture, CMFRI, Kochi in 2018-19?\n  A: The total capital grant for ANIP Mericulture, CMFRI, Kochi in 2018-19 is 115,000 lakhs.\n\n  Q: What is the grand total budget for the Dte. Of Coldwater Fisheries Research, Bhimtal in 2017-18?\n  A: The grand total budget for the Dte. Of Coldwater Fisheries Research, Bhimtal in 2017-18 is 1,310,000 lakhs.\n\n  Q: What are the total miscellaneous expenses for the fisheries division in 2017-18?\n  A: The total miscellaneous expenses for the fisheries division in 2017-18 are 703,000 lakhs.\n\n  Q: What is the research and operational expenses grant-in-aid for CIAE, Bhopal in 2017-18?\n  A: The research and operational expenses grant-in-aid for CIAE, Bhopal in 2017-18 is 2,185,000 lakhs.\n\n  Q: What is the total budget (capital + revenue) for AICRP on FIM, CIAE, Bhopal in 2017-18?\n  A: The total budget (capital + revenue) for AICRP on FIM, CIAE, Bhopal in 2017-18 is 1,787,700 lakhs.\n\n  Q: What is the pension and other retirement benefits for CIFA, Bhubaneshwar in 2018-19?\n  A: The pension and other retirement benefits for CIFA, Bhubaneshwar in 2018-19 are 50,000 lakhs.\n}",
    "{\n  Q: \"What is the total budget for the AICRP on UAE at CIAE, Bhopal?\"\n  A: \"The total budget for the AICRP on UAE at CIAE, Bhopal is 499.70 lakhs.\",\n\n  Q: \"What are the establishment expenses for the CRP On FMPF at CIAE, Bhopal?\"\n  A: \"The establishment expenses for the CRP On FMPF at CIAE, Bhopal are 90.00 lakhs.\",\n\n  Q: \"What is the total revenue for CIPHET, Ludhiana?\"\n  A: \"The total revenue for CIPHET, Ludhiana is 1472.00 lakhs.\",\n\n  Q: \"What are the administrative expenses for the CRP On SA at CIPHET, Ludhiana?\"\n  A: \"The administrative expenses for the CRP On SA at CIPHET, Ludhiana are 100.00 lakhs.\",\n\n  Q: \"What is the total budget for the IINRG, Ranchi?\"\n  A: \"The total budget for the IINRG, Ranchi is 2154.60 lakhs.\",\n\n  Q: \"What are the capital expenses for the NWP on CLIGR at IINRG, Ranchi?\"\n  A: \"The capital expenses for the NWP on CLIGR at IINRG, Ranchi are 0.00 lakhs.\",\n\n  Q: \"What is the total revenue for NIRJAFT, Kolkata?\"\n  A: \"The total revenue for NIRJAFT, Kolkata is 1987.00 lakhs.\",\n\n  Q: \"What are the miscellaneous expenses for the IASRI including CABin, New Delhi?\"\n  A: \"The miscellaneous expenses for the IASRI including CABin, New Delhi are 674.20 lakhs.\",\n\n  Q: \"What is the total budget for the NAARM, Hyderabad?\"\n  A: \"The total budget for the NAARM, Hyderabad is 7838.00 lakhs.\",\n\n  Q: \"What are the research and operational expenses for the CIWA, Bhubaneshwar?\"\n  A: \"The research and operational expenses for the CIWA, Bhubaneshwar are 390.00 lakhs.\"\n}",
    "{ Q: What is the total budget estimate for the Agricultural Education Division in 2017-18?\n                            A: The total budget estimate for the Agricultural Education Division in 2017-18 is 67,971 lakhs.\n                            Q: How much grant was allocated for establishment expenses in the Headquarters Unit?\n                            A: 7,121 lakhs were allocated for establishment expenses in the Headquarters Unit.\n                            Q: What is the total revenue for the ICAR Headquarters in 2017-18?\n                            A: The total revenue for the ICAR Headquarters in 2017-18 is 22,745 lakhs.\n                            Q: How much was spent on the creation of the auditorium?\n                            A: 9,000 lakhs were spent on the creation of the auditorium.\n                            Q: What is the total budget estimate for the ATARI Zone-III, Kanpur?\n                            A: The total budget estimate for the ATARI Zone-III, Kanpur is 8,129.89 lakhs.\n                            Q: How much grant was allocated for research and operational expenses in the NASM division?\n                            A: No grant was allocated for research and operational expenses in the NASM division.\n                            Q: What is the total capital grant for the ICAR Budget Book 2018-19?\n                            A: The total capital grant for the ICAR Budget Book 2018-19 is 31,474 lakhs.\n                            Q: How much was spent on miscellaneous expenses in the CERA division?\n                            A: 2,295 lakhs were spent on miscellaneous expenses in the CERA division.\n                            Q: What is the total budget estimate for the PIU, NASF?\n                            A: The total budget estimate for the PIU, NASF is 260 lakhs.\n                            Q: How much was allocated for pension and other retirement benefits in the DKMA, New Delhi?\n                            A: No amount was allocated for pension and other retirement benefits in the DKMA, New Delhi. }",
    "{\n  Q: What is the total agricultural extension in the given data?\n  A: The total agricultural extension is 77,073.00.\n\n  Q: What is the total revenue for the ICAR Budget Book 2018-19?\n  A: The total revenue is 249,296.85 lakhs.\n\n  Q: What are the establishment expenses for CICR, Nagpur?\n  A: The establishment expenses for CICR, Nagpur are 0.00 lakhs.\n\n  Q: What is the total grant for the administrative expenses of AINPJAF, CRIJAF, Barrackpore?\n  A: The total grant for the administrative expenses of AINPJAF, CRIJAF, Barrackpore is 75.00 lakhs.\n\n  Q: What are the research and operational expenses for the Network Project?\n  A: The research and operational expenses for the Network Project are 63.21 lakhs.\n\n  Q: What is the total capital for the AICRP on Cotton, CICR, Nagpur?\n  A: The total capital for the AICRP on Cotton, CICR, Nagpur is 0.00 lakhs.\n\n  Q: What are the miscellaneous expenses for IARI, New Delhi?\n  A: The miscellaneous expenses for IARI, New Delhi are 0.00 lakhs.\n\n  Q: What is the grand total for ATARI ZONE-IV, Patna?\n  A: The grand total for ATARI ZONE-IV, Patna is 8,702.50 lakhs.\n\n  Q: What are the traveling allowance expenses for the Disaster Management unit?\n  A: The traveling allowance expenses for the Disaster Management unit are 0.00 lakhs.\n\n  Q: What is the total grant in aid for general expenses for FARMER FIRST?\n  A: The total grant in aid for general expenses for FARMER FIRST is 2,016.00 lakhs.\n}",
    "{ Q: What is the total grant for creation of capital assets for AICRP on Forage Crops and Utilization, IGFRI, Jhansi?\n                            A: The total grant for creation of capital assets for AICRP on Forage Crops and Utilization, IGFRI, Jhansi is 0.00 lakhs.\n                            Q: What is the total establishment expense (Grant in Aid - Salaries) for IIPR, Kanpur?\n                            A: The total establishment expense (Grant in Aid - Salaries) for IIPR, Kanpur is 0.00 lakhs.\n                            Q: What is the grand total (Capital + Revenue) for AICRP on Mullarp, IIPR, Kanpur?\n                            A: The grand total (Capital + Revenue) for AICRP on Mullarp, IIPR, Kanpur is 170.00 lakhs.\n                            Q: What is the total research & operational expense for AICRP on Sugarcane, IISR, Lucknow?\n                            A: The total research & operational expense for AICRP on Sugarcane, IISR, Lucknow is 0.00 lakhs.\n                            Q: What is the total administrative expense for NBPGR, New Delhi?\n                            A: The total administrative expense for NBPGR, New Delhi is 30.00 lakhs.\n                            Q: What is the total grant in aid - general for SBI, Coimbatore?\n                            A: The total grant in aid - general for SBI, Coimbatore is 0.00 lakhs.\n                            Q: What is the total revenue (Grants in Aid - Salaries + Grants in Aid - General) for NRCIPM, New Delhi?\n                            A: The total revenue for NRCIPM, New Delhi is 15.00 lakhs.\n                            Q: What is the grand total (Capital + Revenue) for AICRP on Groundnut, DGR, Junagadh?\n                            A: The grand total (Capital + Revenue) for AICRP on Groundnut, DGR, Junagadh is 0.00 lakhs.\n                            Q: What is the total capital grant for AICRP on R&M, DR & MR, Bharatpur?\n                            A: The total capital grant for AICRP on R&M, DR & MR, Bharatpur is 0.00 lakhs.}",
    "{ Q: What is the name of the AICRP on Pearl Millets located in Hyderabad?\n                            A: The All India Coordinated Research Project (AICRP) on Pearl Millets is located at the Indian Institute of Millets Research (IIMR) in Hyderabad.\n                            Q: Which institute is responsible for the AICRP on Soyabean in Indore?\n                            A: The AICRP on Soyabean is conducted by an institute in Indore, but the specific name is not provided in the text.\n                            Q: What is the total grant for establishment expenses (salaries) for the AICRP on Biological Control at NBAIR, Bengaluru?\n                            A: The total grant for establishment expenses (salaries) for the AICRP on Biological Control at NBAIR, Bengaluru is 35 lakhs.\n                            Q: What is the total revenue for the AICRP on Maize at IIMR, New Delhi?\n                            A: The total revenue for the AICRP on Maize at IIMR, New Delhi is 25 lakhs.\n                            Q: Which institute in Hyderabad is associated with the AICRP on Linseed?\n                            A: The Indian Institute of Oilseeds Research (IIOR) in Hyderabad is associated with the AICRP on Linseed.\n                            Q: What is the total grant for research and operational expenses for the CRP on Rice Biofortification at IIRR, Hyderabad?\n                            A: The total grant for research and operational expenses for the CRP on Rice Biofortification at IIRR, Hyderabad is not provided in the text.\n                            Q: What is the total capital grant for Seed Production in Agricultural Corps and Fisheries, DSR, Mau?\n                            A: The total capital grant for Seed Production in Agricultural Corps and Fisheries, DSR, Mau is 0 lakhs.\n                            Q: Which institute in Ranchi is mentioned in the text?\n                            A: The Indian Institute of Agricultural Biotechnology (IIAB) in Ranchi is mentioned in the text.\n                            Q: What is the grand total (capital + revenue) for all Crop Sciences units combined?\n                            A: The grand total (capital + revenue) for all Crop Sciences units combined is 1600 lakhs.}",
    "{ Q: What are the names of the agricultural research units listed in the text?\n                            A: The agricultural research units listed in the text are Blair, CIAH Bikaner, AICRP on AZF, CIAH Bikaner, CISH Lucknow, CITH Srinagar, CPCRI Kasaragod, AICRP on Palms, CPCRI Kasaragod, CPRI Shimla, AICRP on Potato, CPRI Shimla, CTCRI Thiruvanthapuram, AICRP on Tuber Crops, CTCRI Thiruvanthapuram, IIHR Bangalore, AICRP on Fruit, IIHR Bangalore, IISR Calicut, AICRP on Spices, IISR Calicut, IIVR Varanasi, AICRP on Vegetables, IIVR Varanasi, NRC for Banana, Tiruchirapalli, Dte. for Cashew Research, Puttur, AICRP on Cashew, Dte. For Cashew Research, Puttur, CCRI Nagpur, NRC For Grapes, Pune, DMAPR Anand, AICRP on MAP & Betelvine, DMAPR Anand, Dte. on Mushroom, Solan, AICRP on Mushroom, DMR Solan, IIOPR Pedavegi, Dte. on Onion & Garlic, Pune, NRC on Orchids, Sikkim, NRC Seed Spices, Ajmer, NRC For Litchi, Muzaffarpur, and NRC for Pomegranate, Solapur.\n                            Q: What is the total grant in aid (general) for AICRP on Potato, CPRI Shimla?\n                            A: The total grant in aid (general) for AICRP on Potato, CPRI Shimla is 80 lakhs.\n                            Q: What are the establishment expenses for CITH, Srinagar?\n                            A: The establishment expenses for CITH, Srinagar are 20 lakhs.\n                            Q: What is the total capital grant for NRC for Banana, Tiruchirapalli?\n                            A: The total capital grant for NRC for Banana, Tiruchirapalli is 0 lakhs.\n                            Q: What are the miscellaneous expenses for AICRP on Spices, IISR Calicut?\n                            A: The miscellaneous expenses for AICRP on Spices, IISR Calicut are 0 lakhs.\n                            Q: What is the total revenue for IIVR Varanasi?\n                            A: The total revenue for IIVR Varanasi is 50 lakhs.\n                            Q: What are the research and operational expenses for NRC on Orchids, Sikkim?\n                            A: The research and operational expenses for NRC on Orchids, Sikkim are 35 lakhs.\n                            Q: What is the total grant in aid (general) for NRC Seed Spices, Ajmer?\n                            A: The total grant in aid (general) for NRC Seed Spices, Ajmer is 2 lakhs.\n                            Q: What are the administrative expenses for Dte. on Mushroom, Solan?\n                            A: The administrative expenses for Dte. on Mushroom, Solan are 0 lakhs.\n                            Q: What is the grand total for DMAPR Anand?\n                            A: The grand total for DMAPR Anand is 26 lakhs.\n                            }",
    "{ Q: What are the total administrative expenses for the Department of Floriculture, Pune?\n                            A: The total administrative expenses for the Department of Floriculture, Pune are 2.00.\n                            Q: What is the revenue for the HORTICULTURAL SCIENCES department?\n                            A: The revenue for the HORTICULTURAL SCIENCES department is 1098.00.\n                            Q: What are the establishment expenses for the Network Project on Buffalo, CIRB, Hissar?\n                            A: The establishment expenses for the Network Project on Buffalo, CIRB, Hissar are 0.00.\n                            Q: What are the miscellaneous expenses for the CSWRI, Avikanagar?\n                            A: The miscellaneous expenses for the CSWRI, Avikanagar are 0.00.\n                            Q: What is the total capital for the Outreach Program on Zoonotic Diseases, IVRI, Izatnagar?\n                            A: The total capital for the Outreach Program on Zoonotic Diseases, IVRI, Izatnagar is 0.00.\n                            Q: What are the research and operational expenses for the NIHSAD, Bhopal?\n                            A: The research and operational expenses for the NIHSAD, Bhopal are 18.00.\n                            Q: What is the grand total for the Network Project on Animal Genetic Resources, NBAGR, Karnal?\n                            A: The grand total for the Network Project on Animal Genetic Resources, NBAGR, Karnal is 10.00.\n                            Q: What are the establishment expenses for the NDRI, Karnal?\n                            A: The establishment expenses for the NDRI, Karnal are 5.00.\n                            Q: What is the total revenue for the AICRP ON NPAERP + OP on Methan Emission, NIANP, Bangalore?\n                            A: The total revenue for the AICRP ON NPAERP + OP on Methan Emission, NIANP, Bangalore is 20.00.}",
    "{ Q: What is the name of the National Research Centre (NRC) that focuses on equines located in Hissar?\n                            A: NRC on Equines, Hissar\n                            Q: What is the total grant received by the NRC on Meat, Hyderabad in 2018-19?\n                            A: The total grant received was 55 lakhs.\n                            Q: How much was allocated for administrative expenses in the NRC on Mithun in 2018-19?\n                            A: 14 lakhs were allocated for administrative expenses.\n                            Q: What is the total revenue (Grants in Aid - Salaries + Grants in Aid - General) for the NRC on Pig, Guwahati in 2018-19?\n                            A: The total revenue was 170 lakhs.\n                            Q: What is the total grant received by the AICRP on Poultry, Dte. Of Poultry Research, Hyderabad in 2018-19?\n                            A: The total grant received was 33 lakhs.\n                            Q: Which institute received a total grant of 2075 lakhs in 2018-19 (Capital + Revenue)?\n                            A: ICAR RC For NEH Region., Barapani\n                            Q: What is the total establishment expense granted to ICAR Research Complex for Eastern Region, Patna in 2018-19?\n                            A: The total establishment expense granted was 25 lakhs.\n                            Q: Which institute did not receive any grants in the provided data?\n                            A: CIRC, Meerut and Dte. Of Poultry Research, Hyderabad\n                            Q: What is the total capital grant allocated for the AICRP on Dryland Agriculture, CRIDA, Hyderabad in 2018-19?\n                            A: No capital grant was allocated for this institute.}",
    "{ Q: What is the name of the research complex in Goa mentioned in the text?\n                            A: CCARI (ICAR Research Complex), Goa\n                            Q: Which institute in Bhopal has an AICRP on Micronutrients?\n                            A: IISS, Bhopal\n                            Q: What is the total grant in aid for research and operational expenses for the AICRP on Biofertilizer in Bhopal?\n                            A: 25.00 lakhs\n                            Q: What is the total revenue for NBSS & LUP, Nagpur?\n                            A: 300.00 lakhs\n                            Q: Which institute in Jhansi has an AICRP on Agroforestry?\n                            A: CARI, Jhansi\n                            Q: What is the total capital grant for IIWM, Bhubaneshwar?\n                            A: 0.00 lakhs\n                            Q: What is the total administrative expense for the CRP on Water, IIWM, Bhubaneshwar?\n                            A: 0.00 lakhs\n                            Q: What is the total miscellaneous expense for the AICRP on Weed Management, DWR, Jabalpur?\n                            A: 0.00 lakhs\n                            Q: What is the total grant in aid for the Network Project on Organic Farming, IIFSR, Modipuram?\n                            A: 50.00 lakhs\n                            Q: What is the total revenue for NICRA, Hyderabad?\n                            A: 500.00 lakhs}",
    "{ Q: What is the total revenue for the Fisheries department in the given data?\n                            A: The total revenue for the Fisheries department is 80.00 lakhs.\n                            Q: Which institute has the highest capital expenditure in the Agricultural Engineering department?\n                            A: NWP on HP VANR&G, IINRG, Ranchi has the highest capital expenditure of 2.00 lakhs.\n                            Q: What are the miscellaneous expenses for the unit CIRCOT, Mumbai?\n                            A: The miscellaneous expenses for CIRCOT, Mumbai are 0.00 lakhs.\n                            Q: What is the grand total for the Agricultural Engineering department?\n                            A: The grand total for the Agricultural Engineering department is 400.00 lakhs.\n                            Q: Which unit in the Fisheries department has zero grants in aid for general purposes?\n                            A: ANIP Mericulture, CMFRI, Kochi has zero grants in aid for general purposes.\n                            Q: What are the establishment expenses for the unit AICRP on FIM, CIAE, Bhopal?\n                            A: The establishment expenses for AICRP on FIM, CIAE, Bhopal are 96.09 lakhs.\n                            Q: What is the total revenue for the unit NIRJAFT, Kolkata?\n                            A: The total revenue for NIRJAFT, Kolkata is 0.00 lakhs.\n                            Q: What is the total capital expenditure for the Eco. Statistics & Management department?\n                            A: The total capital expenditure for the Eco. Statistics & Management department is 0.00 lakhs.\n                            Q: Which unit in the Agricultural Engineering department has the highest grand total?\n                            A: The unit with the highest grand total in the Agricultural Engineering department is NWP on HP VANR&G, IINRG, Ranchi with 17.00 lakhs.\n                            Q: What are the research and operational expenses for the unit CRP On SA, CIPHET, Ludhiana?\n                            A: The research and operational expenses for CRP On SA, CIPHET, Ludhiana are 0.00 lakhs.}",
    "{ Q: What is the total grant for the creation of capital assets in the Agricultural Education Division?\n                            A: The total grant for the creation of capital assets in the Agricultural Education Division is 2100 lakhs.\n                            Q: What is the total grant for establishment expenses in the ATARI Zone-VI?\n                            A: The total grant for establishment expenses in the ATARI Zone-VI is 4170 lakhs.\n                            Q: What is the total administrative expense in the Headquarters Unit?\n                            A: There are no administrative expenses in the Headquarters Unit.\n                            Q: What is the total revenue for the ICAR HQRS division?\n                            A: There is no revenue for the ICAR HQRS division.\n                            Q: What is the total grant for research and operational expenses in the ATARI Zone-VII?\n                            A: The total grant for research and operational expenses in the ATARI Zone-VII is 86.60 lakhs.\n                            Q: What is the total grant for miscellaneous expenses in the NASM unit?\n                            A: There are no miscellaneous expenses in the NASM unit.\n                            Q: What is the grand total for the ATARI Zone-V?\n                            A: The grand total for the ATARI Zone-V is 0 lakhs.\n                            Q: What is the total traveling allowance for the CREATION AND MAINTENANCE OF INFRASTRUCTURE unit?\n                            A: There is no traveling allowance for the CREATION AND MAINTENANCE OF INFRASTRUCTURE unit.\n                            Q: What is the total capital grant for the PIU, NASF unit?\n                            A: There is no capital grant for the PIU, NASF unit.\n                            Q: What is the total revenue for the ATARI Zone-VI?\n                            A: The total revenue for the ATARI Zone-VI is 5019 lakhs.\n                            }",
    "{ Q: What is the total agricultural extension in the given data?\n                            A: The total agricultural extension is 20300.00.\n                            Q: What is the revenue for the CICR, Nagpur unit?\n                            A: The revenue for the CICR, Nagpur unit is 10.00.\n                            Q: What are the establishment expenses for AINPJAF, CRIJAF, Barrackpore?\n                            A: The establishment expenses for AINPJAF, CRIJAF, Barrackpore are 0.00.\n                            Q: What is the total grant for the Network Project unit?\n                            A: The total grant for the Network Project unit is 0.00.\n                            Q: What are the administrative expenses for NRRI, Cuttack?\n                            A: The administrative expenses for NRRI, Cuttack are 5.00.\n                            Q: What is the total capital asset grant for IARI, New Delhi?\n                            A: The total capital asset grant for IARI, New Delhi is 20.00.\n                            Q: What are the miscellaneous expenses for CRP On Hybrid Technology, IARI, New Delhi?\n                            A: The miscellaneous expenses for CRP On Hybrid Technology, IARI, New Delhi are 0.00.\n                            Q: What is the total revenue for IGFRI, Jhansi?\n                            A: The total revenue for IGFRI, Jhansi is 5.00.\n                            Q: What are the research and operational expenses for AICRP on Chickpea, IIPR, Kanpur?\n                            A: The research and operational expenses for AICRP on Chickpea, IIPR, Kanpur are 0.00.}",
    "{ Q: What is the name of the research unit located in Kanpur with a grant of 8.00 for research and operational expenses on Pigeonpea?\n                            A: AICRP on Pigeonpea, IIPR, Kanpur\n                            Q: Which unit received a total grant of 10.00 for capital assets in New Delhi?\n                            A: NBPGR, New Delhi\n                            Q: What is the total administrative expense for the AICRP on Sugarcane, IISR, Lucknow?\n                            A: 12.00\n                            Q: Which unit has no grants for establishment expenses or miscellaneous expenses in Maunath Bhanjan?\n                            A: NBAIM, Maunath Bhanjan\n                            Q: What is the total revenue for the NRCIPM, New Delhi?\n                            A: 7.00\n                            Q: Which unit received a traveling allowance grant of 20.00 in Junagadh?\n                            A: DGR, Junagadh\n                            Q: What is the total grant for the AICRP on Groundnut, DGR, Junagadh?\n                            A: 20.00\n                            Q: Which unit has no grants in aid for general expenses in the ICAR Budget Book 2018-19?\n                            A: NRCPB, New Delhi\n                            Q: What is the grand total (capital + revenue) for the DR & MR, Bharatpur?\n                            A: 8.00\n                            Q: Which unit received a grant of 14.00 for research and operational expenses in Hyderabad?\n                            A: IIMR, Hyderabad}",
    "{ Q: What is the name of the unit located in Bengaluru that works on Biological Control?\n                            A: AICRP on Biological Control, NBAIR\n                            Q: What is the total grant for establishment expenses for AICRP on Honey Bee & Pollinators?\n                            A: 5.00\n                            Q: What is the total revenue for AINP on Vertebrate Pest Management?\n                            A: 5.00\n                            Q: Which institute in New Delhi has an AICRP On Maize project?\n                            A: IIMR\n                            Q: What is the total administrative expense for AICRP on Sesame & Niger in Hyderabad?\n                            A: 3.00\n                            Q: What is the total capital grant for IIRR in Hyderabad?\n                            A: 0.00\n                            Q: What is the total grant for CRP on Rice Biofortification in Hyderabad?\n                            A: 0.00\n                            Q: What is the total revenue for AICRP NSP (CROPS) in Maunath Bhanjan?\n                            A: 67.00\n                            Q: Which unit has zero grants in aid for capital and revenue in the ICAR budget book 2018-19?\n                            A: NIBSM, Raipur\n                            Q: What is the total miscellaneous expense for IIAB in Ranchi?\n                            A: 2.00\n                            Q: What is the total grant for research and operational expenses in Crop Sciences?\n                            A: 472.00\n                            Q: What is the name of the unit located in Port Blair?\n                            A: CIARI\n                            Q: What is the total capital grant for AICRP on AZF in Bikaner?\n                            A: 0.00\n                            Q: What is the total administrative expense for CISH in Lucknow?\n                            A: 2.00\n                            Q: What is the total revenue for AICRP on Palm?\n                            A: Not provided in the text}",
    "{ Q: What is the name of the agricultural research unit located in Shimla?\n                            A: Central Potato Research Institute (CPRI)\n                            Q: Which unit received grants for research and operational expenses of 20.00?\n                            A: CPCRI, Kasaragod\n                            Q: What is the total establishment expenses for AICRP on Tuber Crops, CTCRI, Thiruvanthapuram?\n                            A: 0.00\n                            Q: Which unit has the highest grand total (capital + revenue) in the provided data?\n                            A: AICRP on Fruit, IIHR, Bangalore\n                            Q: What are the total miscellaneous expenses for NRC for Banana, Tiruchirapalli?\n                            A: 0.00\n                            Q: Which unit received traveling allowance grants of 2.00?\n                            A: AICRP on Cashew, Dte. For Cashew Research, Puttur\n                            Q: What is the total capital assets grant for ICAR Budget Book 2018-19 TSP components unit 28?\n                            A: 0.00\n                            Q: Which unit has administrative expenses of 15.00?\n                            A: IIOPR, Pedavegi\n                            Q: What are the total grants in aid (general) for NRC for Pomegranate, Solapur?\n                            A: 5.00\n                            Q: Which unit has revenue totaling 8.00?\n                            A: Dte. of Floriculture, Pune}",
    "{ Q: What is the total grant for capital assets for the Network Project on Buffaloes at CIRB, Hissar?\n                            A: The total grant for capital assets for the Network Project on Buffaloes at CIRB, Hissar is 0.00.\n                            Q: What is the total revenue for AICRP on Goats at CIRG, Makhdoom?\n                            A: The total revenue for AICRP on Goats at CIRG, Makhdoom is 11.20.\n                            Q: What are the establishment expenses for the Outreach Program on Zoonotic Diseases at IVRI, Izatnagar?\n                            A: The establishment expenses for the Outreach Program on Zoonotic Diseases at IVRI, Izatnagar are 0.00.\n                            Q: What is the total grant for the Network on Sheep Improvement at CSWRI, Avikanagar?\n                            A: The total grant for the Network on Sheep Improvement at CSWRI, Avikanagar is 0.00.\n                            Q: What are the administrative expenses for NIHSAD, Bhopal?\n                            A: The administrative expenses for NIHSAD, Bhopal are 0.00.\n                            Q: What is the grand total for the Network Project on Animal Genetic Resources at NBAGR, Karnal?\n                            A: The grand total for the Network Project on Animal Genetic Resources at NBAGR, Karnal is 8.00.\n                            Q: What are the miscellaneous expenses for the AICRP ON NPAERP + OP on Methane Emission at NIANP, Bangalore?\n                            A: The miscellaneous expenses for the AICRP ON NPAERP + OP on Methane Emission at NIANP, Bangalore are 0.00.\n                            Q: What is the total research and operational expense for the CARI, Izatnagar?\n                            A: The total research and operational expense for the CARI, Izatnagar is 0.00.\n                            Q: What is the traveling allowance for the NRC on Equines at Hissar?\n                            A: The traveling allowance for the NRC on Equines at Hissar is 0.00.}",
    "{ Q: What is the name of the unit that focuses on Yak research?\n                            A: NRC on Yak, Dirang\n                            Q: Which unit has the highest grant for creation of capital assets in Animal Sciences?\n                            A: NRC on Mithun\n                            Q: What is the total revenue for the Poultry Seed Project in Hyderabad?\n                            A: 12.00\n                            Q: Which unit has no establishment expenses in Dryland Agriculture?\n                            A: AICRP on Dryland Agriculture, CRIDA, Hyderabad\n                            Q: What is the total administrative expense for the ICAR Research Complex for NEH Region?\n                            A: 355.00\n                            Q: Which unit has the highest grand total in Animal Sciences?\n                            A: NRC on Mithun\n                            Q: What is the traveling allowance for the Dte. Of Foot & Mouth Disease, Mukteswar?\n                            A: 0.00\n                            Q: Which unit in Dryland Agriculture has zero grants in aid for general expenses?\n                            A: All units listed\n                            Q: What is the total capital asset grant for the IIS & WC (CS & WCR & TI), Dehradun?\n                            A: 25.00\n                            Q: Which unit in Animal Sciences has no miscellaneous expenses?\n                            A: NRC on Meat, Hyderabad}",
    "{ Q: What is the name of the unit with the highest grand total (Capital + Revenue) in the NRM Division?\n                            A: NBSS & LUP, Nagpur\n                            Q: What are the establishment expenses granted to AICRP on Micronutrients, IISS, Bhopal?\n                            A: The establishment expenses granted are 0.00.\n                            Q: What are the research and operational expenses for the CRP on Conservation Agriculture, IISS, Bhopal?\n                            A: The research and operational expenses are 0.00.\n                            Q: What is the total capital asset grant for CARI, Jhansi?\n                            A: The total capital asset grant is 0.00.\n                            Q: What are the administrative expenses for the AICRP on Agroforestry, CARI, Jhansi?\n                            A: The administrative expenses are 0.00.\n                            Q: What is the grand total for the IIWM, Bhubaneshwar?\n                            A: The grand total is 5.00.\n                            Q: What are the miscellaneous expenses for the AICRP on IWM, IIWM, Bhubaneshwar?\n                            A: The miscellaneous expenses are 0.00.\n                            Q: What is the revenue for the NRC on Integrated Farming, Motihari?\n                            A: The revenue is 0.00.\n                            Q: What are the traveling allowance expenses for the Dte. Of Weed Research, Jabalpur?\n                            A: The traveling allowance expenses are 0.00.\n                            Q: What is the total grants in aid - general for the Network Project on Organic Farming, IIFSR, Modipuram?\n                            A: The total grants in aid - general is 0.00.}",
    "{\n  Q: \"What is the total revenue for the Fisheries unit at CMFRI, Kochi?\"\n  A: \"The total revenue for the Fisheries unit at CMFRI, Kochi is 60.00.\",\n\n  Q: \"What are the establishment expenses for the CRP Genomics unit at NBFGR, Lucknow?\"\n  A: \"The establishment expenses for the CRP Genomics unit at NBFGR, Lucknow are 0.00.\",\n\n  Q: \"What is the total grant for the Dte. of Coldwater Fisheries Research, Bhimtal?\"\n  A: \"The total grant for the Dte. of Coldwater Fisheries Research, Bhimtal is 10.00.\",\n\n  Q: \"What are the administrative expenses for the AICRP on FIM unit at CIAE, Bhopal?\"\n  A: \"The administrative expenses for the AICRP on FIM unit at CIAE, Bhopal are 0.00.\",\n\n  Q: \"What is the total capital asset grant for the CIPHET, Ludhiana?\"\n  A: \"The total capital asset grant for the CIPHET, Ludhiana is 0.00.\",\n\n  Q: \"What are the miscellaneous expenses for the CRP on Natural Fibres unit at CIRCOT, Mumbai?\"\n  A: \"The miscellaneous expenses for the CRP on Natural Fibres unit at CIRCOT, Mumbai are 0.00.\",\n\n  Q: \"What is the total revenue for the Agricultural Engineering units?\"\n  A: \"The total revenue for the Agricultural Engineering units is 0.00.\",\n\n  Q: \"What are the research and operational expenses for the NWP on HP VANR&G unit at IINRG, Ranchi?\"\n  A: \"The research and operational expenses for the NWP on HP VANR&G unit at IINRG, Ranchi are 0.00.\",\n\n  Q: \"What is the total grant for the IASRI including CABin, New Delhi?\"\n  A: \"The total grant for the IASRI including CABin, New Delhi is 0.00.\",\n\n  Q: \"What are the traveling allowance expenses for the NAARM, Hyderabad?\"\n  A: \"The traveling allowance expenses for the NAARM, Hyderabad are 0.00.\"\n}",
    "{ Q: What is the total grant for establishment expenses in the AICRP on Home Science, CIWA, Bhubaneshwar?\n                            A: The total grant for establishment expenses is 0.00.\n                            Q: What is the total revenue for the Strengthening and Development of Higher Agricultural Education in India?\n                            A: The total revenue is 1890.00.\n                            Q: What is the total grant for administrative expenses in the Headquarters Unit?\n                            A: The total grant for administrative expenses is 0.00.\n                            Q: What is the grand total for the ICAR HQRS division?\n                            A: The grand total is 0.00.\n                            Q: What is the total grant for capital assets in the ATARI Zone-I, Ludhiana?\n                            A: The total grant for capital assets is 124.00.\n                            Q: What is the total revenue for the ATARI Zone-II, Jodhpur?\n                            A: The total revenue is 56.00.\n                            Q: What is the total grant for miscellaneous expenses in the ATARI Zone-III, Kanpur?\n                            A: The total grant for miscellaneous expenses is 12.00.\n                            Q: What is the grand total for the ATARI Zone-V, Kolkata?\n                            A: The grand total is 211.35.\n                            Q: What is the total grant for research and operational expenses in the ATARI Zone-VII, Barapani?\n                            A: The total grant for research and operational expenses is 132.80.\n                            }",
    "{ Q: What are the names of the ATARI zones mentioned in the text?\n                            A: The ATARI zones mentioned are ATARI ZONE-IX (Jabalpur), ATARI ZONE-X (Hyderabad), and ATARI ZONE-XI (Bengalore).\n                            Q: What is the total grant received by ATARI ZONE-IX, Jabalpur?\n                            A: The total grant received by ATARI ZONE-IX, Jabalpur is 190.50 lakhs.\n                            Q: What is the total revenue for the unit 'FARMER FIRST'?\n                            A: The total revenue for the unit 'FARMER FIRST' is 0.00 lakhs.\n                            Q: What is the total capital grant for the unit 'ARYA'?\n                            A: The total capital grant for the unit 'ARYA' is 64.30 lakhs.\n                            Q: What is the total administrative expense for the Agricultural Extension?\n                            A: The total administrative expense for the Agricultural Extension is 1420.00 lakhs.\n                            Q: What is the grand total for CICR, Nagpur, excluding NEH and TSP?\n                            A: The grand total for CICR, Nagpur, excluding NEH and TSP, is 4105.50 lakhs.\n                            Q: What is the total grant for the unit 'AICRP on Cotton, CICR, Nagpur'?\n                            A: The total grant for the unit 'AICRP on Cotton, CICR, Nagpur' is 1718.00 lakhs.\n                            Q: What is the total revenue for the unit 'IGFRI, Jhansi'?\n                            A: The total revenue for the unit 'IGFRI, Jhansi' is 4345.00 lakhs.\n                            Q: What is the total grant for the unit 'AICRP on Forage Crops and Utilization, IGFRI, Jhansi'?\n                            A: The total grant for the unit 'AICRP on Forage Crops and Utilization, IGFRI, Jhansi' is 859.00 lakhs.\n                            Q: What is the grand total for the unit 'IIPR, Kanpur'?\n                            A: The grand total for the unit 'IIPR, Kanpur' is 2918.00 lakhs.}",
    "{ Q: What is the budget allocation (in lakhs) for AICRP on Arid Legumes at IIPR Kanpur?\n                            A: The budget allocation for AICRP on Arid Legumes at IIPR Kanpur is 289 lakhs.\n                            Q: What is the total budget (in lakhs) for IISR, Lucknow?\n                            A: The total budget for IISR, Lucknow is 5097 lakhs.\n                            Q: What is the NEH budget (in lakhs) for AICRP on Sugarcane at IISR, Lucknow?\n                            A: The NEH budget for AICRP on Sugarcane at IISR, Lucknow is 80 lakhs.\n                            Q: What is the grand total budget (in lakhs) for NBAIM, Maunath Bhanjan?\n                            A: The grand total budget for NBAIM, Maunath Bhanjan is 864 lakhs.\n                            Q: What is the TSP budget (in lakhs) for AMAAS, NBAIM, Mau?\n                            A: There is no TSP budget for AMAAS, NBAIM, Mau.\n                            Q: What is the revenue component of the grand total budget (in lakhs) for NBPGR, New Delhi?\n                            A: The revenue component of the grand total budget for NBPGR, New Delhi is 10014 lakhs.\n                            Q: What is the capital component of the grand total budget (in lakhs) for CRP-AGRO BIODIVERSITY at NBPGR, New Delhi?\n                            A: The capital component of the grand total budget for CRP-AGRO BIODIVERSITY at NBPGR, New Delhi is 200 lakhs.\n                            Q: What is the total budget (in lakhs) for SBI, Coimbatore, excluding NEH and TSP?\n                            A: The total budget for SBI, Coimbatore, excluding NEH and TSP, is 4035.50 lakhs.\n                            Q: What is the grand total budget (in lakhs) for AICRP on R&M at DR & MR, Bharatpur, including NEH and TSP?\n                            A: The grand total budget for AICRP on R&M at DR & MR, Bharatpur, including NEH and TSP, is 1020.40 lakhs.\n                            }",
    "{\n  Q: What is the total capital and revenue for AICRP on Wheat & Barley, IIWBR, Karnal?\n  A: The total capital and revenue for AICRP on Wheat & Barley, IIWBR, Karnal is 1860 lakhs.\n\n  Q: What is the NEH (Capital + Revenue) amount for IISS, Maunath Bhanjan?\n  A: The NEH (Capital + Revenue) amount for IISS, Maunath Bhanjan is 0 lakhs.\n\n  Q: What is the TSP (Capital + Revenue) amount for AICRP NSP (CROPS), DSR, Maunath Bhanjan?\n  A: The TSP (Capital + Revenue) amount for AICRP NSP (CROPS), DSR, Maunath Bhanjan is 67 lakhs.\n\n  Q: What is the grand total (Capital + Revenue) for all units in Crop Sciences?\n  A: The grand total (Capital + Revenue) for all units in Crop Sciences is 148658 lakhs.\n\n  Q: What is the total capital and revenue for CIARI, Port Blair?\n  A: The total capital and revenue for CIARI, Port Blair is 2191.6 lakhs.\n\n  Q: What is the NEH amount for AICRP on AZF, CIAH, Bikaner?\n  A: The NEH amount for AICRP on AZF, CIAH, Bikaner is 0 lakhs.\n\n  Q: What is the TSP (Capital + Revenue) amount for CISH, Lucknow?\n  A: The TSP (Capital + Revenue) amount for CISH, Lucknow is 5 lakhs.\n\n  Q: What is the grand total (Other than NEH and TSP+NER+TSP) for all units in the ICAR Budget Book 2018-19?\n  A: The grand total (Other than NEH and TSP+NER+TSP) for all units in the ICAR Budget Book 2018-19 is not provided in the given text.\n\n  Q: What is the total capital and revenue for NRC for Banana, Tiruchirapalli?\n  A: The total capital and revenue for NRC for Banana, Tiruchirapalli is 1019.15 lakhs.\n\n  Q: What is the NEH amount for Dte. for Cashew Research, Puttur?\n  A: The NEH amount for Dte. for Cashew Research, Puttur is 2 lakhs.\n}",
    "{ Q: What is the total budget for Horticultural Sciences?\n                            A: The total budget for Horticultural Sciences is 60,265 lakhs.\n                            Q: What is the budget for Floriculture in Pune?\n                            A: The budget for Floriculture in Pune is 711 lakhs.\n                            Q: What is the budget for the Network Project on Buffaloes at CIRB, Hissar?\n                            A: The budget for the Network Project on Buffaloes at CIRB, Hissar is 555 lakhs.\n                            Q: What is the total budget for IVRI, Izatnagar?\n                            A: The total budget for IVRI, Izatnagar is 31,935 lakhs.\n                            Q: What is the budget for the Outreach Program on Environmental Pollutants at IVRI, Izatnagar?\n                            A: The budget for the Outreach Program on Environmental Pollutants at IVRI, Izatnagar is 119 lakhs.\n                            Q: What is the budget for NIHSAD, Bhopal?\n                            A: The budget for NIHSAD, Bhopal is 1,662.20 lakhs.\n                            Q: What is the budget for NRC on Mithun?\n                            A: The budget for NRC on Mithun is 1,061 lakhs.\n                            Q: What is the budget for NRC on Pig, Guwahati, excluding the AICRP on Pig and Mega Seed Project on Pig?\n                            A: The budget for NRC on Pig, Guwahati, excluding the AICRP on Pig and Mega Seed Project on Pig, is 188.40 lakhs.\n                            Q: What is the total budget for NRC on Equines, Hissar, including the National Centre for Veterinary Type Culture Collection?\n                            A: The total budget for NRC on Equines, Hissar, including the National Centre for Veterinary Type Culture Collection, is 1,874 lakhs.\n                            Q: What is the total budget for NBAGR, Karnal, including the Network Project on Animal Genetic Resources?\n                            A: The total budget for NBAGR, Karnal, including the Network Project on Animal Genetic Resources, is 1,474.10 lakhs.}",
    "{ Q: What is the total budget allocated for the Animal Sciences unit in the ICAR Budget Book 2018-19?\n                            A: The total budget allocated for the Animal Sciences unit is 88,577 lakhs.\n                            Q: What is the budget for the AICRP on Cattle, CIRC, Meerut?\n                            A: The budget for the AICRP on Cattle, CIRC, Meerut is 1,138 lakhs.\n                            Q: What is the budget for the Department of Foot & Mouth Disease, Mukteswar?\n                            A: The budget for the Department of Foot & Mouth Disease, Mukteswar is 710 lakhs.\n                            Q: What is the total budget for the Non-Plan division in the ICAR Budget Book 2018-19?\n                            A: The total budget for the Non-Plan division is 68,217 lakhs.\n                            Q: What is the budget for the Network Project on Organic Farming, IIFSR, Modipuram?\n                            A: The budget for the Network Project on Organic Farming, IIFSR, Modipuram is 158 lakhs.\n                            Q: What is the total budget for the NRM Division in the ICAR Budget Book 2018-19?\n                            A: The total budget for the NRM Division is 64,217 lakhs.\n                            Q: What is the budget for the ICAR Research Complex for Eastern Region, Patna?\n                            A: The budget for the ICAR Research Complex for Eastern Region, Patna is 3,281 lakhs.\n                            Q: What is the budget for the AICRP on Poultry, Department of Poultry Research, Hyderabad?\n                            A: The budget for the AICRP on Poultry, Department of Poultry Research, Hyderabad is 1,542.5 lakhs.\n                            Q: What is the total budget for the CRAI/NICRA unit in the ICAR Budget Book 2018-19?\n                            A: The total budget for the CRAI/NICRA unit is 5,000 lakhs.\n                            Q: What is the budget for the Central Institute of Brackishwater Aquaculture (CIBA), Chennai?\n                            A: The budget for the Central Institute of Brackishwater Aquaculture (CIBA), Chennai is 4,336 lakhs. }",
    "{ Q: What is the grand total for the Fisheries unit in the ICAR budget book 2018-19?\n                            A: The grand total for the Fisheries unit is 44,669 lakhs.\n                            Q: What is the revenue grand total for CIAE, Bhopal?\n                            A: The revenue grand total for CIAE, Bhopal is 5,032.90 lakhs.\n                            Q: What is the capital grand total for the AICRP on FIM at CIAE, Bhopal?\n                            A: The capital grand total for the AICRP on FIM at CIAE, Bhopal is 1787.70 lakhs.\n                            Q: What are the NEH and TSP values for the NBFGR, Lucknow unit?\n                            A: The NEH value for NBFGR, Lucknow is 22 lakhs, and the TSP value is 10 lakhs.\n                            Q: What is the grand total for the CIPHET, Ludhiana unit?\n                            A: The grand total for the CIPHET, Ludhiana unit is 1472 lakhs.\n                            Q: What is the revenue grand total for the TOTAL AGRICULTURAL ENGINEERING division?\n                            A: The revenue grand total for the TOTAL AGRICULTURAL ENGINEERING division is 21,354 lakhs.\n                            Q: What are the NEH and TSP values for the Strengthening and Development of Higher Agricultural Education in India?\n                            A: The NEH value is 3,000 lakhs, and the TSP value is 2,700 lakhs.\n                            Q: What is the grand total for the HEADQUARTERS UNIT?\n                            A: The grand total for the HEADQUARTERS UNIT is 17,940 lakhs.\n                            Q: What is the revenue grand total for the AICRP on Home Science at CIWA, Bhubaneshwar?\n                            A: The revenue grand total for the AICRP on Home Science at CIWA, Bhubaneshwar is 2,760 lakhs.\n                            Q: What is the extra-mural fund grand total?\n                            A: The question does not provide information on the extra-mural fund grand total.}",
    "{ Q: What is the total budget for ICAR HQRS in the provided text?\n                            A: The total budget for ICAR HQRS is 43,794 lakhs.\n                            Q: What is the funding for ATARI Zone-VI in the given text?\n                            A: The funding for ATARI Zone-VI is 5,484 lakhs.\n                            Q: What is the total budget for Agricultural Extension in the provided text?\n                            A: The total budget for Agricultural Extension is 88,773 lakhs.\n                            Q: What is the grant-in-aid component for CICR, Nagpur in the given text?\n                            A: The grant-in-aid component for CICR, Nagpur is 2,653 lakhs.\n                            Q: What is the total capital for AICRP on Cotton, CICR, Nagpur in the provided text?\n                            A: The total capital for AICRP on Cotton, CICR, Nagpur is 147 lakhs.\n                            Q: What are the salaries and pension expenses for NRRI, Cuttack in the given text?\n                            A: The salaries and pension expenses for NRRI, Cuttack are 988.50 lakhs.\n                            Q: What is the total grant-in-aid component for CRIJAF, Barrackpore in the provided text?\n                            A: The total grant-in-aid component for CRIJAF, Barrackpore is 3,081 lakhs.\n                            Q: What is the general capital for AINPJAF, CRIJAF, Barrackpore in the given text?\n                            A: The general capital for AINPJAF, CRIJAF, Barrackpore is 211 lakhs.\n                            Q: What is the grand total budget in the provided text?\n                            A: The grand total budget is 654,902 lakhs.\n                            }",
    "{ Q: What is the name of the network project on Tobacco?\n                            A: The network project on Tobacco is at CTRI, Rajamundry.\n                            Q: Which institute has a project on Pesticide Residues?\n                            A: IARI, New Delhi has a project on Pesticide Residues.\n                            Q: What is the total capital expenditure for the AICRP Nematode project at IARI, New Delhi?\n                            A: The total capital expenditure for the AICRP Nematode project at IARI, New Delhi is 0.00 INR lakhs.\n                            Q: What is the total grant-in-aid component for the CRP On Hybrid Technology at IARI, New Delhi?\n                            A: The total grant-in-aid component for the CRP On Hybrid Technology at IARI, New Delhi is 50.00 INR lakhs.\n                            Q: What is the salary expenditure for the AICRP on Honey Bee & Pollinators at IARI, New Delhi?\n                            A: The salary expenditure for the AICRP on Honey Bee & Pollinators at IARI, New Delhi is 0.00 INR lakhs.\n                            Q: What is the total grant-in-aid component for IGFRI, Jhansi?\n                            A: The total grant-in-aid component for IGFRI, Jhansi is 370.00 INR lakhs.\n                            Q: What is the general capital expenditure for the AICRP on Chickpea at IIPR, Kanpur?\n                            A: The general capital expenditure for the AICRP on Chickpea at IIPR, Kanpur is 0.00 INR lakhs.\n                            Q: What is the total grant-in-aid component for IISR, Lucknow?\n                            A: The total grant-in-aid component for IISR, Lucknow is 5175.00 INR lakhs.\n                            Q: What is the pension expenditure for NBPGR, New Delhi?\n                            A: The pension expenditure for NBPGR, New Delhi is 1530.00 INR lakhs.}",
    "{\nQ: What is the name of the unit at Bharatpur with a Total Grant in Aid component of 105.00 lakhs?\nA: The Unit/AICRP/Network Project at Bharatpur with a Total Grant in Aid component of 105.00 lakhs is DR & MR.\n\nQ: What are the General Capital Salaries for IIMR, Hyderabad?\nA: The General Capital Salaries for IIMR, Hyderabad are 466.00 lakhs.\n\nQ: What is the Total Grant in Aid component for AICRP on Small Millets at IIMR, Hyderabad?\nA: The Total Grant in Aid component for AICRP on Small Millets at IIMR, Hyderabad is 436.00 lakhs.\n\nQ: What are the Pension expenses for IISR, Indore?\nA: The Pension expenses for IISR, Indore are 386.18 lakhs.\n\nQ: What is the Total Capital Salaries for AICRP on Biological Control at NBAIR, Bengaluru?\nA: The Total Capital Salaries for AICRP on Biological Control at NBAIR, Bengaluru are 45.24 lakhs.\n\nQ: What is the Total Grant in Aid component for IIMR, Ludhiana?\nA: The Total Grant in Aid component for IIMR, Ludhiana is 1529.70 lakhs.\n\nQ: What are the General Salaries for AICRP on Oilseed at IIOR, Hyderabad?\nA: The General Salaries for AICRP on Oilseed at IIOR, Hyderabad are 1419.00 lakhs.\n\nQ: What is the NEH Grant in Aid component for IIRR, Hyderabad?\nA: The NEH Grant in Aid component for IIRR, Hyderabad is 3.00 lakhs.\n\nQ: What are the Total Capital Salaries for AICRP on Wheat & Barley at IIWBR, Karnal?\nA: The Total Capital Salaries for AICRP on Wheat & Barley at IIWBR, Karnal are 1940.00 lakhs.\n\nQ: What is the Total Grant in Aid component for the entire Crop Sciences?\nA: The Total Grant in Aid component for the entire Crop Sciences is 153069.00 lakhs.\n}",
    "{\n  Q: \"What is the name of the agricultural research unit located in Srinagar?\"\n  A: \"00 5 CITH, Srinagar\",\n\n  Q: \"What is the total grant in aid component for CPRI, Shimla?\"\n  A: \"6002.00\",\n\n  Q: \"What is the capital expenditure for AICRP on Tuber Crops, CTCRI, Thiruvanthapuram?\"\n  A: \"21.00\",\n\n  Q: \"What is the general expenditure for IIHR, Bangalore?\"\n  A: \"10523.00\",\n\n  Q: \"What is the NEH Grant in Aid component for IISR, Calicut?\"\n  A: \"6.00\",\n\n  Q: \"What is the total salary expenditure for AICRP on Spices, IISR, Calicut?\"\n  A: \"60.00\",\n\n  Q: \"What is the total capital expenditure for Dte. for Cashew Research, Puttur?\"\n  A: \"910.00\",\n\n  Q: \"What is the pension expenditure for CCRI, Nagpur?\"\n  A: \"0.00\",\n\n  Q: \"What is the total grant in aid component for NRC for Banana, Tiruchirapalli?\"\n  A: \"1079.36\",\n\n  Q: \"What is the general expenditure for AICRP on Mushroom, DMR, Solan?\"\n  A: \"316.00\"\n}",
    "{  Q: What is the name of the first unit or project mentioned in the data?\n A: CIRB, Hissar\n Q: What is the total grant in aid component for the Network Project on Baffaloes at CIRB, Hissar?\n A: 3010.42\n Q: What are the general capital expenses for the AICRP on Goats at CIRG, Makhdoom?\n A: 0.00\n Q: What are the total capital and salaries expenses for CSWRI, Avikanagar?\n A: 4165.00\n Q: What is the NEH grant in aid component for NIHSAD, Bhopal?\n A: 150.00\n Q: What are the total expenses for the Outreach Program on Environmental Pollutants at IVRI, Izatnagar?\n A: 50.00\n Q: What are the general capital expenses for the Network on Sheep Improvement at CSWRI, Avikanagar?\n A: 0.00\n Q: What is the total grant in aid component for the NRC on Meat, Hyderabad?\n A: 859.00\n Q: What are the pension expenses for NDRI, Karnal?\n A: 5.00\n Q: What are the total capital and salaries expenses for the Mega Seed on Pig project at NRC on Pig, Guwahati?\n A: 65.40\n}",
    "{\n  Q: \"What is the total grant in aid component for Animal Sciences in the revised estimates for 2017-18?\"\n  A: \"88,990 lakhs\",\n\n  Q: \"Which institute received the highest grant in aid component in the non-plan estimates for 2017-18?\"\n  A: \"ICAR RC For NEH Region.,Barapani with 6,673.6 lakhs\",\n\n  Q: \"What is the total capital for AICRP on Cattle, CIRC, Meerut in the revised estimates for 2017-18?\"\n  A: \"481 lakhs\",\n\n  Q: \"What is the NEH grant in aid component for CRIDA, Hyderabad in the revised estimates for 2017-18?\"\n  A: \"345 lakhs\",\n\n  Q: \"What are the general expenses for CSSRI, Karnal in the revised estimates for 2017-18?\"\n  A: \"715.5 lakhs\",\n\n  Q: \"What is the total grant in aid component for the institute at Sl. No. 17 in the non-plan estimates for 2017-18?\"\n  A: \"7,100 lakhs\",\n\n  Q: \"What are the pension expenses for ICAR Res. Complex for Eastern Region, Patna in the revised estimates for 2017-18?\"\n  A: \"843.5 lakhs\",\n\n  Q: \"What is the total capital for AICRP on Biofertilizer, IISS, Bhopal in the revised estimates for 2017-18?\"\n  A: \"35 lakhs\",\n\n  Q: \"What are the salary expenses for IISS, Bhopal in the revised estimates for 2017-18?\"\n  A: \"533 lakhs\",\n\n  Q: \"What is the NEH grant in aid component for CARI,Jhansi in the revised estimates for 2017-18?\"\n  A: \"105 lakhs\"\n}",
    "{ Q: What is the total NRM Division budget for 2017-18 (revised estimates)?\n                            A: The total NRM Division budget for 2017-18 (revised estimates) is 66,480 lakhs.\n                            Q: What is the grant-in-aid component for Baneshwar NRC on Integrated Farming?\n                            A: The grant-in-aid component for Baneshwar NRC on Integrated Farming is 375 lakhs.\n                            Q: What are the total capital expenses for Dte. Of Weed Research, Jabalpur?\n                            A: The total capital expenses for Dte. Of Weed Research, Jabalpur are 1,141.80 lakhs.\n                            Q: What is the total budget for the Network Project on Organic Farming, IIFSR, Modipuram?\n                            A: The total budget for the Network Project on Organic Farming, IIFSR, Modipuram is 130 lakhs.\n                            Q: What are the salaries expenses for NIASM, Baramati?\n                            A: The salaries expenses for NIASM, Baramati are 1,000 lakhs.\n                            Q: What is the total budget for CIBA, Chennai?\n                            A: The total budget for CIBA, Chennai is 4,853.50 lakhs.\n                            Q: What are the pension expenses for CIFE, Mumbai?\n                            A: The pension expenses for CIFE, Mumbai are 6 lakhs.\n                            Q: What is the total budget for the Fisheries division?\n                            A: The total budget for the Fisheries division is 49,832 lakhs.\n                            Q: What are the general capital expenses for CRP Genomics, NBFGR, Lucknow?\n                            A: The general capital expenses for CRP Genomics, NBFGR, Lucknow are 411 lakhs.\n                            Q: What is the total budget for CIAE, Bhopal and its AICRP projects?\n                            A: The total budget for CIAE, Bhopal and its AICRP projects is 6,684.90 lakhs.\n                            }",
    "{\n  Q: \"What is the total capital expenditure for Agricultural Engineering in the revised estimates of 2017-18?\"\n  A: \"The total capital expenditure for Agricultural Engineering in the revised estimates of 2017-18 is 4648 lakhs.\",\n\n  Q: \"What is the grant in aid component for NIRJAFT, Kolkata in the revised estimates of 2017-18?\"\n  A: \"The grant in aid component for NIRJAFT, Kolkata in the revised estimates of 2017-18 is 337 lakhs.\",\n\n  Q: \"What is the total budget for the Agricultural Education Division in the revised estimates of 2017-18?\"\n  A: \"The total budget for the Agricultural Education Division in the revised estimates of 2017-18 is 67,811 lakhs.\",\n\n  Q: \"What is the total grant in aid component for the Headquarters Unit in the revised estimates of 2017-18?\"\n  A: \"The total grant in aid component for the Headquarters Unit in the revised estimates of 2017-18 is 18,532.5 lakhs.\",\n\n  Q: \"What is the budget allocated for the Auditorium in the revised estimates of 2017-18?\"\n  A: \"The budget allocated for the Auditorium in the revised estimates of 2017-18 is 7,425 lakhs.\",\n\n  Q: \"What is the total budget for ICAR HQRS in the revised estimates of 2017-18?\"\n  A: \"The total budget for ICAR HQRS in the revised estimates of 2017-18 is 43,798 lakhs.\",\n\n  Q: \"What is the grant in aid component for CERA in the revised estimates of 2017-18?\"\n  A: \"The grant in aid component for CERA in the revised estimates of 2017-18 is 3,683 lakhs.\",\n\n  Q: \"What is the budget allocated for the Swachhata Action Plan in the revised estimates of 2017-18?\"\n  A: \"The budget allocated for the Swachhata Action Plan in the revised estimates of 2017-18 is 150 lakhs.\",\n\n  Q: \"What is the total budget for the Others category in the revised estimates of 2017-18?\"\n  A: \"The total budget for the Others category in the revised estimates of 2017-18 is 3,775 lakhs.\",\n\n  Q: \"What is the budget allocated for the creation and maintenance of infrastructure in the revised estimates of 2017-18?\"\n  A: \"The budget allocated for the creation and maintenance of infrastructure in the revised estimates of 2017-18 is 2,196.5 lakhs.\"\n}",
    "{\n  Q: \"What is the total capital for ATARI ZONE-I, Ludhiana?\"\n  A: \"The total capital for ATARI ZONE-I, Ludhiana is 1014.35 lakhs.\",\n\n  Q: \"What are the salaries and pension expenses for ATARI ZONE-VI, Guwahati?\"\n  A: \"The salaries and pension expenses for ATARI ZONE-VI, Guwahati are 4170 lakhs and 449 lakhs respectively.\",\n\n  Q: \"What is the total grant in aid component for ATARI ZONE-V, Kolkata?\"\n  A: \"The total grant in aid component for ATARI ZONE-V, Kolkata is 1085 lakhs.\",\n\n  Q: \"What are the general capital expenses for ATARI ZONE-VIII, Pune?\"\n  A: \"The general capital expenses for ATARI ZONE-VIII, Pune are 5019 lakhs.\",\n\n  Q: \"What is the total agricultural extension for all zones?\"\n  A: \"The total agricultural extension for all zones is 92000 lakhs.\",\n\n  Q: \"What is the NEH Grant in Aid component for FARMER FIRST?\"\n  A: \"The NEH Grant in Aid component for FARMER FIRST is 283.75 lakhs.\",\n\n  Q: \"What are the disaster management expenses?\"\n  A: \"The disaster management expenses are 40 lakhs.\",\n\n  Q: \"What is the total budget for ICAR in 2017-18?\"\n  A: \"The total budget for ICAR in 2017-18 is 644439 lakhs.\",\n\n  Q: \"What is the total grant in aid component for CICR, Nagpur?\"\n  A: \"The total grant in aid component for CICR, Nagpur is 2440 lakhs.\",\n\n  Q: \"What are the general expenses for NETWORK PROJECT?\"\n  A: \"There are no general expenses for NETWORK PROJECT.\"\n}",
    "{ Q: What is the name of the unit or project with the highest total grant-in-aid component?\n                            A: NBPGR, New Delhi\n                            Q: What is the TSP grant for the AICRP on Honey Bee & Pollinators, IARI, NEW DELHI?\n                            A: 350.00 lakhs\n                            Q: What are the general capital and salaries expenses for IGFRI, Jhansi?\n                            A: General capital is 68.00 lakhs, and salaries are 2875.30 lakhs.\n                            Q: What is the total capital for the AICRP on Arid Legumes, IIPR Kanpur?\n                            A: The total capital is 289.00 lakhs.\n                            Q: What is the grand total (other than NEH+NEH+TSP) for NBAIM, Maunath Bhanjan?\n                            A: The grand total is 997.00 lakhs.\n                            Q: What is the grant-in-aid component for the CRP-AGRO BIODIVERSITY, NBPGR, New Delhi?\n                            A: The grant-in-aid component is 190.15 lakhs.\n                            Q: What are the general capital and salaries expenses for VPKAS, Almora?\n                            A: General capital is 1150.25 lakhs, and salaries are 640.51 lakhs.\n                            Q: What is the TSP grant for the AINP on Soil Arthropod Pests, NRCIPM, New Delhi?\n                            A: The TSP grant is 0.00 lakhs.\n                            Q: What is the total grant-in-aid component for the AICRP on Pearl Millets, IIMR, Hyderabad?\n                            A: The total grant-in-aid component is 613.00 lakhs.\n                            }",
    "{\n  Q: \"What is the name of the agricultural research institute located in Hyderabad?\"\n  A: \"IIMR, Hyderabad\",\n\n  Q: \"What is the total grant in aid component for AICRP on Soyabean, Indore?\"\n  A: \"919.50 lakhs\",\n\n  Q: \"Which institute received a grant of 1525.62 lakhs under the general capital component in 2017-18?\"\n  A: \"NBAIR, Bengaluru\",\n\n  Q: \"What is the total capital for IIOR, Hyderabad in the revised estimates for 2017-18?\"\n  A: \"3035.90 lakhs\",\n\n  Q: \"What is the TSP grant for AICRP on Oilseed, Hyderabad?\"\n  A: \"0 lakhs\",\n\n  Q: \"Which institute has the highest grant in aid component for salaries in the given data?\"\n  A: \"IIRR, Hyderabad\",\n\n  Q: \"What is the total grant in aid component for the CRP on Rice Biofortification, IIRR, Hyderabad?\"\n  A: \"450 lakhs\",\n\n  Q: \"What is the grand total for IIWBR, Karnal?\"\n  A: \"3174 lakhs\",\n\n  Q: \"What is the TSP grant for Seed Production in Agricultural Corps and Fisheries, DSR, Mau?\"\n  A: \"0 lakhs\",\n\n  Q: \"What is the total capital for NIBSM, Raipur in the revised estimates for 2017-18?\"\n  A: \"1975 lakhs\"\n}",
    "{ Q: What is the total grant in aid component for the AICRP on Fruit at IIHR, Bangalore?\n                            A: The total grant in aid component for the AICRP on Fruit at IIHR, Bangalore is 5400 lakhs.\n                            Q: What are the general capital and salaries general expenses for the IISR, Calicut?\n                            A: The general capital expenses for IISR, Calicut are 1893 lakhs, and the salaries general expenses are 737 lakhs.\n                            Q: What is the total grant in aid component for the AICRP on Spices at IISR, Calicut?\n                            A: The total grant in aid component for the AICRP on Spices at IISR, Calicut is 537 lakhs.\n                            Q: What are the TSP grand total and grant in aid component for the Dte. for Cashew Research, Puttur?\n                            A: The TSP grand total is 918 lakhs, and the grant in aid component is 397 lakhs.\n                            Q: What are the total capital, general capital, and salaries general expenses for CCRI, Nagpur?\n                            A: The total capital expenses are 1376 lakhs, the general capital expenses are 734 lakhs, and the salaries general expenses are 638 lakhs.\n                            Q: What is the total grant in aid component for the NRC for Banana, Tiruchirapalli?\n                            A: The total grant in aid component for the NRC for Banana, Tiruchirapalli is 1085.36 lakhs.\n                            Q: What are the TSP grand total and grant in aid component for the AICRP on Cashew at Dte. For Cashew Research, Puttur?\n                            A: The TSP grand total is 358 lakhs, and the grant in aid component is 158 lakhs.\n                            Q: What are the general capital and salaries general expenses for the DMAPR, Anand?\n                            A: The general capital expenses for DMAPR, Anand are 817 lakhs, and the salaries general expenses are 382 lakhs.\n                            Q: What is the total capital expense for the HORTICULTURAL SCIENCES division?\n                            A: The total capital expense for the HORTICULTURAL SCIENCES division is 59847 lakhs.\n                            }",
    "{\n  Q: \"What is the name of the outreach program on ethnoveterinary medicine at IVRI, Izatnagar?\"\n  A: \"Outreach Prog. on Ethno vety. Medicine, IVRI, Izatnagar\",\n\n  Q: \"What is the total grant in aid component for the Network Project on Animal Genetic Resources at NBAGR, Karnal?\"\n  A: \"103.00 lakhs\",\n\n  Q: \"What are the general capital and salaries general expenses for NRC on Equines, Hissar?\"\n  A: \"1625.51 lakhs\",\n\n  Q: \"What is the TSP grant for the AICRP on Pig at NRC on Pig, Guwahati?\"\n  A: \"0.00 lakhs\",\n\n  Q: \"What is the total grant in aid component for the NIVEDI, Bengalore?\"\n  A: \"1239.45 lakhs\",\n\n  Q: \"What are the grand total expenses (other than NEH+TSP) for the Dte. Of Foot & Mouth Disease, Mukteswar?\"\n  A: \"2133.25 lakhs\",\n\n  Q: \"What is the total capital expenditure for the Poultry Seed Project at Dte. Of Poultry Research, Hyderabad?\"\n  A: \"481.50 lakhs\",\n\n  Q: \"What is the grant in aid component for the Outreach Program on Zoonotic Diseases at IVRI, Izatnagar?\"\n  A: \"137.00 lakhs\",\n\n  Q: \"What are the general expenses for the Network on GIP at IVRI, Izatnagar?\"\n  A: \"73.00 lakhs\",\n\n  Q: \"What is the total grant in aid component for the CRP on V&D at IVRI, Izatnagar?\"\n  A: \"631.00 lakhs\"\n}",
    "{\n  Q: \"What is the name of the first agricultural research unit mentioned in the text?\"\n  A: \"CAZRI, Jodhpur\",\n\n  Q: \"What is the TSP Grant in Aid component for AICRP on Dryland Agriculture, CRIDA, Hyderabad?\"\n  A: \"2310.00\",\n\n  Q: \"What are the total salaries for ICAR RC For NEH Region, Barapani?\"\n  A: \"2517.50\",\n\n  Q: \"What is the total capital for PCU-SAS, CSSRI, Karnal?\"\n  A: \"615.00\",\n\n  Q: \"What is the total grant in aid component for CCARI (ICAR Res. Complex), Goa?\"\n  A: \"1479.12\",\n\n  Q: \"What is the general capital for AICRP on Biofertilizer, IISS, Bhopal?\"\n  A: \"35.00\",\n\n  Q: \"What is the TSP Grand Total for NBSS & LUP, Nagpur?\"\n  A: \"7400.50\",\n\n  Q: \"What is the total grant in aid component for CRP on Conservation Agriculture, IISS, Bhopal?\"\n  A: \"275.00\",\n\n  Q: \"What is the total capital for IIWM, Bhubaneshwar?\"\n  A: \"1119.52\",\n\n  Q: \"What is the total general for Dte. Of Weed Research, Jabalpur?\"\n  A: \"1141.80\"\n}",
    "{\n  Q: \"What is the total fisheries grant-in-aid component for the unit CIBA, Chennai?\"\n  A: \"The total fisheries grant-in-aid component for the unit CIBA, Chennai is 2874.50 lakhs.\",\n\n  Q: \"What are the general capital and salaries general for the AICRP on FIM, CIAE, Bhopal?\"\n  A: \"The general capital is 180.00 lakhs and salaries general is 1360.00 lakhs for the AICRP on FIM, CIAE, Bhopal.\",\n\n  Q: \"What is the total grant-in-aid component for the agricultural engineering section?\"\n  A: \"The total grant-in-aid component for the agricultural engineering section is 21607.00 lakhs.\",\n\n  Q: \"What are the TSP grand total, general capital, and salaries general for the unit NIAP & PR, New Delhi?\"\n  A: \"The TSP grand total is 0.00 lakhs, general capital is 0.00 lakhs, and salaries general is 501.00 lakhs for the unit NIAP & PR, New Delhi.\",\n\n  Q: \"What is the total capital for the unit CIFRI, Barrackpore?\"\n  A: \"The total capital for the unit CIFRI, Barrackpore is 10236.60 lakhs.\",\n\n  Q: \"What are the grant-in-aid component and total grant-in-aid component for the CRP Genomics, NBFGR, Lucknow?\"\n  A: \"The grant-in-aid component is 411.00 lakhs and the total grant-in-aid component is 411.00 lakhs for the CRP Genomics, NBFGR, Lucknow.\",\n\n  Q: \"What is the general capital for the unit CIPHET, Ludhiana?\"\n  A: \"The general capital for the unit CIPHET, Ludhiana is 500.00 lakhs.\",\n\n  Q: \"What are the TSP grand total and total capital for the total fisheries section?\"\n  A: \"The TSP grand total is 4880.50 lakhs and the total capital is 50056.00 lakhs for the total fisheries section.\",\n\n  Q: \"What is the salaries general for the unit IASRI including CABin, New Delhi?\"\n  A: \"The salaries general for the unit IASRI including CABin, New Delhi is 3549.20 lakhs.\",\n\n  Q: \"What are the grant-in-aid component and total grant-in-aid component for the unit NAARM, Hyderabad?\"\n  A: \"The grant-in-aid component is 2491.00 lakhs and the total grant-in-aid component is 8425.00 lakhs for the unit NAARM, Hyderabad.\"\n}",
    "{\n  Q: \"What is the total grant in aid component for the AICRP on Home Science, CIWA, Bhubaneshwar?\"\n  A: \"150.00 lakhs\",\n\n  Q: \"What are the general capital expenses for the Strengthening and Development of Higher Agricultural Education in India?\"\n  A: \"28233.00 lakhs\",\n\n  Q: \"What is the total capital expense for the Headquarters Unit?\"\n  A: \"7805.00 lakhs\",\n\n  Q: \"What is the grant in aid component for the ASRB?\"\n  A: \"200.00 lakhs\",\n\n  Q: \"What are the total expenses for the Creation and Maintenance of Infrastructure?\"\n  A: \"2196.50 lakhs\",\n\n  Q: \"What is the total grant in aid component for the ATARI Zone-V, Kolkata?\"\n  A: \"1342.50 lakhs\",\n\n  Q: \"What are the general salary expenses for the ATARI Zone-VI, Guwahati?\"\n  A: \"794.20 lakhs\",\n\n  Q: \"What is the total expense for the Farmers First project?\"\n  A: \"1988.51 lakhs\",\n\n  Q: \"What are the grant in aid component expenses for the ARYA project?\"\n  A: \"150.00 lakhs\",\n\n  Q: \"What are the total expenses for the Disaster Management project?\"\n  A: \"30.00 lakhs\"\n}",
    "{ Q: What is the total grant in aid component for the National Agricultural Higher Education Project (NAHEP)?\n                            A: The total grant in aid component for NAHEP is 500 lakhs.\n                            Q: What is the capital expenditure for CICR, Nagpur?\n                            A: The capital expenditure for CICR, Nagpur is 485 lakhs.\n                            Q: What are the salaries and pension expenses for NRRI, Cuttack?\n                            A: The salaries and pension expenses for NRRI, Cuttack are 988.50 lakhs.\n                            Q: What is the total grant in aid component for the Network on Tobacco project at CTRI, Rajamundry?\n                            A: The total grant in aid component for the Network on Tobacco project is 283 lakhs.\n                            Q: What is the NEH Grant in Aid component for IARI, New Delhi?\n                            A: The NEH Grant in Aid component for IARI, New Delhi is 898 lakhs.\n                            Q: What are the general expenses for AICRP on Chickpea at IIPR, Kanpur?\n                            A: The general expenses for AICRP on Chickpea at IIPR, Kanpur are 0 lakhs.\n                            Q: What is the total capital expenditure for IGFRI, Jhansi?\n                            A: The total capital expenditure for IGFRI, Jhansi is 380 lakhs.\n                            Q: What is the total grant in aid component for the AICRP on Arid Legumes at IIPR Kanpur?\n                            A: The total grant in aid component for the AICRP on Arid Legumes at IIPR Kanpur is 285 lakhs.\n                            Q: What are the salaries and pension expenses for IISR, Lucknow?\n                            A: The salaries and pension expenses for IISR, Lucknow are 793 lakhs.}",
    "{ Q: What is the name of the AICRP on Sugarcane located in Lucknow?\n                            A: The AICRP on Sugarcane is located at IISR, Lucknow.\n                            Q: What is the total capital expenditure for NBAIM, Maunath Bhanjan?\n                            A: The total capital expenditure for NBAIM, Maunath Bhanjan is 1158.15 lakhs.\n                            Q: What is the salary component for AMAAS, NBAIM, Mau?\n                            A: There is no salary component mentioned for AMAAS, NBAIM, Mau.\n                            Q: What is the total grant-in-aid for NBPGR, New Delhi?\n                            A: The total grant-in-aid for NBPGR, New Delhi is 10736.74 lakhs.\n                            Q: What is the NEH Grant in Aid component for CRP-AGRO BIODIVERSITY, NBPGR, New Delhi?\n                            A: The NEH Grant in Aid component for CRP-AGRO BIODIVERSITY, NBPGR, New Delhi is 9.85 lakhs.\n                            Q: What are the general capital expenditures for SBI, Coimbatore?\n                            A: The general capital expenditures for SBI, Coimbatore are 0 lakhs.\n                            Q: What is the total grant-in-aid for AINP on Soil Arthropod Pests, NRCIPM, New Delhi?\n                            A: The total grant-in-aid for AINP on Soil Arthropod Pests, NRCIPM, New Delhi is 234.50 lakhs.\n                            Q: What are the pension expenses for NRC Plant Biotechnology, New Delhi?\n                            A: The pension expenses for NRC Plant Biotechnology, New Delhi are 510 lakhs.\n                            Q: What are the salary expenses for AICRP on R&M, DR & MR, Bharatpur?\n                            A: The salary expenses for AICRP on R&M, DR & MR, Bharatpur are 1402.77 lakhs.}",
    "{ Q: What is the total grant in aid component for the AICRP on Linseed at IIOR, Hyderabad?\n                            A: The total grant in aid component for the AICRP on Linseed at IIOR, Hyderabad is 522 lakhs.\n                            Q: What is the capital expenditure for the CRP on Rice Biofortification at IIRR, Hyderabad?\n                            A: The capital expenditure for the CRP on Rice Biofortification at IIRR, Hyderabad is 450 lakhs.\n                            Q: What is the salary expense for the AICRP on Wheat & Barley at IIWBR, Karnal?\n                            A: The salary expense for the AICRP on Wheat & Barley at IIWBR, Karnal is 45 lakhs.\n                            Q: What is the total grant in aid component for the NIBSM, Raipur?\n                            A: The total grant in aid component for the NIBSM, Raipur is 2408.14 lakhs.\n                            Q: What is the NEH Grant in Aid component for the AINP on Vertibrate Pest Management at CAZRI, Jodhpur?\n                            A: The NEH Grant in Aid component for the AINP on Vertibrate Pest Management at CAZRI, Jodhpur is 0 lakhs.\n                            Q: What is the total capital expenditure for the CISH, Lucknow?\n                            A: The total capital expenditure for the CISH, Lucknow is 2519.50 lakhs.\n                            Q: What is the pension expense for the AICRP on Palms at CPCRI, Kasaragod?\n                            A: The pension expense for the AICRP on Palms at CPCRI, Kasaragod is 250 lakhs.\n                            Q: What is the total grant in aid component for the AICRP on Tuber Crops at CTCRI, Thiruvanthapuram?\n                            A: The total grant in aid component for the AICRP on Tuber Crops at CTCRI, Thiruvanthapuram is 304 lakhs.\n                            Q: What is the general salary expense for the AICRP on Fruit at IIHR, Bangalore?\n                            A: The general salary expense for the AICRP on Fruit at IIHR, Bangalore is 307 lakhs.\n                            Q: What is the total grant in aid component for the AICRP on Spices at IISR, Calicut?\n                            A: The total grant in aid component for the AICRP on Spices at IISR, Calicut is 497 lakhs.}",
    "{ Q: What is the name of the research unit with the highest Total Grant in Aid component for Horticultural Sciences?\n                            A: NRC for Banana, Tiruchirapalli\n                            Q: What is the NEH Grant in Aid component for the Department for Cashew Research, Puttur?\n                            A: 1.00 lakhs\n                            Q: What are the total capital and salaries expenses for the AICRP on Mushroom, DMR, Solan?\n                            A: 26.00 lakhs\n                            Q: Which research unit has the highest total expenditure under the Horticultural Sciences category?\n                            A: IIVR, Varanasi\n                            Q: What is the Sl. No. of the Department of Floriculture, Pune?\n                            A: 33\n                            Q: What is the Total Grant in Aid component for the AICRP on Vegetables, IIVR, Varanasi?\n                            A: 1988.40 lakhs\n                            Q: What are the general expenses for the NRC for Litchi, Muzaffarpur?\n                            A: 2.00 lakhs\n                            Q: Which research unit has the highest pension expense in the provided Livestock Sciences data?\n                            A: IVRI, Izatnagar\n                            Q: What is the NEH Grant in Aid component for the Network on Sheep Improvement, CSWRI, Avikanagar?\n                            A: 5.00 lakhs }",
    "{\n  Q: \"What is the name of the pollutant mentioned in the text?\"\n  A: \"The name of the pollutant is not specified in the given text.\",\n\n  Q: \"What is the total grant in aid component for the Outreach Program on Zoonotic Diseases at IVRI, Izatnagar?\"\n  A: \"The total grant in aid component for the Outreach Program on Zoonotic Diseases at IVRI, Izatnagar is 161 lakhs.\",\n\n  Q: \"What is the NEH Grant in Aid component for the Network Project on Animal Genetic Resources at NBAGR, Karnal?\"\n  A: \"The NEH Grant in Aid component for the Network Project on Animal Genetic Resources at NBAGR, Karnal is 6 lakhs.\",\n\n  Q: \"What are the total capital salaries for NDRI, Karnal?\"\n  A: \"The total capital salaries for NDRI, Karnal are 9300.13 lakhs.\",\n\n  Q: \"What is the total grant in aid component for the AICRP on NPAERP + OP on Methane Emission at NIANP, Bangalore?\"\n  A: \"The total grant in aid component for the AICRP on NPAERP + OP on Methane Emission at NIANP, Bangalore is 153.20 lakhs.\",\n\n  Q: \"What are the general expenses for NRC on Camel, Bikaner?\"\n  A: \"The general expenses for NRC on Camel, Bikaner are 0 lakhs.\",\n\n  Q: \"What is the NEH Grant in Aid component for the NRC on Equines, Hissar?\"\n  A: \"The NEH Grant in Aid component for the NRC on Equines, Hissar is 110 lakhs.\",\n\n  Q: \"What are the pension expenses for NRC on Mithun?\"\n  A: \"The pension expenses for NRC on Mithun are 3 lakhs.\",\n\n  Q: \"What is the total grant in aid component for the Mega seed on Pig project at NRC on Pig, Guwahati?\"\n  A: \"The total grant in aid component for the Mega seed on Pig project at NRC on Pig, Guwahati is 125.90 lakhs.\",\n\n  Q: \"What are the general expenses for CIRC, Meerut?\"\n  A: \"The general expenses for CIRC, Meerut are 0 lakhs.\"\n}",
    "{\n  Q: \"What is the name of the project under AICRP on Poultry with a total grant in aid component of 392.50 lakhs?\"\n  A: \"Poultry Seed Project, Dte. Of Poultry Research, Hyderabad\",\n\n  Q: \"What is the total capital for the project CRIDA, Hyderabad?\"\n  A: \"3693.10 lakhs\",\n\n  Q: \"Which institute received a grant in aid component of 5440.60 lakhs under the NEH region?\"\n  A: \"ICAR RC For NEH Region.,Barapani\",\n\n  Q: \"What is the total general expenditure for the project AICRP on Micronutrients, IISS, Bhopal?\"\n  A: \"25 lakhs\",\n\n  Q: \"What is the total grant in aid component for the CCARI (ICAR Res- Complex), Goa?\"\n  A: \"1410.12 lakhs\",\n\n  Q: \"What is the pension amount for the project ICAR Res. Complex for Eastern Region, Patna?\"\n  A: \"793.50 lakhs\",\n\n  Q: \"What is the total capital for the project AICRP on Biofertilizer, IISS, Bhopal?\"\n  A: \"250 lakhs\",\n\n  Q: \"What is the total grant in aid component for the project CARI, Jhansi?\"\n  A: \"1090.26 lakhs\",\n\n  Q: \"What is the salary amount for the project AICRP on Agroforestry, CARI, Jhansi?\"\n  A: \"35 lakhs\",\n\n  Q: \"What is the total general expenditure for the project IIWM, Bhubaneshwar?\"\n  A: \"0 lakhs\"\n}",
    "{\n    Q: \"What is the total grant in aid component for IIFSR, Modipuram?\"\n    A: \"The total grant in aid component for IIFSR, Modipuram is 1651.00 lakhs.\",\n\n    Q: \"What is the name of the Network Project on Organic Farming located at?\"\n    A: \"The Network Project on Organic Farming is located at IIFSR, Modipuram.\",\n\n    Q: \"What is the total capital expenditure for NIASM, Baramati?\"\n    A: \"The total capital expenditure for NIASM, Baramati is 3142.48 lakhs.\",\n\n    Q: \"What is the NEH Grant in Aid component for CIBA, Chennai?\"\n    A: \"The NEH Grant in Aid component for CIBA, Chennai is 310.00 lakhs.\",\n\n    Q: \"What are the total salaries for CIFRI, Barrackpore?\"\n    A: \"The total salaries for CIFRI, Barrackpore are 619.00 lakhs.\",\n\n    Q: \"What is the total general expenditure for CIFE, Mumbai?\"\n    A: \"The total general expenditure for CIFE, Mumbai is 6.00 lakhs.\",\n\n    Q: \"What is the total grant in aid component for fisheries?\"\n    A: \"The total grant in aid component for fisheries is 48075.58 lakhs.\",\n\n    Q: \"What is the NEH Grant in Aid component for Dte. Of Coldwater Fisheries Research, Bhimtal?\"\n    A: \"The NEH Grant in Aid component for Dte. Of Coldwater Fisheries Research, Bhimtal is 115.00 lakhs.\",\n\n    Q: \"What are the total capital salaries for AICRP on FIM, CIAE, Bhopal?\"\n    A: \"The total capital salaries for AICRP on FIM, CIAE, Bhopal are 3.00 lakhs.\",\n\n    Q: \"What is the total expenditure for CRP On EA, CIAE, Bhopal?\"\n    A: \"The total expenditure for CRP On EA, CIAE, Bhopal is 77.00 lakhs.\"\n}",
    "{\n  Q: What is the total Grant in Aid component for Agricultural Engineering?\n  A: The total Grant in Aid component for Agricultural Engineering is 21040.19 lakhs.\n\n  Q: What is the NEH Grant in Aid component for the NWP on HP VANR&G, IINRG, Ranchi?\n  A: The NEH Grant in Aid component for the NWP on HP VANR&G, IINRG, Ranchi is 10.00 lakhs.\n\n  Q: What are the total capital and salaries expenses for the Eco. Statistics & Management division?\n  A: The total capital and salaries expenses for the Eco. Statistics & Management division are 968.20 lakhs for capital and 2911.00 lakhs for salaries.\n\n  Q: What is the Total Grant in Aid component for the AICRP on Home Science, CIWA, Bhubaneshwar?\n  A: The Total Grant in Aid component for the AICRP on Home Science, CIWA, Bhubaneshwar is 2360.00 lakhs.\n\n  Q: What are the pension expenses for the Ag. Education Division?\n  A: The pension expenses for the Ag. Education Division are 3000.00 lakhs.\n\n  Q: What is the NEH Grant in Aid component for Strengthening and Development of Higher Agricultural Education in India?\n  A: There is no NEH Grant in Aid component for Strengthening and Development of Higher Agricultural Education in India.\n\n  Q: What are the total expenses for the Headquarters Unit?\n  A: The total expenses for the Headquarters Unit are 17994.27 lakhs.\n\n  Q: What is the Total Grant in Aid component for the Auditorium project?\n  A: The Total Grant in Aid component for the Auditorium project is 7425.00 lakhs.\n\n  Q: What are the general expenses for the Agricultural Engineering division?\n  A: The general expenses for the Agricultural Engineering division are 383.00 lakhs.\n\n  Q: What is the NEH Grant in Aid component for the NAARM, Hyderabad?\n  A: There is no NEH Grant in Aid component for the NAARM, Hyderabad.\n}",
    "{\n  Q: What is the total Grant in Aid component for ICAR HQRS?\n  A: The total Grant in Aid component for ICAR HQRS is 11247.00 lakhs.\n\n  Q: What are the capital expenses for ATARI ZONE-VI, Guwahati?\n  A: The capital expenses for ATARI ZONE-VI, Guwahati are 5019.00 lakhs.\n\n  Q: What is the total budget for the National Agricultural Higher Education Project (NAHEP)?\n  A: The total budget for the National Agricultural Higher Education Project (NAHEP) is 248.69 lakhs.\n\n  Q: What are the salaries expenses for ATARI ZONE-VII, Barapani?\n  A: The salaries expenses for ATARI ZONE-VII, Barapani are 220.00 lakhs.\n\n  Q: What is the total Grant in Aid component for others?\n  A: The total Grant in Aid component for others is 120.00 lakhs.\n\n  Q: What are the pension expenses for ICAR HQRS?\n  A: The pension expenses for ICAR HQRS are 0.00 lakhs.\n\n  Q: What is the total budget for agricultural extension?\n  A: The total budget for agricultural extension is 76405.73 lakhs.\n\n  Q: What are the general expenses for ATARI ZONE-I, Ludhiana?\n  A: The general expenses for ATARI ZONE-I, Ludhiana are 8918.85 lakhs.\n\n  Q: What is the total non-plan budget?\n  A: The total non-plan budget is 20098.50 lakhs.\n\n  Q: What are the capital expenses for CICR, Nagpur under non-plan?\n  A: The capital expenses for CICR, Nagpur under non-plan are 85.00 lakhs.\n}",
    "{ Q: What is the name of the agricultural research unit located in Cuttack?\n                            A: National Rice Research Institute (NRRI)\n                            Q: What is the total grant in aid component for the Incentivizing Research in Agriculture project at NRRI, Cuttack?\n                            A: The total grant in aid component is 2850.08 lakhs.\n                            Q: Which institute in Rajamundry has a project on Network of Tobacco?\n                            A: Central Tobacco Research Institute (CTRI)\n                            Q: What is the total capital for the CRP on Hybrid Technology project at IARI, New Delhi?\n                            A: The total capital is 450 lakhs.\n                            Q: What is the TSP grand total grant in aid component for IIPR, Kanpur?\n                            A: The TSP grand total grant in aid component is 2936.85 lakhs.\n                            Q: What is the name of the unit located in Jhansi that has an AICRP on Forage Crops and Utilization project?\n                            A: Indian Grassland and Fodder Research Institute (IGFRI)\n                            Q: What is the total grant in aid component for the AICRP on Chickpea project at IIPR, Kanpur?\n                            A: The total grant in aid component is 1090 lakhs.\n                            Q: What is the total capital for the AICRP on Groundnut project at DGR, Junagadh?\n                            A: The total capital is 944 lakhs.\n                            Q: What is the name of the unit located in Maunath Bhanjan with a total grant in aid component of 1163.15 lakhs?\n                            A: National Bureau of Agriculturally Important Microorganisms (NBAIM)\n                            Q: What is the total salary for the CRP on Molecular Breeding project at IARI, New Delhi?\n                            A: The total salary is 350 lakhs.}",
    "{\n  Q: \"What is the name of the unit that received a grant of 775.00 lakhs for general capital and salaries?\"\n  A: \"NRC Plant Biotechnology, New Delhi\",\n\n  Q: \"What is the total grant in aid component for the NETWORK PROJECT ON TRANSGENIC IN CROPS, NRCPB, New Delhi?\"\n  A: \"308.00 lakhs\",\n\n  Q: \"Which unit has the highest total grant in aid component for capital salaries general?\"\n  A: \"IIRR, Hyderabad with 3191.00 lakhs\",\n\n  Q: \"What is the total capital salaries general for the AICRP on Rice at IIRR, Hyderabad?\"\n  A: \"2305.00 lakhs\",\n\n  Q: \"What is the TSP Grand Total Grant in Aid component for IIWBR, Karnal?\"\n  A: \"0.00 lakhs\",\n\n  Q: \"Which unit has the highest total grant in aid component?\"\n  A: \"NIBSM, Raipur with 2408.14 lakhs\",\n\n  Q: \"What is the total grant in aid component for the AICRP on Soyabean in Indore?\"\n  A: \"919.03 lakhs\",\n\n  Q: \"What is the total capital salaries general for the AICRP on Pearl Millets at IIMR, Hyderabad?\"\n  A: \"869.00 lakhs\",\n\n  Q: \"What is the TSP Grand Total Grant in Aid component for the AICRP on Small Millets at IIMR, Hyderabad?\"\n  A: \"0.00 lakhs\",\n\n  Q: \"What is the total grant in aid component for the AINP on Vertibrate Pest Management at CAZRI, Jodhpur?\"\n  A: \"413.20 lakhs\"\n}",
    "{\n  Q: \"What is the name of the agricultural unit located in Srinagar?\"\n  A: \"CITH\",\n\n  Q: \"What is the total grant in aid component for the AICRP on Palms in Kasaragod?\"\n  A: \"7276.10 (lakhs)\",\n\n  Q: \"Which unit has the highest capital salaries general in the provided data?\"\n  A: \"IIHR, Bangalore\",\n\n  Q: \"What is the TSP grand total grant in aid component for the unit in Shimla?\"\n  A: \"0.00 (lakhs)\",\n\n  Q: \"What are the general capital salaries for the unit in Tiruchirapalli?\"\n  A: \"473.96 (lakhs)\",\n\n  Q: \"What is the total grant in aid component for the AICRP on Vegetables in Varanasi?\"\n  A: \"1828.46 (lakhs)\",\n\n  Q: \"Which unit has the highest total capital salaries?\"\n  A: \"IIHR, Bangalore\",\n\n  Q: \"What is the Sl. No. for the unit in Pune that focuses on Grapes?\"\n  A: \"22\",\n\n  Q: \"What are the grand total grant in aid components for the unit in Pedavegi?\"\n  A: \"1105.84 (lakhs)\",\n\n  Q: \"What is the name of the unit located in Ajmer that focuses on Seed Spices?\"\n  A: \"NRC Seed Spices\"\n}",
    "{\n  Q: \"What is the name of the unit and its TSP grant in Aid component for Sl. No. 1?\"\n  A: \"The name of the unit is CIRB, Hissar, and its TSP grant in Aid component is 0.20 lakhs.\",\n\n  Q: \"What are the total capital and general salaries for Sl. No. 9?\"\n  A: \"The total capital and general salaries for Sl. No. 9 (IVRI, Izatnagar) are 20342.05 lakhs and 33834.20 lakhs respectively.\",\n\n  Q: \"What is the grand total grant in aid component for Sl. No. 25?\"\n  A: \"The grand total grant in aid component for Sl. No. 25 (NRC on Equines, Hissar) is 1626.55 lakhs.\",\n\n  Q: \"What is the name of the project for Sl. No. 30 and its grant in aid component for total capital?\"\n  A: \"The project for Sl. No. 30 is AICRP on Pig, NRC on Pig, Guwahati, and its grant in aid component for total capital is 91.70 lakhs.\",\n\n  Q: \"What are the general capital and salaries for Sl. No. 28?\"\n  A: \"The general capital and salaries for Sl. No. 28 (NRC on Mithun) are 396.89 lakhs and 1116.01 lakhs respectively.\",\n\n  Q: \"What is the TSP grant in aid component for Sl. No. 26?\"\n  A: \"The TSP grant in aid component for Sl. No. 26 (National Centre for Veterinary Type Culture Collection, NRC on Equines, Hissar) is 0 lakhs.\",\n\n  Q: \"What is the total grant in aid component for Sl. No. 6?\"\n  A: \"The total grant in aid component for Sl. No. 6 (CSWRI, Avikanagar) is 4171.00 lakhs.\",\n\n  Q: \"What is the name of the unit for Sl. No. 18 and its grand total?\"\n  A: \"The name of the unit for Sl. No. 18 is NIHSAD, Bhopal, and its grand total is 1501.90 lakhs.\",\n\n  Q: \"What is the grant in aid component for general salaries in Sl. No. 5?\"\n  A: \"The grant in aid component for general salaries in Sl. No. 5 (AICRP on Goats, CIRG, Makhdoom) is 361.20 lakhs.\",\n\n  Q: \"What are the total capital and salaries for Sl. No. 32?\"\n  A: \"The total capital and salaries for Sl. No. 32 (NRC on Yak, Dirang) are 21.35 lakhs and 21.35 lakhs respectively.\"\n}",
    "{\n  Q: What is the total grant in aid component for Animal Sciences?\n  A: The total grant in aid component for Animal Sciences is 92747.12 lakhs.\n\n  Q: Which unit has the highest grant in aid component in Non-Plan?\n  A: ICAR RC For NEH Region, Barapani has the highest grant in aid component in Non-Plan, which is 9537.10 lakhs.\n\n  Q: What is the TSP grand total grant in aid component for Sl. No. 17?\n  A: The TSP grand total grant in aid component for NBSS & LUP, Nagpur (Sl. No. 17) is 7445.50 lakhs.\n\n  Q: What are the capital salaries for AICRP on Dryland Agriculture, CRIDA, Hyderabad?\n  A: The capital salaries for AICRP on Dryland Agriculture, CRIDA, Hyderabad are 250.00 lakhs.\n\n  Q: What are the general capital salaries for IIWM, Bhubaneshwar?\n  A: The general capital salaries for IIWM, Bhubaneshwar are 223.76 lakhs.\n\n  Q: What is the total grant in aid component for Sl. No. 39?\n  A: The total grant in aid component for Poultry Seed Project, Dte. Of Poultry Research, Hyderabad (Sl. No. 39) is 511.50 lakhs.\n\n  Q: What are the TSP grand total grant in aid components for Sl. No. 8 and 9?\n  A: The TSP grand total grant in aid components for ICAR RC For NEH Region, Barapani (Sl. No. 8) and ICAR Res. Complex for Eastern Region, Patna (Sl. No. 9) are 1223.00 lakhs and 3058.90 lakhs, respectively.\n\n  Q: What is the grant in aid component for CSSRI, Karnal?\n  A: The grant in aid component for CSSRI, Karnal is 3680.50 lakhs.\n\n  Q: What are the general capital salaries for Sl. No. 12 and 13?\n  A: The general capital salaries for AICRP on Micronutrients, IISS, Bhopal (Sl. No. 12) and AICRP on Biofertilizer, IISS, Bhopal (Sl. No. 13) are 135.00 lakhs and 70.00 lakhs, respectively.\n\n  Q: What is the total capital for CIRC, Meerut?\n  A: The total capital for CIRC, Meerut is 977.71 lakhs.\n}",
    "{\n  Q: \"What is the total grant in aid component for the AICRP on Integrated Farming System, IIFSR, Modipuram?\"\n  A: \"25.00 lakhs\",\n\n  Q: \"What is the total capital for the Network Project on Organic Farming, IIFSR, Modipuram?\"\n  A: \"175.00 lakhs\",\n\n  Q: \"What is the total grant in aid component for NIASM, Baramati?\"\n  A: \"20.00 lakhs\",\n\n  Q: \"What is the total capital for NICRA, Hyderabad?\"\n  A: \"3597.00 lakhs\",\n\n  Q: \"What is the total grant in aid component for CIBA, Chennai?\"\n  A: \"27.00 lakhs\",\n\n  Q: \"What is the total capital for CIFRI, Barrackpore?\"\n  A: \"7089.00 lakhs\",\n\n  Q: \"What is the total grant in aid component for all Fisheries units combined?\"\n  A: \"124.00 lakhs\",\n\n  Q: \"What is the total capital for CIAE, Bhopal under Non-Plan?\"\n  A: \"2568.00 lakhs\",\n\n  Q: \"What is the total grant in aid component for AICRP on FIM, CIAE, Bhopal under Non-Plan?\"\n  A: \"0.00 lakhs\",\n\n  Q: \"What is the total capital for CRP on Natural Fibres, CIRCOT, Mumbai under Non-Plan?\"\n  A: \"65.49 lakhs\"\n}",
    "{\n  Q: What is the total agricultural engineering budget for the year 2018-19?\n  A: The total agricultural engineering budget for the year 2018-19 is 21,423.19 lakhs.\n\n  Q: What is the grant-in-aid component for the NIAP & PR unit in New Delhi?\n  A: The grant-in-aid component for the NIAP & PR unit in New Delhi is 1,020.80 lakhs.\n\n  Q: What are the total capital and salaries expenses for the HEADQUARTERS UNIT?\n  A: The total capital and salaries expenses for the HEADQUARTERS UNIT are 17,994.27 lakhs.\n\n  Q: What is the grant-in-aid component for the ICAR budget book 2018-19?\n  A: The total grant-in-aid component for the ICAR budget book 2018-19 is 72,482.20 lakhs.\n\n  Q: What is the total budget for the agricultural education division?\n  A: The total budget for the agricultural education division is 68,268.00 lakhs.\n\n  Q: What is the grant-in-aid component for the AICRP on Home Science in Bhubaneshwar?\n  A: The grant-in-aid component for the AICRP on Home Science in Bhubaneshwar is 2,360.00 lakhs.\n\n  Q: What are the total capital expenses for the ATARI ZONE-III in Kanpur?\n  A: The total capital expenses for the ATARI ZONE-III in Kanpur are 9,567.50 lakhs.\n\n  Q: What is the grant-in-aid component for the VANR&G unit in Ranchi?\n  A: The grant-in-aid component for the VANR&G unit in Ranchi is 137.00 lakhs.\n\n  Q: What are the total expenses for the Swachhata Action Plan?\n  A: The total expenses for the Swachhata Action Plan are 150.00 lakhs.\n\n  Q: What is the total budget for the PIU, NASF under others?\n  A: The total budget for the PIU, NASF under others is 3,775.00 lakhs.\n}",
    "{\n    Q: \"What is the total grant-in-aid component for ATARI ZONE-V in Kolkata?\"\n    A: \"The total grant-in-aid component for ATARI ZONE-V in Kolkata is 6189.00 lakhs.\",\n\n    Q: \"What are the capital and general salary expenses for the NETWORK PROJECT?\"\n    A: \"The capital and general salary expenses for the NETWORK PROJECT are 0.00 lakhs each.\",\n\n    Q: \"What is the total budget estimate for the National Agricultural Higher Education Project (NAHEP)?\"\n    A: \"The total budget estimate for the National Agricultural Higher Education Project (NAHEP) is 248.69 lakhs.\",\n\n    Q: \"What is the NEH grant-in-aid component for CICR, Nagpur?\"\n    A: \"The NEH grant-in-aid component for CICR, Nagpur is 2568.00 lakhs.\",\n\n    Q: \"What are the total salary, pension, and general expenses for AINPJAF, CRIJAF, Barrackpore?\"\n    A: \"The total salary, pension, and general expenses for AINPJAF, CRIJAF, Barrackpore are 257.10, 80.00, and 80.00 lakhs respectively.\",\n\n    Q: \"What is the grand total budget for the year 2018-19?\"\n    A: \"The grand total budget for the year 2018-19 is 664755.55 lakhs.\",\n\n    Q: \"What is the total grant-in-aid component for ATARI ZONE-XI in Bengalore?\"\n    A: \"The total grant-in-aid component for ATARI ZONE-XI in Bengalore is 5261.73 lakhs.\",\n\n    Q: \"What are the capital and salary expenses for the Disaster Management unit?\"\n    A: \"The capital and salary expenses for the Disaster Management unit are 10.00 and 30.00 lakhs respectively.\",\n\n    Q: \"What is the total budget estimate for the CTRI, Rajamundry, excluding NEH components?\"\n    A: \"The total budget estimate for the CTRI, Rajamundry, excluding NEH components, is 5310.30 lakhs.\",\n\n    Q: \"What are the capital and general salary expenses for the Incentivizing Research in Agriculture, NRRI, Cuttack?\"\n    A: \"The capital and general salary expenses for the Incentivizing Research in Agriculture, NRRI, Cuttack are 215.00 and 0.00 lakhs respectively.\"\n}",
    "{\n  Q: \"What is the name of the network project on transgenic crops and its total budget (including NEH)?\"\n  A: \"The Network Project on Transgenic Crops, NRCPB, New Delhi has a total budget of 1795 lakhs (including NEH).\",\n\n  Q: \"What is the Grant in Aid component for DR & MR, Bharatpur excluding NEH?\"\n  A: \"The Grant in Aid component for DR & MR, Bharatpur excluding NEH is 1111.19 lakhs.\",\n\n  Q: \"What is the total budget for IIMR, Hyderabad without considering the NEH component?\"\n  A: \"The total budget for IIMR, Hyderabad without considering the NEH component is 2632.57 lakhs.\",\n\n  Q: \"What is the capital expenditure for AICRP on Small Millets, IIMR, Hyderabad?\"\n  A: \"The capital expenditure for AICRP on Small Millets, IIMR, Hyderabad is 0 lakhs.\",\n\n  Q: \"What is the total salary expenditure for NBAIR, Bengaluru?\"\n  A: \"The total salary expenditure for NBAIR, Bengaluru is 512 lakhs.\",\n\n  Q: \"What is the general expenditure for AICRP on Biological Control, NBAIR, Bengaluru?\"\n  A: \"The general expenditure for AICRP on Biological Control, NBAIR, Bengaluru is 132 lakhs.\",\n\n  Q: \"What is the total budget for AINP on Vertebrate Pest Management, NBAIR, Bengaluru under the Non-Plan component?\"\n  A: \"The total budget for AINP on Vertebrate Pest Management, NBAIR, Bengaluru under the Non-Plan component is 446.80 lakhs.\",\n\n  Q: \"What is the Grant in Aid component for IIOR, Hyderabad excluding NEH and Capital?\"\n  A: \"The Grant in Aid component for IIOR, Hyderabad excluding NEH and Capital is 774 lakhs.\",\n\n  Q: \"What is the total budget for AICRP on Oilseed, Hyderabad excluding the NEH component?\"\n  A: \"The total budget for AICRP on Oilseed, Hyderabad excluding the NEH component is 1504 lakhs.\",\n\n  Q: \"What is the pension expenditure for IIRR, Hyderabad?\"\n  A: \"The pension expenditure for IIRR, Hyderabad is not provided in the given data.\"\n}",
    "{ Q: What is the total budget estimate for Crop Sciences in 2018-19?\n                            A: The total budget estimate for Crop Sciences in 2018-19 is 184,929 lakhs.\n                            Q: What is the NEH Grant in Aid component for IISS, Maunath Bhanjan?\n                            A: The NEH Grant in Aid component for IISS, Maunath Bhanjan is 0 lakhs.\n                            Q: What are the total salary and pension expenses for the AICRP NSP (CROPS), DSR, Maunath Bhanjan?\n                            A: The total salary and pension expenses for the AICRP NSP (CROPS), DSR, Maunath Bhanjan are 1860.88 lakhs.\n                            Q: What is the capital expenditure for NIBSM, Raipur?\n                            A: The capital expenditure for NIBSM, Raipur is 0 lakhs.\n                            Q: What is the total budget estimate for the Non-Plan component for Sl.No. 9?\n                            A: The total budget estimate for the Non-Plan component for Sl.No. 9 (AICRP on Potato, CPRI, Shimla) is 537.20 lakhs.\n                            Q: What is the general expenditure for CTCRI, Thiruvanthapuram?\n                            A: The general expenditure for CTCRI, Thiruvanthapuram is 5 lakhs.\n                            Q: What is the total budget estimate for IIHR, Bangalore, excluding NEH component?\n                            A: The total budget estimate for IIHR, Bangalore, excluding NEH component, is 9,672 lakhs.\n                            Q: What is the salary expenditure for AICRP on Spices, IISR, Calicut?\n                            A: The salary expenditure for AICRP on Spices, IISR, Calicut is 0 lakhs.\n                            Q: What is the total budget estimate for IIVR, Varanasi?\n                            A: The total budget estimate for IIVR, Varanasi is 2,589 lakhs.\n                            }",
    "{\n  Q: \"What is the total budget estimate for Horticultural Sciences in 2018-19?\"\n  A: \"The total budget estimate for Horticultural Sciences in 2018-19 is 62,581 lakhs.\",\n\n  Q: \"What is the NEH Grant in Aid component for the Network Project on Buffaloes at CIRB, Hissar?\"\n  A: \"The NEH Grant in Aid component for the Network Project on Buffaloes at CIRB, Hissar is 0 lakhs.\",\n\n  Q: \"What are the total salary, pension, and general expenses for the Department of Floriculture, Pune?\"\n  A: \"The total salary, pension, and general expenses for the Department of Floriculture, Pune are 173 lakhs.\",\n\n  Q: \"What is the capital outlay for the AICRP on Cashew at the Department for Cashew Research, Puttur?\"\n  A: \"The capital outlay for the AICRP on Cashew at the Department for Cashew Research, Puttur is 0 lakhs.\",\n\n  Q: \"What is the total budget estimate for the NRC for Litchi, Muzaffarpur?\"\n  A: \"The total budget estimate for the NRC for Litchi, Muzaffarpur is 561 lakhs.\",\n\n  Q: \"What is the Grant in Aid component (excluding NEH) for the CCRI, Nagpur?\"\n  A: \"The Grant in Aid component (excluding NEH) for the CCRI, Nagpur is 1579.10 lakhs.\",\n\n  Q: \"What are the salary expenses for the NRC for Grapes, Pune?\"\n  A: \"The salary expenses for the NRC for Grapes, Pune are 0 lakhs.\",\n\n  Q: \"What is the total budget estimate for the AICRP on Mushroom at DMR, Solan?\"\n  A: \"The total budget estimate for the AICRP on Mushroom at DMR, Solan is 337 lakhs.\",\n\n  Q: \"What is the NEH Grant in Aid component for the IIOPR, Pedavegi?\"\n  A: \"The NEH Grant in Aid component for the IIOPR, Pedavegi is 0 lakhs.\",\n\n  Q: \"What are the capital, salary, and general expenses for the AICRP on MAP & Betelvine at DMAPR, Anand?\"\n  A: \"The capital, salary, and general expenses for the AICRP on MAP & Betelvine at DMAPR, Anand are 0, 111, and 1027 lakhs respectively.\"\n}",
    "{ Q: What is the name of the unit with the highest total budget (excluding NEH and TSP) in the ICAR budget book 2018-19?\n                            A: NDRI, Karnal\n                            Q: What is the grant in aid component for the Network Project on Animal Genetic Resources at NBAGR, Karnal?\n                            A: 0.00\n                            Q: What are the total salary and pension expenses for NIHSAD, Bhopal?\n                            A: 1305.00\n                            Q: What is the capital expenditure for the Outreach Program on Environmental Pollutant at IVRI, Izatnagar?\n                            A: 50.00\n                            Q: What is the total budget for the AICRP on NPAERP + OP on Methane Emission at NIANP, Bangalore?\n                            A: 180.00\n                            Q: What is the grant in aid component for the NRC on Mithun?\n                            A: 25.00\n                            Q: What are the total general expenses for the NRC on Equines, Hissar?\n                            A: 860.00\n                            Q: What is the total budget for the Network on Sheep Improvement, CSWRI, Avikanagar?\n                            A: 35281.20\n                            Q: What are the capital expenses for the IVRI, Izatnagar?\n                            A: 15000.00\n                            Q: What is the total budget for the AICRP on Pig, NRC on Pig, Guwahati?\n                            A: 250.00 (Assuming the comma was a typo and it should be 250.00) }",
    "{\n  Q: \"What is the total budget estimate for Animal Sciences in 2018-19?\"\n  A: \"The total budget estimate for Animal Sciences in 2018-19 is 101,210 lakhs.\",\n\n  Q: \"What is the grant in aid component for Poultry Seed Project, Dte. Of Poultry Research, Hyderabad?\"\n  A: \"The grant in aid component for Poultry Seed Project, Dte. Of Poultry Research, Hyderabad is 409 lakhs.\",\n\n  Q: \"What are the capital and salary expenses for IIS & WC (CS & WCR & TI), Dehradun under non-plan budget estimates?\"\n  A: \"The capital and salary expenses for IIS & WC (CS & WCR & TI), Dehradun under non-plan budget estimates are 900 lakhs and 1869 lakhs respectively.\",\n\n  Q: \"What is the total budget estimate for AICRP on Dryland Agriculture, CRIDA, Hyderabad?\"\n  A: \"The total budget estimate for AICRP on Dryland Agriculture, CRIDA, Hyderabad is 2533 lakhs.\",\n\n  Q: \"What is the NEH grant in aid component for CCARI (ICAR Res. Complex), Goa?\"\n  A: \"The NEH grant in aid component for CCARI (ICAR Res. Complex), Goa is 0 lakhs.\",\n\n  Q: \"What are the general expenses for ICAR Res. Complex for Eastern Region, Patna?\"\n  A: \"The general expenses for ICAR Res. Complex for Eastern Region, Patna are 2994.50 lakhs.\",\n\n  Q: \"What is the total budget estimate for AICRP on Biofertilizer, IISS, Bhopal?\"\n  A: \"The total budget estimate for AICRP on Biofertilizer, IISS, Bhopal is 265 lakhs.\",\n\n  Q: \"What is the grant in aid component for Dte. Of Foot & Mouth Disease, Mukteswar?\"\n  A: \"The grant in aid component for Dte. Of Foot & Mouth Disease, Mukteswar is 3637.80 lakhs.\",\n\n  Q: \"What are the salary and pension expenses for CAZRI, Jodhpur?\"\n  A: \"The salary and pension expenses for CAZRI, Jodhpur are 5300 lakhs.\",\n\n  Q: \"What is the total budget estimate for AICRP on Cattle, CIRC, Meerut under plan budget estimates?\"\n  A: \"The total budget estimate for AICRP on Cattle, CIRC, Meerut under plan budget estimates is 739.80 lakhs.\"\n}",
    "{\n  Q: \"What is the name of the AICRP on STCR and its location?\"\n  A: \"The AICRP on STCR is located in IISS, Bhopal.\",\n\n  Q: \"What is the total budget estimate for the Network Project on Organic Farming at IIFSR, Modipuram?\"\n  A: \"The total budget estimate for the Network Project on Organic Farming at IIFSR, Modipuram is 120 lakhs.\",\n\n  Q: \"What are the grant in aid components for the CRP on Conservation Agriculture at IISS, Bhopal?\"\n  A: \"The grant in aid components for the CRP on Conservation Agriculture at IISS, Bhopal are 0 lakhs for the Other than NEH & TSP component, 316 lakhs for the Total component, and 0 lakhs for the NEH component.\",\n\n  Q: \"What is the total salary component for NIASM, Baramati?\"\n  A: \"The total salary component for NIASM, Baramati is 435 lakhs.\",\n\n  Q: \"What is the capital component for the AICRP on Agroforestry at CARI, Jhansi?\"\n  A: \"The capital component for the AICRP on Agroforestry at CARI, Jhansi is 60 lakhs.\",\n\n  Q: \"What is the total budget estimate for the Dte. Of Weed Research, Jabalpur?\"\n  A: \"The total budget estimate for the Dte. Of Weed Research, Jabalpur is 1223.3 lakhs.\",\n\n  Q: \"What are the general components for the AICRP on Integrated Farming System at IIFSR, Modipuram?\"\n  A: \"The general components for the AICRP on Integrated Farming System at IIFSR, Modipuram are 235 lakhs for the Total component and 79 lakhs for the General Total component.\",\n\n  Q: \"What is the NEH Grant in Aid component for the IIWM, Bhubaneshwar?\"\n  A: \"The NEH Grant in Aid component for the IIWM, Bhubaneshwar is 0 lakhs.\",\n\n  Q: \"What is the total budget estimate for the CIFA, Bhubaneshwar?\"\n  A: \"The total budget estimate for the CIFA, Bhubaneshwar is 4522.4 lakhs.\",\n\n  Q: \"What are the grant in aid components for the AICRP on Weed Management at DWR, Jabalpur?\"\n  A: \"The grant in aid components for the AICRP on Weed Management at DWR, Jabalpur are 0 lakhs for the Other than NEH & TSP component, 970 lakhs for the Total component, and 0 lakhs for the NEH component.\"\n}"
]