[
    "```json\n\n[\n\n    {\n\n        \"question\": \"What are the key activities included in agriculture?\",\n\n        \"answer\": \"Agriculture includes crop cultivation, animal husbandry, fisheries, and forestry.\"\n\n    },\n\n    {\n\n        \"question\": \"How does modern agriculture improve productivity?\",\n\n        \"answer\": \"Modern agriculture uses precision farming, genetically modified crops, and sustainable irrigation techniques.\"\n\n    },\n\n    {\n\n        \"question\": \"Why is soil health important in agriculture?\",\n\n        \"answer\": \"Soil health is crucial for maintaining agricultural productivity by providing essential nutrients to crops.\"\n\n    },\n\n    {\n\n        \"question\": \"What methods are used to maintain soil fertility?\",\n\n        \"answer\": \"Farmers use fertilizers, crop rotation, and organic farming techniques.\"\n\n    },\n\n    {\n\n        \"question\": \"How does water management help agriculture?\",\n\n        \"answer\": \"Irrigation and rainwater harvesting ensure consistent crop yields, especially in drought-prone areas.\"\n\n    },\n\n    {\n\n        \"question\": \"What are the major challenges faced in agriculture?\",\n\n        \"answer\": \"Major challenges include pests, diseases, climate change, and unpredictable weather patterns.\"\n\n    },\n\n    {\n\n        \"question\": \"How do farmers protect crops from pests?\",\n\n        \"answer\": \"They use pesticides, biological control methods, and integrated pest management strategies.\"\n\n    },\n\n    {\n\n        \"question\": \"How does climate change affect agriculture?\",\n\n        \"answer\": \"It causes unpredictable weather, rising temperatures, droughts, and floods, impacting crop yields.\"\n\n    },\n\n    {\n\n        \"question\": \"How do governments support agriculture?\",\n\n        \"answer\": \"Governments provide subsidies, research funding, and policies that promote sustainable farming practices.\"\n\n    },\n\n    {\n\n        \"question\": \"Why are agricultural markets and supply chains important?\",\n\n        \"answer\": \"They ensure fair prices for farmers and that consumers have access to affordable food.\"\n\n    }\n\n]\n\n```"
]